[{"review": "I like the capo, only it seems a little stiff when opening it up to put it on or take it off.  It was actually a bronze color instead of gold, but that's not a big deal to me.  I'm interested on the durability of this, but for the price, how can you go wrong?", "id": 349}, {"review": "It arrived on time and was as described. Price was very reasonable.  It is easy to use with one hand and does the job.  Not sure what else can be said about a capo.  They either work or do not.  The other aspect is longevity and only use and  time will tell that.", "id": 49}, {"review": "A three star at best. I was not impressed with the finish or feel and I use a capo often. You can count on the price telling you of the quality of this product.", "id": 841}, {"review": "I think I got a great buy love the color and it has a strong spring holds very well great price", "id": 1231}, {"review": "I like this a lot better than others that i have.  Easy on and off and stays put. It's worth the money.", "id": 148}, {"review": "Great Capo.  Like the color.  Good clamp pressure and this design wraps around the back of the Guitar neck so it does not show.", "id": 576}, {"review": "Felt kind of too stiff and rigid to put on a guitar at first, but the more you use it, the more it will wear in (pretty redundant sounding, I know.) The color advertised was not the one I received.", "id": 1423}, {"review": "This works well with the mandolin.  It is certainly an easy change.  I would recommend it &/or purchase again.", "id": 917}, {"review": "I disliked having to wait a month to receive what I could've gotten at my local music store. The capo does what its does. These capo, I know, will lose their tension in time. I thought I had chosen a different capo. That's what happens when I stay at the computer too long without my glasses.", "id": 972}, {"review": "Can't hold tightly on 1st string (low C), a little buzz.", "id": 857}, {"review": "A friend gives his time to help kids learn music. .He mentioned the need for one, so Got it. It appeared to be built well and I've not heard any complaints about the performance. Not very helpful sorry!", "id": 216}]