[{"review": "Used the 9-42's for years but thought I would give these a try. Fuller sound with the 10-46's butI cannot bend them like the 9's. I have switched back on a few of then guitars for variety: 10's for rhythm and finger style, 9's for lead. Get the packs of single 9's and 10's too so that when one breaks you dont have to steal from another whole set.", "id": 226}, {"review": "In 40 years I have had every kind of capo out there. This is the right one. This one works. Buy one for each of your guitars and keep them in the case: they are well made and inexpensive enough.", "id": 304}, {"review": "Works as advertised but the keys are stiff. Pads take too much presure to activate. Nice that I dont need another interface to connect it to my laptop.After the first few uses the USB socket broke and fell off into the unit rendering it useless. Wrote to dealer that was listed as selling it to me thru Amazon only to have them tell me the wrong seller was listed. I had registered it with AKAI already so I complained to them and they sent me a new one. I had to pay shipping back the old one to them even though it was a defective product.Not recommending this product.", "id": 723}, {"review": "Surprised really. For the price I dont think I could have done better. Nice case, come with stand adapters, and make me sound pretty good and I cant really sing. Dropped one a few times and its still working. Good feel/weight. On /off switches on each. I record to DAW and the recordings sound fine. I usually run everything through a BBE so that might be part of why I am pleased with them but I do recocmmend these for mics in this price range.", "id": 405}, {"review": "Never has 15 watts sounded so loud and clear. Never think it only hadan 8 inch speaker. Just enough effects to leave your pedals at home for practices.Light weight easy to carry.", "id": 619}, {"review": "I was dissapointed to find out that you can only use one of theeffects at a time, good though they were. Too expensive foronly one effect at a time. Returned it.", "id": 756}]