[{"review": "I bought this amp to replace a Squier SP-10 that came with my guitar.  The Squier had no effects, just a clean channel and an overdrive button.  I couldn't afford a bunch of pedals, but I wanted some effects so I could get cool sounds from my electric guitar.  I saw the reviews for this little amp on Amazon and decided to give it a try.  It is Awesome!  For such a small amp, the output is plenty loud for practicing at home, and it runs on batteries, too, so I can take it anywhere.  The effects are better than I'd hoped for.  This is certainly not for the pro who performs onstage or with a drummer, but for an intermediate level guitarist (like me) who just plays for his own pleasure or to please his family, this is the amp to get.  It has several modeling functions and you can choose between chorus, flanger, phaser, or tremelo while still adding either reverb or delay.  I'm one of the growing number of retirees who decided to pick up the guitar and learn more about it now that I have the time.  I don't need the deafening stacks that the kids like.  I love this amp.", "id": 48}, {"review": "Overall, I like this winder.  It's handy having the wire cutter built into it.  But when I am winding new strings, it often slips off.  Since I am using one hand to hold tension on the new string, I would prefer this to hold on more securely so I don't have to put it back on several times.  But all in all, it's a lot better than winding by hand, and it seems sturdy.", "id": 94}, {"review": "I bought my new guitar and wanted to keep it in great shape.  I guess this kit works okay, but it's hard to use.  It will probably last my entire lifetime.  I think a smaller kit would have been better.  You really need to remove the strings when you use it, so you have to take off all the strings.  I usually only replace one string at a time when I am changing strings, so I had to change my habits.  If you have a guitar without a truss rod, that may mean you will take a lot more time tuning after you're done changing the strings, since the neck will bend more as you tighten the strings one at a time, and that will change the pitch of the strings you have already tuned.  I'm no expert, but I have a gut feeling that this was not money well spent.  However, since I love my guitar, I use it anyway.", "id": 96}, {"review": "This is fine for my music room at home where it isn't likely to get bumped too hard.  I wish the bottom didn't swivel, because I don't see a need for it to do that.  But it keeps my guitar handy and does the job I wanted it to do at a low price.  I like the security strap that keeps the neck from falling out.  However, I wouldn't recommend this for the stage where there are crowded conditions and it is more likely to suffer a heavy bump.  For that, you would want a larger tripod at the bottom to make it less likely to topple.", "id": 258}, {"review": "This strap works fine for my acoustic using the leather laces to tie around the neck of the guitar.  I didn't like it so much for my electric guitar, because I was nervous that it would come loose, since the leather &#34;buttonholes' are somewhat wimpy.  If you have a heavy electric guitar, I recommend that you buy a locking guitar strap or something with thicker leather.  It would have been better if it had a felt backing, or at least an adjustable pad.", "id": 632}, {"review": "I have a couple of old guitars I couldn't bear to part with, but seldom used.  (Ah, memories!)  I keep my everyday guitars on stands so that it is easier to practice, but these add charm to my music room/office and they work great.  The &#34;fingers&#34; will grasp the neck of most any stringed instrument and hold firmly.", "id": 810}]