[{"review": "Its a great pedal, sound really crunchy, I got a peavy vyper sometime I use this If I want a crunchy style, but the amp I got is really good and has its own distortion styles, I use the heavy metal config on this pedal, I recomend it to anyone... does not introduce noise, I run it on the stock battery, it still works, you can make your guitar sound like Metallica or Megadeth, of course it also depends on a lot of things, like pickups, amp, etc..., I also have a very old little peavey practice amp, this blows away the distortion that it has with less noise and gives it a new life.Listen to it on the Boss website, I heard to it and then I thought the sound was not going to be similar because of the equipment used by them, but it does sound really really close. regards. forgive my english... not from the U.S", "id": 36}, {"review": "Hi, I thought these pots would come without the proper caps, it`s not on the description of the product, and they did, so I'm pleased by it, have not installed them yet... they are CTS brand, it`s hard to read what uF are the caps, I think they are 0.022uF the standard for Fender guitars", "id": 216}, {"review": "I have not tested other micro amps, this does for what I bought it for, to practice at home or anywhere without disturbing and easy transport, it's very portable to take with you. I really like the overdrive sound, the tuner works really well, I dont like much the clean channel it breaks up fast to a not so clean channel, but overall its a great product, so if you need a good tone, and a very portable micro amp you can give this one a try, it's great.", "id": 528}, {"review": "The only complaint that I have is the instructions they are kind of shallow, if you have musical theory background you should not have much trouble, I'm no expert I have a some knowledge beyond basic, and it's really helpfull to take some reference learning new things, visualize quickly chords, scales, mayor and minor scales, you can view there relationship it's a great tool to learn, if you have deep knowledge maybe you dont need it. For complete begginers it might be difficult to start without reading and taking time to study. This is a great complement to study theory.", "id": 531}, {"review": "This pedal has tone! its very easy to use and program, I did not have idea on how to use it, and really quick I got it, it has a great interface, it sounds great, you just need some time to adapt and you will be creating your own tones in no time.The distrosion is great some people say they arent but I really love them, its a matter of  taste and creating your tones, some preset may not be good for youThe downside it does not have the AC adapter but I knew this.The lights under certain light conditions are very bright,But this pedal is note heavy, well constructed and sturdy, I got the AC adapter so I dont have to be on the batteries all the time.This pedal has the whole package, effects, great tone, great distorsion and cleans.", "id": 582}]