[{"review": "I have a Taylor 514 ce acoustic guitar and Elixir Strings are what this very nice guitar came with from Taylor when new.  I figure they have done the research on what works best and I see no reason for a change other than going fro the extra light strings to the light weight strings.  The sound you get with the Nanoweb strings are amazing and they enhance the results from an already great guitar.  They also last a long time before they go dead.", "id": 103}, {"review": "I was very happy to get this bag and the quality is excellent!.  I have a Seagull S6 Dreadnought and it fits in this bag like a glove.  The zippers are also very high quality and this bag will last a long time. Another great quality of this bag is the insulation factor. I had to travel in some very cold weather to a friends home and I fully expected to have to retune my guitar... not so... it was still in tune and the cold had no effect during transport due to the insulation of this bag.", "id": 469}, {"review": "i got this despite the warnings about it being too short for some people.  The strap is about 6\" too short for my Seagull S6 guitar.  I will say the build quality is great but too short, is and remains, too short.  I will keep this item and take it to a shoe shop or saddle repair place and have and extendo put into the strap.  I just can't understand how they can sell this a a guitar strap when it is clearly too short.2/22/2013 I fired off an email to LEVY and the long and \"short\" of all this is you will have to fork over another $30 to buy an extendo for this strap. I don't quite understand why they don't make the strap long enough to start with other than the fact they can extract another $30 to make it work right in the first place.  here's a link to the extendo optionLEVY'S LEATHERS MMGXL-2.5-BRN STRAP EXTENDER http://www.amazon.com/LEVYS-LEATHERS-MMGXL-2-5-BRN-STRAP-EXTENDER/dp/B00BH5N91E/ref=sr_1_2?ie=UTF8&qid;=1361565768&sr;=8-2&keywords;=MMGXL-2.5  the irony here is I managed to buy the last one for the immediate future.This is just another case of caveat emptor for all buyers to consider. I got the extendo strap and it does not match the original so now I have this cobbled up looking guitar strap. It's sort of like wearing a suede shoe on one foot and a polished leather shoe on the other.  I will keep this strap but sure feel like I've been had on this purchase... the terms bait and switch come to my mind.", "id": 481}, {"review": "I bought one of these used that was just like new when I got it.  The craftsmanship is amazing as is the sound quality of this little ukulele.  The build quality, the Aquila strings, and the tuning keys are very high quality.  You can sound great with one of these little instruments in no time.  I downloaded a Lanikai booklet off the internet and was on my way.  It is pure fun to play one of these ukuleles.I bought this for my granddaughter and would suggest a larger model for any adult with larger fingers. Some of the chords are hard to form due to the small size of the frets.  I am still stoked at playing this until my granddaughter takes over on this one.", "id": 536}, {"review": "This is a vey simple fix to a constant problem with guitar straps and where to connect the strap to your guitar.  It goes on in a jiffy and the over the neck strap connects easily.  It is a great idea and worth the cost.  I hate having to drill a hole in my guitars.", "id": 568}, {"review": "I am not a fussy person about guitar strings.  They either sound good or they don't to you and you are the one that matters.  I was very pleased with getting 3 sets at this price delivered to my front door.  There are so many different strings out there just go with the flow and look at the company logo on the outside.  Martin is at the top of the heap.  These strings sound light and bright. Very pleased with this purchase.", "id": 579}, {"review": "One of biggest hurdles for any instrument player is keeping your instrument in tune.  With this little gadget there is no guess work.  Clamp it onto the headstock of your guitar and pluck each string and bring each one into tune. I love this little gadget and the price is super on Amazon!", "id": 706}, {"review": "Wrestling the guitar in and out of the case when you want to practice is inconvenient.  This stand allow for a reasonably safe place to store a guitar when it is out of the case.  It even has a band across the neck of the guitar to keep it in the rack. I like it as a safe stoage place as well as the ease it offers to grab my guitar and practice for a few minutes.  It is a reasonably well made rack at a very good price.  It is much safer to have my guitar in this rack than laying about in the house waiting for someone to step on my guitar.update: January 7, 2013...  liked the first one so much I got two more for my other two guitars.  I love being able to pick up one of the three and do a few licks.  Each one is different and now they are all three out of the their cases and at my fingertips.  The price is right and they keep them safely stored.", "id": 519}]