[{"review": "These picks are nylon, so each one will last you a couple of years (as long as you don't lose them!!) this is thicker than the .60mm, so you can dig into the strings a little better, but still a hair flimsier than the Snarling Dogs .73mm picks (I know, they're the same size, but trust me these are &#34;flimsier&#34;), and the grip is ok. You can't go wrong here.", "id": 62}, {"review": "I feel like this picks dirt off my guitar strings better than the Taylor cloth I also have in the case", "id": 184}, {"review": "You don't really need an expensive sustain pedal unless you're a concert pianist playing on a $10k keyboard- nuff said.", "id": 251}, {"review": "I have an Axe-Fx 2 that requires quality monitoring (I do use studio monitors, but sometimes I need something that no one else can hear), and for a while was using the Senheiser HD 280 Pro headphones.When I put these on (without burning them in), I was blown away at the difference! for $20 more, these cans are more than worth the extra cashAlso better, is the leather wrapped around the arc- much sturdier, while the pad on my Senheisers is flaking off, piece by piece.", "id": 458}, {"review": "This strap is genuine suede leather, so it is really comfortable and has lots of friction, so no sliding around on my shoulders while I'm playing. It's plenty long for any guitar size or shoulder width, and adjusting is just like most leather straps. Taylor logo makes it look good and official.Nothing bad to say about this strap.", "id": 612}, {"review": "I can see this strap lasting a long time. I love how I don't need new strap buttons, considering that the screws may be smaller than the original strap button screws (which facilitates the strap button falling out and your guitar smacks the limestone floor!).You can lock each strap button with one hand- great product!", "id": 666}, {"review": "I love the small size of this tuner, and it clips on to the guitar headstock firmly. The tuner picks up vibrations, so it doesn't require a silent room to tune an acoustic guitar. There's just one button, so it's idiot-proof. However, the button can get pushed to easily, so sometimes the tuner is on in my guitar case, running the battery out too soon.Speaking of battery, the smallness of the tuner necessitates a small battery, but I hate that they used the CR2032 battery. It just doesn't last long, and in Brazil, it's really hard to find this battery at all.", "id": 762}, {"review": "This soundhole cover is one of those products that belongs on the list of essentials for an acoustic guitar player, right up there with a tuner, string winder/cutter, cleaning cloth, pack of extra picks, and capo. It's designed to eliminate feedback when plugged into a sound system, which it does nicely. It's also great for sealing up the body of your guitar if you want to dry it out or dampen it quickly (as in 2 nights like that in a case).", "id": 497}]