[{"review": "I teach guitar classes at a community college and spend my days in a room full of twangin' 'n strummin' guitars. Human ears and tuners with external mics, including iPhone app tuners, have trouble in such an environment. Why? The cacophony of competing pitches befuddle both brains and tuning machines.  So I bring an extra beefySeiko Sat800 Durable Style Chromatic Tunerand Korg CM-100L mic to class for students to use. And it works great: clip to the headstock and it isolates their guitar from the din and delivers a clean signal to the Seiko.The Seiko tuner has hit the deck many times and still looks like new after a couple years. Unfortunately the CM-100L is not nearly as durable: wires are thin, delicate and prone to breaking. If I was the only one using the CM-100L, it would probably last for many years. But students are rough and can't stop themselves from tightly wrapping the wire around the tuner after they're finished (although I ask them not to). The wire gets stressed at the mic clip and/or plug and shorts out. I burn through one or two CM-100L per semester. I found a big gob of silicon sealant on stress points helps extend the life of the wire (electrical tape is useless).Great product: easy to use and makes tuning in a room full of guitars a snap. Wish they made an industrial strength model with big beefy cables...", "id": 474}, {"review": "I teach class guitar in a community college and bought the SAT800 to loan to students during class. I selected it for the rubber bumpers and beefy build, expecting anything in this day and age to nail pitch quickly and accurately. And, indeed, it tunes acoustic and classical guitars without filching. Oddly, in one year of use, nobody has dropped it so the bumpers also provide a sure grip in hand and on music stand. My prior smooth plastic Seiko cost four times as much as the SAT800 but managed to hit the deck several times a week. Amazingly it still works perfectly but was not well suited for butterfingered students. However, the display was larger and sported colored note names, so it was more intuitive for beginner use.The built-in mic works fine in a quiet room but is useless in a classroom full of guitars (as are all built-in tuner mics). You need to use a tuner pickup and all is well (I use a Korg tuner pickup). If I were to nick pick I'd have to say the letter name of the pitch is way too small on the LCD. It's tucked in the far right corner in 12 point type and positioned just after the octave number. A lot of students can't read or notice such small type. Also the octave number immediately in front of the letter confuses many beginners as they assume it is the string number (doesn't matter how many times I explain that it isn't). Finally, it is too easy to accidentally recalibrate the pitch. Nearly every week somebody inadvertently sets it to A435 or whatever and causes a bunch of other students to be out of tune. A lock button or some other safety would be a smart design upgrade. Most of these nick picks don't apply to pros or advanced players but are something to consider if you're a novice.Add a calibrate safety feature and double the pitch name size and this would be a 5 star product. Right now it's a mere 4.5!", "id": 532}, {"review": "SOUND QUALITY: The BX5 sounds neutral and balanced. Compared to similar sized consumer speakers, they are a bit understated and without bass bloat or exaggerated highs (i.e., teen EQ). The even keeled tonal signature is pleasing and easy to listen to for hours. It also lacks a midrange bump, and sounds a bit recessed or laid-back compared to average earbuds or home speakers. In fact the BX5 sounds similar to my Sennheiser 580HD headphones, but with less lower bass. And that's a good thing for mixing as you don't want speakers that add color and/or bumps in the frequency response.Unlike typical passive stereo speakers, the BX5 is powered with separate amplifiers for the tweeter and woofer, i.e., bi-amped. This design allows for accurate reproduction as amplifiers are optimized for each driver. The downside to this design is each speaker needs both input and power cables, so not convenient for living room use but not a problem for nearfield computer based editing.At first the BX5 struck me as underpowered for a 70 watt rating, at least with a signal directly from my Mac Pro. However, once jacked into the hotter signal from my MOTU Ultralite the true power of the BX5 was revealed. It was loud and could be painfully so if cranked.These are directional speakers and render placement of instruments in a stereo soundfield accurately as long as you sit in the sweet spot a couple feet out (your head should form a triangle with the two speakers). That diffuse room filling tone of home theatre speakers is MIA. In fact, unlike most speakers, there is little rearwards projection. Perfect for not bothering family or neighbors but bad for parties. So don't buy these for standard stereo or home theatre use.I mainly mix classical and acoustic guitar solo and ensemble recordings, live and multitrack, so the bass range is perfect for me. The bass extends down to a clear 60Hz, so plenty ump for drop-D and drop-C tuning. If you mix bass guitar and kick drum you'll want larger speakers (BX8) or a sub but these are great for guitar.I'm used to mixing with neutral speakers and headphones but it would be nice if you could adjust bass, mid and highs for different room responses and taste. Oddly, the PDF instructions show EQ switches for the prior version of this model but they are missing from my speakers. I assume they were omitted as a cost cutting measure.RFI RESISTANCE: I'm an inner city dweller and live in a high RFI area. Cheap audio gear acts like a radio receiver and injects a local classic rock station into my mixes. So one of the major selling points for me was M-Audio's claim of RFI shielding. Luckily that was no mere marketing jive. They really are well shielded against RFI. Not a single wayward drum loop or DJ in my tracks, not even when cranked. I can't make that claim for prior speakers I've owned.HEAT: These speakers run on the warm side: the upper back is fairly warm just idling and can get hot to the touch after a long session. Not egg frying hot but a wee bit uncomfortable to the fingertips. It has a sensor to shut it down in case of excessive heat. However I have not seen it shutdown even after all day editing sessions. I live in the balmy tropics so cold weather dwellers may not see as much heat build up. Not a deal breaker but it's wise to turn them off when not in use (I use a power strip so I don't have to flip two separate switches).CONSTRUCTION: These are handsome units in a blend in your your gear sort of way: the black finish matches perfectly with my black trimmed Cinema Display and MOTU Ultralite. Construction appears very good with dense particle board (MDF) cabs, metal back plate (heat sink benefit) and matching plastic front molding around the drivers. The cabs are covered with a satin black vinyl. These monitors are petite and smaller than most speakers with the same sized bass driver.The bass drivers are Kevlar with rubber surrounds (tougher than foam!) and the tweeters sport silk domes. No protective grill or covers as usual for mixing monitors. So the nekid drivers can be easily damaged by a careless finger or chopstick.CONNECTIONS: Like most studio monitors, the BX5 comes with pro audio style jacks for 1/4 inch phone plug/TRS and XLR. If you're a novice recordist or a civilian buying these for general computer use, be forewarned there are no stereo mini jacks, RCA or USB. So you will need to pay extra for a set of special cables and adapters. If you're an experienced recordist, you should have plenty of these cables laying around but, otherwise, be prepared to reach for your wallet.One of the things I like about the BX5 is both the TRS and XLR connections are active at the same time, allowing the monitors to receive signals from two different sources without messing with cables or switches. I have an Audioengine D1 DAC connected to the TRS/phone input (for iTunes, movies, games, etc.) while a MOTU Ultralite (for mixing & tracking) is plugged into the XLR connection.LAST BLURB: Yes, the small Focal speakers I listened to were better sounding and louder than the BX5 but cost a couple toes and a month of lunches. However, a perfect monitor for a home studio isn't only about a good neutral sound, but also about compactness, appearance and value. And the BX5 nails all of these while still sounding pretty dad burn fine.", "id": 783}, {"review": "", "id": 800}, {"review": "Acoustic guitar amps have more in common with stereo systems than traditional electric guitar amps: neutral full-range sound (rather than crunch & distortion), high power ratings for clean tone, full range speaker system with woofer and tweeter and sensitive preamp inputs optimized for the low output of piezo pickups. Unfortunately for me, acoustic amps tend to be optimized for steel-strings and rarely get classical guitar tone right, even with dial diddling. As a dedicated nylon-string player, I'm always looking for the holy grail of amps. Is the Mini sent from heaven?PIEZO TONE: I jacked in my Takamine LTD2012 Classical and Hirade TH8SS (classicals with Cool Tubes preamps) and with tone controls set flat and had my ears pinned back with shockingly powerful output. The master volume was barely cracked but this little guy is loud and muscular. Unfortunately, that big sound wasn't natural and sounded closer to an electric guitar than a classical: big bass, bright lower trebles, weak mids, quacky tone and compressed. Obviously, under-saddle piezo pickups are no studio mic but it should sound better than this. So I diddled the controls and it improved a bit but I couldn't dial in a pleasing tone. The best timbre with my Hirades was bass-11:00, mid-3:00 and treble-9:00 (clock face orientation).Some acoustic guitar amps allow the tweeter to be disabled and I suspect the Mini's overly bright tone would benefit from cutting that little guy from the circuit. As a point of comparison, Cool Tube piezo pickup tone from my 21 year old Trace Elliot TA50R is much more natural, complex and sustained. Cool Tube piezo tone from my SHEN-CPK-8T is drop-dead gorgeous. Perhaps these other amps have additional processing to naturalize and de-piezo the tone? They cost more than the Mini so they gotta earn their keep somehow.I plugged in my mid-1990s Trace Acoustic TAP-1 preamp into the Mini and was able to dial in better tone, albeit still not as good as my ancient TA50R. I also tested my Fishman Aura Spectrum D.I. and it rendered more natural classical tone. So you can get decent classical guitar tone if you're willing to carry another box to your gig.REVERB: The single program digital reverb makes amp timbre brighter and harsher sounding, even when mixed in sparingly. Wish this amp had an effects loop as any budget half rack unit will sound better.MIC TONE: I don't normally use a mic for casual gigs but this is feature is handy when you need to mic a friend or blend in a small internal mic for extra ambience. The Mini lacks phantom power so I installed a battery in my Shure 849 condenser mic, set tone controls flat and was greeted with surprisingly natural mic tone. I also tried my ancient Shure SM57 dynamic mic with similar good results, albeit that mic needed a little treble cut. As a point of comparison, the Mini whips my TA50R good in terms of mic output and tone.APPEARANCE & BUILD: The Loudbox looks more attractive than the pictures. And it is much lighter and slightly smaller than my TA50R. If you drag it to gigs you'll find the exterior delicate: the vinyl material and underlying wood are easily damaged by gentle pressure from straps and carts. It's the most delicate amp I've owned.FINAL BLURB: My feelings about this amp are mixed. For value and use as a wee PA it's a 5 star deal. For under saddle pickup classical guitar amplification it works but is far from natural: compressed dynamics, bright lower highs (even at full treble cut) and the dreaded piezo quack. So 2 stars for classical guitar reproduction. The Fishman Aura Spectrum D.I. or similar acoustic guitar processor does significantly improve tone, but that's another 2 or 3 bills. Unfortunately, straight out of the cardboard, the Loudbox is not ready for for primetime nylon string reproduction. I suspected the Mini was optimized for steel-string guitar tone, so I borrowed a friend's Takamine EF341S and I was right: steel-string reproduction is significantly better than nylon-string. All in all, the Mini packs a lot of punch for 3 bills and just may be the best buck to tone ratio deal for a novice coffee house artist.", "id": 703}]