[{"review": "all 12 of mine broke within a year and the jacks got bent pretty easily. so I switched back to the plastic ones which have lasted me over 2 yearsHosa CFS606 6 Inch Right Angle FX Pedal Cable, 6 Packand they are still going strong.", "id": 207}, {"review": "I was looking for a sustainer pedal for my m-audio keyboard to use with garageband and found this so I bought it and it works great does exactly what it says it does and Actually looks cool. It's an amazing tool for keyboard player. Highly Recommended.", "id": 251}, {"review": "This is a simple preamp booster that adds a bit of dirt so if your looking for a clean boost this isn't it try something else. I find This best used to push the front end of a tube amp. its really similar to an overdrive except this boosts more than a normal one and is good for cutting through the mix on a solo or fattening up single coil pickups. overall great pedal and amazing price highly recommended.", "id": 365}, {"review": "I've been wanting a pitch vibrato pedal for a while but didn't want to spend $350-$500 for an old boss vb-2(which this pedal sounds exactly like) so i looked at this which I didn't really know what to expect but when I got it I was amazed by it, it sounds really good. It maybe less durable than a metal pedal but who cares for this price I wouldn't mind buying a new one if mine broke and considering there is hardly any companies that actually make pitch vibrato's(uni-vibe/Vibe pedals are not pitch vibrato pedals)buying a new one isn't a problem.", "id": 429}, {"review": "These are great patch cables especially for the price. They don't suck any tone they are reliable(I've had mine for 2 years)and are really great for players on a budget.", "id": 11}, {"review": "This mic is excellent, it's pretty much a straight up clone of an sm-57  and for the money there are no mic's even close to this one. Also the price at orange county speaker's website is $29 and $25 in store so I'm not entirely sure why it's $50 on Amazon.", "id": 594}, {"review": "This pedal is ok at best there are a lot better metal pedals out there the only thing this one really has going for it is it has a built in noise gate other wise this pedal is pretty thin sounding and has far to much gain then you will ever need. I would personally recommend the Electro-Harmonix Metal Muff over this any day it is a better sounding pedal for about the same price.", "id": 638}, {"review": "These will not wear down which is amazing and they have all the same great qualities as all the other jazz III's. the only problem I have with them is dirt can get between the grip pretty easily which makes them slip but if you clean them well then its not a problem.", "id": 686}]