[{"review": "These D'Addario \"EXP16 Phosphor Bronze Light\" strings for acoustic guitars produce decent sound and are designed to last longer than \"normal\" strings. We have two beginner guitar players in the house and we are very hard on strings, so these are a good choice for us.We are very pleased with the way they sound, feel, and last, so will likely pick up these again the next time we need to replace the strings.Recommended!CFH", "id": 130}, {"review": "This Guitar Hanger is good looking, well made, and was exactly what we were looking for to hang my son's acoustic guitar on the wall in his room. Our logic was that having it hanging in plain sight would be much more conducive to him practicing over having it hidden in case stuffed in a closet, and so far that seems to be the case.The hanger was easy to install (literally took less than 5 minutes to screw into the wall) and is easy to use (just place guitar in the padded holder by the neck).Highly Recommended!CFH", "id": 166}, {"review": "This Dunlop \"Ergo Pickholder\" is so convenient for storing picks directly on the guitar. This is a great way to always have picks handy, especially if you drop one while playing. Here are my observations:+ Small Size; is fairly unobtrusive when mounted to the guitar+ Easy to Attach; just peel of the paper backing and stick it where needed+ Good Capacity; easily holds 6 picksMy only note of caution is that if you overload this and then fumble pulling out a pick, you are likely to get more then one dispensed in your hand. Try it once or twice and it is easy to avoid.RecommendedCFH", "id": 167}, {"review": "These D'Addario Medium Acoustic Guitar Strings come as individually packaged sets of three, with the necessary six strings in each set. Being new to guitars, we had no idea how often the strings would need to be replaced so this three pack seemed like a good starting point.The strings are good quality, produce accurate tones (according to our auto-tuner), and have held up well.Highly RecommendedCFH", "id": 198}, {"review": "We picked up the \"XCG4 Guitar Stand\" for my daughter's acoustic guitar and it is exactly what was needed! Here are my observations:Pros -+ Stable; once setup and tightened down, this is very sturdy+ Adjustable; the height and base can be configured to accommodate the guitar+ Security Strap; has a rubber strap that hold the neck securlyCons -- Slight chemical smell that dissipates after a few daysThis is a good value for a very functional and good looking guitar stand.Highly Recommended!CFH", "id": 258}, {"review": "We bought the Pyle-Pro Lavalier Wireless Microphone System for use with thePyle Pwma230. We needed an extra wireless mic for our workshop presenters and this was a very inexpensive choice. For the price, this worked a lot better than I expected but it did take some adjustment to the \"Trim Screw\" on the receiver to get the clarity and range needed. We also had to tape the little wire antenna up so it wasn't hanging in front of the speaker (this might not be an issue for you, depending on where you plug yours in).There are a lot of very expensive wireless mic units that I'm sure would provide better sound and range, but this one works just fine for our uses.Overall, a good value for the low cost of this unit.", "id": 267}, {"review": "This little amp is exactly what my son needed for his acoustic guitar's output while playing outside on the porch. The amp produces a much \"bigger\" sound with much better quality than expected. This does eat up 9v batteries so we also picked up an AC power adapter for when he uses this in the houses.We also like that this has a headphone jack, which cuts the sound to the speaker when plugged in.Highly Recommend! Note: We have the \"Burgundy\" color one.CFH", "id": 302}, {"review": "This little amp is exactly what my son needed for his acoustic guitar's output while playing outside on the porch. The amp produces a much \"bigger\" sound with much better quality than expected. This does eat up 9v batteries so we also picked up an AC power adapter for when he uses this in the houses.We also like that this has a headphone jack, which cuts the sound to the speaker when plugged in.Highly Recommend!CFH", "id": 303}, {"review": "We opted for the World Tour \"Guitar Gig Bag\" over a hard case because most of the time my son's guitar is hanging on the wall usingString Swing Hardwood Home & Studio Guitar Hanger (Shades May Vary). This case is generally good quality and meets our needs, with the following observations:Pros -+ Lightweight; doesn't add a lot of pounds but still protects the guitar+ Good Quality; strong material, stitching, and zippers+ Storage Pockets; big enough for music pages, picks, and a small electronic tuner+ Handles; good hand grip handle on the side and has well padded adjustable packpack strapsCons -- Limited Protection; this is not a hard case and it will not provide much protection from a serious impact- Appearance; this is not awe-inspiring to look at, being very basic and the \"World Tour\" logo looks a little \"cheesy\"This was a good choice for the limited, light use it gets from us.Recommended!CFH", "id": 309}, {"review": "The Pyle \"Battery Powered PA System With Wireless Microphone\" is surprisingly well made and has features I would have expected on much more expensive equipment. We run workshops, often at our customer's locations, and needed a portable PA system that could easily be transported and doesn't require a lot of power. Here are my observations:+ Long Battery Life - Worked for over 4 hours straight, but can be connected to AC to work as well+ Wireless Microphone - Built into the system, has good range, and acceptable sound. Battery included.+ Inputs for 2 Microphones, 1 Guitar, and 1 Audio Connection - Each with it's own volume control+ Portable - Built in retractable handles and wheels makes moving this around very easy+ Includes a mini-Plug to 1/4\" Converter - A handy accessory+ Includes Echo Effect - A fun adjustable effect to liven up your voice (my kids loved playing with this :-)Note: My unit shipped with one of the fuses in a bag and it needed to be installed before the system would work.This unit worked much better than expected and is a great value for the performance of this small sized unit!Highly Recommended!", "id": 325}, {"review": "This OnStage \"Heavy Duty Guitar Stand\" is exactly what we were looking for to hold my son's acoustic guitar. Here are my observations:+ Easy to Setup; takes just a few seconds+ Sturdy; free standing design works well+ Neck Retainer; adds a degree of protection from accidental knocksThis is a great basic stand that works exactly like we hoped!Highly Recommended!CFH", "id": 436}, {"review": "This Levy's Leathers \"2inch Cotton Guitar Strap\" is good looking (in an understated sort of way), very well made, adjustable and extremely comfortable, and works exactly as expected.We bought this for my son as a \"starter\" strap and figure he will buy a more flashy one someday, but this one looks like it will be used for the foreseeable future!Highly Recommended!CFH", "id": 479}, {"review": "The picks we received were \"Legacy\" and not \"Alice\" brand. While not as pictured, these are good enough for us as we (my daughert, son, and me) learn to play guitars. The mix of different thicknesses was fairly even, so we were able to select the one that felt \"right\" for each of us.The pearliod looks good and overall am happy with these picks.CFH", "id": 567}, {"review": "This Tascam \"US-100 USB Audio Interface\" is exactly what I was looking for to record from our wireless mic with XLR outputs, directly to my PC video editing software. We professionally produce instructional videos and needed this for \"voice over\" work on existing footage. Before getting this convenient little unit we had to record into a camcorder and then import it into the PC, so this saves us a step when we only need to record audio. Here are my observations:+ Plug and Play; connected to my PC via USB and was instantly recognized+ USB Powered; no external power needed, a big plus when using my laptop+ Good Sound; clean and clear input+ Multiple Inputs; XLR, 1/4 Mic, RCA stereo line, and \"Hi-Z\" GuitarMisc:- XLR input is not powered (not a problem for us)- Includes \"Audacity\" software, but we did not need to load itHighly Recommended!CFH", "id": 639}, {"review": "This Snark tuner is a very clever gadget that is simple to use (even for my children) and works well. The display is easy to understand and is very accurate (confirmed by our guitar teacher's meter). The Snark also has protective grips so it will not damage the guitar finish.Everything should be this easy to use and work this well!Highly Recommended!CFH", "id": 706}, {"review": "This MXL Studio 24 USB Microphone is a decent choice for those needing a portable or a good quality studio microphone. We professionally produce instructional videos, both at our shop and at customer locations, and often need to voice over footage. This mic will replace theBlue Microphones Snowball USB Microphone (Textured White)we use in studio and also theMXL Mics MXL-STUDIO 1 USB Condenser Microphone, Cardioidwe had previously used for off-site recording.Pros -* Good Voice Quality; cleanly captures spoken voices* Good Physical Quality; this is beefy mic that feels very well made* Looks Professional; while not important to the functionality, it makes a good impression on our customers* Long USB Cord; allows for placement away from PC* Headphone Jack; \"real time monitor\", handy to listen to live recording and playback* Travels Well; includes a protective travel case that fits all of componentsCons -* No Pop-Filter Included; normally I wouldn't mention this but the instructions include a warning the condenser mics are susceptible to water damage (like from breath moisture) and a pop-filter is \"essential\". We boughtNady MPF-6 6-Inch Clamp On Microphone Pop Filter* Left Channel; only brings in audio on the left channel, had to compensate in my editing softwareMisc -* Since we do not do music recording of any type, I can't comment on the mic's performance in that area* Software; Studio Control GUI (downloadable) can be launched to control some of the finer functions of the microphone, but the interface is not intuitive and my editing software (Sony Vegas Pro) gives me better control for what we doThe MXL Studio 24 mic more than meets our needs (which may be different from yours).Recommended!CFH", "id": 712}, {"review": "This Joyo JF-03 Crunch Distortion pedal is just amazing! My son has become a fairly decent guitar player over the past year and is moving beyond the basics, so was thrilled to get his hands on this distortion pedal. It was great to hear him play \"Iron Man\" through this pedal, it made a huge difference.The pedal produces a rich sound that has a nice sustain and tweaks easily with the three adjustment knobs (Gain, Volume, and Tone). This is also a very solidly constructed pedal that will hold up well to a lot of abuse. At the loudest settings there is a bit of \"hiss\", but it is easy to find where it starts and dial it back a bit.Highly Recommended!CFHEvaluation unit provided by manufacturer.", "id": 794}, {"review": "This Joyo JF-34 US dream distortion box is very well made and produces a good range of distortion effect. My son has taken up playing guitar about a year or so ago and now that he is past the basics he was interested in trying different techniques. This box can be set to make minimal distortion or maxed out to produce very heavily distorted effects.The box is very good quality, with nice large controls and metal foot switch. The unit can be powered with a 9v battery or via an external power source (not included).This is a fun way to add distortion effects for guitar players.Highly Recommended!CFHNote: Manufacturer provided unit for review but that in no way influences my rating or comments.", "id": 832}, {"review": "This Hosa Cable is very well made, with good quality connectors and a nice long length. My son is expanding his collection of amps and effects pedals so needed additional cables to get everything connected. This 25' cable gives him flexibility to move around and it is sturdy enough that it can take being stepped on and pulled around.The cable works well and is a good value for a decent quality cable.Highly Recommended!CFH", "id": 6}, {"review": "This 6-Pack of Guitar Patch Cables are great for chaining guitar effects pedals and the short lengths helps to reduce cable \"spaghetti mess\". These are well made cables with 90-degree connectors, which is exactly what we needed.Highly Recommended!CFH", "id": 847}]