[{"review": "These strings are great for a 12 string. I started using coated strings on all of my guitars last year and have gotten use to the smooth feel. A 12 string is a little harder on the fingers so the coating is nice to have. They sound as bright and clean as any uncoated string I have used on this guitar. And I think they will last longer. Which is nice because the guitar is really not much fun to restring!", "id": 110}, {"review": "This stuff is great. Leaves board clean and fast. No residue, no sticky and no oil film. Price is right. If you use any fingerboard treatment, try this one...", "id": 344}, {"review": "These are amazing. I'm an intermediate player. Have been for the last 30 years. I tend to have sweaty hands and loose grip. Every other pick I have used has turned in my fingers...loose grip, little sweat, slick finish. Ok now...thin? med? heavy? You can choose the stiffness just by where you hold the pick. Incredible how the stiffness will change depending on where you hold it. And I can even hold onto it. Very nice grip on these. I have to keep getting more cuz everytime I hand one to someone to try, it's the last time I see it. Just hit Add to cart. You won't be sorry", "id": 503}, {"review": "This is the second clip on tuner I have bought. This is much better than the other brand I have. It's easy to use and see. The colors and the swivel head make this one my favorite. The built in tap metronome is a cool idea. If you're shopping for a tuner give this a try. At less than $13 it's a fantastic buy", "id": 707}, {"review": "I just thought I would throw in another 5 star review which is based on the cost vs quality factor. I have several guitars, and always thought Epiphone to be an inferior guitar. Well I was dead wrong. It may not have the price tag of my \"better\" guitars, but it sure has the playability and sound. Especially for the $100 tag on it. Great for beginners or a seasoned player to add to his collection. The simple, yet killer sound of the single humbucker is hard to beat. I will not shy away from Epiphone anymore. Don't make the mistake of not picking up this guitar only because it's not stamped Gibson.", "id": 738}, {"review": "I have several of these tuners and this one is as great as all the others. Easy and quick. No reason to be out of tune with these tuners. The white is great but no matter what color they are, they are a quality product. Rock on....", "id": 861}, {"review": "In my opinion...This is the best amp in this category. I know people who have the Marshall and the Fender. I plugged into my little HoneyTone and I had the best sounding micro amp hands down. They were both amazed with the sound. They said \"well mine was only $45 and \"mine was only $40.\" Too bad so sad for them. I told them mine was $20. Since it doesn't say Marshall or Fender, I only had to pay 1/2 for a better sounding amp. If you are looking for an amp with 1 or 2 watts, and know what to expect from a micro, this amp does not disappoint", "id": 605}]