[{"review": "I've been using these Fender straplocks over the last year:Fender 099 0818 300 F Straplock ChromeThe problem with those is that they use screws to secure that part that is on the strap itself, and the screw will slowly back itself out and you get yourself a disaster. I've decided to try these because they use a \"dual\" system: you can use the lock on your strap, or just use your \"regular\" strap without the locking mechanism. I've only been using these for a week, but so far, I like them much better than Fender's. I think I will replace all Fender straplocks with these.I do agree with the others on the fact that the screws are of lower quality, and the screw heads will strip if you're not careful. When I was installing these strap nuts, I screw in a half turn at a time, and applied lots of pressure so that the the head won't strip. If you can get over the installation, you got yourself a pretty good locking strap.", "id": 44}, {"review": "I was expecting something a little bigger. It will do, but next time, I probably will look for something with a little more stability.", "id": 163}, {"review": "You have to turn the knobs every time you want to use this. What a pain. Oh well, it was cheap enough to have around.", "id": 304}, {"review": "I bought this for my daughter who plays the keyboard. It was already assembled right out of the box, and seems well padded and sturdy. My daughter likes it. I like the price because of the special deal from Amazon.", "id": 306}, {"review": "When I sit down to practice my guitar, I just want something very simple to keep time. It was a pain previously to have to mess with menus and such on a computer to bring up a metronome app from tablet, phone or computer. With this, I'll just have to flip a switch and dial the tempo that I want. Simple and loud enough for me to practice my guitar routines. I do recommend this one.", "id": 390}, {"review": "I don't like these too much. The back side will shed for a while before settling down. The leather is rather soft. I've purchased other similar straps that work better and feel more comfortable. This particular one is just ok.", "id": 660}, {"review": "I decided to try these because the &#34;normal&#34; picks I was using kept slipping out of my fingers. That was several months ago. I am still using these everyday. Pretty durable and reliable. I do recommend these.", "id": 680}, {"review": "My revised review (after about a year of use):The one thing I hated about these is that the screw that is suppose to hold the two pieces on the guitar strap together slowly backs its way out, so if you're not careful, your guitar will fall. It is now a habit of mine to tighten these two parts on the guitar strap, once every few days.My original review:Very easy to install; didn't require drilling. I have these installed on my stratocaster in minutes. Although it looks a little bit big and clunky, it's a small price to pay for stability. I probably will get another set, but may get the black ones instead of the silver because I think the black color may hide the \"clunkyness\" a little better. Overall, a very good product.", "id": 682}, {"review": "These have the correct thickness and texture that I want, but they are smaller than a typical pick. So be sure to try them out first before buying. One just cannot tell the size from the picture Amazon has. I wish they put a reference picture by the side of this pick (may be dim the ref image a little so people won't get confused). Some people swear by these, but I that find my fingers get a little numb after playing these for an hour or two. May be you need to get acclimated to this pick before you can fully use it effectively and for long duration. I won't be buying these again.", "id": 686}, {"review": "Seems like it draws current, even when it's OFF. I have two guitars, and this thing stays with one guitar. I make sure to turn this tuner OFF before putting the guitar away, and when I get around to playing the guitar again (7 to 10 days later), the battery is already drained. This happened at least three times already. The tuning is slightly off from an inline tuner that I have to compare against. I don't know which one is more accurate. The good thing is it's very convenient to have almost instant reading when you need it. I probably won't buy again for my other (and future) guitars.", "id": 785}, {"review": "Good quality bag for my Epi LP. Fit like a glove, in fact I wish they were a little larger to hold some accessories.", "id": 51}, {"review": "They only fit if you have enough room in your strap button, if not they will just pop right out. I threw mine away.", "id": 261}, {"review": "I don't play these myself, I bought them for my daughter. They look kinda flimsy but for the price, they are ok for beginners to play.", "id": 293}, {"review": "Good grip, but too flexible, and the description says nothing the thickness or the flexibility of these picks. Probably good for strumming, but not good for lead.", "id": 503}]