[{"review": "Bought this Hosa Pedal Cable for our son to interconnect his guitar pedal. It works well and seems to be durable. It hasn't given him any problems so far. It doesn't appear to change the sound quality or tone. Great product.", "id": 11}, {"review": "I started buying these strings for my guitar playing son back in December of 2012 and continue to do so to this very day. He absolutely swears by them. He does go through them fairly quickly being that the humidity here in Hawaii makes them prone to rusting. Other than that, the strings are strong and durable and gives off a nice sound quality. He highly recommends these strings to his fellow guitar players out there.", "id": 156}, {"review": "I purchased the Planet Waves 10 Ft Instrument cable for our son to hook up his electric guitar to his amplifier. It works well...no connectivity issues whatsoever. Highly recommend.", "id": 168}, {"review": "I bought these nickel wound guitar strings for my son. He says thses strings are strong and durable and projects a good sound quality. I purchase these strings a lot for my son...you can't beat the price for these quality guitar strings. An added plus...they're made in the USA.", "id": 239}, {"review": "I bought this harmonica for our son...the music enthusiast. He loves it. It seems to be manufactured well...as it is substantive in weight  and seems to be solidly built. Only time will tell. But for now it seems to be a decent harmonica. I actually bought two harmonicas for him, just in case one breaks. Couldn't pass it up as it was selling for such an affordable price. Our son says it's easy to use and has a good sound quality.  Hey, if it makes our son happy, so be it. Highly recommend.", "id": 826}, {"review": "My son uses this winder and cutter frequently to change his strings on his acoustic and electric guitar. It hasn't failed him yet. It's easy to use and cuts the strings precisely and cleanly. He says it's a must have if you maintain and change your own guitar strings. Highly recommend.", "id": 94}, {"review": "Ordered these guitar picks for my son. The picks were exactly as described. We ordered the blue color, which is dark blue with a lighter, shiner, blue design on top of it. It is a \"heavy duty\" grade and it is very sturdy. He is very pleased with these picks. The appearence is pleasing and it is made well - very pleased with the quality. We will be purchasing more picks in the future. Highly recommend!", "id": 120}, {"review": "My son finds that this holder comes in handy when storing his picks. He says it's easy to use and finds no difficulty removing his picks from the holder. Highly recommend!", "id": 233}, {"review": "Bought this distortion pedal for our son...who plays his electric guitar daily. He loves the functionality of it as well as the ease of use. It also produces a nice &#34;distorted&#34; sound quality and tone (I don't know if I would agree, as my generation hails from a different genre of music). But he loves it and I guess that's all that matters!", "id": 434}, {"review": "My son says these picks are great to use because of the rubber grippers that make it easier to hold...especially when playing the guitar for an extended period of time. Highly recommend!", "id": 503}, {"review": "Purchased this Korg Guitar and Bass Tuner for our son who uses it to tune his acoustic and electric guitar. He says its easy to use and is durable. It has LED lights to follow as well as a meter to use. Excellent product...highly recommend.", "id": 624}]