[{"review": "I really like the strings they sound very bright and go well with my guitar I do hope they last quite a while I put them on a bout a month ago but that guitar is only lightly played so I will try to update when I change them", "id": 103}, {"review": "not two weeks after I put these on the A string broke close to the ball on the string.  I break high e strings on occasion.  but something as thick as an A string?? maybe it was a defective string as I thankfully bought two sets and I was able to pull the A out of the other set and it has been fine since.  now however I have the dilemma of should I just buy more strings and just use the second set as I need them.  Further more do I stick with the same brand.  that is supposed to last longer than average strings.  At this point I am going to keep playing this set until its time to change then go from there.  I will update once I decide if I should stick with this brand or go back to super slinky'supdate 3/25well another month went by(a week ago) and the D string broke in the same fashion leaving me to believe I either got defective strings are these strings are not as good as they are said to be. either way its losing another star.  if it happens with a different set of strings I will reevaluate my guitar/review and change accordingly", "id": 106}, {"review": "does not work for all guitars.  one of my guitars has a more rounded head and it does not fit over that anyway I have tried. though with the arrow shaped holders it works as it should", "id": 261}, {"review": "while the product is everything it said it would be.  I was just hoping it would be thicker as it feels so thin. it does whats is supposed to so I cant fault it in that way it. just was not what I was hoping for.", "id": 804}, {"review": "I recently changed them out for a different type of EB's while they were good the were not exactly what I was looking for. not sure the new set is either but time will tell.", "id": 823}, {"review": "when it works good its great but sometimes it gets static-y I wish it had a volume in line not much more to say", "id": 789}]