[{"review": "The these strings are fantastic. The sound is deep and heavy, which is exactly what I was looking for. Makes the bass sound pretty bad@$$. I cranked up the bass amplifier after putting on these strings and the sound is pure, powerful, and blew me away.Well worth the money.", "id": 93}, {"review": "Ernie ball strings are quality strings that last me quite a long time. They sound great, and I have yet to have use set of strings by Ernie that were faulty or disappointing in any way.Of course, I have only used a few other brands of strings, so I don't have an arsenal of wisdom to compare the quality of these strings to. But do take my word when I say that these are extremely reliable, good-sounding, and affordable. 5/5", "id": 226}, {"review": "I own a Fender '65 Reverb Reissue, and I had learned from many guitar gurus and such that the best tubes that sound amazing are very, very difficult to find. However, I bought this JJ Electronics one expecting something decent to tide me through until I had enough money to afford a higher-end tube, and this blew me away. I was surprised at how good the tone of the amp was and how it made my guitar sound.This was well worth the small amount of money that I paid for it. In fact, I think I will just go ahead and keep using this permanently until it's almost dead before I purchase another tube.", "id": 228}, {"review": "Well, unless you absolutely botch production, it's hard to go wrong with some guitar knobs. Typical plastic, durable, and looks good.", "id": 221}, {"review": "This pedal is exactly what I have been looking for since three years ago when I started performing. The distortion on this is deep, has long sustain, and has a nice tone to it that the classic Boss DS-1 pedal does not have. It's perfect for a great sound, from heavy rhythm guitar chugging to fat, bruising solos.I love this pedal and have been using constantly ever since I got it.However, word of fair warning: the pedal itself uses a +9V power charge rather than the typical guitar f/x pedal -9V (barrel jack. Look at the power supply of a Boss pedal to see what I am talking about. This ProCo RAT Pedal does NOT use that). If you buy this pedal, you will have to do one of four things:1) Buy the power supply made specifically for this pedal.2) Consistently use and replace batteries.3) Find a converter from barrel jack to 3.5mm jack.4) Be an electrical engineer and rewire it yourself.Other than the above, excellent pedal!", "id": 232}, {"review": "Works exceptionally well. In fact, this works better than regular, single-layered pop filters I have used in the past and your sound is either not compromised at all or the sound is barely effected so that you would not notice.Well worth the money. The build and design of the pop filter is sturdy and can attach to a majority of microphone stands.", "id": 533}]