[{"review": "The On Stage XCG4 Tubular Guitar Stand is a decent quality simple guitar stand like almost all the others, so here is how I rated it. There are really high quality stand of the same design, but i will not use those stands as a comparison.  Seriously, the tubular guitar stand has been around since dirt.  If you somehow made one that retails for over $30 and are able to sell it, I applaud your marketing team.Continuing on, this is how I rated the On Stage XCG4:If it were over $13, it would have gotten 3 stars.Between $7 and $13, earns it 4 stars.if it were under $7, it would have gotten 5 stars.I hope this helps,~JP.S.  The currency is in US dollars.  Please adjust accordingly.", "id": 258}, {"review": "So, you just spent all your money on a guitar and do not want to spend much more accessorizing.  This strap is perfect, even if you do have the money to spend and just looking for something that will do the job well.The materials are 1)high quality soft nylon for the strap - it feels kind of like a non-stretch ACE bandage, 2) durable non-scratching/marring plastic for the links and adjuster and 3) a thick rubber material for the ends.The thickness of  rubber material for the end secure the the straps pretty well. They do not slide of the strap pegs very easily. I say rubber like because they seem more like a synthetic leather but with more flexibility. Again this material seems to be non-marring.All this and a secret compartment for picks.Overall, a fantastic product with a price that can't be beat.  Highly recommended.  Five stars.", "id": 285}, {"review": "This Jim Dunlop 210 Dunlop Bottleneck Slide is basically a glass tube and so far seems pretty durable.  I will not get it to describing this specific product in detail because, well, its just a tube.  I think I already mentioned something about it being sturdy.A bottleneck slide is always nice to have one to replicate someone else's guitar sound or create your own.  Whether you get brass or glass is your preference.  Yes, they do have different tonal qualities, so you may want to try or buy both.Happy playing.  Cheers!~J", "id": 456}, {"review": "Not cheap as far as pics are concerned, but it's definitely nice to get a variety pack now and then.  If you're new, it helps you find what you like.  if you're experience, you might like to keep different pics around while searching for that new sound.", "id": 773}, {"review": "I bought this product with the notion of being cheap No refills to buy, except distilled water.  In all actuality, its a really simple design.I like this design better because of one simple fact.  If the wood in your guitar is already dry, you'll have to refill your humidifier more often initially.  i'd rather be using distilled water than hydration pack refills that are required in some other guitar humidifiers.  After the guitar gets \"hydrated?\", I usually end up wetting the sponge every 4 to 7 days.  It definitely gets taken several time between refills, so it's not that much of a hassle.Overall, good product that you could probably fashion yourself but why bother.  Try not to over-douse the sponge in order to avoid water damage to the guitar.Peace out and cheers~J", "id": 71}]