[{"review": "I keep this cable on my pedal board -Pedaltrain MINI With Soft Case. I've posted a photo on the pedaltrain Mini page. The right angle connector is great to exit the last pedal on the board and the straight connector goes into the amp. I use a Mogami silent cable -Mogami Platinum Guitar 12, Straight to Straight with Quiet Plug 12 feet- for the input to my guitar, but I can't justify paying a LOT more money for the side that goes to my amp (it's not getting bumped around, plugged and unplugged, etc.). This cable works perfect for it's purpose. Oh yeah... and it matches my tweed amp!!", "id": 47}, {"review": "I use this as the first pedal that my guitar cable touches as it goes into the pedal board. It's true bypass, which means that the sound is not affected when it's not in use. When you step on the button, the sound cuts out and you get the tuner. It works as advertised. My only complaint is that it could be smaller. There are other smaller true-bypass tuners out there if space is an issue on your board. I've posted a photo of this tuner on my board -Pedaltrain MINI With Soft Case. If you need a smaller tuner, I have buddies who use and like the polytune.", "id": 504}, {"review": "I know the kind of person I am - If I buy a big pedal board, I'll have to spend hundreds of dollars to fill it up with great effects. Buy a smaller board and I can be selective in the pedals I buy and save $$ by not trying to fill it. Hence, the purchase of the Pedaltrain Mini.This board will fit approx 5 pedals and a power supply. When I initially purchased it, I was hoping that I could fit the power supply under the board, but I tried a few small power units from Guitar Center and none would fit and allow the board to lay flush. I should probably ding one star for this and it would be a great improvement if pedaltrain would just raise the board about 1/8\" to allow for the power to be mounted under the board.The unit is VERY sturdy and ships with velcro to secure pedals to the top. The velcro feels like it's military grade and does a great job of securing the pedals. It's light, easy to carry, and I can grab the case in one hand, with my guitar in the same hand, and carry my amp with the other hand (only one trip from the car to the gig).Overall, this is a great board. I currently have a looper, overdrive, distortion, echo and tuner on my unit. I've added a photo of my board.", "id": 588}, {"review": "I'd give this baby six stars if I could. My prior practice amp (a Vox) was very nice, but finally went south and required replacement. I was looking for something with a great tube sound, as most of the solid-state amps that I've used (mainly fenders and line6 stuff) just don't get there. I was actually looking at the Fender Blues Junior and headed to my local GC to check 'em out and listen side-by-side. The first time I plugged a Strat into this guy in the store, I was blown away (and that was with all of the Jimmy Page wannabes cranking different amps all over the store). I've gotta say, part of me was hoping to rationalize the extra buck for a Blues Junior, but the Bugera actually sounded better. The only one left in the store was the floor model, so I grabbed it.Got it home and cranked it up and here are my observations:- It's solid and heavy. It's still a small-fry (slightly bigger than most 15w amps out there), but much heavier.- The construction is great. I think I read some reviews that knocked the construction, but from the handle to the floor everything looks like it's built to last.- The sound is even better at home (without the GC cacophony)- Adjustments are minimal, but enough. The tone adjustment basically takes the tone from fat to sharp. I've run my Strat, Tele and Taylor T5 through this. I think the hard bodies get the best blues tone, but I can get a really nice clean tone from my T5- The headphones sound great. I was really surprised by this. I would have thought you needed the speaker to get that great fat tube tone, but sounds awesome through a pair of good headphones- The price is self-explanatory, but that's really the part that blew me away. This amp would sell for double the price tag.", "id": 618}, {"review": "I have used the Line 6 looper in the past -Line 6 JM4 Looper. The Line6 is basically the same as the electronics on the SpiderJam amplifier. It's a decent looper, but it's too big and I don't need all the guitar tones, backing tracks, etc., that go with it so I decided to look elsewhere.I wanted a looper that I could fit onto my pedal board that could provide some basic functionality (multiple channels, etc.) and this one fit the bill. You can adjust the loop volume, switch quickly between tracks, turn the background percussion down (or off), etc. I purchased the extra foot switch to have a little more control over switching tracks.The only fault that I've found thus far is that the foot switch cable that DigiTech includes with the switch has a straight input instead of a 90 degree. This is weird, as all pedals on a board need a 90 degree connection or the cable will be sticking into the next pedal. To solve this, I bought a Hosa 90 degree stereo connector (it has to be stereo) -HOSA RT. ANGL. STER. 1/4\" PHONE (F) - STEREO 1/4\" PHONE (M). I've added a photo of the JamMan on my board and you can find a full photo of the board if you look at thePedaltrain MINI With Soft Casephotos.One other great attribute of this pedal is it's built solid and is easy to stomp on (you don't have to have perfect aim, just good timing). There are a few strange nuances, though. For example, you have to step on the pedal twice and hold to clear the current track. This gets the track started before it clears it. Not good if you were using it in a performance. However, there are workarounds (like just switching tracks). Overall - great deal for the price and, if you are looking to improve your lead guitar/improv, I would certainly recommend a pedal like this one.", "id": 668}, {"review": "There are some more compact units out there (like planet waves), and the intellitouch PT10 is a little clearer to read, but this baby is great for the price. I leave it on my Strat while I play as it can be easily turned on/off as needed and stays relatively hidden behind the head stock. The back lighting is clear enough and the tuner is as accurate as my foot switch tuner. Overall, great deal for the price.", "id": 799}]