[{"review": "I've only been in broadcasting for 3 years professionally and I have to say, after researching condenser microphones for several months, countless reviews and spec research I can honestly say, this mic compares and indeed exceeds many microphones costing hundreds of dollars more.Here's another interesting fact. I thought the &#34;King of all Media&#34;, Howard Stern would have used some gold plated 10 thousand dollar anniversary rig... well I found out he uses a 990 as well. So, think about it, perfect for the amateur, perfect for the professional... and under 100 dollars? Incredible! You WON'T be disappointed on this buy.", "id": 159}, {"review": "NOT high quality, but definitely useable and worth the 6 bucks. Ends are not too bad and it works for what it is.", "id": 465}, {"review": "These are solid, good build quality and really do get the job done well.Easily adjustable, versatile in design and function, get em!", "id": 815}, {"review": "Tascam is an industry leader in pro audio and have been for many years. Their quality is unmatched dollar for dollar and these are no exception. Excellent sound quality, premium fit and comfort for wearing all day as we do at the station. You can't go wrong with these, we're ordering 8 more pairs!", "id": 870}, {"review": "Great quality and construction. Does it's job well. Only complaint is that if the design were a little more streamline. These bolt on with attitude and are a bit heavy. Overall, stays in place and does it's job well. A workhorse for sure.", "id": 46}, {"review": "Solid as a rock and definitely delivers on its promise. Whoever said Behringer gear sucked has no clue about audio gear. Our radio station owns several pieces along with this unit and are expanding our gear with more purchases of Behringer gear. Super value!", "id": 376}, {"review": "Cables are good, my only complaint is the connectors. The 1/4&#34; is not too bad at all, but the XLR end looks and feels cheap. I guess that's because they are cheap. Very good price and good performance. No wierd signal buzz like other cables in this category. Overall, 4 stars!", "id": 444}, {"review": "This cable arrived today and I am still in shock! It's truly amazing. The best BY FAR patch cable I have EVER used, or even seen in 25 years of guitar playin.HUGE value! Buy one now!", "id": 803}]