[{"review": "I started playing mandolin back in September and bought a lot of different picks to try to find the type that would work best for my playing, and finally decided on the Dunlop Jazz Stubby 3.00mm picks.  Once I determined that it was the best pick for me it was an easy decision to buy a package of them so that I won't ever be without one.  Picks have a habit of disappearing just when you need them most -- buying them in bulk this way means that I'll always have them available and can even share them with others if the opportunity arises.", "id": 164}, {"review": "I hadn't thought about it before buying these bridge pins, but metal pins apparently add a bit of brilliance to the tone of my Alvarez-Yairi guitar, so it's a great bonus!  I bought them because my original plastic bridge pins were snapping and I didn't like the plastic ones available at a local music store. I'm very happy I bought them!", "id": 206}, {"review": "I had purchased a different strap for my F-style mandolin and it was adequate but when I learned of this Neotech strap and how adjustable it was I ordered it and tossed my earlier strap.  This should be configurable for any mandolin body size and shape and for most human body sizes and shapes as well.  My only complaint is that the button hole doesn't stay on the end pin of my Epiphone mandolin.  I solved that issue though by taking a large triangular pick I wasn't happy with, drilling a hole in the middle and cutting a notch from the edge to the hole and then sliding this over the end-pin of the mandolin and the strap hasn't fallen off since (over 2 months of daily playing!)", "id": 352}, {"review": "I had purchased a Peak violin stand but wasn't thrilled with the height of the violin bow holder -- the tip of the bow dangled just a bit too close to the floor for my comfort.  This, being designed to hold either a violin or a viola, allows more height and I feel that the bow is safer.  Additionally, this stand allows my violin to be placed on it with the shoulder rest in place while the Peak stand was less secure unless I removed the shoulder rest.  So this stand is more versatile for a performing situation and for days at home when I want to have my violin handy and ready to play as time allows.Warning -- do not use any violin stand at all if you have a cat or dog which can come into the room where the violin is resting on the stand.  The stand does have a lock to help keep the violin on the stand but it would be very easy to knock the whole thing over if a dog or cat were in a playful energetic mood.", "id": 290}, {"review": "Excellent picks, with nicely rounded corners to the essentially triangular shape and nicely beveled edges to make tremolo playing easy and smooth.  The only problem I have is that I keep changing my mind between whether I want a crisp corner for my picking for clarity or a pick like these for smoother playing.  These are a great addition to any mandolin player's case because they give the player a nice alternative to trying to use one of the rounded corners on a pick like a Fender heavy.", "id": 771}]