[{"review": "I'm not very familiar with how pop filters actually work, apart from getting rid of unnecessary peaks when recording. I have noticed an improvement in recording quality with this pop filter on. I don't know how it compares to other pop filters though, but this one seems like it works for me.", "id": 46}, {"review": "This is such a lifesaver (or an effort saver). Every guitarist should have this. In my opinion, there is nothing more annoying in the world than changing guitar strings. This makes the process so much easier. It's a 3-in-1 product that clips the old string, pulls the pins out, and winds the new strings in. On top of it all, it's pretty affordable.", "id": 94}, {"review": "My new go-to strings. These things last forever for someone who only plays casually. They sound great too. Absolutely recommend it.", "id": 103}, {"review": "I haven't owned my electric guitar for over a year, but I've only replaced its strings once. I've been playing almost every day for an hour or two and it still looks and feels very new. At this rate, it seems that the current strings I have installed would last forever. Would recommend to anybody looking for a long lasting set.", "id": 106}, {"review": "When I found that my USB microphone cannot stand on the tripod that came with it, I was so glad that I bought this stand along with the mic based on all the positive reviews. This stand is basically dead weight. That's exactly what I wanted from a desk stand.", "id": 224}, {"review": "If you are looking to walk around while you play your guitar, then you might want to look into something longer. As a spare cable to play at home though, it's pretty good.", "id": 241}, {"review": "I was waiting for a flimsy stand to arrive when I ordered something that seemed like it would be for budget price. This stand actually STANDS. I placed my AT2020 with a shock mount and a pop filter on, and while it is heavy, with proper tightening everything stayed in place. And like many other people say, this is a must-have if you have a home studio.", "id": 279}, {"review": "D'Addario strings have never failed me. These are so much better than the other nylon strings I used to buy where the ball end always broke. These strings sound nice and you can't go wrong with the price tag either.", "id": 349}, {"review": "I ran a few recording tests on my microphone with and without the shock mount. It seems that ambient noise is generally reduced with the shock mount on. It's especially effective when the microphone is on my desk, where my computer tower (which has 7 fans) is directly under it. It's not perfect, but the level of noise reduction really is amazing. On top of all that, it looks nice too. If you are planning to buy a condenser mic for your desk, you should definitely consider getting this, along with a solid stand and a pop filter.", "id": 393}, {"review": "...two weeks in and I can already feel it drying up. Good for peace of mind instead of using a wet sponge humidifier and just keeping the humidity controlled, but it seems it will cost me a fortune if I keep using these.", "id": 406}, {"review": "I use this microphone mainly to record music. Occasionally I use it for voice chat where it supposedly excels in quality compared to desktop USB microphones. I think the best way to describe this microphone is that it is &#34;above average&#34; but does not outperform any higher-end non-USB microphones that I have played with in the past. While it is not an &#34;outstanding&#34; microphone, it's still a great entry-level product for those on a budget.The microphone is relatively easy to use (just plug in the USB cable) but it needs some accessories to be efficient. For instance, the stand that comes with the microphone cannot hold the microphone upright. It seems like it will tip over if you breathe on it the wrong way. Remember to buy a solid desk (or floor) stand for the microphone, as well as a shock mount and a pop filter.", "id": 525}, {"review": "I was surprised when I tested this microphone. It is probably the best bang for the buck at its price range. The base is heavy enough to allow the microphone to stand upright. However the clip does not open wide enough to clamp onto thicker monitors. That was expected though.", "id": 583}, {"review": "That cloth... They should have included something that doesn't fall apart.Otherwise it's great. I use it as recommended by the container and it keeps the strings nice and conditioned, but I'm with other people here who commented that you can't really tell how much of the stuff is left inside. Good idea to keep more than one of these around.", "id": 72}, {"review": "The last thing I would think to upgrade to improve the quality of my music is the cable. I did not know that these cables actually made a difference. My guitar sounds cleaner when I use this cable versus another generic cable that I've had for a while. It was a pleasant surprise. I also heard about the wonderful warranty that Monster has. The cable has so many good things going for it, I now know what to buy the next time I need one.", "id": 125}, {"review": "Accurate little accessory only works with guitars. It seems to me that this tuner works by sensing vibrations of things that it is in contact with. Only buy this if you intend to use it with a guitar. I don't know how effective this would be with other stringed instruments, or for uses other than tuning.", "id": 706}]