[{"review": "To be honest, I was looking for a pedal that would give me distortion similar to Megadeth's first album KIMB. So far I havnt got a perfect setup on it yet, but ive got close enough to it. This pedal is great, only a couple notes I should make about it. Do NOT buy this pedal if your expecting to play classic rock, or just rock in general. This pedal is for metal. The battery drains like a MF. I dont understand why. The only possible explanation I can think is that I leave it plugged into guitar and amp, but ive had other pedals that wouldnt drain the battery unless its TURNED ON. I prefer just to get an AC adapter and not use batteries. Other than those few things iv had no problems with this great pedal.", "id": 36}, {"review": "So I bought these because being Dunlop, I trust the brand. I dont even mind that they are sorta big and bulky. The only problem I have is, they scare the piss out of me. Its not a \"tighten washer and nut\" situation with what ive normally seen on strap locks. These have pegs that insert. Its so hard for me to trust these, I always have 1 hand gripped firmly on guitar even if just adjusting the amp I clench my guitar. So scared that the little metal balls things will just slip, peg fall out and ruin a $500 guitar. I havnet had a single problem with this system yet, and I never hope that I do. But if it happens there will be an update to this. Good product so far, just wouldn't recommend it. There is too much crap in the world to be worried about, strap locks shouldnt be one of those things.", "id": 44}, {"review": "For the price, I got a little more than expected. The sound is pretty great. The scoop switch gives you a slightly different sound. Other than that your can change amount of distortion. Its cheap, and maybe it doesn't have alot of fancy versatility with the settings and whatnot. But for the price this is one hell of a deal! Quality item.Only complaints are; its so little sometimes just accidentally moving the cable will flip it around or something. But thats expected, and not that big of a deal if you're careful. Now the one issue I really have with this pedal, its cosmetic so its not worth 4-starring this review; but it did get to me. The knobs. They are not the cool chrome ones in these pictures. They are black plastic ones. They look sorta bland and not as cool, but ive noticed no functionality problems with them yet. Still a great product though.", "id": 397}, {"review": "I bought this as for practice. I have a $180 amp, but was looking for something a little more portable. This is what I came to.It has great distortion, the effect is pretty awesome too! The lead cuts clean; &#34;mostly&#34;. In general is does tend to get a little noisy though. However. For the price, this is probably one of the best steals ever. Like I said, I have a &#34;sort-of&#34; name brand amp that is estimated at around $180. I can safely say that the sound quality of this item is about as good as the amp. Until I can afford a REALLY good amp, this will be my primary one; and really I have no problem with that.Pros:-Cheap Price-Fair sound quality-Nifty Built-in Effect-Can plug into AUX letting you play with musicCons:-Cheap ITEM quality-Distortion can get &#34;messy&#34;-Not very versatile...Metal ONLY.I hope it never breaks.", "id": 546}, {"review": "I thought this tuner was going to be an oversized cheap piece of junk. Because well these days you usually get even a little less than what you pay for. But this tuner destroyed those expectations. Its a small, \"smart\" tuner. So many functions and just a great design. Its really cool that I dont have to go hunt down a tuner that could be lost in my room somewhere. This attached to basically any guitar, or almost any object for that matter. The only thing negative I have to say is, im not so sure you can plug a cable into it. Which you would expect with ALL the other stuff it comes with. Otherwise, its pretty great.", "id": 707}]