[{"review": "I've been playing for 40+ years.  I've seen dozens of guitars come and go until I found my 1948 Gibson J-45 and I've tried dozens of types of strings.  Some guitars sound best with Phosphor Bronze.  Some sound best with 80/20s.  I still have an all Koa Martin guitar that is *so* bright that it sounds best with the normally tone-killing Elixir Polywebs. Got a guitar-banjo? Try silk-and-steel or silk-and-phosphor. Trust me.  I've been through my John Pearse phase. Pyramids?  Yep. Tried 'em.  I really liked LaBellas.  The problem was that back when I was using them, they would tarnish in the packaging.  I don't know if that's still the case.Anyway, the bottom line is that D'Addario phosphor bronze are my go to string.  They set the baseline for every guitar I've ever owned.  (Note: That's baseline. In some cases, I've decided something else sounded better.)  For many guitars, including my J-45, there's nothing I've found that I've liked better.Also worth noting:  The string that sounds best depends not only on the particular guitar, but also on the type of pick one uses, the type of music one plays, and the way one approaches the instrument.  The string that's best for bluegrass with a hard attack may not be what's best for delicate finger style.Bottom line: Don't follow leaders.  Watch the parkin' meters.  Experiment.  But, D'Addario PBs are a great place to start.", "id": 198}, {"review": "I don't have a classical guitar, but I just got an inexpensive but really fun steel string guitar with a non-radiused fingerboard.  I've also got over a dozen capos (don't ask!) but all are for radiused fingerboards.The fingerboards of most steel-string guitars--electric and acoustic--are radiused, that is, they are not flat.  They have a gentle curve to them, so gentle that many wouldn't notice it unless they looked closely. Look up \"fingerboard\" in the Wikipedia for an excellent discussion and Google images for diagrams and pictures.Even though the curve is gentle, if a fingerboard is radiused, a capo must be curved, too, or the outside strings would not be pressed down properly and would buzz.  If a fingerboard is flat, like a classical guitar's, the capo must be flat, too, or the center strings will not be pressed down properly and will buzz.If you're not sure whether your guitar's fingerboard is radiused, slide a ruler between two frets.  If it lies flat, then so is the fingerboard.  If it rocks, the fingerboard is radiused.I REALLY like this capo because of the way pressure is adjusted by turning the tension screw.  This makes it possible to exert just the right amount of pressure--not tool little, which would cause strings to buzz, and not too much, which would cause the instrument to go out of tune.As others have noted, its one drawback is that it can't be clamped to the headstock when not in use.  But for that, I'd replace most of my capos with radiused versions of this capo.  HIGHLY recommended!", "id": 304}, {"review": "The reason they are called silk and phosphor is that the wound strings have silk along with steel in their cores (the wire around which the windings are wound) rather than just steel.  This allows them to tune to pitch with less tension, so they can be the ideal string for a beginner or someone who is moving from nylon.  There are also silk and steel strings with silver plated copper windings.  The lower tensions and light gauges mean that they may not drive some guitar tops hard enough to let them perform up to their capability.  That is, they may sound soft and cheap.  I would not put them on most Martin dreadnoughts, for example.  But they may work fine on lightly braced guitars. The only way to find out for sure is to experiment.These are an experiment for me, I usually use silk-and-steel on my guitar banjo, it was time to change strings, and I stumbled across these.  I'll have to see where things settle down, but so far I'm willing to give these silk-and-phosphor the nod over silk-and-steel.  The sound is a bit brighter.  My music partner says she prefers the way these silk-and-phosphor blend with her fiddle.This is so \"out there\" that I won't let it influence my rating.  My guitar-banjo's tailpiece has small holes through which the strings must pass.  The ends of the windings at the bottoms of the bare steel 1st and 2nd strings stick out a bit, so I had trouble putting them on.  I was able to use a fine wire cutter to nip the end of the 1st string, but it didn't work for the 2nd string.  I ended up using a D'Addario string of the same gauge in its place.  Admittedly, it was a tight fit, but I was able to put it on without working on it.", "id": 613}, {"review": "The Intelli IMT-500--The tuner that killed the Intellitouch!There are scores of chromatic tuners on the market.  Most work by using a small built-in microphone that picks up sound waves.  In order to be used effectively, the tuning space must be relatively quiet.  Many of these tuners have input jacks that allow electric guitars to be connected directly and tuned by the electronic signal they produce. A bunch of years ago a variety of clip-on-microphones began to be marketed.  The microphone could be clipped to any instrument and its cord attach to an electronic tuner.  Now, anyone could tune an instrument no matter what the background noise.Then, the Intellitouch tuner hit the market.  The entire tuner clipped onto the instrument.  One could tune an acoustic instrument in a noisy environment.  There was no cord to deal with and the instrument could stay clipped to the headstock or quickly removed and slid into a pocket or case.  Talk about convenience.  Jams and festivals (bluegrass, folk, whatever) became seas of Intellitouch tuners.Intellitouch owned the market even though there were so many situations where they did not work well. In particular, they have trouble with the bass notes of dreadnought sized guitars. The more overtones an instrument produces, the worse the tuner behaves. The bass string of a Martin rosewood dreadnought was near impossible to tune without using one of the many workarounds that owners developed.  So, it was very much a love-hate relationship.  The shortcomings were huge, but the convenience meant that they were tolerated.Then, came the Intelli.  It was an Intellitouch that worked, if not perfectly, then a whole lot better.  The amazing thing is that the switch from Intellitouch to Intelli wasn't gradual.  Within six months of its introduction, jams and festivals became seas of Intelli tuners.  People were throwing their Intellitouches into drawers (if they weren't lucky enough to find a die hard holdout willing to buy one second-hand) to get the Intelli.  That's a considerable investment to abandon.  But, why not?  The Intelli is half the price of the Intellitouch and works a whole lot better.  They are so inexpensive that it's easy to justify getting one for the practice area and one for the case so that you don't have to worry about forgetting to pack it.Anyone who will ever have to tune an acoustic instrument in a noisy environment will quickly find this tuner indispensable.  And it works darn well in a quiet environment, too!Highly recommended!", "id": 635}, {"review": "Anyone who cares to take the time to look at my other reviews will see that I am not fond of the Snark displays.  I prefer the \"needle\" type because it's symmetric above and below center while the Snark has red turning off when flat and gold turning on when sharp.  However, that's me and YMMV, as they say on the Internet.Don't ask, then, why I got a SN-6.  I don't smoke, drink, or womanize, the unit is cheap, the money's got to go somewhere, and I like to play with accessories.I am fond of saying that it doesn't matter which type of tuner you use because they've pretty much become a commodity.  They all tune well with the same accuracy, so it comes down to looks and price.Well, that's not *quite* true.  Some models suffer fits in certain situations.  The rapid fall of the old Intellitouch was, in my mind, not due to price as much as its inability to deal with the low E string on a Martin dreadnought.  A web search will reveal countless workarounds.  I (and the rest of the world, apparently) buy a tuner to tune, not work around.Lately, I've become enamored of theKala KA-UBASSFS Solid Mahogany U-BASS - Fretted.  If you want a tuning challenge, the low bass E string is it.  The SN-6 hardly hiccups.  Other tuners seem to do \"okay\" but require a little coaxing.  Not the SN-6! That's 5 stars in my book!", "id": 763}, {"review": "If an initially unfavorable opinion changes, I owe it to the maker to say so, so I'm saying so!For me, the hardest part of adjusting to a new tuner is throwing out preconceived notions of how it should be used.It's not always easy getting vibration sensing tuners to settle down. In many cases, they jump around until, by the time they settle down, the vibration has decayed to the point where it no longer registers. So, a bit of subjective judgment is sometimes involved.As far as the SN-8 is concerned...WRONG!I've found the SN-8 to, in fact, be Super Tight, BUT one has to insure that there isn't even a HINT of red or yellow on either side of the center green bar.This is what I don't like about the other type of Snark display.  It's not symmetric!  It requires all of the red bars to be lit along with the green, and none of the yellow bars to be lit.  If the rad bars are illuminated constantly, how can you tell if the string is a hair flat?  When I'm on pitch I want *all* indications of sharpness and flatness to vanish.In that regard, the image shown here is wrong! It shows the Super Tight behaving like the other tuners with all of the red bars illuminated along with Green and even a yellow. Uhm...no.The SN-8 is Super Tight, has a touch metronome, and lets you set it down a few semi-tones if that's what floats your boat and, as they say on TV, \"All for an incredibly low price!\"I keep a tuner on each guitar and one in my gig bag, just in case.  At this price, I already have a half dozen Super Tights with two more on the way.", "id": 811}, {"review": "For me, the hardest part of adjusting to a new tuner is throwing out preconceived notions of how it should be used.It's not always easy getting vibration sensing tuners to settle down. In many cases, they jump around until, by the time they settle down, the vibration has decayed to the point where it no longer registers. So, a bit of subjective judgment is sometimes involved.As far as the SN-8 is concerned...WRONG!I've found the SN-8 to, in fact, be Super Tight, BUT one has to insure that there isn't even a HINT of red or yellow on either side of the center green bar.This is what I don't like about the other type of Snark display.  It's not symmetric!  It requires all of the red bars to be lit along with the green, and none of the yellow bars to be lit.  If the rad bars are illuminated constantly, how can you tell if the string is a hair flat?  When I'm on pitch I want *all* indications of sharpness and flatness to vanish.In that regard, the image shown here is wrong! It shows the Super Tight behaving like the other tuners with all of the red bars illuminated along with Green and even a yellow. Uhm...no.The SN-8 is Super Tight, has a touch metronome, and lets you set it down a few semi-tones if that's what floats your boat and, as they say on TV, \"All for an incredibly low price!\"I keep a tuner on each guitar and one in my gig bag, just in case.  At this price, I already have a half dozen Super Tights with two more on the way.", "id": 820}, {"review": "[Now that the SN-13 is about the same price as an SN-8, I've changed the comment about the price differential.]The SN-13 is another great Snark chromatic tuner with a Super Tight display. However, the black SN-8 adds a tap tempo metronome and the ability to set the tuner a few semi-tones below standard for about the same price.  (No matter for me since all I use is the tuner, anyway.)  Still, the SN-13 is *white* and, for all I know, may do a better job at tuning an older iPad.  :-)", "id": 861}, {"review": "Added December 5:Has yet to fall off the fiddle scroll again so the 5 star rating stands without an asterisk.Added November 8:I put the star back.  I've got (another) one on one of my banjos.  It does require a teeny bit of twisting a neck (either mine or the banjo's!) to see it clearly, but the size is more convenient if you want to carry it in your pocket and there's no neck to snap.While it may have some trouble staying affixed to a fiddle's scroll, it seems firmly rooted to the banjo's headstock.-------------------------Original November 4:This tuner has a display like the SN-8 rather than the SN-1 after which it is named. It's like any other Snark Super tight Tuner.I've taken off 1 star for two reasons:(1) I find I have to twist either my neck or my instrument uncomfortably to use it. Maybe it's just a matter of finding the right place to put it.  I'll keep trying.(2) My music partner immediately adopted it for her fiddle thinking she could leave it on all the time.  It was clamped solidly on the scroll but, to do that and have it be comfortable to read, the tuner was hanging down while playing.  Eventually it slipped off.  If it weren't kept on, this wouldn't be an issue, but that's how the advertising shows the tuner being used--clamped to a guitar headstock, hanging down. I'll report back if it doesn't happen again for a while. Even if this *is* an issue, its small square shape makes it very easy to slip into a pocket while not in use, so I still think it's worth 4 stars.", "id": 893}, {"review": "There's NO SUCH THING as a \"best string\".  From experimenting over the years, I've found that, while I have \"old standbys\" that will be the first thing I try, often there is a string that is just right for a particular guitar and it varies from guitar to guitar.Coated strings have become all the rage over the last few years.  They're expensive, but they last a lot longer, especially if you have the kind of body chemistry that causes them to corrode quickly.  Also, they minimize the amount of finger noise you get if you slide on the strings.Elixir Polywebs were the first coated string.  The coating is much heavier than that of other strings.  This produces a much less bright, more muted sound.  I have an old koa guitar that is so bright I can't stand it with standard strings.  The Elixir Polywebs tone it down to the point where it's perfect.If you're looking for a darker sound, then Elixir Polywebs are definitely worth a shot.  If you want a coated string but prefer the brighter sound of uncoated strings, then you definitely don't want Polywebs.The 4 stars applies if you want this particular type of sound.  If you don't want this sound, you could end up awarding them 1 star.", "id": 100}, {"review": "A year ago, I wrote a lengthy comparison of theEdirol R-09 WAVE/MP3 Recorder, Blackand theZoom H4 Handy Recorder + 2GB Accessory Kit(pre-accessory kit).  I wanted a high quality, easy to use recorder, so even though the H4 had all of the features of the Edirol and sold for considerably less, I kept the Edirol because it was so much easier to use.Zoom has responded with the H2, a scaled down version of the H4 with all of the features of the R-09 and all of the controls right where you need them.  The H2 even has additional features over the R-09, but they don't get in the way.  For example, there's a choice of a 90 degree recording pattern, a 120 degree recording pattern, and even a surround sound option. Samsontech has some nice video demonstrations on its website.One big complaint I've had with the Edirol is the cost of its add-on stand.  Unlike the Edirol, the H2 comes with a simple stand.  In addition, the H2 has a threaded hole so that it can be mounted on a standard digital camera tripod!  On a separate note, it's much easier to replace batteries with the H2 than the Edirol.Recently, I got together with friends and recorded the same live acoustic music on both the Edirol R-09 and the Zoom H2.  I used Adobe Audition only to normalize both tracks (that is, equalize their loudness).  The first time we played them back, I thought I detected a VERY slight preference for the Edirol, with the overall opinion of the group split between the two units.  The second time we played them back, my preference was for the H2, with overall opinion continuing to be split.  We all agreed that the differences were so small as to be negligible if there were any at all.I do prefer the Edirol's control buttons to the H2's membrane and I'm not about to sell the Edirol, perhaps because I am more familiar with the Edirol and don't want to give it up just yet. Also, the Edirol R-09 is the darling of the moment.  However, if I owned neither, I couldn't justify the huge bump in price of the Edirol over the H2 and would opt for the H2. When I went to a music party last weekend and knew I'd need only one recorder, I grabbed the H2.", "id": 463}, {"review": "Had I known what I was getting I would never have ordered it.  There are gig bags and there are gig bags.  I've ordered and used inexpensive guitar gig bags.  I expected more. This one offers almost no protection.  The only reason I have not returned it yet is that the return shipping will leave little to refund, but may end up returning it anyway.It *did* fit my Kala KA-TG with room to spare.", "id": 510}, {"review": "As my reviews demonstrate, I'm a sucker for a new tuner.  Peterson has an excellent reputation for its strobe tuners. I'd even tried one, once, but decided it wasn't the sort of thing to be carrying around to jams.  So, when I saw that Peterson had introduced a clip on tuner, I couldn't help but salivate.\"Awkward\" is a relative term, but I don't feel it's a disservice to use it here.  The typical clip-on tuner has an LCD \"needle\". When the needle is dead center, the string is tuner.  If it's short of center, the string is flat.  If it's past center, the string is sharp.  The SC-1 has two sets of rings that appear to rotate, analogous to what a strobe might look like.  A string is in tune when the rings stop rotating.  I found that with the way the sound of strings decays, it's difficult to get the rings to stop spinning, even in the SC-1's sustain mode.  (I've already returned the tuner.  Otherwise, I just realized, it would have been a big help to have done a short video of tuning a guitar with the SC-1 and with a Zoid or Intelli.)The SC-1 also boasts a \"sweetened\" mode for tuning guitars.  However, when  I tuned my lounging-at-home guitar this way, I found the needle was dead center on every string on my Intelli tuner. (For those who've read my other reviews, my preferred Zoid was in the case with my favorite guitar.)It may well be, and others may report, that the SC-1's feature set make it ideal for other situations.  However, if you main purpose is to keep a guitar in tune, then, with the SC-1 costing more than THREE ZoidsZoid Z-1000 Clip-On Tuner by Sabineor FOUR IntellisIntelli IMT500 Clip-on Chromatic Digital Tuner for Strings, I recommend that you consider the Zoid or Intelli.", "id": 711}]