[{"review": "Pros:* They look very nice.* They cause much less wear than the 2nd hand rack screws and washers.Cons:* More expensive and I had to wait a few days longer than it took my rack equipment to ship.I'd purchase these again, but I now have 25 but only need 16 at the most once my rack is filled.", "id": 22}, {"review": "I purchased one of these about 6 months ago for my partner who is a musician because we had no recording equipment in the house. We didn't really expect much except a quick way to record ideas.It's simple, easy to use and has outstanding quality of sound. We've used it to record acoustic guitar and vocals with surprisingly good fidelity. We've recorded whole ensemble practice sessions with the mic which it's really not designed for and still had reasonable results. Our friends who are musicians ( and even an audio engineer) are quite surprised and impressed with the quality of sound we get.I've even ordered a second mic for my computer to use with skype.To sum it up, this mic is cheap, easy to use, portable and with fidelity that will surprise you but don't expect it to be a full home recording studio :)", "id": 583}, {"review": "I got mine for less than 20 bucks. The stand is definitely constructed cheaply but nothing keeps it from functioning as intended. Other reviewers complained about it having a screw together joint in the middle. We have a more expensive stand of the same type with exactly the same feature and no problems with either.", "id": 585}, {"review": "I'm using this unit to set up a Linux Digital Audio Workstation. It works out of the box with a recent ubuntu install or linux mint if you prefer. You will probably want a realtime kernel and use jackd to take full advantage of this device. Without using a jackd interface or a realtime kernel audacity records 96kHz but skips when duplexed, I mark this up to not having sophisticated controls or realtime enabled.The following settings are the best I've been able to manage in jackd2 without and xruns on a realtime kernel(using qjackctl) (I'm also no expert)Frames / Period: 128Sample Rate: 96000Periods / Buffer: 3Which gives a predicted latency of 4msWith a 10ft 1/4 inch patch cord (to run jack_iodelay) I got a consistent 8.24 ms overall latency (not bad imho).Without the realtime kernel you should expect xruns with these settings, my computer is a sandy bridge pentium 2.2ghz with 6gb ram and a ssd.We have used this with an AT2020, AT2021. SM58 microphones and the sound quality is quite high. The preamps deliver what seems like no noise under usual conditions. Simple two mic recordings of band practices sound outstanding. I've also tried some higher gain recordings of weird ambient sounds (rain crickets) and still received very little noise from the device itself but can hear everything that happens in the house.Update:I've found the above setting in jack don't work well for processing live guitar effects in rakarrack. Here are the best setting I could come up withFrames/Period: 512Sample Rate: 48000Peiods/Buffer: 3RealtimeSoft ModeQjackctl lists the latency of 32ms but I have not tried measuring i with jack_iodelay. All the included effects of rakarrack work on my computer for these while booted in the (hard) realtime kernel", "id": 801}, {"review": "I received a pair of these two weeks ago and am happy with my purchase. They seem well put together and just feel nice. They also came with two Velcro ties each. With proper care I'm confident these cables will last a very long time.", "id": 692}, {"review": "After a little bit of configuration headaches I can confirm this product works quite well with ardour2 and is my prefered method of mixing. For the price it's a really good deal.", "id": 741}]