[{"review": "I bought one of each Soft, Medium and Hard Wedgie rubber picks and even though the colours were right, the Hard is as soft as the Soft. They felt exactly the same in fact. The Medium was the hardest out of the bunch.Packaging error? I have no idea. The fact that each stiffness only comes in one colour and the colours were right lead me to think something is wrong with the manufacturing. So check with what you get.Sound wise, the rubber really removes the treble on my acoustic guitar, making it sound really dull and muted.There is a lot more friction from the rubber on the strings that I do not think it is idea for strumming.The only reason I can think of using is if you want to reduce the noise but frankly, you would have much more control if you used your fingers instead.", "id": 244}, {"review": "Let me start of by saying this tuner is great.My previous tuner was a Korg CA-40 and frankly, that tuner is terrible.The main differences between SAT800 and the CA-40:SAT800 has a build-in light, CA-40 does not.CA-40 has a build-in stand at the back to prop it up to a 45deg angle, SAT800 does not.SAT800 has a auto and manual mode, CA-40 has auto.SAT800 displays the octave of the note, e.g. 1E, 2E, etc, CA-40 displays only displays the alphabet, E for all oactaves.SAT800 has a numerical display for the cents off, CA-40 does not.What made me get a new tuner is how finicky the CA-40 when using the build-in mic. The needle on the graph just jumps all over the place from the harmonics of the guitar and that has nothing to do the sensitivity or accuracy of the tuner. Yes, it is accurate but so are many of the tuners out there that do not have such a poor usability. Another issue with the CA-40 is the poor screen. The screen is so dark and only viewable head on.The CA-40 does not have any of the flaws of the CA-40 and is even more accurate.What this tuner has: accuracy, usability, durability, versatility. What more can you ask from a tuner of this price?", "id": 532}, {"review": "It is sturdy, well made, feels hefty in your hands, with an extremely smooth action - everything the Shubb winder is not.Well, it is made in China, while the Shubb is made in USA. But what is the point if it is so much inferior?I think it proves that it is not about where it is made but how it is designed and manufactured.", "id": 683}, {"review": "Let me first start off with the sizing. When they say \"Fits Soundholes from 33.75\" - 35\"\", they really mean it.You are going to have a hard time trying to fit it even if it is 1/16\" smaller than the specifications.I know I did. My friend's Oscar Schmidt 3/4 sized guitar was just that much smaller and it did not fit well. The edges did not \"catch\" completely  and it looks terrible.My classical guitar had a similarly sized soundhole but because of the much wider fretboard at the edge of the soundhole, it did not fit at all. You could try cutting the edges off the Oport at the fretboard.The main issue is the sound.Yes, it does make the sound fuller when you are strumming, slightly but enough to tell.However, it does so at the expense of the sustain and harmonic overtunes.Fingerpicking just does not sound as nice as before, even though the guitar is noticeably better on the bass notes.For me, that does not justify it.A simple bone saddle does way better than this and it cost less.Another thing I found out was what was Amazon does to stuff others return - they resell as brand new if it looks brand new.The packaging on mine came slightly torn and looked as if it had been opened. Does it matter? In practical terms, no, not for this sort of item.I guess that is how Amazon keeps their prices low yet with good customer service and return policies.", "id": 704}, {"review": "I have had this tuner for about half a year and frankly, I have had enough.The main problem with this tuner is the usability.The tuner has a poor display, is extremely finicky and it does not display the octave of the key.Tuning with it can be condensed into one word - frustrating.The needle is very finicky and jumps all over when ever I pick the strings, especially so when the guitar is much out of tune.The poor display is dark, with no build-in light, and has poor visibility at angles too. Combine all that you have a terrible, accurate tuner.Yes, it is accurate but only as accurate as what the graph can display, which is +/-2 cents.Enough said, I bought a new tuner, the Seiko SAT800, for a bit more money that this.The main differences between SAT800 and the CA-40:SAT800 has a build-in light, CA-40 does not.CA-40 has a build-in stand at the back to prop it up to a 45deg angle, SAT800 does not.SAT800 has a auto and manual mode, CA-40 has auto.SAT800 displays the octave of the note, e.g. 1E, 2E, etc, CA-40 displays only displays the alphabet, E for all oactaves.SAT800 has a numerical display for the cents off, CA-40 does not.The needle graph on the Seiko is much more stable and it is just way more usable overall.I wholly recommend you do not purchase this tuner. I was fooled into buying it by the other reviewers on Amazon and I hope you would not be.", "id": 330}]