[{"review": "For years I've owned a nice AT4033. Recently I've wanted to be able to \"double-mic\" vocals for vocal doubling ambiance, chorus effect, etc., but didn't have the cash for another AT4033 or similar. After searching the net extensively, I kept seeing the MXL770 rated very highly and decided to take the plunge and figured I'll just return it if it's not any good. Wow! I can't hear any discernible difference when simultaneously recording the AT4033 on the left channel and the MXL770 on the right channel. They both sound great and I think the MXL even looks better and feels just as solid as the AT. A definite keeper.It's great that advancements in design and engineering are producing high quality products for the masses at rock bottom prices ($69). Who says you can't afford the \"good\" stuff these days. Keep it up technology gurus!", "id": 268}, {"review": "Bought these for home karaoke and they work great. I also have a weekend DJ business and these work well professionally. Why spend more? My DJ business includes up to 4 Shure wireless mics at around $500 a piece but these inexpensive Nady's seem just about as good in sound and performance (very few drop-outs if you stay within 30 feet of the receiver). I'll probably start taking these on gigs since they are so affordable to replace if they break.", "id": 402}, {"review": "One of the the best lights I own. Small but fills a gym with light for under $100, what more could you ask? As the other reviewers boast, this is a great unit and I hope it lasts a long, long time.", "id": 729}, {"review": "This boom has cleaned up my desk quite a bit and is great value for the price/performance ratio. I have an AT 4033 in it and it holds it in place with no problems. Wish I would have known about it sooner.", "id": 867}, {"review": "Bought this as a back-up to my AT system and have only tried it in my living room. Home tests show it works fairly well in that environment although I think I hear a little distortion if I turn the gain up too much (I don't think you can change the gain on the AT system). My only nitpick is that I'll need to use an adapter to go from the guitar plug to a 1/8&#34;. For the price, it's amazing. I just hope it works in the field as well.", "id": 267}, {"review": "I wanted the version of this device with the built-in microphone to be able to check my singing accuracy as well as to tune my guitar. Maybe I should just change the guitar pitch to my off-pitch singing and I could finally achieve perfect harmony! I like everything about it especially (I think) it's ability to turn itself off after use if you forget to do so and save the battery life. A well designed device.", "id": 707}]