[{"review": "Im not loyal to brands on the whole but when I reach for a pick I hope this is the one I get. They wear out and get nicks so I have to remember to keep ordering them.Edit: Watch the Steve Vai interview where he shares his secret for restoring the edge of worn, nicked, picks. Rapidly,firmly wipe the pick edge against a carpet. The motion is as if you were trying to cut into the carpet with the edge of the pick, repeat 3 or 4 times and whadda u know! The edge is now smooth and nice.", "id": 62}, {"review": "Meh, these things are what they are. They didn't solve any problems or make anything better.  Oh well, sometimes you just gotta do stuff for no reason.", "id": 115}, {"review": "Against most educated and experienced advice from many blogs I installed one of these in my 1972 Twin Reverb 100 watt. The original speakers are too Hi-Fi sounding for me.They hurt my ears, so clean. This speaker has all the range and a little bonus sizzle to boot, but in a round, full, musical way. Again to those who may like to tread in my ill advised path, these are 50 watt speakers, the Twin Reverb is 100 watts. Right now I have the CR and one original speaker running in my TR. I'll get another CR if this one holds up okay. But I'm in a band that plays small rooms a lot so I dont crank it past 4-5 very often. I'll post an update if this speaker fails. But at least on an initial run, I'm glad I bought it.Rock And Roll Forever!", "id": 276}, {"review": "Cheaply made but functional. Keep a couple of these in the bag as spares.They will be handy if you- know- who shows up to the gig without a strap.", "id": 285}, {"review": "This system works good. I use it every gig now, no problems. The leads are actually a little too long, but that's a good thing.", "id": 428}, {"review": "I've had a few of these things, not all the same model. This one was hard to read. I changed the battery and that helped out quite a bit. Overall I like it and use it on gigs instead of my pedal.", "id": 762}, {"review": "When I look down at my dirty scuffed up old pedal board and see these patch cables, so bright and festive, I just FEEL beautiful all over again.", "id": 805}, {"review": "This device sounds okay, its usable. But you should plan ahead if you're in the USA and want one, it ships from mainland China, it takes a while to get to the States.", "id": 836}, {"review": "I'm glad I tried these, I wont order them again. I thought they might be a good alternate for my Dunlop nylon picks, not really though.Edit: Im nothing if not fair. My last review of these was in the context of my playing my Strat or sometimes my 335. I stand by that review. However, now Im playing my Godin 5th Ave and suddenly these picks are perfect. Ive gone back and forth trying different picks with my guitars. In the end these are the picks I reach for when Im playing the Godin.I will buy these again. I changing my review from 'Just Okay' to \"Contextually Perfect\". Ok I'll add a star, your right I should add a star. There!", "id": 65}]