[{"review": "Fits nicely on my mic stand and hold a butt load of picks. It is quite tight on my picks, but I imagine it will loosen slightly as it gets used.", "id": 70}, {"review": "This is a basic EQ pedal, that is a bit noisy in my testing. Even when running on battery power, there is a bit of hiss that is just enough to be annoying in my rig and probably enought to be very annoying in some higher gain rigs.", "id": 84}, {"review": "I purchased this cable to use for a multitude of purposes around my home studio and within my live rig.I am a bass player by trade, though I dabble with many other instrument (as many of us do). I typically run direct for recording and have lately been foregoing a bass amp for many live shows, when the sound system is adequate, via SansAmp ParaDriver or VT Bass Deluxe DI.Around my modest home studio I often need an XLR to run just a few feet from my DI to my interface so the AT cable works well there. For being a thin flexible cable, I notice no noise issues or interference problems.I also sing backups on stage and I typically run my mic into a TC Electronics Mic Mechanic pedal, (which is great for those of us who do not have outboard effects processors for our vocals) and then to the mixer. I use the AT 10' XLR to run from the Mic to the pedal and it allows just the right amount of cable to be routed securely for the show, then I run the standard XLR to mixer or stage snake out of the TC.The cable end are very rugged feeling and have a very solid feel when connecting and disconnecting equipment, unlike many of my other cheaper XLR cables. This cable, at least in its 10' form, sounds just as good as my Mogami Silver 25' XLR. I know that many cheaply priced XLRs are noisy and problematic. I have several. I don't have to worry about those problems with this cable and will be purchasing more in other lengths as well to compare to my Mogami cables.On short, I would recommend it for any budget conscious musical professional or novice alike.", "id": 288}, {"review": "Seriously, just stop.Don't be like me and wonder what all the fuss is for years, just go ahead and get a pair. They are just awesome. When I finally got mine, I opted for the anniversary edition as they were on sale, and I am seeing the regular athm50s right now for $119!! That's crazy cheap.I had some rather inexpensive Sony headphones for about eight years(still have them actually) that are comfy and sound good, but not entirely accurate. The ATHM50S are really solid studio headphones. I can't imagine why I have taken soooooo long to try them for myself. They exude quality and are comfy, even when I'm wearing my glasss which many headphones are not. Not for long seasons anyway.I use the ATHM50S in my home studio and I have started taking them along in my gear bag for studio sessions along with a 15' headphone ext cable.I feel oSo foolish having lived without these cans for so long, don't you do the same!", "id": 458}, {"review": "This pedal work, although I find it a little bit cumbersome in my particular setup. My issue is really only one of cable routing though and will be remedied soon enough. The M195 does perform as it is suspend to although it does play word with my delay pedal, even running the delay on the output side of the M195. The noise gate is quiet and smooth an would be vital to many with a high gain setup. I run mine in my pedal chain for my bass rig, when using fuzz and distortion.", "id": 740}, {"review": "Wow, I am very surprised by this pedal. I got it with the intention of going aft that chimey AC30 tone, which it does a decent job at. I didn't realize everything else this pedal can do. You can get a very heavily distorted full on rock crunch out of it no problem. Metal, no problem, crystal clear and punchy, no problem, super crispy tele twang, no problem.I tried it on bass and was REALLY impressed. It is eerily similar in function to my SANSAMP VT BASS pedal and gets a lovely SVT type sound quite easily with loads of bottom end. I even threw it in my bass effects chain to use as an added OD/Crunch in front of both my head/cab as well as VT BASS and PARA DRIVER. Works like a charm.Turn the VOICE control to go from smooth and thumpy to gritty and crunchy, while adding a bit of mid range response.I only wish this had a balanced XLR out in addition to the normal 1/4&#34; out. Phantom Power would be nice then also.I would easily use this in a live setting running straight to the board, though a speaker sim afterwards would really top it off nicely and help to smooth out frequency spike here and there.  I have been thinking of trying the Joyo DI wit speaker simulation for this purpose, but I just haven't gotten around to buying it yet.In my opinion you should at least check this thing out, I mean its $40", "id": 798}, {"review": "I like the overall design of this mount although it would be nice to have a little bit more articulation. The best thing is that I can leave my ipad in the LIFEPROOF case for performances so I don't have to worry about water, sweat, or other various liquids and beverages hurting my main daime, my ipad. I use my ipad for almost everything these days and I certainly can't see going back to a lyric book after using the ipad and the SET LIST MAKER app. Then thes the real book app and of course notes and pages, iBooks, etc. it is a great tool for gigging musicians and this mount gets it up where you can see it. Best thing I've bought for my ipad in a while.", "id": 831}, {"review": "I have a small format 10 channel mixer for my acoustic and small gigs and it has no built in effects. It also gets a little bit noisy when using the EQ on the two mic pre channels.The Mic Mechanic allows me to dial in foot switchable effects right on y pedalboard, where they should be for a solo act or when your running your own sound. I typically leave the &#34;Tone&#34; button on at all times, as it gives a nice eq curve and mild compression. Effects are easy dial up on the selector and can be customized by using the modifiers...(read the manual). The correction works pretty well for me, but someone who is a bett vocalist may not need it, in which case, you can turn it down. I typically run mine around 12-1:00E thing I don't like about this pedal is its 12v power consumption. It can be phantom powered, but if I engage phantom power on my mixer it is on for both mic pres And I use the other often times for a second dynamic mic when playing as a duo. It can run off the Sanyo Pedal Power without issue however and I often use it on my acoustic pedalboard with a compressor and delay/reverb for my guitar.", "id": 849}]