[{"review": "This guitar cable is very nice.  It looks high quality and has the white ends.  Fantastic deal for this cable.", "id": 6}, {"review": "This thing works great and it looks very stylish with the guitar hanging on the wall.  This also keeps it away from the kids who always seem to want to play it.  Very good idea and holds it perfectly.", "id": 154}, {"review": "I hated having to put the pick between strings.  And now that I have a ton of picks, I can convientently put them in this little thing that attaches to the guitar.  Im still weary of putting it on my guitar because it has a matte finish, and I dont want to ruin it.  But the instructions say it should be fine.  I think I might put it on my amplifier instead because having it on the guitar might get in the way as well, still deciding on that.  But for the price you pay for this, it's a no brainer for any musician.", "id": 167}, {"review": "At first glance this can look like a microfiber cloth.  But these one's really get the guitars shining up really nice.  They are made for glasses and stuff like that and they really polish good.", "id": 184}, {"review": "This is a very very nice guitar strap.  Comes with dual locking strap holes on each end.  Very nice for creating a great grip on your guitar so they won't fall off.  I originally bought the cheaper version and sent it back and got this one.  Very good for the price.", "id": 208}, {"review": "This is my first guitar stand and I have to say I am pretty happy with it.  It's made of good quality metal and you can tell it's much higher quality than the price tells it to be.  The neck strap and the base are excellent.  Made of great padding to pad the bottom and can put any guitar base on there.  Look at the other reviews and you won't be disappointed.  It didn't smell like the other reviews said either.", "id": 258}, {"review": "When I first got this it blew up my headphones and didnt work right at all with my desktop speakers or anything.  I am now glad to say that after getting a replacement headphones and desktop speakers that this thing works fantastic.  It is a small design amplifier and does it's job very well.  I now have my good headphones, my noise canceling headphones, and my desktop speakers hooked up to it and they all work fantastic.  No more unplugging and plugging in the desktop speakers and headphones from the back of the computer which was such a hassle everytime.  Now all I gotta do is turn the control knobs and wallah.  I have to say it works very well for the price.  The only thing I don't recommend doing is turning the volume past the 2nd notch for your good headphones because they might damage them like they did mine.  Anyways, I would recommend this if you hate unplugging and plugging stuff in all the time and you want some more bass.", "id": 376}, {"review": "I got these because they were recommended replacements for the Fostex T50RP.  They fit great and are far more comfortable than the stock pads.  For the price, they are worth it.", "id": 646}, {"review": "It works really well for tunings other than standard EADGBE.  I am still trying to get it tuning in standard, but so far it's pretty accurate.  I know it can do standard tuning, i just can't figure it out.", "id": 707}, {"review": "I am still considering myself a beginner with the guitar.  I have learned a few songs, but I still am not that good enough to spend a huge amount of money on a guitar.  I wanted something that would sound nice and still be relatively cheap.  I had the Dean Electric Guitars in the past and a Fender Acoustic a while ago.  The Fender and the Dean's were very nice.  I thought the Dean's had a very nice sound to them and so did the Fender.  This guitar has a very nice sound to it as well.  I couldn't figure out the different tunings on it though.  It said Rhythm and Treble and then just regular in the middle.  I kept it on the regular because it sounded normal.  The other one's must be for some special type of music.  But this guitar sounded just as good if not better than the Dean's.  It is also very easy to hold unlike the Dean's I have found.  The Dean's also had warped necks which made some notes not playable and I have not found one on this guitar which is a plus.  But this is a very nice beginner's guitar if your just looking to get started.  I would stay away from those Fender knockoff's and stuff like that and get this guitar.  I also got the cheap Rogue amp to use with it and it sounds great, plenty loud enough if not too loud sometimes.  All in all, a very nice bargain.", "id": 816}]