[{"review": "So far, I'm very happy with this Microphone. Tone quality is fine and does everything I need it to do for backup vocals in my band. Although a longer cable would be nice, it's great a cable and was included in the package.", "id": 18}, {"review": "If you are in a band or a sound guy for a band you gotta have one of these. The time and stress saved by not depending on trial and error to eliminate good/bad cable is priceless. Bottom line!!! eliminate a variable and audio problems are faster and easier to solve.", "id": 318}, {"review": "As with all Boss / Roland products, the Boss FS-6 performs as designed. I purchased it to control both my Boss ME 20 Multi effects pedal and my Fender Blues Jr amp. The A switch (in non latching mode) allows me to cycle through stored effects banks in my ME 20 and the B switch (in latching mode) allows me engage and disengage the FAT (overdrive) switch on my Blues Jr Amp. Everything works exactly as planned. The FS-6 rugged, compact (fits right into my into ME 20 carrying case) and easy to use.I read a few reviews where people were complaining about batteries...something to complain about. As with most guitar players I don't use batteries in my effects pedals I use an 9 volt AC/DC adapter. Visual Sound offers the \"One Spot\" AC/DC adapter kit that has a 9 volt battery snap connector adapter. I removed the battery cover, then using a small rat tail file I carefully cut a notch in the battery cover for the snap connector to pass through. I then put rubber feet (purchased at ACE Hardware) on the bottom to allow the snap connector cable...battery problem solved.I also use the FS-6 as a sustain pedal for my Yamaha YPG 225 portable grand piano and a control for my RC-3 Loop Station simultaneously. The possibilities are limited only to your imagination. It is somewhat expensive but it is a Great Product!! If you need a duel switch then I highly recommend purchasing the FS-6.", "id": 412}, {"review": "Like many guitar players, I have a few effects pedals of different brands and I needed an alternative to nine volt batteries to power them. At one of the guitar forums I frequent I started a thread about powering a TS9 Tube Screamer with a non-proprietary nine volt power supply, One Spot came back twice in the replies. Since that time I acquired a two more pedals so now I really needed something. I looked into powered pedal boards but decent boards were too expensive and too bulky me. I got creative, I ordered a One Spot Combo Pack then bought some 2\" wide industrial strength Velcro and built my own board that fits in my hard-shell brief case.So far so good, after two months of band practices the One Spot 9V DC adapter with the Multi Plug daisy chain cable does what I bought it for, my little four pedal setup works beautifully. I'm perfectly happy it. The One Spot adapter is well made and the cable is ten feet long so it should be long enough to reach your stage power source. The Combo Pack also includes protective caps for the unused plugs on the Multi Plug daisy chain.If you are thinking about buying this product, do it. If you have concerns about compatibility with your pedals, here is a compatibility chart.[...]Power to the pedals, Rock On!!!!", "id": 428}, {"review": "My band was playing out one night, I use an amp stand that was on the stage. I really liked how elevating my little amp helped improve it's sound and decided I had to have one. I started searching around and found this product. The price was right so I took a chance and purchased one sight unseen. The Musician's Gear stand does everything I needed it to. It arrived in three days was well packaged and easy to assemble. It's light weight, portable and well constructed and would safely support an amp up to 75lbs. I would recommend this product to anyone with an amplifier 75lbs or less.", "id": 517}, {"review": "It's tough to shell $85+ for a pedal that is not an effect, but now that I've had it for a few weeks I'm glad I bought it. Although my guitars pretty much stay in tune, warmer weather and humidity levels affect my guitars and they change a little while I'm playing them. The Boss TU-3 is bright and easy to read and keeps me it tune all the time. When you play in a band, you got to have a pedal tuner and you can't go wrong with Boss.", "id": 647}, {"review": "I like Ernie Ball strings. They are less expensive and seem to retain their integrity longer than the other brands I tried. I change strings every two weeks. I tried the rest and returned to the best.", "id": 226}]