[{"review": "Like all Gibson products, this is high-quality polish that one would use on a high-quality guitar. I have used Gibson polishes for 38 years....", "id": 81}, {"review": "I have several stands, and this is the second one of these I bought. It works fine and will hold any size acoustic guitar.", "id": 258}, {"review": "If you want to get humidity into a guitar, this product is a must. I works well -- and if one lives in dry area of the country, this is a must have product.", "id": 299}, {"review": "These work great keep the guitar case around 43 degrees but do not seem to last as long as they did in the past. They are easy to use.... I continue to buy them because I live in a dry region of the country.", "id": 406}, {"review": "These are fine but didn't fit well; but they are a quality product. In my case, I actually needed medium or small to fit tight.", "id": 617}, {"review": "While this is a simple string cutter (something one can buy about anywhere), it is made well and is of excellent quality. Anyone changing strings on a guitar needs one this tool. It is easy to hold and is a good product.", "id": 648}, {"review": "These are outstanding strings that sound great; just a littler softer (to my ears) than the standard Martin strings. They last longer and are worth the difference in price over regular, non-coated strings.", "id": 717}, {"review": "If you do not want to have a hole drilled in your new Martin guitar, this is a must have product. I didn't want to have a hole drilled in a new Martin guitar, so this worked fine wit the Martin leather straps. Actually I bought two of them..... It is a 5-star product.", "id": 886}, {"review": "A simple system for gettting humidity into the guitar; The price is just right and it is very simple to use.", "id": 71}, {"review": "This product makes changing strings on a guitar easy; a must for anyone with any type guitar. It is basically the same thing sold or made all the major brands of guitars. It holds the guitar secure while changing strings or making adjustments. It also is easy to store when finished.", "id": 571}]