[{"review": "For the money, this strap is as good as any other poly strap.  Plus, it was made in the U.S.A.!", "id": 74}, {"review": "I installed these pins in my Silvertone SD10.  They fit great and are a lot better than the cheap plastic ones that were in it.  If you have a lower end guitar, I highly recommend these pins.  The saddle will make a bigger difference in sound than the pins, but every little bit helps.  For the cost, you can't beat it.", "id": 263}, {"review": "I installed this saddle in my Silvertone SD10.  If you have a lower end guitar, this will make a huge difference.  I had to sand it down some in all directions.  I did the length first, then thickness and finally the height.  I used 220 grit sandpaper. The directions are in the package.", "id": 415}, {"review": "My first Kala Ukulele had these strings on it from the factory and I've never switched brands.  Everywhere you read, these are the strings to have!", "id": 698}, {"review": "If you are looking to install a guitar strap button or just want to upgrade your existing button, these are great buttons to use.  It comes with two buttons, two washers and 4 screws (two different sizes).", "id": 786}, {"review": "For the money, this is a great guitar case.  I bought it for a Silvertone SD10, which costs about $120.  The guitar fits it fine.  I use it to store my guitar around the house or put it in the back of the car to transport it.  I don't think I would take it on an airline.  They destroy luggage, so I don't think it would fair well.  The compartment inside is large enough for picks, strings, capo and a strap with room to spare.  Mine opens and closes ok and the lock works. It is well worth the $60 I paid for it.", "id": 859}, {"review": "I installed these on a Silvertone SD10, which is a dreadnought acoustic guitar.  They are so much nicer than the strings that were on my guitar from the factory.  If you are looking for a regular/medium string, these are real nice. Great product.", "id": 87}]