[{"review": "This music stand is og great quality and of a great price.I have been very pleased with it. I have bought On-Stage stands in the past before, so i was sure that I wouldn't be disaapointed and I was right.Very sturdy-well built-good price.", "id": 155}, {"review": "These Strings sell for about half the price than the store, so it worth the effort and wait to order these from Amazon.The strings came very quickly and are of very good quality.", "id": 237}, {"review": "Good  power supply for the cheaper Yamaha keyboards. I have never understood why Yamaha keyboards don't come with a power supply? So, I found a suitable power supply for the instrument and works fine. No problems.Don't buy the one from the store, this is cheaper. Be patient and get this one.", "id": 476}, {"review": "I really like this cable., It is a great, quality cord that is very durable and I think it would be a long time before I would need another one. The length is long enough for any need and the cable will obviously be around for a while.", "id": 492}, {"review": "I bought these (light)picks because of the price. They work good if your strumming some light rhythms, but they tend to be weak and break if your strumming a fast song. I guess that's to be expected for a light pick.", "id": 574}, {"review": "The snark makes tuning your guitar easier and faster than anything I've ever seen.  It does wonders for tuning your guitar and cuts down on the time to tune your guitar. The music stores can't seem to keep these in stock because they are so popular. The price in the stores is $20.00 and at Amazon, you can get it for half the price. I saw no difficulties with using the tuner and it was up and running on the guitar and is easy to use.", "id": 706}, {"review": "I bought this guitar case for wife, as she plays a acoustic guitar and needed to replace her &#34;GIG bag( soft case) with a hard case that would protect her guitar better than the soft case could. She absolutely loves the case and it is well built and when you use it, it makes you think that this case should cost more, but for the $60, it is an awesome deal.The case fits her acoustic like a glove and has a storage compartment for her Mic cable, DI box , picks and tuner. Underneath the neck, there is enough space for storage of two sets of extra guitar strings. You  might pay more for a NAME brand case...save some money for soemthing else an dget this case, because it is a great deal. We found nothing negative that we could say about it. It also was packaged VERY well to protect the case during shipment and came very quick.", "id": 753}, {"review": "After buying this product, I have concluded that $8.00 is a lot of money for foam! Does the job, but I think the velcro job would be preferable to this one.", "id": 29}, {"review": "Not much to say about a XLR cable.It works.Average quality..does the job. No problems. Good price, came quickly through PRIME.", "id": 556}]