[{"review": "Great replacement string  for your ukulele, great to have on hand in case or replace your strings after you get your uku.", "id": 45}, {"review": "Having bought 4 sizes of Ukulele, only to discover the Baritone Uku is much like a classical guitars lower 4 strings, I was curious for 60 bucks to see what it is like to play the Mandolin.  If you are interested in this style of play,  search You Tube videos and watch people,  I have not found anyone cutting Hotel California out on these things..I also didnt feel like I wanted to learn yet another chord set ( tried playing the electric guitar, even going and getting Rocksmith software to learn ( which is prety cool)  anyhow,  I changed the strings on the Baritone to be a ukulele..so this Mandolin has a very thin neck,  ( Maybe 1.25 width)  I have watched videos of other people playing and their necks  look wider, this is hard to fat finger ( yea I have fat fingers).My initial problem is this thing doesnt come delivered anywhere close to ready to go, the Saddle moves, is not hard mounted and has height adjusters..so once  I figured that out, and also put some 3 in 1 oil on the nut so when tuning the strings dont drag ( whether this is right or wrong I dont know, I did it regardless)I measured from the nut to the 12th fret, then the 12th fret to the Saddle and moved the saddle so both measurements were really close, if you are having tuning trouble withe yours, I bet this is the problem,,  with your Tuner set your strings Tight,,  that was another problem, this thing should twang high pitched, like the dude in the Geico commericals ( Again on You tube someone posted videos of tuning )  I also read buy a very stiff pick,  not for me,  I guess I am not gentle and smashed the strings,, couldnt keep the pick in my fingers. so I use a light one, the grounds for using the stiff was the pick will not bend and create delay I guess between the two strings ( same note), the light weight one  works well for me, ( when I do pick this thing up )it is not hard to tune, I use my Ukulele Snarks, and pick one string at a time,  it is a cute guitar regardless and I saw one for sale Used at Guitar Center for 75 bucks, same one.if you are someone who can play guitar,  this might be fun,, I suck at it, I pretty much suck at Ukulele playing too but manage to play rock tunes that actually sound like something..I might some day figure out how to tune it like a ukulele but you can play songs with three to four chords,  good luck.", "id": 202}, {"review": "my guitar strap was old, I replaced it with this one as I didnt want to head into town,, is black and no frills.", "id": 285}, {"review": "Had a guitar for years,, always tune it but never time to practice, it tells you what note is actually being played when your string is out of tune so you can zero in on the correct one better..", "id": 394}, {"review": "the reason I bought them is I only needed a few, I live in BFE and there is no real place to buy any on my drive home from work, so I got these and delivered to my doorstep,, all is well with the world", "id": 573}, {"review": "Bought this for my bass playing step son,  dont know if he uses it but I loved the green,,  I have two, a soprano and tenor  ( Larger ) cant play for crap, but liked the look.", "id": 589}, {"review": "if you are brave enough to drill into your ukulele for a strap these are for you,  I was hesitant at first, but this did the job.", "id": 598}, {"review": "had no trouble putting them on or getting them in tune,  great addition to any uku bag, i would recommend them.", "id": 698}, {"review": "so cheap I bought one for each of my ukuleles..  would never use a pitch pipe again, and I guess I might be tone deaf cuz i cannot tune them without these.", "id": 706}, {"review": "Like it better than the other tuner I bought, this one was a dollar more and cant remember what the other one was but would defiantly buy this again.", "id": 707}, {"review": "but I keep thinking it is going to interfere with tuning at the nutwill be trying to get more use in.", "id": 715}, {"review": "only  thing is you need to loosen some strings to get it into place, but  worked great for what I wanted to screw around with it,", "id": 759}, {"review": "I bought one for my tenor and a different brand for my soprano Ukulele,,  I found I like the snark better for the dollar more in cost..  the other has multi use ( bass, chord, ukulele ) and seemed cheap,  I liked the snark so much I bought this one for my concert ukulele,,  you might ask, Huh  why one for each ukulele,  if you play,, then the answer is simple, for 10 bucks I do not have to hassle swapping tuners out,, and can just grab my ukulele and go.", "id": 763}, {"review": "Love the ukulele,  and the book is okay,, shows cords but the songs are very outdated,,  you tube is your friend when learning the uku...Update : I got a tenor uku for Xmas adn bought a concert uku just because, I love them both more than this little guy although it does travel with me and I just forked out money for a hardshell case so it wont get beat up as much in my suitcase by American Airlines,( just ruined my suitcase)anyhow,  it has been going out of tune for awhile now ( c string fattest one)  and I just figured out my bridge is lifting, there are two rivets holding it down and there is a board inside although not a very thick one,,will be putting a new piece on the inside and some good wood glue under the bridge and let it dry,,,  if the bridge falls apart again, I will be smashing the box and making a Banjo uku with the neck,,if you think you are really going to like playing, go for a concert or tenor,,  if you are liking the size spend a bit of money, this is pretty much the same as my grand daughters 20 dollar ebay ukulele I bought myself 4 years ago and gave to my 3 yo grand daughter because that one too would not stay in tune.", "id": 766}, {"review": "works out great for my two Ukus,,  hung it on the wall, looks good and is easy to adjust etc.", "id": 779}, {"review": "but works well,  I have a different brand which has a string and small hook but I find when adjusted correctly I cannot remove it,,  this sling keeps the head loop large so you can get it off without a binch of hassle,, I find the hook to be wide though and could be alot better with a thinner hook.", "id": 824}, {"review": "need to learn to read, since I have bought two other sets with a wound C string,, so bought these because I was having alot of trouble with my tenor uku my wife bought for me for Xmas,,  have since made a new nut and saddle to fix ( ok bandaid ) a high third fret which also I have sanded down and now is lining up with the others..", "id": 829}, {"review": "Liked the fact it tunes your ukulele as I must be tone deaf and cant use pitch pipes,, I bought another for my step son.  I did have a problem with mine not turning on one time but after re-seating the battery it has not had a problem since.", "id": 846}, {"review": "while learning how to read these things better,, I picked these up,  I need to read better becaseu I have 4 Ukuleles,. all different size and right now my tenor has a wound string on the third string,  so now I am more careful with buying strings, not that a wound is bad, I just suck at playing, my  concert is my favorite and just discovered that it fits in the case I bought for my soprano and I can take it on travel..", "id": 203}, {"review": "bought because cheap and trying to keep my electric guitar strings in good shape if I decide to pick it up again.", "id": 787}, {"review": "I have three uku, soprano, concert ( Love the best ) and a tenor,,  this brand of strings rocks.  enjoy", "id": 830}]