[{"review": "Really just some inexpensive and yet durable cables to link your stompboxes together. As of yet, i havent had one go all crackly, which, considering they get frequent use, is pretty good. Often, cheap cords die within a year or so. Every electric guitarist keeps a stock of these things, and this one in particular is cheap and accessible. I probably have around twelve of them.Enjoy!", "id": 11}, {"review": "I've been using Dunlop Nylons for almost as long as I've been playing guitar (twenty one years now). I find the .60's are just a bit too thin, but for more chord strumming style playing, such as playing rhythm, the .73's are perfect. They are flexible, but not flimsy. The tips will wear down after a while as with all picks. I estimate that a solid thirty to forty hours of playing is all you'll get with a pristine tip. However, they're definitely still usable after that. One other advantage these picks have is that they never break. So, i dont see how you can go wrong.", "id": 62}, {"review": "I had never considered using an EQ pedal before seeing and buying this, but man....I was missing out! The ten bands are truly incredible in shaping a precise sound and is especially impressive when using distortion. Each band is hyper sensitive....five for tone (high/mid/low) and five for gain. Aside from providing exact sound control, it also boosts your volume a little and functions as an overdrive as well. If you dont use distortion though, you can still benefit highly from this pedal, as even the clean channels become more crisp and effects more pronounced. This is especially highlighted when using delay or chorus, but distinctly noticeable regardless. By far the most versatile pedal I have ever used. I cant imagine not using it now that I have it. One further note....you can run this through an adapter chain if you dont want to dedicate an outlet to this one pedal....but, it is really cool that the power supply is included with the purchase. Just ups the value even further. I really cant recommend this highly enough. I think every guitarist and bass player should own one.Enjoy!", "id": 140}, {"review": "I actually bought this amp at a pawn shop for $60, but i would have paid the retail price if i had bought it new, with no complaints. For such a small combo, this amp really packs a punch. It is plenty loud, and is just fine for smaller club gigs. However, you could use it in larger venues also, since you generally mic up your amp anyway, and get most of your sound from monitors.Anyway, the clean channel is what you would expect from any Fender amp, with good tone and crisp reverb. The high gain channel is really fat sounding. I still use distortion pedals, and generally leave it on the clean channel so i can switch back and forth between clean and distortion with ease (not sure if there is a foot switch for the amp, since my pawn shop purchase didnt include one), but without a pedal, the high gain channel performs adequately.For the price, this is really an upper echelon amp in my opinion. Kind of does away with the need for a half stack, unless you are really gigging frequently at larger venues or outdoors. Plus, it is far lighter and easier to transport, lol.", "id": 223}, {"review": "I admit, i was really just curious how good a $15 pedal could possibly be, so i figured i would try one out. I had played some Danelectro stuff in the past (a baritone guitar and an amp many years ago) and remembered being satisfied with their stuff. Anyway, i figured since the pedal was so cheap, why not try it out.You know, it is a pretty decent stompbox. The slap echo is a good enhancement effect, meaning, it isnt really over the top....just gives you a mellow, reverb-ish echo...not quite delay, not quite reverb...kind of somewhere in between. I have since added it to my stompbox set up for that little something different. Not bad at all. I cant speak to battery life though, since i use an adapter combo to power all my effects. For kicks, try it out with some distortion and/or overdrive, and a wah....Anyway....Enjoy!", "id": 315}, {"review": "Sometime round 1994, my friend Kendal built several of these for our band. They were great and incredibly handy. I havent investigated this, but i wondered later when i started seeing them marketed if he had developed the first one or not. Certainly, if he did, he never patented it or anything.Anyway, flash forward 18 years and here i was sitting with my row of stompboxes, resenting batteries and individual power supplies. I thought back fondly to my first sound combo power supply and realized i needed to invest in one again....and so i did. This one comes with some slip covers for any unused adapters. So far, it has lived up to my expectations. I cat speak to playing out with this yet, as i am mostly messing around in my little home studio, but i definitely havent heard any crackle on my recordings or when just amping up and letting loose. So, for such a simple device, you really cant beat it...unless you dont really use boxes. Personally, i presently have my wah, distortion, chorus, overdrive, delay, slap echo, and flanger running through it. Everything works great.Enjoy!", "id": 428}, {"review": "I have owned several of these over the years and own a silver colored one presently. The price is right for these, and they work just fine. My only real issue is that sometimes, they will bunch or bend strings when setting them on whatever fret you're going to bar, thus producing a sound you weren't looking for. Some of the higher end capo's counter this by having screws and such rather than a spring. However, like i say, these work fine with a little care and attention to their placement on your fretboard, and are from what i can tell, the most popular model on the market.", "id": 26}, {"review": "As far as tried and true distortion pedals go, this is really just average. The filter doesnt have enough of an impact on the pedal to provide a truly large range from fuzz to metal distortion. Compared to other distortion pedals, it really fails in this regard. However, if used as a fuzz pedal instead, it truly shines, since this is really what it is. Does it have distortion? Yes. Is it valuable as such? Not in my opinion. It isnt condensed enough to be used strictly as that. Another gripe I have is the 9 volt slot. Most pedals use a universal design which allows you to use almost any power supply. Not so with this pedal. You are pretty much relegated to their own adapter or batteries, which sux IMO, especially since I run all my pedals off an adapter chain.Anyways, while this is fun to play with, you should definitely consider the sound you are going for. If you prefer to play a more grungy or 70's era metal, then this will work for you. For more crisp sound, you should look elsewhere. IMO", "id": 232}, {"review": "This is really a no frills stand, except the addition of a neck guard strap, which is a nice touch. It is adjustable for different size guitars and quite stable. There's really not a lot more to say about it, except that, at $7.95, i dont see how you could possibly be disappointed. I would certainly not spend 20 or 30 dollars on a stand when i could buy one of these.", "id": 519}, {"review": "I will just say that in my opinion, if you are looking for something to take your Taylor to a gig in, you are better served with an SKB. In a sense, the case should mirror the guitar it will hold. However, all that being said, this gig bag is perfect for less expensive guitars. It is well crafted and cheap. I use it for my Ibanez Exotic Acoustic Electric. A nice guitar, but not one that i would cry about if it got a scratch or two. Anyway, i also store some extra picks, my strap, and a couple cords in the bag (along with a fretboard cloth, a set of strings, a tuner, and an allen wrench for the truss rod). All in all, great value for a good item.", "id": 539}, {"review": "Just like the last reviewer, I also use this to link my MXR/Dunlop pedals together. They are surprisingly well made and I dont notice any signal distortion or drop off in sound at all. No cracklies, nada. I have been well pleased with these and will continue using planet waves cords. They are solid, durable, and reliable (and cheap as well).Enjoy!", "id": 578}]