[{"review": "Great all around mic used for vocals.  No frills, tough as nails, and great sound for live music.  If you're buying your first mic (or switching from a cheapie) and intend to use it for singing/vocals, this is a mic that any musician would probably recommend without hesitation.  I've never used another one since the first time I switched from a cheaper mic (that came with some bundle) 10 years ago.  I depend on the smoothness of my vocals to carry off songs and this mic reproduces the warm sounds I like perfectly.  You can stand 3 feet away and really wail, or get up close for some bass response, or anything in between.The SM58-CN comes with the mic, 25-ft cable, cable tie, carry pouch, and mic clip.  The standard SM58 does not have a switch (one less thing to break and I don't miss it)  but the SM58-S does have it for a few dollars extra.", "id": 20}, {"review": "Sound can be subjective and strings are a matter of debate that can go on forever.  Usually I wouldn't notice a significant difference between brands (except for any coated string that all sound like crap to my ears) but when I put D'addarios on my 000 I just couldn't believe the improvement over the Martins.  It took dozens of string changes and gage experiments but now its clear.  These consistently sound the most balanced and responsive... With the crisp clear highs that my guitar lacks when strung with anything else.I'm glad the search is over for awhile and I have a solid sweet baseline to experiment from here!", "id": 199}, {"review": "Thought about buying the (expensive) G7th capo, but I'm very glad I didn't.  The tried and true Shubb works great at a great price.  I don't use it much but it's nice to know that when I do I won't have to mess around with or detune to make it sound right.  The difference between this one and 'clamp on style' is night and day.", "id": 541}, {"review": "If you've never had a pedalboard before I'd say pass on this one and look for one that is more user-friendly.  The pics and description don't show just how insanely large this is.  It's too big.  Patch cables are crap and the power supply didn't seem sturdy enough to be kicked around.Besides this, I had trouble using it (even for practice) because the lip of the case gets in the way of my foot hitting the pedals.I ended up giving this one away to a friend and getting a Gator 'bone' and a seperate power supply.  Easier to practice with and easier to toss into another case with mics/cables rather than being a whole suitcase on it's own.", "id": 616}, {"review": "Nice little acoustic amplifier that gets the job done with high fidelity and sufficient volume.  Numerous reviews posted on Amazon, Sweetwater Sound, and Musician's Friend pages and the positive ones pretty much all hit the mark.  This is 60W mini-PA that amplifies your guitar nicely and reproduces vocals beautifully- if you have a quality mic.  There are 'package' sets with this amp by other sellers on Amazon that bundle cables and mics, et cetera... recommend steering away from that and just buying the amp from Amazon and getting a Shure SM58 (or other quality mic) seperately.Many reviews talk about the durability and how easy the amp is to ding and scratch cosmetically.  I see potential for that, too- thus the need for a carry bag mentioned below.  But I don't see this as a big downer and I personally don't mind if it takes on a road worn appeareance after bumping it a few times.  If appearance is your thing, shell out the extra $200 and buy a Roland or Fender...Shop around... click around... if you buy &#34;items sold from Amazon&#34; you can depend on Free Shipping.  If you buy from sellers THROUGH Amazon you will usually pay shipping and the overall pricetag will be bigger.  And as I've stated on other reviews, other sellers that sell through Amazon sometimes ship slower or make mistakes with shipping... so know that going in.  On your major music retailers' sites this baby is going for $360 to $380.  Got it to my door for $304.  I really can't say enough about the ease of shopping, trustworthiness, and quick delivery of items sold by Amazon.  5 stars just for service... the fact that the Amp is awesome makes it that much better.You probably won't be able to find a carry case that fits this amp, but I bought the 'Singer Black universal Sewing Machine Tote' for just over $20 and it's perfect.  It fits the mini snugly, with room for odds and ends like cables and mics and maybe a few small pedals.  With my current setup I can walk in the room carrying the whole shebang in two hands, and that's really neat.  The closest 'amp case' would be $100 1x12 combo case that won't fit right and would take away from the whole portability thing.You're not going to find 20 lbs and $300 worth of quality amp anywhere else.  When compared to other makers (Fender/Roland) nothing gets the consistently good reviews that this little guy gets, and I understand why.  Recommend without hesitation!  And as with all my reviews if something goes wrong down the road I'll edit the review to share.  But I expect that this amp will meet my needs for a long time to come...", "id": 703}]