[{"review": "You may wat to reconsider buying ANY filter.On this model, the top (filter) part is essentially pantyhose wrapped around a cardboard tube.Despite this, the clamp and adjuster parts are relatively good.In all honesty, Buy a nicer filter, or none at all. They do NOT make a huge difference on recording quality unless you're using Top-of-the-line microphones. If this is the case, spend the money to get a nicer filter.One nice thing- these keep artists from getting too close to the mic and essentially making out with them. I found that quality nice when dealing with... passionate vocalists.", "id": 134}, {"review": "I love a lot of Danelectro products, but not really this one, i give it 3/5 because it works as advertised.The features are good. True Bypass requires a 9v wall plug, and adjustments are good.BUT HERE'S MY ISSUE- The Distortion is not 'Crunchy.' It distorts, sure, but the sound is not dimensional... it has no depth to it.Thats fine for someone who is playing one of the various metal genres, but i play a lot of blues-rock... I ended up switching to a Vintage-Tube overdrive by behringer.Not for me, maybe for you.", "id": 280}, {"review": "The Danelectro mini amp was an impulse buy for me, but this thing is fantastic! clean tones to woodstock fuzz, this thing belts 'em out. only complaint- battery doesn't last too long. get a power adapter. otherwise- GREAT PRACTICE AMP!", "id": 302}, {"review": "The adjustment screw/handle bit still works after 2 years, and the base is heavy- a cast metal.They look good and the paint lasts- great for a performance space.Now about the title- I used one (I own 2) as a sledge hammer during a band bonding event. The base ended up striking the concrete patio, and a chunk of the base broke off. Not a issue with manufacturer, but don't drop it too hard. Despite the break, the stand still sits upright, and i still use it.nice and cheap.", "id": 515}, {"review": "These a cheaply made with corrugated plastic, however they are surprisingly durable. THESE ARE NOT 8.5x11 (paper size). They are about half-sheet size.", "id": 520}]