[{"review": "I'll never use another string on acoustics. The reduced finer squeak, the long lasting coating, and the great tone of these strings is wonderful. I've tried a couple cheaper brands recently, both coated and uncoated... but come back to these every time.", "id": 103}, {"review": "Before we get started, I am more \"pro\" than amateur. I work at a church as a pastor of Worship Arts and use this in my work. But I hesitate to say I'm only \"pro\", because \"amateur\" means you do something purely for the love of it... and I feel that way about music... So...First... the models I've tested are far and away more realistic to my ears than other modelers I've used, which includes Logic Studio's amps (these sound almost as good btw), POD X3Live and XTPro (the HD models are noticeably better... and the fizz is GONE GONE GONE), the original POD and 2.0 (which sounded the same to me and made me happy at the time), and the ToneLab SE (which I missed for a while, but not anymore).I made a few patches for one of my guitars based on having a Bassman 4x10 alongside the Dr. Z, and it is the coolest sound I've ever made with this guitar... easily. Better sounding, to my ears, than the real amps I've been using (maybe because I put them off stage and don't run them very loud). I ADORE the sound of this unit.Oh, and as always... forget about all the pre-sets. They're probably all as useless as you imagine they might be.Now the bad news. And it's significant... for some...First off, editing is clunky like it was on the XT and X3Live. Just forget about trying to use the display. Connect to a computer... Seriously. When you start from an init patch, you only get lucky, it seems, to manage to coax it into \"two amp\" config...Next, The functionality of this unit is exaggerated by it's specs. You will almost certainly NOT be able to do 8 FX at once the way you're thinking. Why? Let's say you use an XT or a X3. think about what you're used to.You start with 8 FXSubtract effect banks for...1. volume pedal (you need to use an effect bank). You might be able to use an analog pedal, but I like my volume after my compressor... so I have to do it in the loop I guess...2. FX loop (only works with an effect bank... Line6, is there any way you can make this always active in a firmware upgrade? Seems like you could.)3. Noise Gate (used to be always available... don't worry if you mix this with the M13 as I plan to do, though, as the M13 has a great gate). I mostly use clean or just barely broken-up amps, so I might be able to skip this.4. Wah (this is always available and active in the X3 and below).5. Post-EQ. The X3Live had a final EQ before final output that I liked a lot. in addition to all the other FX, too. You need to dedicate an FX bank now.SO... you might only have 3FX left. For me, put in a clean boost and tube drive (which I think sound better in this box than they did in the M13. Probably because they're \"digitally part of the signal\" is all I can think) and a verb for the amp. No slots left. What if you need delay and modulation? EEK! I have to re-think the way I use FX in this box. Still evaluating how that will work for me.What if you're a guy like me who was using the X3Live (occasionally) as a one-box solution for a dual-voice guitar. (All my guitars have piezo bridges.) No dice.I will have to use an acoustic preamp. No matter. I have one. I will probably dedicate a \"null\" amp to bring this signal into the unit and mix it.In addition, there aren't as many computer-recording routing options as the X3Live, and the SUPER-sweet ability to switch between two FX chains in one patch (instead of switching programs) is gone. As far back as my old Vox ToneLab SE, I could literally switch channels from one amp/cab to another in the same FX chain. You could do something similar on the X3Live. Not here. Also... Line 6, why on earth can't you make the Midi in and out work as a USB Midi interface with this unit? How complicated can that really be?In short... the X3Live has significantly... SIGNIFICANTLY more flexibility imho than this unit, for many of us at least, and ought not to have been discontinued imho. For some of you, it's still a viable option.You also still might need your other FX!I thought it might be possible that this unit, even if I needed to use my AG Stomp for my acoustic side again (which I'm happy to do) would bump my M13 off the stage. It did not at first, but after a while, I did indeed get rid of the M13, and don't miss it.. That said, I think from what I'm hearing that some of the FX (especially the dirt pedals) work FAR better inside this box than they do in the M13 when you connect it to a POD or amp.My favorite patches so far that I've made (which use the Bassman model and the UNBELIEVABLE Dr. Z model... far and AWAY my favorite amp model EVAH!) don't leave any room for modulation or other special FX. (I'm not a \"switch whole patches on the fly\" guy. I turn FX off and on.) But after a bit of tweaking and patch-making, I discovered that for my sounds, I didn't need dual amp chains that often, so I have all my flexibility back...So am I complaining about these limitations? No. Because the sound of this unit is so extraordinary. I'd take off a full star for this shortcoming, but the fact is the unit sounds good enough that I can't do it.There will, at some point, I hope, be a next-generation of this technology which will possibly address some of the usability shortcomings, but I have to say, for this price, I am totally satisfied with the sound!In the meantime, am I willing to trade the flexibility of my former rig for the sound of this one? Heck yes, it sounds that good. I even love the models of amps I know I'll never use for the first time ever.... And after a few months of experimenting, I was able to make patches that completely worked for my two-voice guitar stuff... with NO additional outboard gear if I didn't want. So I've simplified to where I wanted to, and no longer feel like I'm really compromising anything.So... started with a rig consisting of the HD500, and sometimes an M13, and an acoustic preamp (currently a Yamaha AG-Stomp) mixed in with the HD signal through the aux input. I've now gotten to the point where I can do everything I want, if I need, without the additional pedals, and I sold the M13. I kept a few analog pedals and such that I just like, but rarely take them out of the house anymore.I'm only nit-picking so that you will know all the trade-offs. For what I have been fantasizing about, basically an M13 in form and function with a handful of amp models shoved in the box, this is as close as we're probably going to come. And, did I mention... the SOUND! It's seriously great!UPDATE! I have learned that I will indeed have no problem replacing my M13 as well, and sold it off. I thought I'd miss it, but I don't.UPDATE! As of February 2012, I have supplemented this product with a black James Tyler Variax JTV59 (Korean), and it's a marriage made in heaven! If you are going to go with this product, and if you are looking for a new guitar, check out the new Variaxes. Totally amazing.", "id": 700}, {"review": "I'm a HUGE fan of the two previous NS Capos from Planet Waves. What does this add to the others?Well, functionally I think it works no better than the previous dual action capo. In other words. It's freakin' perfect.So... I'd give it 4 stars... except it gets 5... because...That little clip that holds a guitar pick is absolute genius.Full marks. You can't miss with this product.", "id": 843}, {"review": "Okay, so... it's small, easy to dial in a good sound, very inexpensive, made here in the US, and has a wonderful transparency to it.Add to that the different ways to configure it (by using the internal dip switches), and you have a compressor as flexible as any I've used for guitar at half or less of many cost (which sound, imho, no better).It stacks well with the EP booster and another comp/boost in the chain, too.Whether you want to drive your amp a little harder or just squash your signal, this product is impossible to beat.I totally adore it.", "id": 866}, {"review": "Don't get me wrong, the improvement over the old formulation is noticeable. There's a little more &#34;brightness&#34; to the output, they are a little more long-lasting, and they stay in tune quicker and longer than the normal XL120. This is a good string.But it looks like the going rate on these strings will be 12 bucks a set. I can get three sets of regular (excellent) XL120 strings for that money, and if the NYXL lasted 3 times as long then they'd be worthwhile, but I've been able to try them twice now, and they don't last 3 times as long.Great string, great innovation, great achievement, drastically overpriced.", "id": 897}, {"review": "I was looking forward to trying these, as I've loved this company's product since day one.But I think they've messed around with the gauge, slapped a meaningless &#34;HD&#34; tag on, and added a few bucks to the price. More profit in someone's pocket for marketing jargon.I have a smaller-bodied guitar, so these should have, by their claim, given me better balance, but imho, the opposite happened. The bottom dropped out, the top end stopped sizzling, and the middle strings totally took over when I strum with a pick.When I play with fingers it's better, but not worth spending more money on than the normal .012s I've been using (which I think I liked a lot better).It's possible that these work great on the Taylor guitars they were ostensibly designed for (color me skeptical), but I'd say if you're happy with what you have, you need not try these.Again, long-time user and big fan, but paying extra money for a slightly different gauge and a silly &#34;HD&#34; moniker... no thanks.", "id": 898}]