[{"review": "I didn't give 5 stars just because I know there are better strings out there, but these strings are a great value and wouldn't hesitate to buy them again. In fact, I have already bought them several times. One little thing I appreciate about these strings is the different colored ends that makes them easy to identify.", "id": 156}, {"review": "If you're a musician, there are those things that you gotta have on a regular basis and for guitar, strings are one of those things. I give these 4 stars rather than 5 just because I know there are better strings out there. However, these ones are great. I like the sound they provide and the price is nice.", "id": 198}, {"review": "I really like this tuner for the convenience and ease of use. However, it broke not too long after I bought it. One of the connections broke, that is. I think they might have made it a little more durable since then. Moreover, I sent it in and they replaced it, so that was cool. It would be nice, though, not to have had to do that.", "id": 707}, {"review": "I just got them (I bought 5) and put them up, so I don't know about longevity. So far, though, they work great and seem to be sturdy enough. And the price is great!I am using them for a variety of instruments including steel string acoustic guitar, classical acoustic guitar, electric guitar, electric bass guitar (4 string), and mandolin. The hangers adjust easily while maintaining stability.", "id": 779}, {"review": "I liked this tuner, the look, the size, the ease of use, the quality performance, until it died. I think what happened is I just left it on too long. My problem was that in order to turn the power off you have to hold the power button rather than simply pressing and releasing it. Since it died that first time, it doesn't seem to perform the same. I also haven't really paid much attention to it since it died because I sent another similar tuner in for replacement, and I got an acoustic guitar that has an on-board tuner and a tuner pedal for electric guitar.I wouldn't recommend against this product. Just remember to hold the power button to turn it off.", "id": 799}]