[{"review": "A long time Planet Waves user I trusted that the circuit breaker cable would be up to their usual high standards... IMHO it is not.The plugs are great but do not seem to have good cable grip. I like their old cables that had a long cable protector extending from the plug allowing the cable to flow gracefully from the guitar (and into the amp at the other end). The actual cable is horrible.... it is a hard plastic outer shell and does not lie or flex well like a good cable should (e.g. like my old Planet Waves cables do). They claim that the shielding is excellent but I find it to be mediocre. Very disappointing purchase.", "id": 32}, {"review": "These just happen to be my favorite.I always keep .46mm .60mm and .73mm sizes on hand. (mostly use the .60's) I've been using them for years and so will probably never change. I like the 'grippiness' of them .... I hate smooth picks.Picks are cheap so just keep trying different ones until you find one you like.", "id": 64}, {"review": "A good value box set of quality products. Use these each time you re string and keep your instrument in top shape. I do guitar set ups for folks and these come in real handy.", "id": 95}, {"review": "I purchased this as an extra CV controller for a Digitech Control 2. When I got it, I tried it out as a volume pedal just for kicks and YES it does suck the tone right out of the signal. As far as a CV controler? it sucks at that too! Why? it squeaks as you move it (after 5 minutes use, right out of the box). Behringer is a joke and gives German engineering a bad name (although only 'conceived' in Germany).It's a direct copy of the Yamaha FC9 and so I am about to purchase one of those and see how it compares. I'm betting the extra 45 dollars will be well worth it.Also, you may say \"who cares if it squeaks a little\"? well I do when I am controlling volume swells or a 'wah' effect at low volume in the studio!Good luck if you buy it.", "id": 212}, {"review": "I was impressed by the sturdiness and size of this neck cradle. Combined with the OP/TECH work mat that I purchased I can now turn almost any table or bench into a handy guitar workstation. In my experience Jim Dunlop always makes good products and this one continues that tradition.", "id": 550}, {"review": "Peterson makes some of the best and most accurate tuners and their high end strobe tuners are a must for the professional guitar repair shop allowing for accurate intonation and set ups. This tuner is accurate and I have even successfully set the intonation on a couple of my instruments using it (although it is not intended for this purpose). However I purchased it for the intention of taking it along to gigs in my guitar case. Unfortunately, due to the flimsy plastic construction I don't feel that it is up to the task and it would only be a matter of time before it gets broken if taken out of the house or on the road. Far better off purchasing a cheap Snark tuner that if lost or broken wouldn't be a big deal to replace and is accurate enough for most peoples use.", "id": 711}, {"review": "Overall, as with most Zoom products, this unit is a winner and cannot be touched by it's competition in it's price category except for perhaps the Olympus LS11 which is cheaper but the Zoom has a ton more features.Build quality is good, features are good (the only unit in it's price range to have combi XLR / 1/4\" TRS inputs) and it records to a high quality.However, I think Zoom almost went too far with features and perhaps they could have focused more on making it THE BEST digital recorder under a grand and making it a great USB digital interface instead of spending money on the 4 track feature and all the built in effects and other fluff that works O.K. but is much more easily realized in a simple digital 4 track recorder (e.g a Tascam PocketStudio)The manual is a farse in Japanese /English translation and any person that does not have experience with recording devices like this might really struggle to learn how to use this unit (although it's fairly intuitive to operate if one is familiar with such devices - I gave up on the manual and just dug around in the menus, but the unit is still a little 'fiddly' to operate in advanced modes.My last comment is in regards to the H4n as a USB interface. I have played with it a bit and so far it does not make a good interface. First of all it is only 16 bit and I can only get it to work with MME drivers. I have read that there are some ASIO drivers available for Windows 7 but I use XP. I may try to use ASIO4all but it is still only 16 bit and therefore not much use for serious interface work. There is a direct monitor function but there still seems to be some timing issues when multitracking with a DAW software (I have only tried it with Cakewalk Sonar). I had hoped to use it with my laptop as a portable interface but sadly I can't seeing it being of much use in this regard.However, overall the unit is stellar and I highly recommend it.PS. I read some folks having issues with line inputs (e.g. recording a stereo mix from a mixer). I personally don't see the problem, the inputs are designed to accept a variety of signal types. If it is not working for your situation one can always use a TRS Hi Z unbalanced to XLR Low Z balanced converter, available at Radio Shack for around 20 bucks.", "id": 581}, {"review": "I purchased this pedal at a local music store for practice and possibly doing some loops at open mics with my Roland GR55 (which has a flawless basic looper built in, but only 20 seconds record and no undo). I had hoped that it would at least last one hour on with a battery so that I wouldn't need to carry a power adapter along.The factory battery lasted about 1 hour. The second brand new fresh Duracell battery lasted about 20 minutes. I started recording a loop with another (3rd) fresh battery (tested 9.10 v with a multimeter) and the unit started behaving erratically after a few seconds of recording, suggesting that it was faulty. The lights started coming on and off randomly (record/undo/all three together, then off, then undo on, then all three on etc. etc.)The first time I used the JamMan XT (with the factory battery) it seemed to be working OK and all I can say is that as a basic looper it sucked.I am used to synching loops with other loopers and timing is everything, so I know it was not my poor technique. The main problem was that it didn't matter how hard I tried (even if I did a manual fade out) there was always a gap of about 2 seconds between the end of the loop and the start. This makes the unit useless.Also, it is poorly conceived in that, to replace the battery you have to take out 2 screws... exposing the delicate printed circuit board.The potential for damage here is very high. Also, replacing the screws needs to be done very carefully to avoid cross threading the screws and messing up the receiver nuts which are mounted directly onto the circuit board. To save a few dollars Digitech did not have the foresight to manufacture the unit with a battery box which would have protected the electronics and possible (read INEVITABLE) damage.I have owned quite a few Digitech products over the years and generally they are well thought out and well constructed but they have really dropped the ball on this one.It's going back to the store where I purchased it.", "id": 891}]