[{"review": "This microphone is great for singing with a PA and an electric guitar. I sing worship/praise songs and southern gospel and it is very smooth in the mid range and when you get up close it enhances the bass nicely. I don't think it is the same as an SM58 but it is exactly what I need. Built to last and it is a Shure.", "id": 18}, {"review": "This little box is great for metronome use. It is loud and the screen is easy to see. The tuner function can be a little disconcerting sometimes. It seems to work ok but the display might fluctuate from G to C when tuning to G on a Bass guitar. I used it to set my intonation on a new Bass and it was well worth the price I paid. I would buy another one if I lost this one.", "id": 298}, {"review": "This stand is great for my 45lb Peavey 1500. It is a light weight rack and I had to put the amp toward the bottom. I wouldn't put much more in it but it is exactly what I needed. I can grab the rack by the top bracket and move it around easily. Haven't tried gigging with it but if you are gentle I think it would work fine.", "id": 322}, {"review": "I am not one to spend a lot on batteries so this was a no brainer. It has worked great now for over a year at least. I had to look it up and I have had this for 3 years tomorrow.", "id": 461}, {"review": "This will give you the delay and compression that you need for country twang on the telecaster. It will also give you a rhythm track to play along too. The rhythm machine has 44 rhythms with adjustable volume and tempo. It is not perfect as it has no on/off switch, it reverts to default mode when you power it up, it is a little hard to set volume and tempo on drum beats. It only cost around $60 so perfection should not be expected. For practice and the home studio it is great.", "id": 631}, {"review": "Capos are not something that I shop for. I have had two for years. One is a strap type and the other is an expensive K type. It is similar to this one. Yeah...in looks only. This one blows that one away. It has adjustable tension and it fits on the neck in a different manner. It is not in the way of chords or fingering and it does not cause the strings to go sideways. This is great. I play a Tele and an acoustic Martin. It works great on both. I play professionaly and this is the best thing I've gotten in two years.", "id": 843}, {"review": "This is the perfect fit for all my basses. I have two Ibanez and two Essex basses. They recommend the light top medium bottom string gauge. I play fingerstyle and they feel great. They have corrosion resistant packaging and since corrosion is what kills your strings the longer you can keep it at bay the better. They are made in  the USA and they use recycled packaging. I cannot attest to their lifespan but the package says long life so we will concede that point.", "id": 896}, {"review": "Great strings with a good feel to them. They are size 10-46 which is just right for my electric guitars. I won't know how long they last for awhile but they are a bit pricey. If they hold up well then they are loud and bright on my telecaster and I will switch if they last a long time. I don't think of these as extra lights (09-42) they are more of a light to me.", "id": 897}]