[{"review": "This is the one you want.  It's a timeless classic, built like a tank, worth every penny.  An investment in your musical future!", "id": 158}, {"review": "This is a very simple product, but one which fulfills its intended purpose of hanging guitars on the wall.  This fits all my guitars from telecaster to classical neck widths.  The swivel mount is key to keeping excessive stress off of the neck.", "id": 166}, {"review": "Schaller is sort of a household name among guitarists, because they've been making the same product for so long now.  You probably already know what this thing is and what it does.  All my electric guitars are equipped with these.", "id": 278}, {"review": "Leather tends to be stiff and not very flexible.  Nylon has incredible strength but isn't very comfortable.  In my humble opinion, cotton twill is totally the way to go.  It's comfortable and adequately strong.  This strap is sturdy and robust, and it's plain black.  You can't go wrong here.Schaller strap locks are compatible with this strap.  You should buy those too, they're great.It gets five stars for being not only better than most other competing products, but also a lot cheaper.", "id": 658}, {"review": "I've always used jazz picks for my electric guitar work.  Danny Gatton did so, and I wouldn't have it any other way.  These are the absolute best picks I've ever used.  They don't wear down as easily as delrin, tortex, or some other materials.  And, these have a really, really nice textured surface that keeps them from slipping out of your fingers.  I think I'm going to order these in massive bulk quantities and stash them away in case they ever decide to stop manufacturing these...", "id": 686}, {"review": "The design of this product is innovative and excellent.  I haven't used it for as long as I would generally like before writing Amazon reviews of purchased items, and so cannot testify to its reliability, but suffice to say that, for the price, it would be hard to beat.The display is very clear, and the ability to clip to your headstock while tuning is marvelous.  I wonder how I ever lived without it before.For live gigs playing electric, I would prefer a floor tuner running through a pedal board with a patch cable, as noisy environments probably wouldn't be ideal for this tuner.  This is more for your parlor acoustic setup.", "id": 707}, {"review": "I always wanted a Boomerang III looper, which at almost $500 was not really a justifiable expense for me.  Then, I found this for about $100, and I immediately sprung for it.  This is a great practice tool.  All it does is make loops.  The learning curve is very low, and there's no limit to the number of loops you can layer other than the total 5-minute recording time.  There are no quirky timing issues to be found here; your own ability to keep time and rhythm will always dictate how good you are at making loops.  This does take some getting used to, but it makes you a much better musician in the process; your drummer and bassist will thank you.This could possibly even be used as a live performance tool, although you'd have to be very, very proficient with this tool and be playing very, very tightly in the pocket.  I personally am not a good enough musician to ever want to risk doing something like this, lest something go wrong on stage (and lest I subsequently find myself impaled on a drumstick).Students would be especially encouraged to get one of these.  My playing has definitely grown and improved since I finally broke down and bought a looper.", "id": 869}]