[{"review": "I used to use Fender medium picks only. Now for Jazz and metal I use this pick. You will just have to try it for yourself to see if it is right for you.", "id": 68}, {"review": "These are my favorite strings.  They last a long time and my fingers don't hurt when I play.  I tried Martin strings once and hated them.", "id": 103}, {"review": "I'm a fanatic about my frets looking shiny and polished.  I want them to be slick when I bend notes.  If you polish too hard or too often with steel wool, it can wear down your frets.  These micro abrasive sheets do a great job without harming your frets.  I watched a Youtube demo and that sold me on ordering them.  I think Amazon had the best price.", "id": 317}, {"review": "My hopes for this pad was that it would be soft a sqishy on my shoulder.  The gel is pretty dense, so it's kind of hard and squishy and very heavy!  I found that it just added more weight.  I'm not using it.  I would look elswhere for a different product.", "id": 452}, {"review": "I wrote a review for the SN-1 which is essentailly the same tuner except this one also has a mic.  Here is my other review:I own a few tuners, including a Boss Tu-70.  Recently I purchased and reviewed the new GoGo TT-1 clip on tuner. I never thought a clip on could be as accurate and dependable as my Boss.  The GoGo is awesome and instantly became the only tuner I use.  But now I have to say, I think the Snark is a little better. I bought the SN-1 and the SN-2 because they are so inexpensive and so amazingly accurate.  The other great thing is they are chormatic, so besides being a great tuner, you can leave it clipped on to the headstock to practice accurate string bending or just learning the notes on the fretboard. The display is very easy to read...better than the GoGo (although GoGo has a new improved display since I bought mine).  I love the colors and the matte finish too.  The rubbery matte finish makes gripping the clip much easier than the smooth plastic of other tuners. The rubber surface also makes opening the battery compartment a snap too, I had to fight like heck to get the battery door open on my GoGo.  The Snark is less than half the price of my GoGo and out performs it...it's a no brainer.", "id": 707}, {"review": "I've used Shubb for years.  I strayed briefly on a Fender Smart capo.  You can read my review on that item.  I really liked it at first and in my review I said I was converted from Shubb.  Im back to Shubb.  The Fender is plastic and it works fine on my electrics but not as well as on my acoustic.  The Shubb works great on both. If you just buy a Shubb to begin with, you wont ever have to waste money on trying out different capos.  It will not clamp on to your headstock, so if you like having a capo sticking out of your guitar when you're not using it, then this isn't it.", "id": 761}, {"review": "I own a few tuners, including a Boss Tu-70.  Recently I purchased and reviewed the new GoGo TT-1 clip on tuner. I never thought a clip on could be as accurate and dependable as my Boss.  The GoGo is awesome and instantly became the only tuner I use.  But now I have to say, I think the Snark is a little better. I bought the SN-1 and the SN-2 because they are so inexpensive and so amazingly accurate.  The other great thing is they are chormatic, so besides being a great tuner, you can leave it clipped on to the headstock to practice accurate string bending or just learning the notes on the fretboard. The display is very easy to read...better than the GoGo (although GoGo has a new improved display since I bought mine).  I love the colors and the matte finish too.  The rubbery matte finish makes gripping the clip much easier than the smooth plastic of other tuners. The rubber surface also makes opening the battery compartment a snap too, I had to fight like heck to get the battery door open on my GoGo.  The Snark is less than half the price of my GoGo and out performs it...it's a no brainer.", "id": 706}, {"review": "I was afraid poor quality would come with the low price, but I did an AB comparison with one of my expensive oxygen free, yada, cables and I could not tell a difference.  I was playing an American made guitar through an American made tube amp so this was a legit sound test.  I'm sure the plastic on the ends of the plugs will not last as long as a more expensive cable...but who cares...buy a new one!  Love the coil, love the price.", "id": 709}, {"review": "This is the first and only TC Electronic product I've ever purchased.  I watched the Youtube demos and liked what I heard.  It has exceeded my expectations. The reverb sounds are heavenly with plenty of control to tweak. The Toneprint feature is amazing.  I downloaded \"Church of Andy\" preset from the TCE website and just love that patch.  Downloading is quick and easy.  I created a folder on my computer and dowloaded all the available Hall of Fame patches so whenever I want to change it out, I don't even have to go on the Internet to get it.  There is an iPhone/iPod4gen app where you can transfer the patches directly through you guitar to you pedal. Don't ask me how it works, but it does.  I will probably buy more TC Electronic pedals in the future.", "id": 748}]