[{"review": "The reviewer who wrote that that these are \"cheap foam\" worth $5.00, doesn't understand or appreciate the quality of these speaker isolators. A/B these with some $5.00 cheap foam and you will realize how good these Auralex isolators work. I am using a pair of Behringer Truth active speakers that weigh 33 pounds each. These isolators not only support them very well but solved a big problem I had. It seems my speakers were \"audio coupling\" with the console they were placed on making the console vibrate with the spaekers and muddy up the lower fequencies.My problem started when I noticed that my mixes sounded good on other systems except for the bass frequencies around 80-125 HZ. Apparently my Behringer speakers were not accurately reproducing that fequency range and I was EQing that range badly to compensate. I didn't hear it when I mixed my Hafler M-1 speakers. I was about to give up on the Behringer Truth speakers but I really thought that they sounded excellent on every other frequency and are very detailed in every other range. The Behringers also had all the power I needed (active speakers) and can be played really loud in my studio without any distortion. Except for what I can only describe as a muddy or not clearly detailed low end, I love these speakers. Fortunately I was at a friends studio (a great pro studio) and I saw that he was using the Auralex Isolators under his speakers. He said he loved them. I bought them and placed them under my speakers and remixed a project I had been working on. WOW!! What a difference. It was an immediate difference. The bass is now nicely detailed and that muddy tone is no longer there. I had to reajust the EQ on the lower frequencies (cut them back to almost flat)on the new mix. I immediately bought a 2nd set for my small Hafler speakers. Why take a chance that they were also not reproducing accurately. These isolators are a great product and problem solver that saved me from buying new speakers and discovering that I still had the same problem. \"Cheap foam\"?? I don't think so.", "id": 57}, {"review": "I bought this to make it easier to switch guitars on the job (I often go from an electric to an acoustic or a Gibson humbucker loaded guitar to a single coil Fender). For that one job it works well with no noticeable noise in my VOX VT-30 amp. Other reviewers said that the two level controls only work if are using this pedal for a one in to two out situation (one guitar to two amps). That is definitely correct. In a two in (two guitars to one amp) situation only one level control works which isn't bad if you need to compensate for any volume loss from the pedal. For $25.00 it a pretty useful pedal.A quick word about Behringer stuff. I have several Behringer pedals and other Behringer equipment. I never had a problem with their stuff. Not once. I often read these reviews that complain about the low quality of Behringer stuff and the plastic case on the effects pedals but I have yet to damage one of the pedals and I admit that I am not that careful with my live equipment. This stuff is the best bargain on the market. Are my Behringer Eurolive active P.A. speakers as good as my Mackie SRM450 speakers. No, but the Behringers cost about $250.00 each while my Mackie's cost twice as much. If money is not a problem you should go with the bigger name brands but often at three to four times the cost and with only minor improvements.I am a weekly player and have been for 40 years. I wish this stuff had been around when I first started playing.", "id": 375}, {"review": "This pedal does exactly what it says it's supposed to. It boosts the guitars signal. It does it really well, with very little to no noise. The thing I like most is that it is not a \"sledge hammer\" type pedal or overdrive. The input signal is cleanly boosted. What you put into the input comes out the same only louder. It starts with no change in the signal and allows you to raise up the gain very slowly. It just gives the signal from your guitar a stronger output to whatever you are plugging into (amp, mixer, effects or pedal board). This pedal arrived at my door on a Friday afternoon so I took it to a gig that night without trying it first (something I don't normally do). The first two times I used this pedal were that night (Friday) and the next (Saturday). I thought it worked great for my needs. A few days later I read a review that said this pedal had a noticable hiss. Since I didn't remember hearing any, I got it out at home and plugged it into my amp (I have the same amp at home that I use live). When you activate it with the tone set flat on the pedal and the volume about 12:00, there is a very sight hiss (no noise when bypassed). For me it is a very minor hiss that in live situations with all the normal room noises I never heard at all. This may not be true for all amps and maybe some high gain input amps may handle this signal differently. I know for sure it is a lot quieter than almost any effects pedal I have ever owned and I have box full from 35 years of playing. I am using a Vox VT30 which is a modeling amp with lots of bulit in effects (delays, chorus, flanger, compressors etc.) These days I don't use any additional outboard effects (except a BBA Sonic Stomp that I never turn off) so siganl from my guitar hits my amps input very cleanly. If you use various guitars on gigs, this pedal is very useful. It allows me to quickly match the various guitar output levels and compensate for differences between humbuckers, single coils and piezo pick ups on an acoustic without having to adjust the amp controls. This is a great problem solver for any rig that needs to control the input level to the amp and it does it at a bare bones price.I have owned several Behringer pedals for live work and have some Behringer rack gear in my live audio rack and in my home studio. I gig reguarly once to twice a week faithfully. I have never broken or had a problem with any of my Behrinnger gear (including a pair of Behringer 12\" powered speakers mixed with a pair of Mackie 15\" powered mains). I don't intentionally abuse my gear but at 2:00 when your packing up s*** happens but so far my Behringer stuff has never let me down yet and I have had some it for many years. I also keep reading about people worrying about the hard plastic cases on Behringer pedals. Don't worry about it. They are sturdy enough. (Just watch out if you are changing the battery on a dark stage. The battery goes under the pedal switch and the spring that is under the foot switch will probbaly fall out if you are not careful. (To open the battery compartment/foot switch cover just use a pen or small phillips style jewelers screwdriver and push in the black pins on either side of the pedal.)", "id": 382}, {"review": "I own two of these Behringer boxes (they come in two modals) and use them with Sonor/cakewalk and an internal software sound modual (Roland Virtual sound Canvas) to play back midi files with my live two piece band. The sound through the PA (Soundcraft mixer and Mackie active speakers) is loud and very clear, in most cases, no eq needed. I guess it really revolves around your personal needs. For live performance these Behringer boxes are excellent and the price is a steal. I do not use it to record as my home recording is done on a stand alone DAW (Tascam 2488 24 track).If you are a live musician or a DJ using something like Virtual DJ these boxes are a great way to eliminate low level hum from a laptop and give you a dramtically better sound than most internal laptop sound cards.", "id": 384}, {"review": "For years I was lugging around a large rack case with my Mackie board and a host of rack effects (reverb, delay, compressors etc.). While using the rack I had a line from my programmable guitar effects pedal (Boss) that went to a rack compressor then out to my little Vox amp (the internal compressor in my Boss ME-30 pedal was terrible). I was very happy with this set up for about 10 years but about a year ago I stopped using the rack (smaller clubs and places with too many stairs). Since then I went to a smaller PA (Soundcraft Gigarac and some active Mackie speakers)and started using that terrible compressor in the otherwise decent Boss pedal. A few months ago I took out my old box of effects pedals and built a small pedal board. This worked great but I couldn't locate my old Ibanez CS9 compressor and years ago I know gave away my MXR. I needed a compressor pedal for my new pedal board that worked as well as the Alesis.Seems like I found a winner. This MXR clone from Behringer seems to work as well if not better than the MXR and is much quieter. Some people have mentioned a slight bump on the upper mids of the compressed signal (and I agree that it is there) but it's not hiss or added noise and I like the sound. My main guitar is a mid 90's Epiphone Sheriton and it sounds great through the Behringer DC9. I can't comment of the durability because I haven't had it that long but the case is metal and everything feels solid. I don't crank up the compression too much and I leave the pedal on about 90% of the time to control the overall signal from my pedal board (My pedals in order: Ibanez TS9, Ibanez Super Tube (a 1984 pedal that was made between the TS9 and TS10) a cheap chorus pedal, Ibanez DE7 delay into a Behringer DR600 Reverb.)For $24.00 this compressor does just what it's supposed to do. It's a two knob \"sqeezer\" just like old MXR and just works. (No need to worry about compression ratios, thresholds, release points or attack settings). Two knobs: one to set the overall compression and one to adjust the output volume. Great simple pedal clean sound.Update: I have had this pedal now for about 1 1/2 years. I notice one reviewer said that the bass sound dropped out on his guitar signal with this pedal. I have to admit that this is true. It's not a huge drop in the bottom end tone but it is noticeable. This pedal is not something that I would use too heavily, it does a nice job compressing peaks and overall range and gives you a nice smooth sound. If you are looking for a guitar pedal to \"sustain\" the sound you may want to look at other pedals. This is just a basic compressor not a true \"sustainer\" and at high levels it will probably make you sound very \"thin\" as the compression ratio gets above 3.5-4.0 or higher. On the other hand most stomp pedal compressors under $80-100.00 will do pretty much the same thing. My Alesis rack compressor will knock the punch out of a signal at high levels also. The sound is clean but it's best used for a little compression, not the huge amounts needed to call it a \"sustainer\". Try the Behringer CS400 for more sustain.", "id": 454}, {"review": "I am a bit surprised by some of the negative reviews about this product. I have been playing professionaly for more than 35 years and in that time have gone through many amps, guitars and and dozens of effects of all sorts. The great ones I have kept over the years (Ibanez TS9 and TS 10, MXR Compressor etc.) and have put them in a small pedal rack that doesn't take up much stage room. The one item that I didn't have in a pedal form was a good reverb. I have had great success with other Behringer rack products (Digital Reverb/echo, EQ's, patch panels and other home studio stuff). The DR600 was my first Behringer pedal. I think it works great. I have had it for about 6 months and have used it almost every weekend since I got it to play jobs with my band (often several nights a week). It has given me no problem. I can't speak to the battery issue since my pedal board is powered by a \"One Spot\" multi AC adapter.", "id": 545}, {"review": "I bought this stand after trying two others that didn't work well. This one is very adjustable and stays put. I use this in my home studio and I can place it so it comes up right under my mic boom just off to the side of microphone so when you are doing a vocal you don't have to look down or move you head away from the mic. I'll be buying two more.", "id": 592}, {"review": "What more can you ask for at roughly $25.00. This is a very useful guitar compressor. It is a simple compressor, that's it. Easy to understand with responsive controls.I use compressors quite a lot. In my PA rack I have a Yamaha rack compressor and an Alesis rack compressor. In my home studio there are compressors in my 24 track DAW and in my computer I have the T-Racks Deluxe mastering software with several VST classic analog compressors like the Pultec as well as VST optical compressors. I only mention these as a way of saying that I am very familiar with compressors and adept at using them. I have a pretty thorough understanding of compression ratios,attack and release points and I have learned to use them sparringly and with care. The Behringer CS400 does a good job as a straight guitar compressor. It is usefull for taming levels from your guitar and boosting your signal which adds punch to the signal presented to your other effects and ultimately to your amp. In recording circles you often hear good engineers say that if they can hear the compressor working, it's not being used correctly. The Behringer CS400 is quiet, almost transparent (unlike the Behringer DC9 I discuss below). Yes, it is plastic but it's fairly well made and unless you are really rough on equipment with a little care it should last a few years. If you are putting it into a pedal board it should last a long time.If money is not a concern go ahead and spend more on a rugged pedal made of metal but expect to pay somewhere around $75-$100.00 and up (Keeley,MXR, Digitech, etc.) Unless you go over $100.00 I don't think there will be a difference in performance and even then it will be subtle. If your signal path aready has hum and static, this pedal will not change that and actually may increase it because that's what compressors do-lower high signals and bring up lower signals for a more uniform sound. If you want to just smooth out your peaks and tighten up your sound with more punch, this little Behringer CS400 will do it.(Behringer also makes another compressor pedal in the same price range the Behringer DC9. It is all metal and attempts to clone the classic MXR pedal. I personally would stay away from this pedal for live use. I bought one and found that although it gives you great sustain it also colors your tone and seems to attenuate your low end quite a bit on the higher compession ratios you need for long sustain. You can dial in more low end on your amp but if you expect to turn the compressor on and off on different songs you will hear a tone difference. I don't use the DC9 when I play live but I like it on my guitar when I record using my VOX VT30 amp. I like it better than the built in compressor on the VT30).", "id": 645}, {"review": "I play 1-2 nights a week in a midi-assisted duo. Our PA is a pair of Mackie 15\" Thumps (powered) on the floor and Behringer 12\" B212D (powered) on stands with a Mackie board. We adjust the PA to the room by adding or reducing the number of powered speakers. In larger rooms we have a regular pair of floor monitors but in smaller rooms where you are stuck in a corner between the coat rack and the waiters station (you know the spot where they generously removed two small tables) we don't have space for floor monitors. These smaller jobs have become much more common and I needed a compact yet powerful monitor. Since we work with midi sound modules to reproduce the drums, bass and assorted extra instuments, it is very important that we hear these sounds clearly. The Behringer monitors do the job well. The overall sound is clean and clear, the speakers are light and portable and for me the boom stand adapter works well. I compared the Behringers to their \"clone\" the Mackie SRM 150 and frankly I couldn't hear a major difference with my MP3 player playing through them. Obviously Behringer cloned the Mackie's and did a good job. They have all of the same inputs and outputs as the Mackie's and look almost exactly the same. I have owned a pair of Behringer B21D powered speakers for about three years now and they have been knocked over and mistreated (accidentally) and still work great every night so I am a fan of Behringer gear. In the end the real difference was the price. The Behringer's go for $150.00 while the Mackie's go for about $250.00. The choice was simple; since I couldn't hear (or see) a major difference I bought the Behringer's. I have only had them for about two months but I have been pleased so far.Update: It has been a couple of months more since I started using these monitors and have even purchased an additional one. I still love the sound and all of the other things I posted above but: forget about the boom stand adapter. It is very difficult to get lined up so the mic is facing you and because of the angle of the monitor itself which is not adjustable the boom will not stay in place. I am using a good quality telescoping mini boom that is not very big or heavy at all but it will not stay up. Save yourself the headaches and just carry another mic stand. Other than that these are great monitors.", "id": 654}, {"review": "I have used Fender Thin 351 picks for 40 years but always in either solid black or swirl brown. These picks are great because when you drop them on stage or in a dark club you can find them easily.", "id": 332}, {"review": "This liitle box works great for my needs. I am using three guitars on stage (When possible/room permitting.)and use this mixer to combine all three into one output to my amp. This way I can leave all three guitars plugged in and not have to take time between songs changing cords and such. It also solves a second problem: since the pick ups on each guitar have a different outputs (Fender single coils, Ibanez acoustic with Fishman piezo and Les Paul Gibson Humbuckers), I now have volume controls that make the overall volumes match. This is perfect for that. Inexpensive unit that is made of brushed aluminum and is quiet and adds a little boost to the signal that I velcro to my small pedal board..I'm glad someone else mentioned the A/C plug on theirs being European standard and not 110 volt US standard. Don't be surprised if it happens to you. I bought one and had the same experience. I got mine from Musicians Friend. They offered to have me return it but I chose to keep it since I had a 12 volt power supply available from an older unit I long since stopped using. No stars deducted since it was not the manufacturers fault that my supplier didn't check their inventory to make sure it was US standard.", "id": 374}, {"review": "I own three of these units (one Red 222 and two Grey 202)and use them to output midi sounds from my laptops internal sound moduals to a pro PA system (mostly Mackie gear) for live performance and occasionally to add sounds to recordings in my 24 track home studio. This unit is quiet and very handy. The price is dead cheap. I have two other similar units (a Lexicon Alpha and the smaller Lexicon Omega boxes)that cost much more. Yes my Lexicon boxes provide a lot of different inputs and outputs and are very nice but if all you need is a very portable basic input/output sound card that is very quiet and easy to install (just plug it), you should buy this box.Some of the reviews talk about it being \"cheap\" plastic. Yes it is plastic (so are many other more expensive units) but I have been throwing these boxes in with my other equipment and have yet to break one of them or have any problems. I will also admit that while I don't abuse my equipment on purpose, I am not that gentle either and have dropped these several times with no damage.The software that comes with the 222 package is good, but in my case I really didn't need it. I have Sonor/Cakewalk software and Abobe Audition but I would like to take a moment and say something about the included Audacity. One reviewer wrote that it is a \"very low,low.low\" quality software. That couldn't be further from the truth. I have used this software for years in my studio and it is very high quality software. It can work in both 16 and 24 bit processing, and input and output almost every type of audio format (.wav, MP3, etc.). It also has a ton of very nice free downloads (compressors, EQ's, sonic enhancers etc.)from the Audacity web site. Audacity started life as a shareware but was purchased by Sound Forge who was in turn bought by Sony. This is high quality studio software that you can still download and use for free and it's not a trial software that will expire in 30 days or block out important features. I would add that to really make it work well you need to use the preferences section to set it up to the higher quality settings that are available. As I remember the defaults are set at mid level quality so the average home user can use it without taxing their computer resources.The bottom line is that both Behringer units (202 and 222) both work great and I can't hear or see any difference in them other than the color and the added software included with the 222 package. For such a low price you can't go wrong.", "id": 597}]