[{"review": "I always keep a lot of these on hand.  These are the only picks I use when playing my acoustic guitars (strumming style & vocals).  Since I play for several hours nearly every day I have a tendency to go through a lot of picks.  These definitely last longer for me than other brands (similar weight) that I have used.  For example, I can &#34;round-off&#34; the end off a Musician's Gear pick or a Fender pick in about an hour or so of playing and seem to get much more mileage out of these picks.  The weight is great for my style of playing.  They seem more durable than other brands.  They're inexpensive and since I play a lot of hours I always keep lots of these on hand.  I love 'em, use them daily, and rely on them !!!", "id": 61}, {"review": "As musicians, sometimes we find just the right sound or feel with a piece of equipment and it changes everything taking our performance to a new level.  For me it happened when I found just the right sound & feel from my Taylor acoustic guitar, the right vocal mics, the right mixer, my Bose L1 Model II, etc.Today I had one of those finds. After years of being somewhat dissatisfied with every capo I've encountered I discovered the perfect capo for me: the G7th Performance Capo.  I'm not kidding - it was one of those finds.  As an acoustic guitar player / vocalist, obviously, I have to play all of my songs in the right key for an optimum vocal performance.  This means occasionally relying on a capo to get just the right key with just the right chord shape/structure.  Unfortunately, some of my songs had \"weak\" spots (sending them to my \"B\" list) courtesy of the combination of a \"weaker\" chord for me (due to physical limitations) & the reduced sustain & tonal quality resulting from using a capo.  This dissatisfaction has had me on a \"capo quest\" which ended today when I found the G7th Performance Capo.The first thing I noticed when I used the G7th was the improved sustain over every other capo I've used.  All of those \"weak\" spots in my songs totally disappeared.  I quickly dusted off several songs that were on my \"B\" list & found the improved sustain & tonal quality allowed me to move them to my \"A\" list.I have no problem with the weight of this capo (others have pointed out that it is heavier) I can't detect any change in balance when handling my guitar (I play sitting on a guitar stool with the guitar resting on my leg - perhaps someone standing using a guitar strap might notice a slight difference in the balance.)  I love the \"self-ratcheting\" feature of the G7th.  I thought from some reviews & videos I watched that I'd have to pinch-down on the open end fairly firmly for a secure hold - this was NOT the case.  I think the G7th has just the right width & density of foam under the top bar:  a) providing more \"friction\" to hold this capo in place;  b) playing a role in very effectively dampening the strings; & c) possibly being more gentle on the strings than a more narrow/harder foam or rubber top bar, thus having less impact on tuning.I did find one slight negative about this capo which I was able to quickly overcome.  The end of the top metal bar (on the open end of capo) is slightly more \"squared-off\" than the end of the bottom piece (which in contrast is rounded off).  It may be just the way I play some chords, but my hand was contacting that squared-off end of the top bar & was getting irritated - so I simply turned the capo around with the open end facing me (versus facing the floor) & the surfaces contacting my hand were far smoother - thus, zero  irritation.  This was nothing new to me - I have had to do this with other capos.Others have commented on the cost of this capo.  For me, the cost of this capo was nothing compared to the many thousands of dollars I've spent finding just the right guitars, PA's, mics, & other equipment / accessories.  I almost can't believe it only cost me $40 to make such a difference in my sound. The G7th Performance Capo is priceless !!!Overall, I HIGHLY RECOMMEND this capo - if you're like me - this could be a very inexpensive way to take your performance to the next level !!!  I'm a strong believer in having back-ups for critical components so I will immediately purchase another G7th as a back-up (maybe I'll order the black or gold & use my silver one as the back-up).", "id": 266}, {"review": "I have been using this little amp very heavily for about a year now and highly recommend it.  The device is extremely compact taking up virtually no space sitting right next to my mixer, it does exactly what I expect & the sound is clean.  Works great - great price - meets my requirements perfectly.", "id": 376}, {"review": "I use several Behringer components in my set-up (e.g., my mixer, PA Speakers, effects, accessories, etc.) including this pedal.  I have confidence in the Behringer name and always feel like I'm getting a good solid piece of equipment that I can rely on.  This pedal is no exception - it's a sturdily built effects pedal that will give you exactly what you are looking for in a compressor pedal.  I don't like to depend on battery power for any critical components if I don't have to so I also purchased the Behringer PSU-SB Power Supply General Purpose DC 9V Power Adaptor available on Amazon along with this.  Great price, sturdily built, great compressor effect !!!", "id": 454}, {"review": "I always keep a lot of these on hand. These are the only picks I use when playing my acoustic guitars (strumming style & vocals). Since I play for several hours nearly every day I have a tendency to go through a lot of picks. These definitely last longer for me than other brands (similar weight) that I have used. For example, I can &#34;round-off&#34; the end off a Musician's Gear pick or a Fender pick in about an hour or so of playing and seem to get much more mileage out of these picks. The weight is great for my style of playing. They seem more durable than other brands. They're inexpensive and since I play a lot of hours I always keep lots of these on hand. I love 'em, use them daily, and rely on them !!!", "id": 455}, {"review": "I actually own an even dozen of these.  I've never had any issues with them marring the finish on my acoustic guitars.  They work great & you can't beat the price.  I think I paid around $4.95 for most of the ones I purchased.  Although these are great & I will continue to use them as needed (e.g., when playing), I just replaced these today with Swing String Wall Hangers.  I freed-up so much of my floor space by moving 12 guitars to the wall that I was actually excited about all the free space!!!", "id": 519}, {"review": "Use this on my Taylor acoustic-electric which does not have a built in tuner.  Love it - it hides very nicely on the headstock - your audience won't even see it.  What else can I say - it's accurate, it works, it clamps on really neatly & securely, it's a great price, it has not marred the finish on my Taylor's headstock in any way, etc....  I'd recommend for all your guitars which do not already include a built-in tuner.  Would definitely buy again !!!These are so cool that everyone should have at least one of these even if you don't need one  :)  !!!", "id": 785}, {"review": "I just finished installing 12 of these and couldn't be any happier with the product.  It is a sturdily built product with EVERYTHING you need for installation.  I didn't think this was possible, but I actually found a product MADE IN THE USA !!!  I will definitely buy more of these as my guitar collection grows.I did NOT have the mis-matching color issue that others commented on - all I did was contact the seller (in my case Brook Mays Music) and ask if it was at all possible for them to closely match these since all 12 are going on the same wall.  They were extrememly responsive, even sending two emails concerning my request (basically saying they would do their best - but no promises).  Well, Brook Mays came through for me & I received (very quickly I might add) 12 of these that matched perfectly !!!  I will definitely go out of my way to use this seller again.Another great experience purchasing items through the Amazon site !!!", "id": 166}, {"review": "Anyone who plays a lot know that strings are very much a personal thing.  The tonal qualities, weight, feel, materials and all other qualities / variables combine to make strings your very own personal favorite.  For me these strings bring it all together and are my string of choice for all 12 acoustic electrics I use to play what I consider rock ballads using my strumming-style of play.I love the feel and tone of these strings for my style of play and my equipment set-up.  I do have some issues with these strings, but overall, I'm willing to put up with the issues for the overall performance I get from the EJ26 strings.  The issues include what I think may be premature breakage.  I do not play &#34;hard&#34;, I play long (playing several hours daily), but I play rock ballads using a somewhat softer strumming style.  (I definitely do not &#34;pound&#34; on the strings - I like to think of it as fairly &#34;gentle&#34; strumming.)  Yet, I seem to manage to break the high E & B strings on a regular basis (by playing, not by over tuning).  Some of this can be expected, but what bothers me is the frequency with which I'm breaking G strings.  I simply don't think these wound G's should be breaking at all with my style of playing.  I've noticed that the current &#34;most helpful critical review&#34; mentions this same problem.  I change strings frequently so I don't think this is the reason they are breaking.Overall, I am willing to put-up with what I believe to be some premature breakage (especially with the G string), for the other qualities that draw me to the EJ26 strings.  They sound great for my style of play, equipment, and set-up.  They feel great.  I love 'em and will continue to buy quantities of them for my 12 acoustic electrics.  I just wish I had a better feeling about the premature breakage.", "id": 198}, {"review": "How much can you say about a little piece of rubber that sticks on your mic stand???  First, it a great price - about the same as a Big Mac (LOL).  Second, it fits great & does exactly what it's supposed to do.  Third, now that I use a pick holder I wonder why I never did so before.I do have a tendency to break, drop or even wear-out picks when playing and this handy little device reduces the imnpact of this tendency.  I have some solid / heavier weighted stands that \"stand-up\" to a quick grab of a pick from this holder.  But when using one of my cheaper /lighter tripod-style stands I make sure I'm careful to lightly or barely insert the picks into the holder so I don't pull the whole stand down when extracting a pick.Great product - \"couldn't live without it\" (LOL), and it's NOT the manufacturer's fault I have some cheap light-weight stands....  If you're looking for a pick holder I can't think of any reason not to try this one.", "id": 210}, {"review": "Works great - keeps all my fretboards looking great.  Even though I change strings frequently on my twelve (12) acoustic electric guitars this bottle will last forever.  I play hard for several hours almost every day and I'm always amazed at the &#34;crud&#34; that accumulates on the fretboards. (Guess I'll have to stop eating Cheetos while I'm playing - just kidding...) This oil breaks down the &#34;crud&#34; and restores the look of the fretboard to new condition.  No issues / no problems only positive things to say about the oil...", "id": 234}, {"review": "These cords work great and helped me (finally) clean up a mess of longer cords running between various voice processors and mixer.  The set-up went from a mess of eight neatly wrapped 6 ft cords to these 1 footers.  Looks great.  Cords are sturdy - I haven't had nor do I foresee any issues with them.  Would definitely buy again.", "id": 662}]