[{"review": "I don't like the feel or sound of these strings.  I bought both the .010 and the .011 and they both hurt my fingers and sound like tin foil.  I would not buy these again", "id": 90}, {"review": "I bought a case of these.  I can't handle #12 strings and the sound of #10 is terrible.  I prefer #12 strings for finger picking but they hurt my hands.  not the fingers but the hand and wrists, so .011 strings are what I use.  I am not sure if they get dirty and get corrosion but they are my main strings and I love the low price too!!", "id": 199}, {"review": "they don't cost a lot and they work well.  They are inexpensive and they work.  I have purchased 5 of these for my guitars and they are nice", "id": 282}, {"review": "they are cheap to buy and they are nice straps for an acoustic.  I am not sure how they would feel on a heavy electric", "id": 285}, {"review": "I AM SELF TAUGHT GUITAR FOR ABOUT 15 MONTHS.  WITHOUT THIS I WOULD BE LOST.  I WORK WITH A GUY WHO HAS PLAYED GUITAR FOR 30 YEARS.  HE TUNES IT TO ITSELF .  WHEN I HAD HIM TRY MY TUNER HE FOUND THAT HIS GUITAR WAS TUNED TO ITSELF YET SO FAR  OFF.  FOR $15 YOU CANT BEAT THIS.  DON'T BE SO CHEAP. BUY THIS AND ENJOY IT!", "id": 331}, {"review": "I normally buy D'Addario Strings here. I buy the .011 or .012 strings.  This is my first time playing Ernie Ball since I first began learning.  When I first started on guitar I put .009 electric Ernie Ball on my acoustic so I could handle the pain and keep learning.  Then I went to D'Addario strings.  I wanted to try these since the under $5 price is good.They sound nice.  They don't sound as crisp as the D'Addario strings. They sound more mellow and not as BOLD.  They are 80/20 and I prefer those to the other strings out there.  I can't say I love them or I hate them.  I will probably stick with D'Addario since I don't find any difference in them.  I bought some other Ernie Ball strings on Amazon that I will try soon. For the price I would buy these strings at least once to test out and see how you feel about them.  I don't think they sound bad and if they do, it did not cost much to test them.  enjoy", "id": 237}, {"review": "I JUST BOUGHT A NEW GUITAR AND WILL BE BUYING ANOTHER ONE OF THESE.  THE PRICE IS GREAT AND IT WORKS!  VERY HAPPY WITH THIS STAND", "id": 625}]