[{"review": "This is an excellent-sounding pickup.  I've had it for about six years.  Good sound throughout the spectrum - full lows and bright highs, without too much emphasis on either.  At the price it sells for, I consider it a bargain.The drawbacks:1) You need to be pay attention when installing and removing - you can damage the sound hole on your guitar if you're not careful.2) No volume control.If you're looking to occasionally amplify an acoustic guitar, this is a great, cost-effective way to go.", "id": 129}, {"review": "There's nothing not to like about this capo.  I have two of them.  I've played guitar for over 40 years and have used other types of capos.  I like this one's low profile and the fact that you provide the pressure to the fretboard (by turning a knob to tighten it) rather than rely on a spring, as on the clip-on type. It takes a few seconds longer to install than the clip-on type, but I like the results better.", "id": 304}, {"review": "For the money, this one's a no-brainer.  It's a one-trick pony, but that's what it's supposed to be, and it does its trick very well.  Sounds better than the Ibanez or Boss models - warmer and less processed-sounding.  Plugged into a solid-state amp, at its lowest drive setting, it sounds like you're playing clean through a tube amp.  Plugged into my '65 Twin Reverb (not a re-issue, but the real thing)- WOW!I just got it a couple of weeks ago, but it looks like it will hold up to gigging without a problem. Don't be a 'gear snob' who looks down on lesser-expensive products - the sound is what matters.", "id": 381}, {"review": "If you want to use this to power up a Tascam DR series digital recorder, I have a less expensive solution for you:  if you own a usb wall charger (like a cell phone charger), you can use that to power your device through its usb port. That's a lot cheaper than spending twenty-something dollars on an additional wall wart!", "id": 461}, {"review": "I agree with the others - I've been using Fast Fret for over 20 years (and Finger Ease spray for over 40), but I believe Slick is a better product.  I give it just 4 stars, though, due to its design. The wiping cloth that comes with Slick is meant to fit in a small plastic ziplock bag inside the cap, but it's difficult to get the cloth back inside the small bag, and it's bulky inside the cap, making it a little difficult to close with the cloth inside the cap. It would be easier to close if the cap side was deeper; the way it's designed now, the cap and the applicator are equally sized, when they needn't be. That's a small gripe, though - if I could give it 4-1/2 stars (with half a star off for the design), I would - it's great stuff.", "id": 730}, {"review": "I lost a recording/rehearsal space I shared with some musician friends when it burned down from an electrical fire during 'superstorm' Sandy late last year.  A total loss - and we had no insurance (we sure learned our lesson).So, we rented a new space (this time it's nowhere near the shore) and we are re-building.  We're starting from scratch, and little odds and ends like guitar hangers add up after a while (it's bad enough we had a number of instruments, amps, and other equipment to replace).  So if we can save a few bucks here and there, it helps.I bought one of these hangers to see if they were any good. After I tried it and it worked fine, I went back and bought another 9 of them.  We have guitars, basses, ukeleles and mandolins hanging from them - they work on all sizes.  We use those wide-threaded sheetrock anchors to screw them into the wall.  Like I said, they're nothing fancy, but they get the job done!", "id": 779}, {"review": "For a cheap tuner, this one is pretty good - it's about as accurate as the Snark, and not as delicate (the ball joint on the Snark makes it prone to breakage if you're not careful packing it in a case or gigbag).The display is large and bright.  I wouldn't use it to intonate an instrument, but for quick knockaround tuning, it's fine.", "id": 799}, {"review": "It does the job. It's bulky but it works well. It comes with an extra set of holders for thicker tablets (or to use the tablet while still in the case).", "id": 831}, {"review": "The thickness of the pick you use is a matter of personal preference. For my style, the .60 Dunlop Tortex is perfect.  The surface is matte and not too slick.  I don't think I have ever worn one down to being unusable; they seem to last forever (or until they're lost).  I've tried other brands and picks made of other materials, but I always come back to these. I'll probably be buried with one in my hand!", "id": 61}, {"review": "It's just unbelievable how well this device holds picks.  I mean, you just insert your guitar picks in this device and BAM - it holds them!  No further action is necessary! And when you need a pick - you just pull one out, and there it is!What will they think of next?", "id": 167}, {"review": "These Planet Waves locking straps work very well on most guitars with standard-size strap pins.  Once locked, they're not going anywhere.  What you need to be careful about is that you have to use some common sense - the locking end, once fastened, can act as a lever to pull the pin out of the guitar if pressure is put on it a certain way.  For this reason, you would want to be careful when using it on acoustic, hollow, or semi-hollow guitars.  And I certainly wouldn't keep this strap on a guitar when it's going to be carried in a gig bag.  Keeping this in mind, these straps are an efficient, inexpensive way to be sure your guitar won't break loose of its strap.", "id": 208}, {"review": "I've played guitars for over 40 years, and I've owned or used many, many tuners - stompbox, rack-mount, etc.  This is a great tuner. I bought a clip-on tuner about 10 years ago when they were first becoming popular.  It was ok - fairly accurate, very convenient, but it's sensitivity would make it difficult to tune the low E.  This Snark is much better.  I compared it to my Boss TU-2 (which is the standard stompbox tuner of gigging musicians), and it's just about as accurate.  The fact that it's chromatic means you can tune to any note, which is useful for non-standard tunings. It even has a built-in mic for situations where you can't clip it on (say, for a lap-steel guitar).  The head swivels to just about any position, and its sensitivity allows you to tune in live situations when other instruments are playing.  The only reason I give it 4 stars rather than 5 is that because of its curved \"arm\" it's a little awkward to pack for traveling - if you were to cram it into a space and there was some pressure on it I could see the arm possibly breaking off from the spring part. So, to me, outside of that (and the fact that it only comes in red so far), it's perfect.", "id": 707}]