[{"review": "I know that you can easily change strings without paying for a tool to help you out, but honestly this thing is worth every penny. It cuts your changing time down drastically. You don't really know how convenient it is to have the peg puller, winder, and wire cutter all in a little tool until you actually have them all in a little tool. Not to mention, it's very rigid and it certainly seems like it'll hold up for years to come!", "id": 94}, {"review": "It's a little harder to open than other capos I've used, but it works perfectly once you get used to the toughness of it. It's not cheap and flimsy, though! I don't see this one wearing down anytime soon! Now stop reading this review and buy this capo! You wont regret it!", "id": 116}, {"review": "It's actually sleek looking and although I didn't have the nerve to actually stick this to my guitar, it's a lot easier to find this in my guitar bag or even in my room than a few stray picks here and there. It holds about 8 medium size picks for me and I'm sure I'll lose a lot less picks because of it! It's almost kind of fun putting my pick in this thing..is that weird to say? Just buy it already!", "id": 167}, {"review": "I'm going to be honest, I have a cheap guitar. I payed $120 for an Epiphone at my local music store because I just play it recreationally. (Bonfires, sitting around the house, etc..) So I've never really put a nice set of strings on it because I figured strings aren't really going to make THAT much of a sound difference on this guitar, but I was way way way wrong! These strings aren't even that expensive, actually they're only a few more dollars than the usual cheap strings I put on my guitar. Yet, they completely  changed the sound of my guitar and it sounds like I forked over some money for a decent guitar! The strings are high quality and they feel so smooth under my fingertips! I used to play once or twice a week, but I can't help but want to play every single day just to hear these things sing!", "id": 198}, {"review": "They're my favorite picks and I always buy the medium ones! I'm sure other picks works just fine, but these are always my preference.", "id": 574}, {"review": "I sometimes see reviews as redundant and unnecessary and I see a lot of positive reviews for this guitar strap, but I don't know why. Maybe other people don't really care what kind of strap they have or maybe they just have never had a good strap before. It wasn't too hard to get on and only took a couple of seconds, but once I got it on it was stiff and felt odd. It was very uncomfortable around my neck and I took it off my guitar in a matter of matters. I would honestly recommend spending a few extra dollars on a more expensive and more comfortable strap. Unless you're just going for something that is inexpensive, does the job, and isn't designed for comfort.", "id": 776}]