[{"review": "I love these strings and the price too since I like to change them every time I do a modification to my guitars. Every couple months I change something making \"Upgrades\". They sound Great and stay in tune well.", "id": 156}, {"review": "I do like these strings. Had a few packs of these from Christmas. Opened up one recently and the .009 string or 1st string \"Was Not\" in there. Next time I'm gonna have to open up the package to make sure they're all in there, should measure them too. Didn't open them to keep them sealed until I was ready to use them, no more.", "id": 227}, {"review": "Now all I have to do is install these on my Burswood Strat Copy. I know I'm gonna have to drill holes for the locating pins I may even have to drill the tuner holes also. Look forward to getting those crappy, loose, un-smooth, original hardware tuners off this thing.July 20, 2012:Just installed these Fender locking tuners on my Strat. Didn't have to drill the tuner holes, they were the perfect size. Placed all the tuners in the headstock lined them up with a straight edge and just pressed each tuner very firmly into their hole (with the locking part screwed in tight so as not to damage them) and  very lightly and carefully tapped them with a small rubber mallet to mark my drill points. Then with a small magnifying glass and using a punch I made a center punch mark (just using pressure by hand with the punch since wood is soft) on each indent that the tuner made. Set my drill depth with a piece of tape on the drill and was done in less than 15 minutes.", "id": 387}, {"review": "I've had this Amp for 5 years and it still works and looks great. Took a while for me to learn all the things that the Jam can do since I was new to the world of electric guitars and amps when I received it. Crank this baby up and it moves air. I've used all the in's and out's with no problems. My rig consists of an Ibanez AS73, Schecter Devil Custom 2008, Line 6 HD500, and an AKG Perception 420 thru a Line 6 UX2. Finally, I only play at home so this gear doesn't get banged up from gigging.I agree here> (As B. Russell said: The only downside I can mention is that this amp may not be for the technically challenged. There are a lot of features on this amp, but you need to learn how to use them. The common features are easy to use, but if you want to dig in and start really taking advantage of the amp, you will need to invest some time into it. Since I'm not scared of playing around in menus and reading the manual, this amp fits me well.)", "id": 466}, {"review": "You'll see much controversy about this device if you read the line 6 forum. My own opinion about this is \"I Love it\". I play the guitar privately (not live in public) and I have no complaints at all. I still use it all the time and learn something new everyday.", "id": 700}]