[{"review": "This pedal is outstanding for the price.  The feel is great and it doesn't move at all when you put it down on the floor.  The only thing I disliked was that it doesn't support \"half dampening\" like most of the higher end pedals around this price range.I got this for Christmas of 2007 and it is still going strong used every day in my recording studio.Great product", "id": 251}, {"review": "Dont use the cheap fog liquid as it smells bad and gums up the system if you leave it in too long.I got this last year for a small party and had the smoke alarm going off in my basement within seconds.  This beast puts out lots of fog and does a nice job.It does get hot and drips at the front if you spray for too long but it does do what it's supposed to.  Also note that the cap on the machine doesn't seal well and will drip if you angle the unit too much.Keep it away from walls and floors as the oil will collect on them and leave you with a mess to clean up later.  It's best on a stand 3-4 feet off the ground.Overall build quality is very nice.  Metal case, compact, nice bracket, lighted remote telling you when it's ready.The threads on the tank are plastic as is the cap and can be damaged if you cross thread which is quite easy...", "id": 256}, {"review": "I picked this up for a friend who has the AudioTechnica AT2020 USB and Yes this does work with that mic too.  It's solid, helps with mounting, and will be well used.", "id": 393}, {"review": "This could be a great mic and is similar to the Shure SM58.  But I've found that most of these pyle pro audio products tend to have a much higher signal to noise ratio..even plugged into my best preamps in studio.  Spend more money, get some quality mics.  These are only good for garage practice on a budget.", "id": 690}, {"review": "I got this cable to run to my electronic drum set at the other end of the studio as a previous cable failed on me.  The balanced lead works well and the cable is very quiet.  Construction features too well soldered TRS 1/4&#34; male connections and the only downside I can complain about is the lack of strain relief...but nothing major and the cables work fine none the less.", "id": 745}, {"review": "This was something I HAD to pick up, simply due to the price.  I own a Shure SM57 and compared to this, the sound is very close, not dead on, but I'd consider this over other mics for someone on a budget.The  top does not spin like the Shure and the weight is much lighter due to the material used to cut cost I'm sure, but none the less, it makes no difference sound wise.Overall, a great buy!", "id": 777}, {"review": "If you have a better mic, you can plug that into the transmitter as it's a simple mini jack (1/8&#34;) and that helps this sound wise quite a bit!  I will say range is not great, it won't go 500 feet like my expensive Sennheiser kit but this will go about 30 feet line of sight before  cutting out.Note it's VHF, not UHF so it is more prone to interference.I find the transmitters' to be cheap and the battery cover does not fit all that well.  I also wish it was an XLR connection.  A lock on the plug to the transmitter would also have been nice and note the clip and all that is plastic so don't toss this around or it WILL break.For general use in doors, it's decent and for sure worth the price...but if you're looking for something clear, you should look to spend at least $500 on a wireless lapel or handheld system.", "id": 267}, {"review": "This little mixer is handy to have around for small headphone mixes and such, but don't expect it to last forever as is typical with Behringer products. At least it's cheap though!  I just wish it had a power switch...", "id": 367}]