[{"review": "We ordered one, it worked so nicely, we ordered 2 more.  You can adjust the tension precisely to fit your guitar, and minimize string stress and de-tuning each time you move your capo.  Very nice product.", "id": 304}, {"review": "Fast delivery, and exactly as advertised.  Put it to work making music within minutes.  The steel gives a clearer sound than the glass  bottle slides,  but you need both.  Good product.", "id": 340}, {"review": "Really a remarkable microphone for around $100.  Very sensitive . . . its for studio, not live performances.  Be sure to set your DAW insert on your input channel with a compressor/limiter, as you can easily blow through the volume into clipping.  Has a rich warm tone, like tube mics.  Compares to a Audio Tech 2020, not in the class of say an Audio Tech 4040.  Can't beat it for the price.", "id": 371}, {"review": "Arrived fast, had them up and running in minutes.  It was easy to adjust my EQ on my laptop to produce awesome listening music, just beautiful, clear, nicely separated sound.  I wouldn't use these for high volume stuff, the sound is almost delicate, and very precise in its separation.  The classical musician's in our guild loved the sound, that should tell you something.  Stunning, really.  They are, in fact, exactly what they are advertised to be - top notch small room project studio monitors.  I readjusted my EQ for the needed flat response for sound engineering and I was extremely pleased with the results.  The sound you can get out of these is so varied that we needed to give our hearing time to adjust, as the flat studio mixing EQ sounded horrible at first, as it should!  I have been in and out of studios for 30 years and I can say, used appropriately, these are excellent near-field mixing monitors.  Take time to review the set up data from M-Audio, its good stuff, and don't ask these little beauties to be everything, just let them be what they were made to be . . . and enjoy!  We ended up re-mixing half a dozen acoustical songs off a recent project with these via Cubase 7 and the general consensus is that the mixes improved by 30%.", "id": 783}, {"review": "Delivery was Amazon fast, installation took all of 2 minutes and we were making music.  It has worked perfectly from the start and as continued without a flaw for the last 6 months, and we expect it to continue for years.  For the price you can't go wrong.  Mic sound is pristine, no noise, we use it for vocal recording in studio, run it off an M-Audio Mixer Keyboard which lacked Phantom power.  Top Recommendation.", "id": 485}, {"review": "This is not just a tuner - its a peacekeeper for our band.  Arguing over tuning can really take up time.  It works so good everyone in our acoustic string band is required to have one attached!  I do kind of miss the fights over who's in tune and who's flat, though.  Excellent product, though the metronome is of no value, but that's not important.  We use it for guitars, violins, violas, cello, bass guitar, voice training, and ordering pizza (who ever is out of tune pays the pizza bill).", "id": 818}]