[{"review": "Hello Musicfriends - This is built cheap but sounds great. Good controls too. For me in the studio/songwriting  its perfect but I would not exactly go on tour with it..... There is something about the knobs I still love, even if all my other digital units have a tremolo hidden in it... may be  the age thing...", "id": 24}, {"review": "Very playable right out of the Box and very beautiful. I have a Epiphone Swingster, Nighthawk and Violin Bass and they are all great products! I decided to give it a good set up. After the Strings were off I sanded down the Bridge 1-2 mm and adjusted the neck just a little. Then I want to really recommend Martin Bronze Strings light or extra light (green box) for an awesome sound and easy playability which is important on 12 Strings. Instructional videos can be viewed on YouTube before you go for it or you get a Guitar Tech to do it.Ps Matching Epiphone cases are available and so are inexpensive clip on pickups if you want to go thru an Amp or line in recording.Ps The Tuners are a bit to close to each other in my opinion. When you tune one string your fingers can rub against next tuner.", "id": 153}, {"review": "Musicfriends, This is a fab item - For 20.00 You can't go wrong on this. Warm distortion and good controls. For me great studio/recording use but thats it. I would certainly not tour with it... its built cheap w. plastic housing and one circuit board squeezed in and funny enough the one piece rugged metal... is the bottom plate. Hello designers.... Metal around top and plastic on the bottom if you must. But anyways, bottom line great unit for 20.00 and sounds good very versatile.", "id": 280}, {"review": "Excellent Sound quality.Very functional and easy to work with.Small enough to take along.It is my most used Gear in my life right now. I don't want anything else.", "id": 463}, {"review": "I love the performances and sound production quality of Celebration Day! The band's on fire and Jason Bonham did a incredible job. A must buy for the Zep fan I can highly recommend this.To rehearse that long for this one show it's a shame they could not consider another world tour or at least a few more concerts. With Jason doing so well it was possible I could easily imagine NY, SF, Rio, Paris, Rom, Tokyo etc", "id": 855}]