[{"review": "wanted it just on looks alone...It is a nice looking cord... I know it will perform...as for Sam Ash ...this cord was packed in a mailer inside another box with my Roc n Soc... his shipping team do great work..never any complaints from me... I love Sam Ash.. thanks Amazon", "id": 3}, {"review": "these are my preferred mics for practice and gigs... an all around tough mic....great for all your needs...I highly recommend them..", "id": 20}, {"review": "Nice padded seat, well constructed. good padding for comfort, I go 190lbs.  Heavy duty base, lots of adjustment if needed. love Amazon, why shop anywhere else?", "id": 139}, {"review": "I love it and there are a lot of bold type enhancements to my acoustic now.... the chicken picken' is much fun and I am still experimenting. AS with all digitech pedals,  I just seem to love their ease of operation.  the gain on this pedal without feedback is incredible....", "id": 186}, {"review": "no problem...it came today like the computer said it would... the box was mint...to my surprise there wasn't even any tape on it... I opened it ... pulled it from its plastic sleeve and set it up on about a minute it was holding a speaker cab...thanks again Amazon....and why would I shop any where else?", "id": 329}, {"review": "Always good to have a stationary MIc on the floor.  Sometimes it is weet nestled in a drum set or for a singer that might not want to play any instrument but just wants to stand tall... went together perfectly and I really wanted it...Shipping was fast and no problems... thanks", "id": 515}, {"review": "This pedal is super...tons of verb if you want it.... makes any amps built in verb obsolete after you plug into this.. I highly recommend digi stuff... I have this coupled with other pedals and a Jamman stereo and it is awesome...thanks.... love shopping through Amamzon", "id": 185}, {"review": "who cares if they were used or hanging around the warehouse hey they went together and don't show any wear and tear to me...love them...thanks", "id": 279}, {"review": "cords are cords but these are very nice, packaged great, good deal instant turnaround... easy, affordable, fast, why go out? Just go to Amazon. These guys did a super job getting them here fast.... they care about musicians.... we are a tough act to follow...right so look for accesories and cables/cords..etc...at orange County and Amazon...Thanks for caring guys...", "id": 692}]