[{"review": "As a freelancer, I occasionally work with a band that plays the Midwest, performing on a near-weekly basis.  These are seasoned veterans who have no interest in gear per se and even less interest in brand cachet.  It's all about money to them.  I couldn't believe it when I first saw the group using these Nady mics (even lower-priced several years ago) and insisting they were as good as Shure SM-57's and 58's.  I still don't believe the quality of workmanship compares (any casual empirical test of build quality will prove as much).  But these Nady's handle the announcing, the vocals, and, when needed, the softer sounding instruments (flute, harmonica), and none has broken or quit on my watch.I'm a keyboardist, so mic power and fidelity don't affect me.  I'm only a trifle mortified when there are musicians in the audience who catch on to how cheap we are when it comes to the all-important \"gear component.\"  At the same time, my embarrassment, I confess, is not unmixed with a bit of demonic glee.  After all, who's playing--and getting paid for it?", "id": 15}, {"review": "I started with the Shure PG58 and most recently acquired the Shure SM58.  I'd probably be all too ready to agree with those who argue that a Neumann or Telefunken mic costing 5 G's simply isn't that much better than a Nady mic costing 10 bucks.  But with respect to the Shure, I'm less sure that the SM58 isn't worth 40% more than the PG58.  Perhaps if you have a sufficiently high-powered and \"clean\" amplifier and have tweaked the EQ settings to favor the frequencies of the human voice, the two mics could be mistaken for one another.  It was my attempts to occasionally use an instrument amplifier as an emergency P.A. that led me to realize the PG58 sounded somewhat muted and dull compared to the SM58.  Switching to the more common, admittedly more expensive mic, gave me just the extra gain I needed along with added crispness and clarity to the voice (at least for announcements).P.S. I notice that the head of the PG58 is larger than that of the SM58.  Since the rise of the \"digital audio workstation\" (who doesn't have a computer with free, included Garage Band on it?), large, even gold-plated, expensive-looking but cheap mics are on display all over the place.  Despite appearances, when it comes to mics, size doesn't matter--except for appearances (directors of high school show bands will dispense those headsets that wrap half-way around the face, knowing that the girls in the front-line think they're cool--they look just like Madonna'a or Janet's headgear). Some of the best mics are tiny, with an opening the size of a pin-hole.", "id": 18}, {"review": "I made the mistake of thinking I could save forty bucks and get by with the Shure PG-58.  I'm no vocalist but occasionally need to do announcements or accommodate a guest vocalist through an instrument amp (rather than a P.A.). Whatever the reason, the PG-58 simply doesn't have sufficient gain or oomph to be of much use with the Roland Cube / Peavey amps I try to employ it with (I use a 1/4\" adapter with the XLR connector that comes with the mic).  When I borrow a Shure SM-58 mic from someone, the difference is instant and dramatic--it's a far more efficient (i.e. louder) mic, producing a full, clear sound, and without additional pre-amplification, demonstrating why it's the most popular microphone in the world.  For five bucks extra, I can't fathom a reason for avoiding the SM-58S, the version with an on-off switch.  It's a small price to pay for quick solutions to feedback or the unwanted pick-up of \"private\" comments by indiscreet band members.  And even if you're an instrumentalist, it may be wiser to select the SM-58 over the SM-57.  The former mic is a little more ostentatious, but it's also slightly more adaptable, and the screen can filter out a certain amount of wind noise and unwanted non-musical sounds. Above all, the SM-58 has proven itself to be the Sherman tank of microphones, simply unparalleled for ruggedness and durability.[I see a review cautioning the consumer to be wary of \"this seller.\"  Perhaps a good point unless it's in reference to Amazon Prime, which is the Shure SM-58 of commerce: competitive prices, no postage, easy returns.  But anyone who returns an SM58 probably had no business buying it in the first place.  They are the populous drones of the industry, invariably purchased by professionals who know first-hand what they're getting--reliability and virtual indestructibility.  In fact, it's the very popularity of the SM58 that has led to all of the slightly less or more expensive imitators.  Consumers require choice, but with the Shure SM58 there need be none.]", "id": 20}, {"review": "Frankly, I'd never heard of a \"pop filter\" until my popping p's and b's came into consciousness at the same time that this device popped into my field of view on an Amazon web page.  I'll bet that a couple of layers of women's nylon stockings would be just as effective, but this contraption pretty much purges your elocution of the offensive phonemes (they're called \"plosives\").  I'm still hearing the \"s\" phonemes (sibilants) along with some guttural artifacts (\"back\" vowels prefaced by an \"h\" that ignite a momentary gargling effect), but this filter doesn't purport to be able to do anything about those buggers.As for the price, after seeing the gooseneck, the base, the generous-sized screws, etc., I'm prepared to say that  this one is fairly valued (I doubt that the Shure or Blue pop filters, at almost double the price, offer anything more than brand-name status).  The hardware and build-quality are about as solid and heavy-duty as you could wish for.  (I know I'll never be able to blow it away.)  Unfortunately, the clamp seems designed to fit on a mic stand rather than a computer screen, which is almost a half-inch too thick.", "id": 134}, {"review": "I can't do more than underscore the endorsement of this mic by the previous reviewer (FOX).  If you haven't started in the mic-collecting business, trying every trendy dynamic and condenser mic in the hundred dollar range and below, you might actually save some bucks by cutting directly to the chase and going for this one.  I've always wondered why I can't reproduce the sounds of our local NPR outlet, and I finally realize it's because they have the Shure SM7B and I don't.It enhances the voice with depth and richness and filters out the pops and unwanted percussives (face it, those separate pop filters are cumbersome to use).  It's very directional and \"selective\" (rejecting room ambience and background noise), so it's perhaps not the ideal mic for all applications.  But for announcing, broadcasting, vocal performance and vocal recording, I don't see how anything could possibly equal let alone surpass it.", "id": 136}, {"review": "I left my trusty Manhasset behind on a job and was about to replace it when I came upon this alternative offered by Amazon.  As banged up as a Manhasset can get from week-end warriors like me who simply throw it on top of everything else in the backseat before the long ride home, I've never had one fail on me over the past 40+ years.  There's nothing on the stand that the user can even adjust, yet all of the moving parts always seem to retain just the right amount of tension, preventing 5-10 pound folders from lowering the top half or causing it to dip forward.  But the \"rub\" is their non-adaptability.  The feet on the base are permanently attached as is the upper tray holding the music.  Consequently, these ubiquitous, well-proven stands can sometimes be a challenge to pack in a crowded van or sedan, especially with a couple of keyboards, amps, instrument stands, and other requisite gear on board.This is where Amazon's On-Stage Music Stand becomes attractive (of course, it doesn't hurt that it costs less than a Manhasset).  It permits you to fold up the legs to a position parallel with the shaft as well as to completely remove the upper shelf that holds the music.  Consequently, it's much easier to find a convenient place--whether in the trunk or on the floor of the back seat--for packing the stand.  Simply \"slide\" it into position.The drawback--apart from durability issues that some reviewers have warned about (be careful not to over-tighten those set-screws!)--is that this thing is heavy.  Frankly, I was expecting a lightweight stand, at least compared to my old Manhasset, but if you've owned or been around the latter, the first thing you're likely to notice with the stand pictured here is a palpable, substantial addition in weight. At the same time, with the moving parts and the set screws (topped by plastic, rotating, serrated wheels), the On-Stage stand doesn't give me the same amount of confidence in its durability as did the Manhasset--in other words, I'm very less likely to become careless with it and simply toss it on top of the gear-pile after a long, exhausting 4-hour gig.Bottom line: the On-Stage appears to be a good value--a truly heavy-duty stand (in most respects) that'll do extremely well as a practice stand in a studio or living room and that packs up conveniently for traveling jobs.  But don't expect it to lighten your load or, simply because it's heavier, to last longer than a Manhasset.If you do a lot of traveling and don't plan to put one of those 1000-page piano folders on the stand, there's at least one truly lightweight (albeit plastic) stand that's worked out really well for me (perhaps needless to say, some haven't--they fall apart or they're so ingeniously designed that it takes 15 minutes simply to disassemble them and put them back in their unforgiving, pint-sized cases).  But the Peak stand is made to hold up (in turn, it holds up relatively heavy music books) and has served me well for several years (just as I was about to condemn the stand, I called the company, they responded immediately by sending out a critical plastic piece that had become warped, and the Peak stand has been problem-free ever since).  It'll cost you a bit more, but not as much as some folks are willing to spend in exchange for losing a few unwanted pounds.", "id": 155}, {"review": "I'm a keyboard player, and in the past I had been spending $40-$60 for Monster's \"delegated\" keyboard cables.  But suddenly one shorted out on me after only several months use, causing me to question the \"Monster mystique.\"  I began to compare the Monster keyboard cables with cheap, \"off-brand\" guitar cables and couldn't hear any difference.  No question it's a well-made, trustworthy (but not indestructible or infallible) cable, but I'm no longer committed to it at any price.  However, at Amazon's current \"value\" price for this particular Monster cable, it's a no-brainer.  Moreover, I no longer have hesitations about purchasing a cable that doesn't say \"piano\" or \"keyboard\" on it.  (One of my Monster keyboard cables even came with one end designated for the amp and the other for the instrument--but it was hard to see which was which in a dimly lit club.)As for length, 6 feet is ideal if you're playing through your own amp (my preference).  If you're plugging into a board or P.A. system, you'll want anywhere from 12 feet to 25 feet.", "id": 241}, {"review": "The version I picked came with a grounding wire, claiming that using the wire in conjunction with the brush would discharge all of the electrostatic-producing snap, crackles, and pops.  If you believe that, continue to do so, and maybe you'll imagine less surface noise than was the case before employing the device.  Speaking more pragmatically, I've found some use for the item only when loose, conspicuous debris has collected on the surface of a vinyl disc.", "id": 260}, {"review": "[Later: The mic is indeed the Behringer C-1, but Amazon has provided it with the description belonging to the C-1U.  Unlike Amazon's description, this is not a mic that comes with USB plug, phantom power, and computer connectivity. And, of course, none of the advertised \"included\" computer software programs is included.  It's a conventional studio mic that requires connection to a regular amp / P.A. with an XLR jack and phantom power. It will NOT connect to the USB port of a computer without an expensive adapter and a preamp with phantom power.  Moreover, Amazon's form thus far is denying a refund and offering only replacement--presumably for another mic just like this one! If you want the described mic, Amazon is showing it from a different vendor--at about 30 more plus S&H.;]The Behringer C-1 mic is the best condenser mic I've used for the money, its large diaphragm capable of reproducing some of the rich and deep sonorities of the costly, high-end mics at the radio station (NPR) where I occasionally work.  However, Behringer makes a distinction between the C-1 and the C-1U.  The description on Amazon fits the C-1U, not the C-1.  So one way or another, 50% of the purchasers of this product are likely to be surprised and disappointed.Indeed, the C-1U is a phantom-powered mic that doesn't require phantom power, which it derives from the USB port of a computer.  Moreover, the mic not only saves its owner the bother of a pre-amp with phantom power but it also makes unnecessary a costly (and time-consuming) XLR to USB adapter.  It's ready to go--just plug it into your laptop and start recording.  (I use Sound Studio, but the included free software--Audacity--works practically as well.)On the other hand, if the mic is a C-1 as advertised, be prepared to receive a conventional condenser mic, with an XLR connector and a phantom power requirement (found on numerous recording devices and P.A. amps or available on a neat little pre-amp sold by Amazon, the A.R.T.).Having just returned a keyboard--the M-Audio Pro88sx--for which Amazon mistakenly provided the wrong description (for the M-Audio Pro88, not the Pro88sx), I'd be hesitant to place any bets on which mic the buyer will receive--the C-1 as advertised, or the C-1U as described.  At least if you're purchasing directly from Amazon instead of a sub-vendor, you can be assured of a hassle-free return.  And if the mistake is due to Amazon's description, returns are generally postage-free.", "id": 327}, {"review": "I'm frankly sick and tired of showing up for a gig and having my keyboard run through the P.A., thereby in essence causing me to forfeit all control of the instrument to the bandleader (or board op). Still, I've had to concede that the amps I've been using--a Roland KC150, then a KC350--had plenty of power and pop but no sonic attributes that would recommend them above the Bose P.A. set-up the band uses.  Then, because I needed a small amp with an XLR connection for use as an emergency P.A., I picked up this relatively new item from Roland, which prominently describes itself as a \"monitor\" amp (i.e. meant only for the performer's ears).Was I surprised when I got this thing home and put it through some rounds with a Kurzweil PC2 and SP2.  It's little more than a compact brick, but it appears to have the power of my KC150 and, more importantly, in terms of \"listenability\" it sounds like its several heavens apart from the KC 150 or 350 (those ever-present Roland KC amps will make any piano, including Rolands, sound uninspiring if not boring during the course of a four-hour gig).  This latest contender covers the entire piano range, effortlessly, smoothly, providing rich yet responsive bass where its needed and brilliant but not strident highs.  Perhaps some would judge the sound a trifle \"colored.\"  If so, I'll take the coloration any day to the untempered sounds I've been getting from electric keyboards.  The mid-range is tight and controlled, with the upper register \"growing out\" of it gradually but unmistakably.  By contrast, the upper register on the heavy-duty KC amps strikes like a serpent, leaping out of the mix like home-brewed white lightning  hitting the palate after it's just gotten accustomed to a vintage Bordeaux.I even compared this little thing to my previous standard--the Roland Cube 60 that had preceded the KC150 (which has been around too long).  This new one was smoother, bending to the bass notes like a gracious willow and springing to the top ones like fresh spring birch.  In other words, even the Roland Cube sounded uneven and rough compared to this latest overachiever, which handled the tones of the scale like a single portamento, revealing no holes in any of the registers.Playing any instrument or amplifier on the job can lead to a judgment radically different from the one made at home.  If my instruments (I'm usually playing 2-3) have to be mixed through the P.A., fine.  I won't have to listen to them.  They'll be processed by this monitor, which will be facing and playing for me before it kicks out the stuff that the bandleader deems worthy of the public's ears.", "id": 410}, {"review": "I'm raising my rating, and the result?  Getting \"demoted\" from the front page.  In any case, even though I recently picked up the Sony PCM-D50 from Amazon, I'm sufficiently impressed by the Zoom H2 to give it 5 stars and endorse it for anyone who wants professional quality results without the grief and expense of 8-16 track digital recorders or even the fuss of more complicated personal recorders.  For quite a while its only competition was the Edirol-R09, but as the price has come down, the Zoom H2 stands out from its immediate competition. Currently, the H2 is my \"back-up\" unit.  But for convenience or stealth purposes, I often use it as my main recorder.Anyone who receives this item is guaranteed to be impressed.  Production values haven't been spared in terms of the packaging; the included equipment (no batteries but a power adapter, protective pouch, handy table stand, mic stand adapter, wind screen, ear buds, USB cable, and a 256mb SD card); and the manual (a quick set-up sheet plus an ample booklet with generous-sized print written in clear, idiomatic English that makes some of Sony's recent instruction manuals look torturous by comparison).The screen and controls, admittedly, are minuscule, requiring sharp eyes (though the screen is well-illuminated) and nimble fingers (I much prefer the knobs and slider switches of my Sony to the touch-pad of the Zoom).  What's encouraging about this recorder, apart from the price, is that the designers at Zoom have made the H2 with the genuine audiophile and/or all-around musician in mind.  It's not simply another \"guitar player's gadget,\" loaded down with an endless supply of effects, loops, rhythm and bass tracks, files within files, programs buried within programs.  The H2, unlike my pricey Sony, can handle both .wav and mp3 protocol, has microphone fields ranging from 90 degrees to 360 degrees,  is capable of applying compression limiting to recorded files, offers a wide range of sensitivity and placement for recording lectures, conversations, solo performers and orchestras.  In short, the device promises to deliver the quality of some of recorders costing a thousand or more--and in a practical digital storage card format.Other Pluses:  Although the instructions are quick to point out the input for an external microphone (the pictured ones are the two popular stereo mics made by Sony, costing $60 and $90 respectively), the Zoom onboard mic (actually 4) is darn good.  It captured the range and resonance of a grand piano and even managed to pick up a conversation in the kitchen and a grandfather clock's  chimes from upstairs.  And it's reassuring to see a mic with a surface area reminiscent of the mics of the past (a single tiny hole is more common these days).  Getting the recorded signal onto a computer's hard-drive is expedited with the included USB.2 cable, and from there you can edit the wave pattern in a program like Cool Edit (which I strongly recommend over editing in the recorder).  There's also a metronome on board (potentially useful for a student musician during practice sessions) and a tuner (useful for a student musician or a pro who wants his instrument to be in tune before recording).Possible drawbacks: 1. Zoom admittedly has overdone things a bit with all of the audiophile bells and whistles--limiters, compressors, cut-off levels, AGC control, auto-dynamic levels, sensitivity ratios, panning effects, and the list goes on.  It's too easy to miss a step, to waste precious time fumbling with the menu, to find your fingers going numb while making all of these tiny adjustments.  Moreover, the instructions, while clear and abundant, omit much information that would help the beginner.  The hypothetical audience keeps changing from someone who's a complete newbie to someone who's a knowledgeable aficionado.  And I have great difficulty imagining a harried band director or impatient student taking the time to fiddle with scrolling through the tiny screen's menu to get to a metronome or tuner. (Frankly, with 75 kids squirming in their seats I'd go to the old single-function, dial-up, block-shaped metronome without a second thought.)2. The H2 is so light that using it with the AC adaptor seems rather incongruous if not highly unlikely.  Undoubtedly you'll want to pick up a 2 to 4 GB SD card and a good supply of double A batteries (it takes only 2) to record in the field.  At standard MP3 (128-meg) quality, you should be good for dozens of hours.  (The adaptor would have made more sense if Zoom had enabled it to charge batteries that could remain in the recorder.)3. My H2 would not connect to my iMac with OSX Leopard without downloading an upgrade from the Zoom site. After having some difficulty with the install, I decided to forget about it and simply transfer files in \"real time.\"What's encouraging about this recorder, apart from the price (2/3 of the H4, 1/2 of the Edirol R-9) is that the designers at Zoom have made the H2 with the genuine audiophile and/or all-around musician in mind.Perhaps the primary deal-maker or breaker: The tiny screen and small controls.  Until mastering the miniaturization, I would want to have a \"back-up\" cassette recorder for any performance that I judged of special importance.  As for build quality, my H2 is like new after almost 18 months use. Undoubtedly you'll want to pick up a 2 to 4 GB SD card and a good supply of double A batteries (it takes 2) to record in the field.  At standard MP3 (128-meg) quality, you should be good for dozens of hours.  (The adaptor would have made more sense if Zoom had enabled it to charge batteries that could remain in the recorder.)My H2 would not connect to my iMac with OSX Leopard without downloading an upgrade from the Zoom site. After having some difficulty with the install, I decided to forget about it--especially after seeing how slow (I mean really, \"overnight\" slow) the machine is in \"Normalizing\" a long file or converting it from .wav to mp3.  What takes minutes with a software program like Sound Studio or WireTap Studio requires hours when you're using the Zoom as a computer interface.  Use it for what it does best--namely, produce realistic audio from a tiny, weightless, durable device that practically makes the added attractions gratuitous and frankly puts to shame  its expensive rivals.", "id": 463}, {"review": "I have little doubt that the Blue Icicle will get the job done with a Shure SM-58, or similar \"dynamic\" microphone.  But its claim that it will convert any \"condenser\" mic, even one that normally requires XLR connection and phantom power, into a \"plug 'n play\" USB mic should not be taken at face value.  I say this because I have an acquaintance with the original Audio Technica AT2020 Condenser mic who had intermittent and marginal success when he tried such a conversion.  In the long run, he would have been ahead (in terms of both the conversion and saving a few bucks) by purchasing the AT2020 USB mic.  As it is, the Blue Icicle is probably the best such converter on the market (the comparably priced LightSnake cable will not convert condenser mics, despite what you may have read).  So, if necessary, give it a try--and more than one.  But make sure there are return privileges.", "id": 538}, {"review": "Although the big push these days by Samson/Zoom is on behalf of their latest entry, the pint-sized H1, the H2 is still outselling it.  Perhaps for good reason.  Amazon's price has the H2 going for less than a 50% mark-up from the H1, yet only the H2 offers a sound stage as wide as 360 degrees and is almost as portable and easy to slip into a pocket as the H1.  The latter offers the now popular X/Z mic configuration, but they're \"fixed\" mics. if you wanted to ensure the widest separation, you'd be unable to aim the mics in opposing directions.  Also, the H2 can be set down on a flat surface more securely and is less sensitive to microphonics from touching any part of the machine.  I've owned both machines and have found the construction quality wanting, the SD door broke loose on the HD2, and the on-off switch came loose on the H1.  Both are somewhat tricky to operate, with settings that are not visible in dark places and which nonetheless require agile, accurate, and quick, small fingers.  (Some users are bound to react negatively to the minuscule size of the H1's micro-SDHC storage cards.)  Both are capable of full-bodied, full frequencied high-fidelity audio, but you have to remember to treat them gently.The Zoom Q3 video recorder strikes me as the best built of the bunch, as it's solid metal practically through and through, and the limited settings make it easier to use than either the H1 or H2.  However, I found it impractical to use at a concert where where the included video component distracted the listeners behind me.  Also, with its size and bright-blue color it's anything but a stealth machine.This brings us to the 4th (and most expensive) Zoom, the H4n.  It's the most versatile of the Zooms, not only permitting movement of the mics but the addition of external mics for authentic mixing.  Still, the build quality is not notably superior to the H2, and of the 4 Zooms, it's the fussiest, intended for a user whose willing to take some time to become familiar with its versatile learning curve.  After less than satisfying experiences with the first 3 Zooms, I sent the H4n back in favor of the Sony PCM-50, which is constructed like a Hummer compared to the plastic of the Zooms.  I see that Amazon's description of the Sony is misleading, since the PCM-50 will NOT permit the user to record in MP3 format.  WAV is the only format it offers, which simplifies the recording process, allowing the user to select file size with the software program used during the editing process.  (The only down side is the limited duration of WAV, requiring the user to employ a Sony Sound Stick in addition to the built-in storage.)", "id": 581}, {"review": "I was looking for an affordable mic enabling me to make announcements from a home computer that would approximate, if not be indistinguishable from, the audio quality of the heavy-duty Shure microphones used at WGTD FM HD.  All the mics that I had previously tried at this price point and lower, including Blue's \"Snow\" line, sounded overly treblish, with pronounced sibilance (listen to the comparison-contrast provided by the first reviewer in his video demonstration).  By contrast, the Yeti is rich and resonant, and its sensitivity permits using it without benefit of a pop filter.  Short of spending 4-5 times more, I'm convinced this is the best option in my particular case.At the same time, as a musician without a home studio I seriously doubt I'll make much use of the mic for performance or recording.  As far as performance goes, the very size and conspicuousness of the unit could compromise presentation, upstaging the performer (at least a vocalist with a normal-sized head).  And for traveling purposes, I've found the Sansom Go mic to be the best fit with a laptop computer (even though Blue's literature shows the Yeti alongside a laptop).Blue appears to be trying to have it all ways with this product.  Its size and weight are likely to attract buyers as well as provoke reservations--perhaps leading some purchasers to complement what strikes me as a home studio mic with one or more of Blue's lighter, more compact microphones.  Its onboard amplifier and circuitry are convenient and permit unprecedented versatility.  But as other reviewers have mentioned, the volume, gain, and pattern knobs are rather loose, allowing for lateral and vertical as well as the expected rotating movement.  The knobs turn effortlessly but not with the ball-bearing smoothness one might associate with ultra expensive professional equipment. There's the slightest hint of resistance at one point in the gain control's circular movement, but it's not at the 12 o'clock position, so it's difficult to say whether or not the knob is intended to have a mid-point for quick and easy assessment of positioning.In sum, the Yeti should please anyone who wants to broadcast or record a fuller and richer sound than that previously attainable with comparably-priced mics, and it should prove a useful (not to mention handsome) addition to any home studio.  It's still a bit early to make any pronouncements about the worthiness of this imposing metal humanoid as a road warrior.  It's main competitor on Amazon--the Audio Technica AT2020--is pint-sized compared to the Yeti, and I'll confess I'm still not sure whether I made the best choice (the 2 mics have been alternating in the 1 and 2 slots of best-selling mics on Amazon for 3 months now).  I wish there were some direct reviewer comparisons to indicate whether the AT's relative compactness and light weight come at a compromise--however slight--to audio quality.[I experienced initial hesitancy on Yeti's part to make an appearance in the Input and Output panels (in System Preferences) of my iMac. Then I read the instructions, which discourage plugging the mic into a hub. Plugged directly into a USB port on my computer, Yeti immediately sprang into action. My hunch is that a good, powered 4-port hub would be equally effective.]", "id": 644}, {"review": "Perhaps more than anything else, it was the introduction and subsequent success of the Zoom H2 personal digital recorder that led to an explosion of interest among home audiophiles, who suddenly found themselves equipped to make quasi-professional-level recordings with their computers plus a minimum of user-friendly equipment at reasonable prices.  The price of the Samson Meteor USB mic, a fairly recent entry, has come down to the point of being fairly valued (initially, I was seeing it going for prices above the better-sounding Blue Yeti mic).  It's an attractive (some would say \"cute\") little mic with its quaint \"retro\" design and deceptively fold-up, portable size.  I say \"deceptive\" because, due to the non-adjustable mic stand, it can be more than a little challenging to find space for it on a desktop, next to a computer, and squarely in front of the narrator's mouth.Bearing in mind the above reservation along with the actual quality of the recorded sound (it's good, but nowhere close to studio-quality), it would seem to make the most sense for those seeking \"high fidelity\" audio to spend the extra 20% for a Blue Yeti or an Audio Technica AT2020 USB (as tempting as the lower price of the non-USB version of the AT2020 is, be sure to try it out with a pre-amp supplying phantom power before going that route.  I've known a couple of individuals who ordered the AT2020 condenser mic, only to discover that it was useless with a computer, even with the addition of a Snake Light cable).If your primary considerations are convenience and portability, the Samson Go mic sounds almost as good as the Meteor and is unmatched in size, convenience and portability.  (It scored higher than the Blue Mikey and Blue Snowflake in my auditions.)  I'm tempted to say it's the perfect laptop mic, clipping to the top cover more securely than the Snowflake, whereas the Yeti is ideal for desktop use, producing rich-sounding recordings rivaling those of a professional studio's Shure SM7B mics.", "id": 743}, {"review": "Until 5-6 years ago there was a virtual void in high-quality personal digital recorders.  Then the Zoom H2 came along, and numerous variations on a theme were soon to follow.  I've owned both the H2 and the H1 and, though both have their strong points, the Tascam DR-05 has served me better than either. The H2 has pleasing 4-point sound and the H1, at half the size of the Tascam, works well for \"stealth\" as well as video recordings when mounted on a camera.  But both recorders are more complicated than necessary, with tricky menu systems, excessive tiny buttons (6 on one thin side of the H1), and dicey build quality.The Tascam addresses these shortcomings with a machine that's a pleasure to use.  There are no shaky, rattling parts, the controls are solid and instantly solved (easily manageable with a single thumb), and the wide-spread mic pattern is ideal for most stereo recordings of music (for dictation, I use a separate, small mic inserted in the topside input).  The machine reminds me of the far costlier Sony PCM-50 in terms of ease and convenience of operation. The Tascam's 320 kbps MP3 recordings of a grand piano strike my ears as no less authentic and sonically \"present\" than its 96/24 WAV files, and tweaking is held to the absolute minimum.  If you don't have $500 to spend and are looking for a woodshedding companion for day-in, day-out use, this is the one.", "id": 750}, {"review": "Apple threw a curve at me when, with the new \"thin\" iMac, the company eliminated not only the Superdrive but the 3.5mm \"Audio In\" port that had been highly useful on previous models, especially for recording computer sounds with a single patch cord.  After trying a Griffin and Logitech device, I finally found a useful workaround with the Behringer UFO202 interface (there are 2 other very similar models by Behringer--the UCA202 and the UCA222). What sets these interfaces apart from the 302USB is a smaller footprint and a permanently-attached, \"dedicated\" USB cord.  Simply by plugging the USB cord into the USB port on my iMac I was able to record all of the broadcasts, tapes and LPs just as I had done with my old iMac (though monitoring required more cords in back--ugh!).For a committed neophyte like me, the UFO202 was probably sufficient.  I miss the permanently attached USB \"out\" cable and, moreover, am questioning whether I'll ever use the mixing capabilities of the 302USB, which to my eyes has a bit of a \"learning curve.\"  The problem for the impatient beginner begins with the instruction manual.  Instead of separate sections, the manual uses small, thin font and mixes English with Spanish instructions--a minor but unnecessary inconvenience. (But give Behringer credit for providing a manual!)I thought I was investing in more versatility (for a modest price increase) than what the Behringer UFO/UCA line of interfaces offered me.  But a friend tells me that GarageBand has the capability of recording sound-on-sound.  My present programs (Sound Studio and Toast) can't do it, but if GB can layer 2 or more sound sources, then the question becomes whether an external mixer does it better.  If not, the Behringer UFO202 is not only adequate to serve my needs, but its tiny footprint makes it especially welcome on a new iMac's desk space (Apple's elimination of the internal burner gives the company \"thin screen\" bragging rights while robbing the user of both money and space--thanks to the new requirement of an external burner).Behringer has presented the best solution I've been able to find to Apple's surprising (and dubious) omissions with the latest iMac.  If your uses include mixing, and if you have the space (we're talking a mere inch or two), the 302USB is no doubt worth an extra ten bucks.  But if you have a UFO or UCA interface, your needs may already be covered.", "id": 782}, {"review": "First, I would be extremely wary of the durability of any piano bench for under $50. Second, as a professional piano player I have never found a use for a traveling \"bench\" or \"stool.\" Think about it: you've got a heavy keyboard to haul plus an amp plus a keyboard stand and maybe a music stand, electric light and music, perhaps even a storage case for the cables, adapters, extra fuses, batteries, tuners, sometimes an extra keyboard or two, or a couple of tone generators with MIDI cables, or, if you still pack a Rhodes, spare tines and a pair of wire cutters--and you're going to add a bench (!) to your weekly moving equipment caravan?In 90% of the locations that I've worked, I'm able to locate a plain chair without arms (usually the kitchen crew knows where the house spartan chair can be found). Not only does it reduce by one the paraphernalia, but it helps protect against the body structure problems to which piano players, especially, are prone over the course of thousands of hours of slouching, subjecting finger joints to unhealthy amounts of pressure, too caught up in chords and scales and retrieving half-remembered melodies to register the physical-neurological effects until after the job.  I've always envied the lounge act players who can stand while playing--far better for the entire musculature configuration of the human anatomy (not to mention prostate). In fact, if the club or restaurant has a regular piano bench or one of those padded, rising and lowering black Steinway cushions, try to replace it with a plain chair without arms. Especially if you're doing 4-hour gigs, sometimes two in the same day, you'll notice the difference short and long term.Bottom line, your back needs more pampering than your bottom, which is why you need a seat with a back. Only concert artists like Horowitz and Rubenstein could get away with those cushy Steinway stools--30 minutes to complete the concerto and be done with it (actually most of the stress was gone upon completion of the cadenza of the first movement). Some of us aren't that lucky--or gifted--or smart.", "id": 464}, {"review": "Having misplaced my Blue Snowflake USB mic, I decided to give this recently introduced, competitively priced USB mic from Samson a try.  (Samson is maker of the highly popular and effective Zoom personal digital recorders--the H2 and the H4n.)  It's an attractive, fully outfitted piece of equipment, with handsome packaging (a small black box and zippered carrying case with aesthetics apparently inspired by iPod).  It's smaller and lighter than the Snowflake--more diminutive than the picture would suggest.  Yet the audio quality strikes me as being somewhat warmer and richer, favoring the bass frequencies of spoken narration more than the Snowflake, which has slightly cleaner and clearer definition at the treble end.The Samson Go was seen instantly by my iMac, and recording was as advertised: \"Plug n' Play.\"  The mic is somewhat more sophisticated than the Snowflake in terms of \"latency\" settings (it permits direct monitoring via headphones connected to the mic to insure no delay, or lag time, between transmission and reception), and there's a three-way switch for directional patterns (the manual could be clearer, however, about the difference between \"cardioid\" and \"cardioid 10 pad.\")  No matter. The mic performed virtually flawlessly right out of the box, with no tampering with the switch.It's extremely sensitive, slightly more so than the Snowflake.  Yet I was unable to avoid the \"P\" popping sounds, regardless of how close I got to the mic and muted my consonants.  So be prepared for the addition of some sort of \"pop filter\" device (either one sold on Amazon or a self-designed one, using a nylon stocking).The mic can be clipped to the top of a computer screen or mounted on a mic stand (using a supplied adapter or ordering a properly sized one from Samson).  Yet with its heavy base plus the flexible, tilting mic, it can be placed on a flat surface--much like the Snowflake, but with greater stability and without any intrusive cable.  (The Snowflake tends to \"flop around,\" requiring some balancing of the device by the user.)My biggest disappointment thus far is that the clip, as alluded to by another reviewer, does not open far enough for attachment to a desk-top computer (it should be an ideal fit with most notebook machines).  Although the Snowflake doesn't use a spring clip, it suffers from the same limitation.  If you're especially concerned about durability, the Snowflake appears to be the heavier, more rugged mic, with thick metal and no tiny switches or spring clips to wear out.  The Samson is the more delicate and refined of the two.  But don't kid yourself.  Either mic will exceed the capabilities of your computer's built-in mic and perhaps the owner's expectations. On the other hand, neither is a match for the Shure SM7B that I'm accustomed to using at a local broadcasting studio.  Still, Samson would appear to have a winner with this little wonder, whether it's used in conjunction with a computer to record full-frequencied music or \"realistic\"-sounding narration.", "id": 583}, {"review": "I'm surprised that the maker of Amazon's popular AT2020 would go this low.  The mic, imo, is fully-valued, even at its single-digit price.  It's \"dynamic\" rather than \"condenser,\" but it still requires loads of power to get it up to workable levels (phantom power, which is a requirement for condenser mics, would probably not add sufficient heft). It's very lightweight and, with its optional plug and on/off switch, is versatile enough.  The quality of the sound, moreover, isn't bad--providing you can hear it.  Be prepared to have plenty of watts on hand to coax any appreciable sensitivity from this non-responsive creature.  (I haven't tested it for recording purposes.)  Despite appearances, this mic is no bargain.", "id": 623}, {"review": "First of all, don't be \"oversold\" by the \"extraordinary value\" that some reviewers claim this fifty-buck inputting device to be.  Akai is considered a budget-priced version of, and a step down, from Sony, which in the minds of some has dropped a few steps lower itself.  But it's the ideal solution for many of us who may be working at a desktop computer with Garageband, Band-in-the-Box, Finale, Sibelius, Audacity or a similar program.  The last thing I would do is lug a 50-pound PC or SP Kurzweil model (plus AC power transformer) upstairs to place on an over-crowded desk. Even the 12-pound Yamaha NP-30, with its 76 notes, is awkward to use for this purpose.  Make it nothing longer than a 41-note keyboard, but if you can get one at half the price of the E-Music 41-note, that may be the handiest, most practical device for your needs.Sure, there are alternatives.  You can click at a \"virtual keyboard\" that Garageband makes available for a mouse--but it's slow.  Or you can download a virtual keyboard to your iPad (or iPod) for a couple of bucks, but it's limited to no more than an octave and a \"touch screen\" which, though superior to mouse-clicking, still isn't as satisfying or \"immediate\" as inputting by pressing down on actual, physical keys.This cheaply-made--even \"cheap\"--but effective Akai keyboard fits the bill very nicely, especially for someone who's working in congested space.  It's regrettable the company refers to it as a \"performance\" keyboard.  It's nothing of the sort, nor should it be.  That's the reason I initially went with the NP30, only to find that the bi-purpose instrument I had in mind was impractical for either intended use.Take a look at the Korg \"Nano\" piano, and if you're a pianist, you'll immediately see the superiority of the Akai.  But be careful not to be lulled into purchasing the deluxe model of either the Akai or the E-Music, or you'll be close to spending as much as you would for a keyboard that lives up to the name \"Performance.\"  This Akai model looks and feels like a kindergartner's ten-dollar toy, but it's the best compromise I've been able to turn up for my crowded work area.", "id": 629}]