[{"review": "This winder and cutter...winds and cuts fine...But the pin puller does not fit my guitar pins even though the ad claims that, &#34;...it fits virtually all guitars, banjos and mandolins...&#34;  Oh well...another lessson learned.", "id": 94}, {"review": "Thank you Fender for a really fun instrument that fits my size...and thanks to all of you that recommended it for just that reason : )", "id": 152}, {"review": "This arrived with one end of the security strap and metal part...Broken! OK...I bought it on sale and returning it would not be an option...it would cost as much to mail back as it did to buy it!Obviously it was not the packaging which was more than adequate and there were no broken off pieces in the box.Of course,I could not recommend this product to anyone...most disappointing purchase!", "id": 258}, {"review": "These strings have soothed my poor sore fingertips...They are very light to play and make my practising easier whille Iconcentrate on building callouses  ; )", "id": 333}, {"review": "Just what I needed...easy to attach and saved drilling a hole for my guitar strap. Works like a charm!I recommend this product.", "id": 568}, {"review": "I 'm obviously not a &#34;Techie&#34;.  I couldn't understand how my delightful, and so neat, little toy wouldn't work... until I found out that the battery was wrapped in cellophane - A-ha!To be fair I must explain that the battery was already installed in the tiny little amp when it arrived, so I didn't look too closely at it.  But of course when I couldn't get it to work for me, I soon discovered the problem.This product is the neatest, sweetest little delight for the eyes...and will astound you with it's capacity to roar out your music when turned up fully and respond immediately to your slightest touch on it's sweet little knobs to sound out your music from there and down to a whisper,  whenever you require it to.The sound from the speaker is as clear as a bell...no static at all...Truly an amazing little gadget... attractive, so portable and does the job of one twice, or more,  of it's size.", "id": 235}]