[{"review": "They feel great, last longer than any other string I ever used and most importantly, they sound terrific. The medium weight also has a better tone than thinner gauges. My Taylor is much louder now that I use these.However, you may have to adjust your truss rod if you change from lite or extra light.", "id": 104}, {"review": "Been using these for years. They feel great, last longer than any other string and most importantly, they sound GREAT.They cost a little more than other strings but they're worth it.", "id": 107}, {"review": "Schaller guitar strap locks work really, really well. However, I had problems at first until I made some changes.- First off, you need to put a drop of lock tight on the threads or the nut will loosen. The blue stuff will be more than enough.- Second, the lock can grab the strap pin on your guitar and turn/loosen the screw over time. Kinda defeats the purpose of the locks if they hold on to the button but the button comes out of your guitar. So... When I install the new button, I put a drop of epoxy in the screw hole first. Never had one unscrew again.If you do those things first, you will never have your guitar strap fall off by accident. Ever... But, you can remove the strap any time you want easily by disengaging the lock.", "id": 278}, {"review": "I used to buy leather straps but not any more. This strap is very nice and comfortable. It's also the cheapest one I ever bought. Can't go wrong.", "id": 353}, {"review": "Sounds like a great concept and they seem well made. I just don't care for them. I know others love them so I guess it's just a personal thing.It took weeks to receive them in the US. Don't be in a rush.", "id": 404}, {"review": "I'm very pleased with this purchase. The cables are flexible, quiet and no pops or loss of signal. Not much else to say. Buy them.", "id": 578}, {"review": "They work great, they're quiet and they're cheap. What else can you ask for? I'm very happy with the product", "id": 663}, {"review": "This strap is nice and comfortable but your guitar will fall off of it easily. I plan on using strap locks so it won't matter to me but if you don't use strap locks, your guitar may hit the floor and ruin your whole day.My advice. Install strap locks on all of your guitars and protect your investment. Then choose comfortable straps that won't scratch your guitar (like this one).", "id": 658}]