[{"review": "I actually replaced a BOSS TR2 with this pedal. Does everything it is supposed to do without the \"perceived\" (that's was they say) volume loss typical of many tremolo pedals. If it's perceived, then how do you explain how good this sounds? I have since had the pedal rehoused in a metal enclosure with a better switch because I was scared of breaking its plastic housing when switching it on and off.", "id": 24}, {"review": "Wanted a way to plug in my BOSS ME70 to save on batteries. Didn't want to drop the money on a BOSS PSA, so I got this one instead which does the same job, just for less money.", "id": 40}, {"review": "I was using the bigger triangle kind before. The one that's more universal. But I only use the tortex pics. So I got this. They fit perfect. And they don't move around so much like with the bigger triangle one.", "id": 167}, {"review": "I was messing around with the wiring in a MIM strat and I ended up melting the switch. So I ordered this one to replace it. Worked out perfect.", "id": 214}, {"review": "I used this to replace a Pot in my MIM Telecaster. Works great. I didn't notice any change in tone. It just worked like the old one. But the main this is that it worked. And my Tele sounds as great as it always did.", "id": 216}, {"review": "I have owned two of these stands. The first one was rendered unusable after the set screw disappeared. The second one must have walked off on its own while I was moving to a new place. Not the greatest stands by any means, but for what they're worth, I didn't mind spending another $10 to get one. Sure there are other stands of much higher quality that are even more compact and portable. But price, ability to collapse, and it's light weight made it the one I bought... again.", "id": 91}, {"review": "I am normally a guitarist in my band, but I have found myself at times needing to play the keys also. Having two instruments to play, a pedalboard, and mic stand is a lot of real estate on the stage, so this adapter made things MUCH better for me when I find myself back in that position. Works great with my On Stage Keyboard Stand. If you play keys and are also a vocalist, this is a must! Worth every penny.", "id": 495}]