[{"review": "They sound great, and I'd purchase them again. With ten packs, it will likely be a while before I do so.", "id": 156}, {"review": "Sounds and feels nice. I have an entry level guitar, a Peavey Rockmaster. It came with entry level strings. These strings make it sound like an upgraded instrument.Be advised, the low E string is thick. When I try to depress the 12th fret, I can't get it to register as a hit with Rocksmith 2014 unless I press HARD with my middle or index finger. Well, sometimes the pinky is needed to do that. Plan on a weaker score if you learn guitar using this game.", "id": 335}, {"review": "I ordered them because they are carbon fiber, but love them because I DON'T loose picks anymore! I used to lose a pick every other day. Bought six, still have six a week later. :)Here's how I keep it: about midway over the fretboard, slide it between the E, B, and G strings (the three smallest strings) and slide it up towards the headstock. It has little gecko-like protrusions that grip the E string. Stays in place and CANNOT slip out. Wonderful!", "id": 686}, {"review": "The device itself is difficult to read in bright light.My first one arrived not working at all.The second one arrived with a low battery. What? After three days the battery goes out.I would have returned it, but lost it because it doesn't adhere to the headstock very well. You've been warned.", "id": 785}, {"review": "I play using this device. It is portable, so I always have it with me. I tune the A to 432, and this works well for that. Has a tuner and a metronome. What's not to love. Best to carry a cable to plug into the guitar, unless you are in a quiet area. It is sensitive, and will pick up ambient sounds to give false readings. This is a good thing: it's sensitive.", "id": 851}, {"review": "I give the product a 4star for doing what it is supposed to do. I give it a single star because it failed two weeks after the return period. Generously, I'll give it 2stars. Something like this really should last at least a year or more. Cheap parts/manufacturing?  50 cents a day is not a good deal for a device of this nature.", "id": 491}, {"review": "I'd suggest that this is not for beginners. More for the intermediate musician. It is not something you are going to understand at first. The learning curve is moderate. Other than that, quite useful and durable.", "id": 531}]