[{"review": "Designed to accommodate most \"standard\" shaped guitar picks, this Dunlop pick holder is handy little spring loaded device, for storing picks.  You can mix brands and types, but how many picks can fit inside, will vary from around three, to perhaps a dozen.  As a guide, about 10 Dunlop 0.60mm nylon picks will fit, but only 4 Dunlop 1.50mm Delrin picks.  Even thick irregular picks like the Dunlop 3.0 Big Stubby will fit, however the total number will be greatly reduced.Build quality is good, but forcing too many picks inside, could cause the spring to fail, or the seam to split.  A piece of double stick tape, shaped to match the pick holder, is included.  The tape does a barely passable job of hold the device in place.  I stuck mine on the backside of the headstock of my guitar, and while it stays in place, it's pretty wobbly.Color options at this time seem to be limited to black, but if you have DIY skills, you could paint it whatever color you like.  This is a decent buy, below the two dollar level.  I prefer this model over theDunlop 5505 pick holder, because it seems to be sturdier, and I like the more rounded appearance.", "id": 167}, {"review": "Pro Tec manufactures a variety of accessories for musical instruments.  Their low cost black nylon guitar strap, is a well constructed high quality item, that is a top seller at Amazon.  The large sized attachment tabs are quite thick, about 1/8 inch.  Although the fit on the typical guitar strap nuts is snug, some type of strap retainer would still be recommended.  Black works with most colors, and this strap should last for a long time, but it is so inexpensive, if you qualify for free shipping, you might want to consider ordering a spare.", "id": 285}, {"review": "I normally use Dunlop&#8217;s 0.60mm nylon picks, but decided to give the 0.60mm Max-Grips a try, when the price dropped to $3.00 for a dozen.The top half of the Max-Grips have a special surface with tiny ridges, that gently bite into the skin to provide a nice secure grip.  The feeling is a little strange at first, but you should get used to it quickly.I like the feel and playability of the 0.60mm Max Grip&#8217;s, but they are little more flexible than I prefer, so if I were to get another set, I would get a thicker type, either0.73mmor0.88mm.", "id": 680}, {"review": "I had never heard of ChromaCast, but after buying this guitar bag, it's easy to understand why this bag is a top seller at Amazon.  It's relatively inexpensive, fairly well built, and features a number of zippered compartments of varying configurations, to store accessories.  The case is very convenient to carry, as it has a handle on the top, and a second handle on the side.  It also has a set of shoulder straps, for carrying the guitar on your back.  The quality of the nylon is decent enough, and there is a rubber pad on the bottom for protection and traction.  The amount of padding inside the bag is a little light, and the zippers might not be heavy duty, but for general use, this bag is hard to beat for value.Some have reported that the case is too small to accommodate an acoustic guitar, but I was able to insert my 4.8\" high acoustic inside, with some room to spare.  I was so impressed by the quality of this bag, that I also boughtChromaCast's electric guitar bag, for just $17.", "id": 863}, {"review": "How a guitar pick \"feels\", is such a matter of individual preference, that there really doesn't seem to be much point in trying to rate them, as what I like about a particular type of pick, may not be relevant to another player.  Most picks have high ratings, because players who like that particular type, write reviews that rate them highly.  Obviously, the best thing to do is playing with a pick on your own guitar, but that isn't always possible.  With that said, for what they are worth, here are my thoughts regarding Jim Dunlop's purple colored, Big Stubby 3.0mm picks.I like a pick with a sharp point for better control, and the Big stubby certainly meets that criteria.  The sharp point and the pick's rounded edges, help the Stubby to slide smoothly off of the individual strings, which makes for easier picking.  Besides electric guitar, I find these picks nicely suited for acoustic, and semi-solid body guitars, where the string tension is greater.I had tried the 1.0mm Stubby previously, but the 3.0mm pick is much thicker, and heavier, and has absolutely no \"give\" at all.  I'm still getting used to playing with something this stiff and hard.  Although the pick has rounded depressions on each side for the fingers, when picking rapidly, I find that maintaining grip can still be a little tricky.  Keeping the pick clean and dry, does help.My favorite pick had been theDunlop 0.6mm nylon pick, but I am very pleased with the performance and feel of the 3.0mm Stubby.  I can locate the strings easily, and be more precise, while still being able to play with decent speed.  Time will tell, but this may become my new favorite pick.The \"pick pack\" contains 24 picks.  I only paid $2.99, which is simply an outstanding deal.  If you're a player looking for a really stiff almost indestructible pick, you might want to give this ultra heavy duty Stubby a try.", "id": 66}, {"review": "Most better quality leather guitar straps are typically $20 or more, so in retrospect, the low cost of this Planet Waves Black Leather guitar strap should have served as a red flag.  I bought it anyway, hoping that it would be a decent product, but unfortunately, upon receiving it, I was almost immediately disappointed at the quality of the item.While the strap appears to be 100% leather, and isn't a piece of junk, it doesn't appear to be of very high quality. The leather is thin and soft, and I would not be at all surprised, if the edges soon begin to curl, and the strap begins to wrinkle. I don't expect the leather around the holes for the strap nuts, to hold up well long term. If you use this strap, you probably want to use some kind of strap locking system.I have leather straps that have lasted for over ten years. The leather is thicker and stiffer, and has resisted fraying along the edges. While the leather has developed some cracks, it is still holding up fine, and there is no chance that the strap will tear. I could be wrong, but looking at the Planet Waves strap, I have doubts that it will hold up anywhere near as well or as long.If you are a casual player, this strap is probably fine, although strap locks are recommended. The leather may start to curl up and deform, but the strap certainly isn't going to fail immediately. While serviceable, more serious players, or those with an aggressive style of playing, might want to spending a little more for a better quality leather strap. I decided to keep this strap, but it is installed on a secondary guitar that I don't play that much.", "id": 659}, {"review": "I love my Snark SN5 tuner.  It works smoothly without any issues, and allows me to tune my guitar swiftly and accurately.  All you need to do is clamp the tuner to the headstock, and it is ready to go.  The SN5 is smaller than I expected, but the multicolored meter is easily readable, and the meter can adjusted so that it can be seen clearly from any position.Using the color coded meter, you can tell whether a string is flat or sharp, and adjust the string tension accordingly.  With a little practice, tuning becomes a quick and easy process.  The unit is powered by a CR 2032 battery, which generally has a long life.Although the clamp has rubber pads, apparently the finishes of certain guitars could still be prone to damage.  The instructions states that the Snark is not recommended for guitars with the following finishes, polyurethane, French polish, and nitrocellulose lacquer.  Those with Gibson, Gretch, or Taylor guitars may want pay particular attention to this warning.  I have had no problems using this tuner on Kramer, Ibanez, Charvel, Epiphone, and ESP guitars.  The tuner also works for bass guitars and violins.  I do not have either of those instruments, but I imagine the tuner would work much the same.As there are a number of guitar tuners that attach to the headstock, it took me a little while to decide on the SN5.  Even after eliminating tuners by D'Addario and Planet Waves, selecting the SN5 wasn't that simple, as Snark makes a number of similar tuners.  I am completely satisfied with the SN5, and believe that it fully deserves a 5 star rating.  It is also the least expensive, of the tuners I was considering buying.  If the finish of your guitar isn't an issue, you may find the Snark to be very helpful.", "id": 762}]