[{"review": "This pedal was the mainstay of my effects for a few years.  It really does have a ton of range, although it only does one effect at a time, so you'd have to reach down and change the knobs mid-show in order to get the other variations.  My most commonly used setting was with the overdrive-distortion mix knob at about 2 o'clock, which produces a very professional sounding Grunge-type effect.  If you want any of those 90's sounds, excluding the heavier metal sounds, this pedal will definitely get you there.", "id": 37}, {"review": "I owned this pedal for many years, before finally trading it in on some other equipment.  It produces one sound extremely well, but it only does that one thing.  The sound it does very well is the late 60's/early 70's fuzz sound: \"White Room, Black Curtains\"; \"Satisfaction\"; \"Ina Gadda da Vida\".  Note:  this pedal produces very good sustain, but has really bad attack.  As such, it will not really do the \"Whole Lotta Love\" sound.  As I said, it does one thing very well, but its range even with classic rock is quite limited.  If you plan to cover songs with that classic fuzz sound, this pedal gets you 100% of that sound.  If you want to also cover other classic rock, you're gonna need at least one more overdrive/distortion effect.", "id": 308}, {"review": "These picks play about like a regular triangular pick, the rounded ears may be more practical for some players.  They stand out because everyone loves the idea of them.  I would definitely recommend any serious player own one pack of these, and carry one around because they always get a good laugh.", "id": 373}, {"review": "Consider the distortion sound of Cream, the Doors, and ZZ top.  That buzzy, psychedelic type sound is what this pedal does.  Unfortunately, that's about all it does.  However, if you want to have the perfect \"break on through\" guitar intro sound, this is absolutely the pedal for you.  Quality-wise it's awesome, and if I needed that sound I would definitely own one again.  I got rid of mine to purchase some other gear that served a wider variety of functions, and honestly I haven't missed it, because I'm not in a Doors cover band or anything.", "id": 448}, {"review": "The problem with this pedal is that you have to step all the way down on it to turn it on, which produces a sound.  The Morley pedals have a separate on/off switch, so you can turn them on or off at a given position.  The difference is the sound is just a bit more professional if the wah isn't always turning on or off at the top of the wah frequency.  Suppose you wanted to set the wah in the middle, and just leave it there.  You can't really do that with this pedal.  It is a bit smaller than a morley wah, but in my experience, the sound is equivalent on the base models.", "id": 41}]