[{"review": "These are great.  I have these on all my guitars.  Only problem is the clip on install to the strap.  If you can't get it done google for install videos which will show you how to use a pliers to push the clip into place.  Once installed you are good for life.", "id": 44}, {"review": "I needed a small, collapsible stand which would fit in my backpack with my little amp cables and stuff. This is perfect, love it.", "id": 91}, {"review": "I use these on all my guitars.  Love them.  Easy to assemble and use.  If you have trouble putting it on your strap google for some videos showing you how to use a pliers to push the clip on.  Once installed they are fantastic.", "id": 342}, {"review": "They say 2-4 months, I've never come close to even a month. Usually 3 weeks and they are toast in a guitar case not opened more than twice in that 3 weeks.  If it sounds too good to be true, it usually is.  I don't recommend these.", "id": 406}, {"review": "Can't believe they are still selling these things at full price with the old 30 pin connector.  I have lots of pads but none still have the old style connector.  This is now a boat anchor.  To buy a 3 meter cable from them, they charge $40 for the cable, $15 to ship it and then tax.  The extortion here is almost Monster cable like.  These folks should be embarassed.", "id": 764}, {"review": "The larger ones sometimes have the neck snap so I thought this might be the answer.  The answer is to treat your larger Snarks nicer cause this thing on the back of your guitar with no adjustments simple doesn't cut it.  I have to move the guitar and crane my neck to see the display.  I'm quite disappointed and it sits here with no use.  It is cheap though.  Still to me it was money out the window.", "id": 893}, {"review": "What else is there to say, they are easy to use, they are easy to install and they are easy to check.  I've tried them all and these are the only ones I come back to.  No expensive pads to buy, just use water.  Simple to drop down into the body of guitar, no attempt to fit some rubber block thingy into your sound hole.  Comes out as easy as it goes in.  I have 4 of them.  Love.", "id": 299}]