[{"review": "I've been using these straplocks for over 10 years now and never had a guitar or bass break free on me either live or in the studio...they simply work and cost next to nothing to boot. Folks, this is the best insurance you can buy for protecting you precious instrument from popping off of you strap, even if you do some serious gymnastics on stage it's not going anywhere. This is a must have, just buy it!", "id": 44}, {"review": "I've been using Slinky's for so long now, I honestly don't see me using any other brand ever again. They are tough, well made, and simply work and sound great....do what everyone else does and try them out and see for yourself what a difference a great string makes to your playing!", "id": 226}, {"review": "I'm not going to gush over this one...it simply works well for the price paid. It has nice thick leather ends that hold onto my guitar well enough(especially if you use locking clips...you DO use them, right? ;)). I like it and will use it again.", "id": 285}, {"review": "I've bought quite a few guitar stands off of Amazon in the past few years, and I've paid for the most expensive ones and the cheapest ones, and this is the best one I've found yet. Very sturdy, well made, and fully height adjustable, with strong soft foam to protect your precious guitars from getting all scratched up. It states that cellulose finishes can be damaged, so at least it lets you know that ahead of time(most cheap stands don't), so that's a good thing as well. Don't waste more money than you have to for a good quality stand, grab this one!", "id": 310}, {"review": "This is a great gig bag for the money. It has more padding than I thought it would have, has very strong construction, and plenty of places to store stuff like sheet music and cables. The carry handle and shoulder straps are well padded and comfortable to use as well. It's even reasonably water proof, handling the light rain shower well with zero leaks. For the money, this is the best one I've bought on Amazon, and will certainly buy it again in the future. Highly recommended!", "id": 311}, {"review": "Instead of shelling out over $25.00 for a Line 6 A/C adapter for my Pocket POD, I decided to give this one a try out, and I'm glad I did! It's well made, works great, and saved me quite a bit of coin in the process. Can't beat this one for sure :-)", "id": 521}, {"review": "I got this to use on an old Mac computer to allow me to use some equipment that needed more than a line level output. It works great for that. Haven't used it for anything else, though, so cant comment there. Seems sturdy and well made as well.", "id": 569}, {"review": "I've probably used every type of pick out there at this point in my life, and find that Planet Waves makes a good one at a fair price. Picks will always be a subjective thing, every user has his/her own preference, so trying out as many as you can can benefit you in the end. These are well made, last quite awhile, and they don't even look bad, try them out, you might just like them :-)", "id": 574}, {"review": "This is a genuine Fender Switchcraft brand input jack. It is a bit bigger width wise than the import copies, but that's an easy adaption if using a copy strat. It works perfectly. Great price from the seller as well. If you want a sturdy jack, this is as good as it gets.", "id": 674}, {"review": "There are many cheapie string winders out there, they all look pretty much the same....but they most certainly are not. This one built like a tank. with thick, solid construction. It's built for the long haul. It fits every tuning peg it's ever been fit to, has a cool little compartment built in thats perfect for extra acoustic bridge pins and extra pics, and simply is tough as nails. This is the last one you will ever need to buy.", "id": 683}, {"review": "Theres a reason why so many uke manufacturers supply these strings as standard on their best ukes...they are simply the best there is for a fair price. The sound brightens up and amplifies even the most dull sounding uke, and allows for a smooth experience once stretched properly. Not much more can be said about these awesome strings...stop reading this and order them! :-)", "id": 698}, {"review": "I love the way this tuner works, with a bright screen and easy to use controls. The metronome feature is also a nice addition. It's a bit lightweight, making it seem like it wont last very long if even dropped once, but it hit the floor many times on me already and it's still going strong :-) This is a great tuner at an even better price, try it out and see for yourself!", "id": 733}, {"review": "For those looking for a solid, well made bass amp to step up to from the cheapies that usually come with beginner bass set ups, this is a hard one to beat. It has 25 watts, a line out for outputting to a PA system or bass cabinet, and an effects loop for adding effects pedals. The design is solid, well made and will go the distance. This is my second one, the first one went two years with zero problems, and I beat it up nearly every day gigging at small venues and just plain abusing it....it took it well. Highly recommended!", "id": 736}, {"review": "I've got several capos, from the highest end models to the cheapest, and this one is every bit as good as the expensive ones, with ease of use and solid build quality. Why spend more?? Just buy it, and stop over paying for your capos forever more!", "id": 802}, {"review": "If your looking for a great, fast and accurate tuner for your guitar or bass, this is the one for you. It is easy to see in light or dark venues, has great build quality, and helps to tune your instrument in record time. I don't go anywhere without it, it may well be the last tuner you'll ever need.Flaws are few. The battery life could be better and it wont work with acoustics(no built in mic), but then you know that before you buy it, so you cant really complain. It would just be nice if it included one is all.All told, if you need a great tuner, look no further, this is one of the best, especially for the price paid. Why are you still reading this?? Buy it already ;-)", "id": 811}, {"review": "This is a solid stand, with good adjustability and a thick, decent quality foam to cushion your guitar/bass....its only fault is its price. Amazon sells cheaper versions that are just as good. Simply search  for guitar stands on here and see for yourself.", "id": 841}, {"review": "I bought this on a whim to use as a low cost tuner for my Hola! uke...and find myself using it on my six string guitar and four string bass as well. It tunes quickly and easily, with different colors used for when your too high or too low in pitch, and uses green as the color when you nail it, very nice and easy to use. It's also very compact, easily storing in even the tightest of gig bags, even your pants pocket will do for traveling.I highly recommend this if your on a tight budget and can only get one tuner for multiple instruments, it's a bargain and it works great. You can't honestly ask for more!", "id": 846}, {"review": "I never really considered a cheaper cable, I was always taught to get the best I could afford. When this showed up in a cable search on amazon, I jumped on it. I figured I had nothing to lose.To my surprise, this is an excellent cable, with good build quality and a strong, thick jacket that inspires confidence. The sound through it is identical to my Monster cables, and it cost one quarter the price....hmmmm, guess I should have tried to figure this out myself instead of listening to &#34;snobs&#34; for so many years. I will never do that again.This is worth the money twice over, try it out for yourself and kiss overpriced cables goodbye!", "id": 6}, {"review": "I've used these since I fist started playing, always trying the latest and greatest along the way, but I keep on coming back to these. They have a great feel to them, sound twangy and great, have decent durability, are cheap as all get out, and have the best multi pack deals out there(especially on Amazon)....I simply don't see any reason to switch atm. Try 'em out, you'll like 'em :)", "id": 156}, {"review": "I've used so many guitar cables over the years that I lost count. It's hard to find a tough, low noise cable for less than ten bucks anywhere, but this one is the best one out there for the price paid. Its made well, with strong plug ends and a thick yet flexable cable covering that I love. I use it for all of my equipment connections, and it simply works with no problems and no noise that I could detect. Try it out, you'll discover the same as me and my band mate's have, that this is the best cable for the money on Amazon!", "id": 168}, {"review": "Normal pickguard screws, nothing special here. You do get a nice amount for the money, though, so this is still a good, if not great, deal. Good to buy for stocking up with, just don't expect anything special because of the Fender name.", "id": 215}, {"review": "I like these picks for use with my ukulele, it makes strumming a lot easier on these old hands of mine. It sounds exactly like the sound you make while strumming with your fingers, and they seem to be sturdy enough to last awhile. A worthwhile buy for tired fingers :-)", "id": 245}]