[{"review": "This is the #1 mic you should get, recording or live, instruments or voice, it always come through  with a great sound and seems almost indestructible.looking forward to work with it on future projects, can't believe it took me so long to get one of those", "id": 19}, {"review": "Well, just got one of this and been messin with it for a couple of hours...Now that's a Fun king wah wah!!It's big, it's hard and it's heavy but when you turn it on you understand why this is the original. It sounds exactly like how i always imagined, like in all those records...This one gets the big 5 for being everything i wanted it to be!", "id": 41}, {"review": "Well, just got one of this and been messin with it for a couple of hours...I still think it takes a bit of brightness on bypass but when it's on it's great! I've been thinking on using it mainly as a boost for leads but it sounds so much better with it i can't seem to turn it off!it's light, small and it looks well built but only time will tell how resistent it is but hey for 30 bucks it's a great deal!This is a good EQ for an excelent price, not an excelent EQ so i give it a 4 out of 5 and look forward to testing some others danelectro pedals.", "id": 84}, {"review": "As LC condenser it's definitely a light weight, but for lesse than a $100 bucks it sounds pretty good...Used on acoustic guitar with less than satisfatory results, but got a great sound out of a violin and a fairly decent voice sound.Looking forward to more tests.", "id": 371}, {"review": "Well, just got one of this and been messin with it for a couple of hours...It's exactly what you would expect from Behringer, it works...it's not great but it get's the job done, i feel it takes quite a bit of brightness and definition but it's still pretty useful for less than $25I don't regret geting this because delays are so much fun but i wonder if i should have gone withDanelectro D-8 Fab 600Ms Delaywell, maybe next time...I give it a 3 out of 5, it wasn't this time Behringer surprised me.", "id": 506}]