[{"review": "Comfortable and easy to adjust for length.Additionally, it easily snaps off the banjo when you want to put the banjo in a tight case...My case is tight around the head, so I unsnap the strap and store it in the case by the neck of the banjo.", "id": 101}, {"review": "The Planet Waves instrument cables have a nice heft to them and click firmly into the amp/instrument.I have had no problems with them at all.The attached elastic tie down that comes with these custom cables makes it easy to coil the cables for storage.5 stars.", "id": 195}, {"review": "The tuners I have for my guitar/banjo have modes for use as a metronome.  The problem is to use them as a metronome you have to push a small multifunction button to switch to metronome function, then press smaller buttons to set the speed of the metronome.  I find them annoying.This metronome can be set with one hand by simply turning it on and twisting a dial.  The speed is easy to read and setting the loudness of the metronome clicks is easily changed.  And there are two clicks to choose from.  The metronome has a flashing light too.Overall a very useable metronome.5 stars.", "id": 390}, {"review": "This tuner can be adjusted to be very easy to see when you tune your instrument.It senses the vibrations of the string through the neck and head, so the sounds of other instruments do not effect the tuning.Very light, so I leave it on when I play...and it turns itself off when I forget, so it doesn't unnecessarily drain the batteries.Inexpensive so can afford three, one for a banjo, one for a bass and one for a guitar to keep in each instrument's case.", "id": 706}, {"review": "I bought this amp for practicing my bass at home.  I really liked the sound.  It was crisp and clear, just like I expected from an Ampeg.It looked great and felt solid.Then after two weeks it developed an annoying metallic rattle inside the case.  The rattle just got worse, louder as I played.  It was very annoying.  I didn't feel comfortable opening up a new amp and trying to trouble shoot it myself. I had visions of voiding the warranty and being stuck with an amp I couldn't play.I was sad returning the Ampeg, great sound for the price, but I was soured on Ampeg, perhaps unfairly from a sample of 1. I replaced it with a Fender Bronco which has an Ampeg emulation setting so my bass world is back in balance.Admittedly since the Fender Bronco was more than twice as expensive as the Ampeg, I have thought that I could have just taken the money I spent on the Fender Bronco and bought a more expensive Ampeg, on the guess that a more expensive Ampeg would have a better design or materials or quality control.  But a guess is just a guess and I didn't want to test that guess by throwing more money at Ampeg, so the Fender Bronco got my money.My rating of 3 stars is an average of 5 stars for quality of sound, and a 1 star for quality of production.", "id": 736}, {"review": "This tuner is tiny and works as advertised to tune my guitar, bass and banjo.  I have tested it against other, older and larger tuners and all tune to the same accuracy, which is very good.I docked it one star because the screen doesn't stay on (in my opinion) long enough when I am trying to tune a string.  When I pick a string, the screen flashed for a brief second with the tuning information and then goes blank.  It works, but I find other tuners easier to use that have screens that stay on longer with each pick.Perhaps a more experienced guitar play may only need that brief flash of tuning information to tune a screen, but for me I find it easier to have the tuning information displayed longer.Also this tuner is tiny.  I can leave it on my instrument when I put the instrument in a case, no problem at all.  The flip side of this is that the screen is tiny too.  Really tiny...almost hard to read tiny.  You need to decide if this tiny size is an advantage or disadvantage for you.", "id": 785}]