[{"review": "I got these for a parts-tele I built and I'm really happy with them.  Like all vintage tuners you may need conversion bushings to make them fit modern peg holes which are usually larger.  But they look great, work great, stay in tune and are completely vintage spec.  I have a '57 reissue strat and I can't tell the difference.  One thing I've always loved about vintage tuners is that you tuck the strings in the center of the shaft so it keeps the headstock looking neat.", "id": 114}, {"review": "I really like the deluxe bags by fender.  Plenty of space for stuff, good straps and carry options and enough padding to provide as much protection as a soft bag can.", "id": 468}, {"review": "It's sturdy, well made, and cheap.  You couldn't go out and buy the raw material and put something like this together for what you pay for it.  I've used it with a couple of amps and it'll handle up to say an AC30 without an issues.", "id": 517}, {"review": "I've had this for about 3 years and I agree with every one here that this is a fantastic amp at a good price point.  It's a wonderful sounding amp and gives you good chimey cleans and lush distorted breakup.  It only gets better as the speaker breaks in so make sure you put lots of hours on it initially and you will be rewarded.  If it was between this an a Blues Jr. which are similarly powered and priced I'd opt for this in a second.  I think the AC15C1 is actually a better blues amp.(Opinions vary of course)I only have a couple is \"wishes\" as they're not really gripes.  One is the stock reverb.  It's really overboard in a way that I didn't find musical.  I ordered a new tank and now it's great.  I hope Vox changed this out because I found anything over 2 on the stock tank way too much.  Second would be an FX loop.  Not a deal breaker as the amp takes pedals well but it would a good feature as wold be channel switching built in.  Third and last I wish it came with a footswitch to turn the Trem and Verb on/off and switch between the top boost and normal channels.  I know you can get it aftermarket but it would have been nice.  Probably one of the reasons it's so affordable.And speaking of foot switches do yourself a favor and get an a/b/y switch for this.  It allows you to switch between the top boost/normal channels and also allows you to run through both channels at the same time and let me tell you there are some really sweet tones when you run both channels at once.  I've gone through a fair amount of gear in my time but don't see getting rid of this.  It's such a fun little amp that it's nice to have around even if it were not my main go-to amp.  It's certainly loud enough for small venues and jamming with a controlled drummer but it's not going to shake the paint off the walls like an AC30.  Highly recommended.", "id": 665}, {"review": "I just received this a day ago and bought it on whim after being very impressed with the Joyo Crunch Pedal.  This is (I think) based on a very expensive sweet honey drive pedal.  It's supposed to be very reactive to your playing.  Dig in and it puts out distortion, play soft and it cleans up.  This is much more noticeable the cleaner you run your amp.  I can say it's pretty reactive and feels like a very responsive tube screamer.  I've heard some say they find the distortion from this pedal a little harsh but I find is wonderfully smooth with some grit.  I found it really warmed up my sound in a good way.  I'm playing an american strat with noisless Dimarzio Area pickups through a Vox AC15 and it's an awesome combo.  I put this pedal in front of my OCD and I was really getting some sweet tones.  If I had to play out with just my amp and one pedal for a little dirt this might win over my OCD.  It's expensive for a Joyo but cheap for a really good OD stomp.  It's definitely not for metal or heavier distortion stuff but it's got plenty on tap for blues and classic rock.  So far I've been super pleased by Joyo pedals.  The jury is still out on how well they hold but but they sure sound and perform pretty darn well.", "id": 833}, {"review": "This Review is for the (JOYO CRUNCH DISTORTION)  I have a few OD's including a OCD, a fuzz and a modded Rat but thought for $30 bucks from Crazy Cart this might be a cool distortion pedal. And it is. It's very articulate and gives you good Marshally 70s/80s crunch. Cleans up nice with the guitars volume and retains your guitars sound. It's almost OD-ish in it's responsiveness. It's not super heavy distortion though. I'm a blues/classic rock guy and it'll do fine for heavy, classic rock distortion but it's not a modern metal pedal. For the price its amazing. I really love it. I'm so impressed with this pedal that I've ordered the Sweet Baby and will probably get a couple of others while they're still cheap.", "id": 794}, {"review": "I got this from a \"direct from china\" vendor.  When it arrived the volume pot was not working.  It would only operate at about the first 1/4 of travel and then die off.  I was ready to give up but on the second day it just started working(???).  So I don't know if it's a fair representation of these pedals.  I have two other fuzz's(Swollen Pickle & MXR 108 Classic Fuzz).  To me this pedal is pretty nice but sounds a bit compressed.  The Octave feature is a little useless for anything other than lead work and the mid-cut makes it a bit nasal sounding.  Don't get me wrong, it's a pretty cool pedal but it's not as nice to my ears as my other two fuzz pedals.  But those pedals are about $100+ so if you just want to play around with a fuzz pedal this might do the trick.  But do buy from a local vender in case you get a lemon.  All in all I think if you really want a quality fuzz pedal you might be better off somewhere else.  I own a few other joyo pedals that I love but to me this one is just OK.", "id": 836}]