[{"review": "Pop filter works great. This really eliminated many subtle flaws I had with audio recording. Granted, you can make a make-shift pop filter using a hollow ring and nylon. But the adjustable clamp is really...well adjustable so fits many unique mic placement situations. Plus, although it is flexible, it is also very sturdy so don't worry about and vibration noises coming from this.", "id": 46}, {"review": "I was pleasantly surprised of how heavy the base was compared to what I was expecting. The adjustable stand also works great and won't fall on you or anything. I bought this and a mic/boom stand for my Samson SP01 Shockmount (which the Audio-Technica condenser mic is on), however its connecting slot is a 3/8in female while this stand has a 5/8in male (same with the mic/boom stand). So just make sure whatever it is you're buying can connect properly with the stand. If not, just buy a cheap (about 6$) adapter like I did.", "id": 224}, {"review": "Almost all of this product is made with very sturdy materials. Can double as a mic or boom stand. The boom attachment is very easily adjustable but also very sturdy when you lock it down. Wasn't disappointed. The connecting parts of the mic stand/boom are 5/8 inch male size so make sure whatever you're buying this product with can connect to that (my shock mount had 3/8in female connector). If not, just invest (about 6$) into an adapter like I did.", "id": 279}, {"review": "This microphone's quality is amazing. I just hooked it up to my PC (Windows 7) and it worked no hassle whatsoever. Nothing to install or hoops to jump through, just works great. I recommend buying a mic stand of some kind if you really want to eliminate vibration or other background noises. The stand that comes with it is very stable, but it is low to the ground (or in this case, desk/table) so it may pick up some unwanted background noise (computer fans, mouse clicks/movement, etc).", "id": 525}, {"review": "Does what it says it will do and it does it very well. The connector is a 3/8in female slot so make sure whatever it is you're buying can connect to that. The mic/boom stand I bought and the on desk stand were both 5/8in male so I had to buy 2 cheap adapters (6$ each). I also am having some issues really \"locking\" in the Audio-Technica condenser mic to the shock mount. So far it stays in, but isn't \"super\" secure (wobbles just a little if it's moved), but maybe I'm just doing it wrong. Aside from that, though, great product.", "id": 393}]