[{"review": "I bought these because I really had too long of mike cords for my solo live show. And these are really nice cords if you have a home portastudio recording studio like myself. Who needs all the spaghetti to trip on all over the place? I bought two because I use a Digitech Live 2 Harmony processor and two XLR mike cords are required to make it operational. Good price here too. Hard to find just 10' mike cords. Usually longer ones are only obtainable.", "id": 5}, {"review": "Why drive a Pinto when you can drive a Cadillac? This is the industries best mic as far as I am concerned. I had a Shure SM 58 like everyone else owned but there is no comparison between this mic and a SM58. SM 58 is garbage compared to the Beta 58A. Spring for the extra bucks and be happy. That's what I always say.", "id": 23}, {"review": "The MXL 990 sounds just as every bit as good as some very expensive mikes I have used. Just like with any condenser mike it's a good idea to invest in a decent pop filter if you don't want those annoying popping P's in your recordings. I would recommend this mike to anyone for vocals or miking acoustic guitars in your recording studio or portastudio. Also a great mike for doing voiceovers.", "id": 159}, {"review": "For me being a solo 12 string guitar and vocal act this works just fine for me. And you get the extra plugs ins supplied by Focusrite too with this interface. I cannot say I am wild about the included software which is Ableton Live Lite 8. I really disliked the screen views of Ableton and thought they were hard to view. So I did some scouting around and talked to a few techs and they suggested Mixcraft 6. WOW! I like a mixing board that is right up in my face and no guesswork. Mixcraft 6 is so user friendly and you don't have to bring in a professor from another planet to understand it. You can be laying down and recording tracks in no time. And shouldn't recording be fun and not frustrating besides? The Focusrite Interface recognized Mixcraft 6 as if it were an old school bud and the extra plug ins. So all and all it turned out great and I am a happy camper. This in my opinion is one of the best entry level Recording Audio Interface units around. It also has phantom power for those of you who have condenser mikes requiring phantom power. Dollar for dollar you cannot go wrong with this interface. Engineered in England. And on the downside, made in China. (Isn't everything these days?)", "id": 801}, {"review": "What my headline says. It does exactly what it's supposed to do. Removes those annoying popping P's out of your recordings. Until you can afford a Sennheiser condenser microphone that has a built in pop filter than you're going to need this. And the price was right too.", "id": 46}]