[{"review": "While the Nanowebs are coated and then coiled, the Polywebs are first coiled and then completely coated.  They both feel very, very smooth to play and the sound is amazing, I mean really amazing.  The Nano's sound is not quite as smooth and rich and heavy as the Poly's.  I would recommend trying both types for your electric guitars.  The Nanos may sound better for you on a hollow-body electric, and the Polys may sound better for you on a solid body electric; it's a personal preference like anything else.  The Polywebs though feel and are really smooth and give you a really fat, mellow, sweet sound.", "id": 106}, {"review": "I opened the package for the first time and didn't think much of it, but the cloth works great on cleaning frets and even the cardboard template does its job.  Obviously, cardboard isn't going to last so purchase metal templates and use the cloths.", "id": 317}, {"review": "The capo design makes for a quick and easy install on the fretboard.  What I like most is that the padded arm is thin and keeps out of the way of your playing.  Highly recommended!", "id": 490}, {"review": "OK, it's a tuner.  But.....it is dead balls-on accurate, quick tuning and easy to read even in daylight.  Great for gigs in that you can tune and re-tune during performances with fast, fast accuracy.  I own 5 or 6 of them, one for each guitar, and I highly recommend them over ANYTHING else.", "id": 707}, {"review": "They are comfortable to use.  The Planet Wave logo gives me a nice grip on the pick; and I like heavy picks, so the \"heavy\" option fits my preference.  I've got a gig tomorrow night, so we'll see how they work then.", "id": 577}, {"review": "This is the best clip on tuner out there.  It's dead accurate, doesn't bounce around like dial needle tuners, and it's EASY TO READ!  You just clip it to your headstock, either acoustic or electric, turn it on, position the face toward you and start tuning very quickly.  Highly recommended for all string players, especially electric or acoustic guitar or Dobro.  There are other tuners by Snark that are more sensitive to lower ranges and higher ranges, so check out what suits your needs.", "id": 706}]