[{"review": "I like these straplocks, but they were a little tight to get on a Levy's strap.  I did manage to get it on.  However, I found it was easier just to buy a strap for each guitar.", "id": 44}, {"review": "I have two of these.  They hold a variety of guitars just fine.Since the blocks are square, make sure you get them aligned with a wall or ceiling so they don't look crooked.  They seem to come from a variety of wood - mine are not a matched set even though I ordered two of the same part.  They have different wood grains.", "id": 166}, {"review": "I used this along with a Dunlop DC adapter and it all fits nicely.  I'm powering a Zoom MS-50G and a Fulltone OCD.  It will pay for itself over a year in saved battery costs.", "id": 192}, {"review": "I really like this strap.  I ended up ordering a total of three with different color schemes so I can have one on each guitar.  They're really comfortable.  They're much less bulky than most of the leather straps I've seen, so I can just keep them on the guitar in the case.I've had the original blue one I bought for about 3 years and it still looks and functions like new.", "id": 286}, {"review": "It's a cable.  It works great.  I don't see any reason to spend more money on a short cable like this.", "id": 494}, {"review": "I'm only running two pedals, so I'm not sure how far you can push this, but it's working fine for my setup.", "id": 521}, {"review": "This is really a great amp for the price.  If you're new to electric guitar, and you want an amp to get started, buy this one.  It has incredible versatility, and you can get started with trying out a huge range of different sounds without having to invest in a variety of effects and different amps.I got much more than I expected for the price of this amp.  I really like the Bassman and Twin Reverb settings.I won't claim that you can buy this amp and never have need for something bigger, better, vintage tube, etc., but this will more than meet your needs to use at home.  Buy the 20W version, which is plenty loud for home.  Later - when you have the skills to justify it, start buying some tube equipment.  This amp will help you figure out what tones you like for the music you want to play.I considered various new/used amps in the same price range, and I'm extremely happy I picked this one.  If you came by my house with some other brand new amp that cost twice as much as this and wanted to trade me, I'd tell you to go away.  But if you stop by with a nice Twin Reverb, I'd give up my Mustang ... but then I'd go buy another one.", "id": 718}, {"review": "I replaced an older Snark that I use all the time, but seems to be cutting out sometimes.  I love this new one.  It's a bit easier to see the display.", "id": 820}, {"review": "I played with light acoustic strings for a long time.  I tried these and they make for much easier action.Do you lose tone quality that you would get with heavier strings?  ... maybe, but the tone is still much improved going from old light gauge strings to new extra light strings.I'll probably stick with extra light for awhile.  They sound great to me, and I can play longer without getting sore fingers.", "id": 198}, {"review": "This is an extremely versatile pedal.  I was considering getting a reverb or delay pedal, but I decided to go with this instead since it's infinitely more flexible.There are tons of effects.  Some I might not use, but there are plenty I will use.  New firmware was just released, and it adds a few extra effects.  You download the firmware and install via the USB port.I use it with a VHT special 6.  I have a Fulltone OCD after the Zoom.  It works nicely with the tube amp whether or not I turn the OCD on.  The effects sound excellent to me.  I'm now a Zoom fan.If you're lusting after a bunch of effects pedals, but only have the cash for one, this is a really good option.  At a minimum, you'll hopefully figure out the 5-10 you won't really use without having to shell out the cash for them.", "id": 862}]