[{"review": "This is a great Tremolo pedal.It is very quiet and when used correctly, there is absolutely no signal drop or volume drop whatsoever.You can blend the Tremolo type from a smooth sinuous pulsing waveform to a sharper edged \"on/off\" type tremolo.Tremolo varies the volume of the sound. It does not vary the pitch.You have control over the \"depth\" or \"amount\" of effect, and you can control how fast the effect pulsates the sound.A very simple, popular effect that I wouldn't want to live without in some form or another.Pretty teal green color.As with all Boss products they are built like a tank and generally last forever if they are not abused or damaged.I have no idea how fast this pedal eats batteries because I use a power supply.There is no on/off clicking when depressed.There is no added hiss, hum or distortion.The battery compartment is easily accessed without having to unplug anything.Simply a great effect and quality product from Boss and tends to hold its resale value well.", "id": 39}, {"review": "Terrific All-in-One Must-Have Tool for Guitarists!I have been using the older style Planet Waves model of this winder/cutter/bridge pin tool and when it came in I was a little skeptical about the new model.I am happy to see that the changes are relatively minor and if anything it is just a little bit smaller so it will fit inside your case compartment more easily leaving more room for other junk.I have used the Planet Waves tolls for years without any difficulty or problems with breaking, bending, becoming dull or unusable. They keep on keeping on and I have one in every case.Buy, you'll love it, and if not, you can always return it.Hope this helps!", "id": 94}, {"review": "Probably the best single thing this cable has going for it is the Lifetime Warranty.I have owned Planet Waves cables in the past and twice I have sent them back for replacement...no problems whatsoever.For the price you are paying (about $1 dollar per foot) you get good quality cable, good cores and shielding with heavy duty retention at the jack connector ends.Not the best, but not the worst. Good enough for live stage gigging and probably won't notice much difference if you are recording.I haven't noticed any RF hum or noise when moving about with these cables.They also come with a set of colored bands so you can easily identify which cable goes to where, cable owner, etc.Affordable price and lifetime warranty make this a \"feel good\" purchase.I would recommend these cables and will buy again.", "id": 195}, {"review": "D'Addario Strings Are Simply The Best!The brightest tone, normal lifespan, fair prices,, and louder than the rest!I have played guitar professionally for over 27 years.These strings are the best all around for tone, clarity, punch and volume.Don't be fooled by strings that may last longer or have coating on them just to sacrifice clear tone.One a side note. I hate their new packaging.They used to wrap them individually in paper sleeves. Then about a decade ago they started winding them individually, but placed them loosely inside a plastic sealed pouch. NOW, they wind up two at a time, and place them inside a plastic pouch. Arrgh!Same great strings and tone, but now you have to unwind them from their &#34;pairs&#34; and lay them out two-at-a-time...kind of aggravating, but NO FRIGGIN' WAY WOULD I EVER USE ANOTHER STRING! - lol!I compared these (and other D'Addario's) to other manufacturers...they were much louder and cleaner.Don't be an idiot. Buy the best all around string and improve your tone immediately.", "id": 198}, {"review": "Without going to extremes and spending two-hundred bucks on an NOS tube from 1957, I recommend for us frugal individuals to go the cheaper route until you get your first platinum hit.JJ's tubes are well-trusted and have become the defacto standard when selecting quality and tested reliability.BTW - 12AXT and ECC83 are the same tube.I can't remember the last time I had a JJ tube go microphonic beyond control.I have played full time for over 27 years. I use these.Hope this helps.", "id": 228}, {"review": "I ordered these for a Gibson Songwriter Deluxe EC Custom Vintage and they seem a little bit thinner with slightly smaller heads and a micro-touch longer than the stock pins from Gibson.The pins measure: 28mm -or- 1 1/4\" inches in length.I was going to return them but figured I would try them out in my Gibson Blues King L-00 parlor sized guitar.It was about the same result, a little too thin, smaller heads and slightly longer but I went ahead and tried them.GLAD I DID.I didn't think that after using the Tusq bridge that came stock from Gibson it would make any detectable difference but I was wrong. I CAN tell a slight difference. I did not remove the strings, just loosened them so it was compared to the set that was on it, which were fresh from yesterday.A small amount of improvement in sustain and high end frequencies ringing out was noticeable.They also provide a graph in the packaging info, but I think that it was a test using BOTH the TUSQ pins AND replacement saddle. If you haven't changed your saddle...do it now and get rid of that soft plastic one.I must admit, I did order these with about 75% of \"dressing up\" the guitar in mind, and any amount of tonal improvement would be gladly appreciated but not expected. I got both.White with Paua Dot inlay looks very nice and provides the eye candy I was seeking, although there is no care taken as to \"match the dots\" for consistency, -they will vary in appearance.The TUSQ Pins being a wee bit smaller seem to slide down all the way...right away and need to be pushed all the way into the slot while stringing up the guitar. The heads set flush to the bridge mount compared to the Gibson stock plastic pins that stick up a little higher, and I do wish that the TUSQ pins were the same size.I will see how well they do on the Blues King and most likely will order new pins for the Songwriter Deluxe once they pass the test of time and playing for a month or two. I don't expect them to cause any problems and should provide the extra sustain and ringing that is very much appreciated in any small amount or fashion!If in doubt, consider changing your strings to a brand that might be more suited for the \"tone\" you have in mind, be it darker, brighter, softer, louder, etc. Strings make a big difference and I find using D'Addario phosphor bronze strings very bright & ringy, last long, are affordable, and seem noticeably louder than GHS or Ernie Ball. (steel strings only - does not apply to nylon or gut strings.)Once again, if you have a plastic saddle and/or nut then these pins might not make much of a noticeable difference...then again, they might make all the difference in the world! You just have to try them and see.They are inexpensive and pretty...well worth the risk!", "id": 263}, {"review": "I ordered three of these ...so far!Very affordable and good quality. Made in Canada.Keeps wireless unit very snug and tight.Easy in and out with Velcro retaining strap. (all leather.)I use the little plastic flat ring on the bottom to loop my strap through which keeps it tight against the guitar strap.The width of the slots are 1 inch and 1/16&#34; or approximately 27 mm wide. The leather will bend a little to allow a slightly larger and tighter fit.These are much better than I suspected and have a few expensive Levy's classic padded straps. They fit each other like a glove and are very high quality without getting ridiculous or gawdy.If you click on the item and go to the product page I have uploaded some photos of actual use and close-ups.", "id": 264}, {"review": "Man...when I saw these things a light came on in my head...it was an &#34;uh, duh&#34; moment.No noise, plenty of length and nicely spaced with right-angle plugs for all your standard 9V DC pedals.Any complaints about noise with these cables it just a symptom of something wrong within their setup.I had an old wall-wart laying around and put it to good use.Check the total amount of amperage draw (usually 500-1000 milliamps) to make sure your wall-wart can handle it and daisy-chain away!", "id": 486}, {"review": "Without going over the fiscal cliff these cables worked very well in my 7-pedal guitar effect lineup.No noticeable hiss, hum or buzzing. Clean & quiet.Good buy for the price.", "id": 494}, {"review": "Fits nicely and tight on standard wide threaded microphone stands. If you have the smaller \"screw headed\" ends on your microphone stand, you can get a little threaded adapter at any music store for next to nothing. (Maybe a dollar, if they don't just give it to you.)Using this with stands that have a heavy round base takes up less space onstage and other places, as well as making it easy to relocate and keep out of the way.No need for a tripod stand with the legs folding up and out, getting in the way, plus most inexpensive tripods are cheaply made, very light and will break easily when moving gear or simply tripping over them.The base screws down all the way onto the stand until it is hand tight.The set screw allows for tilting and turning adjustment of the camera.The set screw presses against a ball-socket hinge and has a plastic thumb knob that seems a little fragile. I am very careful not to over-tighten in fear of twisting off the plastic thumb tightening knob.I am also leery of stripping the set screw or the threads inside the housing, but at this price I guess you can't expect to have a sophisticated adjustment mechanism, eh?There is a notch in the side of the housing to allow for a 90-degree preset angle.The metal thumbscrew that attaches the base of the camera to the adapter has a rubber washer as well as a thin rubber mat acting as like a cushioning gasket when tightened to your camera.Be careful. The metal thumbscrew can easily fall out from the holding plate when transporting, removing or switching cameras. I found a little 'plastic threaded washer-like ring' that screws onto the holding plate screw when not in use. You could easily find many types of washers, screws, plastic pieces, etc., to hold it in place when in storage or transport. You could also leave it attached to your camera. Either way, be careful not to let it fall out and get lost.Overall the \"little thing\" is quite solid, heavy and sturdy and takes up little to no real estate and does a great job at being small, basic, solid and inexpensive.It holds well when bumped or moved. Mine has absolutely \"no slop\" in it, does not wobble or come loose. I would not put a larger sized 8mm camera or heavy camera on this adapter. Most modern devices will do just fine.Again, just make sure you tighten it up 'just enough' to hold it well. Don't put the grip of Hercules on it and it should last for years. Mine has.I'm happy with mine and bought our drummer one for Christmas.Hope this helps!", "id": 548}, {"review": "If you are ordering these to replace one or two of your Gibson Speed knobs, you will want to replace all four because they are not identical to Gibson's.In all fairness, these could possibly be BETTER than Gibson's stock, seem to be made with a more solid underside, but the numbers are a little bit smaller.This is the only reason I gave them four stars.Fit perfectly on CTS potentiometers and if you replace all four of them, nobody except you will know! -lol.All four of mine were fine with no apparent flaws or defects, as opposed to other reviews.If you get these and they aren't perfect...send them back until you get a perfect set! It's free!Hope this helps...not much else to say!", "id": 853}, {"review": "I thought I would throw my two-cents in about the new design and effectiveness of this soundhole humidifier.After making a few homemade case humidifiers out of things like a travel butter container with many holes drilled into it and a sponge, I started thinking about how some of the cases separate the body cavity from the neck & headstock cavity inside the guitar case and not allowing the humidity to flow freely to all areas, especially the body where it is needed the most.Even though I was getting acceptable humidification in the case I was concerned about the body being dryer in comparison so I went ahead and splurged the 8 bucks on these. (I actually bought three of them.)I crank the gas heat up in the house in the winter and A/C in the summer, keep my guitars inside their cases and inside a closet. The humidity drops quite low, but the sponges remain moist for several days before I can no longer fight the urge to re-wet them. lol.Two great tips in one:Use a regular, more dense sponge, thicker like the ones at the dollar store. Cut them to size and stuff them in!Throw away the sponge when it starts to get yucky and don't worry about distilled water, unless you want to. I can't argue using very pure water compared to the possibly toxic crap that comes out our faucets, but for one dollar you can get a boat load of them after you cut them to size, and toss them away without any regard when needing replaced.Don't worry about the &#34;thing&#34; hanging in-between your strings. It will not damage anything unless you get the sponge  too saturated and it leaks. I will either squeeze the excess water out, or shake the container with the sponge inside until I am satisfied that it won't drip.The humidifier will not cause any stress or damage to your strings by spreading them when you wedge this inside your soundhole.If you ARE rough, careless, thoughtless, or stupid, you could possibly knock this loose and have it rub or fall out, but I would be more worried about the guitar and what it would take for this to happen. This would be more extreme to the guitar than the humidifier or any harm it could cause.The top snaps on by squeezing the sides to release little tabs that stick through the top cover. The sponge inside is quite small, and there isn't too much room for a much larger sponge. The device is simple and fairly solid. Treat it gently and it will last forever. You can easily clean the inside or run it through a dishwasher. If you give the inside a quick rinse every few fills, I'm sure it would be a decade before anything &#34;built up&#34; to require extensive cleaning or replacement.Keep an eye on it for the first few days and then weeks to get a feel for when you should be re-wetting the sponge.Try to keep the sponge moist when it's dry.I strongly suggest getting an Oasis case humidifier, (or similar) mini sized about 1&#34; X 4&#34; costing around 17-20 bucks.This will take any guesswork out of the equation and give you fairly accurate readings inside your guitar or instrument case.Remember, too much humidity can cause your acoustic guitar to warp. Too dry and it will shrink and crack, split the soundboard (top) also leaving the edges of the frets sticking out like the backbone of a fish and quite abrasive!If you spent more than one hundred dollars on your guitar and live where it gets cold and/or dry, you would be negligent (if not careless) to spend the pittance to make sure your 'baby ain't thirsty', or worse...dead & broken!Hope this helps!", "id": 71}, {"review": "I have owned many delay pedals in the past several decades.I like this one the best...especially for the price range.Boss DD-7 beats the pants off the Line 6 Echo Park delay. The Echo Park delay causes a little noise/interference when not used, being caused by the little LED light flashing...you can hear it buzz each time it flashes through the amp. The Boss DD-7 was perfectly clean and did not alter the tone.Many great features including an on-the-fly sampler/looper.The ability to control it with an external pedal/switch.Easy to set and adjust while playing live and on-the-fly.Matches perfectly with other Boss pedals.Standard \"Built Like A Tank\" Boss construction is renowned for.It also beats the other Boss Delay pedals available for quality, sound and features.Many options, settings and configuration choices makes this pedal versatile.I bought this for quality, ease of use and straightforward operation while playing live.It also \"self-oscillates & freaks out\" quite well. (If you're into that sort of thing!)Make sure you read the instruction and settings operation manual. There are \"new\" operations and ways to \"set\" this pedal up to perform certain functions.", "id": 511}]