[{"review": "I was a bit disappointed in this gadget.  It just doesn't have the quality sound that I expected from the material written about it.  I've had much better luck with a simple interface between my guitar and iPhone or iPad.  That arrangement isn't as compact as this Vox product, but the sound is much more pleasing.", "id": 546}, {"review": "This is one of the best, simple to use, guitar tuners I've used -- and I've used a lot of them.  The bonus is that it's also one of the least expensive that I've seen.  You won't be disappointed.", "id": 762}, {"review": "This gadget works fine to connect an electric guitar to an iPad or iPhone or a computer, but the particular one I received has a defective input socket for a 1/4 inch audio plug.  It doesn't snap in place.  Just sits there waiting to let the plug slide out.  That makes it fairly useless.  I may have simply gotten a defective one.", "id": 764}, {"review": "I'm normally an acoustic guitar player but recently acquired my first electric ever.  It was used, and the strings were dismal sounding, so I bought these D'Addario EXLs.  They hold pitch beautifully.  My only complaint has to do with my guitar technique, not the strings.  Having used heavier strings forever on my acoustic guitars, the recommended lighter gauge recommended for the electric don't like my \"heavy-handed\" approach to pressing down the strings.  As a result, the highly bendable lighter strings become sharp up near the nut until I relax and enjoy playing with a very light touch.  It will take some getting used to -- or else I'll simply move to heavier strings and leave the lighter ones to lead guitarists who know what they are doing.  All of that said, the strings are pure joy to play.", "id": 197}, {"review": "As an amateur musician, I'm always looking for ways to practice without chasing everyone out of the house with loud amplifiers and such.  I thought this gadget would do the trick, but the quality of the sound and range of adjustment just didn't meet my expectations.", "id": 491}]