[{"review": "Very good quality cable and plugs. Easy to make custom length cables from 3 inches to 30 ft. My pedal board looks so professional and uncluttered that I actually made room for 1 more because there was no extra wire to get in the way.", "id": 312}, {"review": "I bought this for my new 12 string Guild acoustic. I use Oasis humidifier for my other acoustics and am satisfied with them. The reason I tried this one is because it's necessary to spread the strings quite a bit to get the tube in between them. And with 12 strings, it really put a lot of tension on them. Another difference is there is nothing to do with the Planet Waves. You slip the included packs (2) into the saddlebag type pouch and slide them between the strings. They should last 3-4 months & you don't do anything else. Also comes with a 3rd one for the headstock. With others you have to add water and remeber to check it so they don't dry out. I also used a Dampit but because it hangs from a cord, it sometimes gets caught on the wiring on an acoustic-electric! I may eventually replace my Oasis humidifiers with these also.", "id": 406}, {"review": "Nice strap. Very comfortable. Doesn't cut into your body at any point. Easy to adjust. Worth the price. Would definitely buy another.", "id": 481}, {"review": "Not as good as the G7th line of Capo but they are about half the price. I bought this for a 12 string Jumbo acoustic guitar and I was thrilled with the way it sounded. So I will probably be using it on my electrics. But like I said it good for the price.", "id": 490}, {"review": "I have several capos & this one really surprised me for the price. It's light-weight yet strong and the adjustable grip is great for any neck. Compared to my G7th which costs 3 times more, it is a great buy. I really like Planet Waves products. They are made well & last.", "id": 843}, {"review": "Not the best but not the worse. This stand works as expected, it can hold a guitar. All the surfaces that make contact with your instrument are covered with rubber padding which is important. Only downside is there's no neck support. I used this mainly for putting my guitar down when not playing not for displaying!", "id": 883}, {"review": "These are laser cut pads for your studio monitors. I feel more vibration from a hard drive spinning on my desktop than the sounds coming out of my speakers. And they look professional too.", "id": 57}]