[{"review": "This is NOT my first guitar. Nor am I breathless Epiphone supporter shouting how this guitar is the sonic equal of Taylors and Martins. It's not. Here's what it is: An exceedingly well-constucted, AMAZINGLY playable guitar. Fit, finish, feel and action were all VERY nice... Sound on the other hand? Let's face it. It's plywood all around. It SOUNDS like plywood. But that doesn't distract from the fact that it's a great guitar for $100 bucks.It's a fine &#34;first&#34; guitar. It's a great beach/camping/cabin guitar. Leave it in your car to practice at lunch. Leave it in the office. ANY guitar is better than no guitar... And this guitar is better than a LOT of other entry level guitars.Seriously consider changing strings the second you take it out of the box... New, premium strings DO make a difference.If your expectations are for a playable, rugged, affordable guitar you won't be disappointed. If sound quality is your primary concern, well... You are going to have to spend more than a hundred bucks to be happy.For my desired application, this guitar was great... I'm very happy with it and would buy it again in a heartbeat.", "id": 53}, {"review": "How you feel about a capo has almost as much to do with the guitar you're using it on... What works great on one guitar might not be so marvelous on another... I can say with confidence that this capo works flawlessly on an American Standard Strat... Fits great, easy on/off, easy adjustments. The padding on the capo is such that you would really have to go out of your way to mar the finish on your neck with it... All relevant areas of the capo are well padded. It seems very well constructed, after two weeks of heavy use, I don't see why it wouldn't last for years.", "id": 116}, {"review": "Don't panic, strings marked A/D/F#/B CAN be used just fine for G/C/E/A tuning... They don't seem to be quite as nice as the comparable Aquilas, but they're half the price... They were for a $20 uke... (And yeah, new $4 strings do improve the sound on a $20 uke!).", "id": 203}, {"review": "Picks are picks right? Select your material, select your weight, and you're done, right?No! these picks have this difficult to describe pattern molded into them... They &#34;grip&#34; your fingers... It's uncanny... They do not slip.I wouldn't touch anything but Fender mediums for years and years... Tried these on a whim... Not I have piles and piles of picks going unused... These are THAT good!", "id": 680}, {"review": "This tuner is amazing, even more so considering the price. It's chromatic, so it will tune anything! I tune electric and acoustic guitars, bass, ukulele and mandolin with it! I've bought three for gifts... It's great.Sooooo, everything I said initially is still true... It's a fantastic little tuner... BUT I've broken two of them. (Where the clip attaches to the tuner - as in a multitude of other reviews...)This tuner *is* amazing... But fragile!", "id": 707}, {"review": "This is the stand you remember from the band room. Effective, and built like a tank. You will need a wrench to assemble (a very simple task). One note - the metal feet would scratch some types of flooring, invest in the optional foot covers if you're concerned.", "id": 339}, {"review": "This is a great little uke for the money... I've bought them for my kids and quite a few for gifts... As many have noted, tuning stability improves GREATLY after the strings stretch in... One suggestion - If you're willing to add a 4-7 bucks to the purchase price, buy a set of D'Addario or Aquila strings and put them on right away... The stock strings are pretty poor, even a set of 4 dollar strings is a vast improvement. Other than that, I love these little guys, and plan to keep on buying them... Finally, if you buy this (or any other uke) do yourself a favor and watch the movie \"Mighty Uke\"... You won't stop smiling...D'Addario J65 Ukulele Strings, SopranoAquila AQ-S Nylgut Soprano Ukulele StringsMighty Uke: The Amazing Comeback of a Musical Underdog", "id": 589}]