[{"review": "This product is not what it seems. It has a cool name, but that's about it. It's a tool oil that stinks. I tried my best to get use to this product, but learned that there are much better ways after going into the studio and recording for the 1st time. After doing away with the Fast-Fret, my playing has improved and I hardly ever have to change my string because of gook. Not to mention that getting that crap on my fingers was just nasty. I now use Old English and my guitars thank me, my nose thanks me and my fingers thank me. You will too...", "id": 72}, {"review": "I usually use 9s, but decided to try these 10s instead. I didn't notice much of a difference at first, but after a while I noticed that it's easier to tune between the G and D string (3rd and 4th strings) because the gauges are closer. Sound is just right for instrumental rock, shredding metal and delivering that Fatal Blow...", "id": 156}, {"review": "I've tried many types of chairs, sitting on my computer char, etc. but it was always awkward. This bench, with its thick padding and wide width allows me to practice playing the guitar and move around freely. Honestly, I even sat on the floor for a while, but no matter what I did my legs would hurt. I just wasn't at the right height. This bench is adjustable and I was able to find a height so that I could practice for hours without putting a strain on my legs and back. It was absolutely worth the small investment for me.", "id": 362}, {"review": "At first I thought the idea of using a metal pick was outrageous, but after actually trying one - I love it. It has really helped me deliever that Fatal Blow...I can honestly say, this is not for strumming or even heavy metal rhythms as you risk breaking a string and putting an eye out. Not to mention that it's hard to strum and sounds awful.What these picks are good for is leads. Rock, Metal, Shredding and even Country. The sound is short with a very high tone pitch. Switching back to a plastic pick and the notes sound a little dull. One plus is, while recording I do not hear much in the way of the pick scraping when doing alternate picking (shredding) as I did with a plastic pick.I still use a plastic pick for slow leads that need that sort of sound, but love these picks when things heat up. Also, I'd like to add that even though I can play Rock You Like A Hurricane by the Scorpions - it never sounds quite right. Until Now. Using a metal pick make the lead scream and help the tone carry for a thicker sound.Also, these picks have a no-slip grip. With the Fender facing your fingers, there is a nice little indent for the thumb and with the added grooves it's very easy to grip and use. It feels funny at first, but I got use to it really quick.I can honestly say that this is one of those things you just have to try for yourself to get the full experience...", "id": 804}, {"review": "It beats doing it the old fashion way and the cutter is sweet, but it could be better.1. It slips off if you go too fast, but I thought that was the purpose of using a gadget like this.2. It didn't come with much of any instructions, so I was using it wrong at first. There is a big and a small slot.3. The cutter is so that I pinched my finger during use. The cutter works great, you just have to be careful.4. The screw that holds it on keeps coming loose. Sure I can tighten it, but it just means the design could be better.All and all it's one of those must have gadgets, but it does require a little discipline to master. I hope the next version comes with a soft, rubber insert so it doesn't scratch the chrome off my turner pegs. That and maybe they could use a long screw and some Loctite to keep it from coming loose. And well, maybe they could offer it in more colors to make it easier to find. Everything I have seems to be jet black.", "id": 94}]