[{"review": "I bought these for supplemental mics for a podcast, verbal audio recordings.  The sound quality is very good from these mics, in fact its hard to distinguish the difference on non-pro mixers from other higher end mics.  They feel good in your hand, nice build quality, and if you put a windscreen on them there is very little pop.  Sensitivity is good, and I'm very pleased by this purchase.  I'd definitely recommend these for any kind of audio recording, they may even be a good option for instrument recording given the lower price tag.  NOTE: once you put the pop screens on, they no longer fit into the carry case.  You have to remove the wind screens or modify the cushioning inside the case.", "id": 405}, {"review": "Seems to be made well, length was perfect for my application and there have been no problems with functionality or connectivity using the cable.  These make great and affordable mic cables.  Not much else to say, it works and looks well made.  Definitely recommend it.", "id": 465}, {"review": "This is such a cute little instrument, my daughter loves it and the sound is good.  The only downside is that it doesn't stay tuned for very long.  We always have to go and re-tune it, which can be frustrating.  But otherwise it seems well made, it looks great and when its tunes, the sound is good.  Its not multi-hundred dollar instrument, but for kids and beginners its a good deal.", "id": 766}, {"review": "Its a pop filter, it works well and does the job.  However the neck on this thing is a bit long, so if you are using a short mic stand it may have some extra flex that gets in the way.  Otherwise its a good option at a good price.", "id": 842}, {"review": "I got this mic to record a vocal podcast and so far I'm very happy with the results.  The sound quality is wonderful, the sensitivity is amazing!  Clarity is great, packaging is nice with the carry case and included stabilizer.  I'm not an audio expert, but so far the sound quality out of this mic sounds very excellent to me.", "id": 268}]