[{"review": "This is a clone of the boss compressor and works just as well as far as I have been able to tell as the original. being the owner of both I would have to say if you're not too stuck up about brands then I would go with this if you like the boss cs3 but many people say that bosses compressor is not that good I know some compressors do seem to be a little more natural sounding however that is just preference it does what it needs to chicken picking or just crispening up your sound its plastic but nothing is unbreakable so use some sense don't hit it with a hammer or JUMP on it and you'll not break it I've had no problems with behringer but heard great things. The cost is so low anyhow so who cares anyhow.", "id": 645}, {"review": "I have had this pedal for a while and prefer it to my boss dd7 and the anolog is much more natural sounding. Its said that its not actually an anolog pedal however I think it does a good job at mimicking anolog sound. Ive played guitar and bass for over 10 years and had a few decent pedals in that time. I might be embarrassed about the label but not the sound. great pedal.", "id": 725}, {"review": "If you hate fuzzy distortion then you will love this pedal I had a boss ds 1 and metal zone mt 2 and did not like them much because they're so fizzy they are ok but this pedal sonically sounds so much better to me. it does plexi tones very well on lower gain settings and full on Marshall crunch on higher settings if that is what you're looking for then this is for you. it offers rugged construction and true bypass. the only problem I have had is that unity gain is at around 9 o clock this pedal is hot and has lots of head room props to joyo for this mi crunch box clone.", "id": 794}, {"review": "this is a great pedal I would suggest it to anyone looking to get a pedal that would do overdrive and distortion it is a little more on the gain side and has a fizzy characteristic not to fuzzy however imo. Its fairly responsive too and the eq is opposite of say a tube screamers pronounced mids so rather flat eq. Plenty of volume and is a clone of the fulltone OCD if you want overdrive that doesn't sound like a tube screamer than this is for you. And botique quality at paupers price.true bypass so no tone loss props to joyo. P.s. crunch distortion is also an awesome pedal by joyo which does plexi tones well and is very crunchy.", "id": 795}, {"review": "well it is worth the money in my opinion however i had to take about a quarter inch total off the sides for it to fit the pocket not that difficult really. the stripe needed to be sanded flush good thing it is not pre finished. the rod had to be  adjusted to get proper relief and the headstock is a little larger than a fender. for the price worth the small effort it took to get it rockn", "id": 838}]