[{"review": "It's a strap.  It's pretty well made.  It holds your guitar on your body so you can play it.  It costs $5 or less delivered...what more could you ask for in a strap???  There may be better ones out there, but at more $$ and this does the same thing.", "id": 208}, {"review": "I like these picks.  They look great, and work well.  I have no issues at all with them, and they play a little stiff when new, but within minutes feel like an old friend.  Great buy for $3.  Give one to a guitar playing friend and watch eyes open wide with a \"NO WAYYY!\" look on their face!!", "id": 373}, {"review": "Really cool looking and are nice picks for the $$.  The eye holes really do make it a better gripping pick than a standard pick.  Great deal from amazon - - thanks!!  I will definitely buy more of these in the future!!", "id": 477}, {"review": "I had looked around for strap locks for my Dean Dime Razorback, and was not happy to see that most locking mechanisms were designed with a button on top to release them.  My guitar straps attach on the rear and underside of the guitar which would be easy to accidentally press when the guitar hits my waist causing unknown horrible damage.Then I saw these and knew they were perfect for my situation.  I installed them last night and could not be happier.  They are very solid and the lock is 'positive' so you can feel the click when it is set.  I am sure they will work well if your guitar straps mount in the traditional spots as well.  This is a great product at a good price.Note:  If you are installing on a Dean Razorback or ML, the stock front strap mount screw goes through the plate, body into the neck....DO NOT USE this to mount, or pull the old strap mount off and return the screw...it is too long and will likely split your neck.  Just drill a hole right next to it and install the locking mount right next to it (it can touch it even and still function properly).  Enjoy!  I really am happy that my guitar is much more secure now and don't worry that I will hurt my favorite guitar.", "id": 523}, {"review": "Excellent little device for the money.  Easy to use.  I have paid double for tuners that have not worked as well.  This will get you in tune for $11 or less - can't beat it.", "id": 706}, {"review": "I was unsure what kind of polish to get for my guitar.  I would have thought pledge would work, but after a little reading I found out that could be bad for the woods tone and resonance.  After scoping out Amazon I came up with this product, and I am happy.  It makes my black guitar shine and is very easy to use.  It also comes with a nice polishing cloth...great deal for the money.", "id": 81}, {"review": "This is my 3rd VOX Amplug I have purchased through Amazon.  They are all awesome in thier own way.  The Satriani Amplug has very nice effects similar to a flanger and delay with reverb.  Without the effects on it is similar to the Lead plug with much lighter distortion - still has nice crunch to it though.  If you are a Satch fan you will find this amplug endlessly entertaining!  If you could only buy just one, this one may not be for you depending on what style music you like to play.  I love metal, rock, classic rock etc.The first song I played through this plug was 'The Star Spangled Banner' (ala Jimmi Hendrix) and wow, the Satch effects just make it sound amazing!  The Top Gun anthem sounds wicked with this plug as well.If you are looking for a pure distorted metal sound go for the Metal Amplug - it rocks your face off(I LOVE MINE). The AC30 Amplug is real nice for classic rock and country (it is nice and clean but can go into AC/DC tones) - very versatile Amplug.The Satch Amplug is a welcome addition to my collection...I would tell you to buy it, and if I lost mine I would replace it immediately.  Same with the Metal Amplug.  If I lost my AC30 Amplug I would wait for it to go on sale or something and pick up another -  as versatile as it is, I don't play enough classic rock or country as I do metal.", "id": 720}]