[{"review": "I use this adapter on the interface/mix board end of 1 channel of my XLR cable snake, to change 1 channel into my monitor return. I plug an XLR to Female 1/4\" stereo adapter to the other end to create a headphone jack at the musician end of my setup. Now I can record with 6 channels, and monitor with 2. (It's an 8 channel XLR snake). Why do I go through all that you ask? because I have an 8 channel XLR snake, and instead of buying another snake, why not ADAPT the snake I have? hence the word adapter... :-P I love it. It's a great tool to add versatility to your setup, no matter what you're doing. Definately recommend this product to anyone that would happen to need to change an XLR to balanced 1/4\" stereo... It's high quality, and very solid, I definately expect this to last me a long time.", "id": 12}, {"review": "This rack stand is made up of a heavy steel, and welded together very well. I received my rack stand yesterday, and put it together in under 5 minutes. My audio equipment mounted easily, with the 48 INCLUDED mounting screws, and everything looks great, and I don't have to worry about this thing collapsing or falling over. It is very sturdy, and very stable. I recommend this to anyone planning to rack up to 12 audio or networking devices. I will definitely be purchasing another rack stand once I fill this one up. I will add pictures of my rack stand setup shortly.", "id": 322}, {"review": "As I've heard with the Pyle Pro amps, I received mine today, and it was defective. Only one channel worked, and it definitely looked like it took a beating before it arrived at my doorstep. The packaging was very good though, so I'm  thinking this looks like a refurb/used, and they listed it as new. Already printed the return shipping label, and it will head back to the Amazon warehouse on Monday...", "id": 496}, {"review": "I first used the Snark when I borrowed a friends before a show, and I thought it was the coolest thing in the world. He used it to tune his acoustic electric, and at first I thought it was working off of sound, but then I put it on the headstock of my unplugged electric, and it picked it up instantly, and tuned it perfectly. I couldn't beleive it. I had to have one. I ordered the one that is capable of both miced tuning, and vibration tuning, as well has having the tap beat metronome, and I am in love with it. It's SO sensitive, and so accurate, you can turn the mic off, and use it to tune your electric guitar in a VERY loud room, and it won't pick up ambient noises. LOVE IT LOVE IT LOVE IT. I recommend this to ALL musicians. The mic feature would be useful on your music stand, or attached to your trumpet, tuba, saxophone, whatever... clamp it on, and play. Absolutely awesome.", "id": 707}, {"review": "I've used this mic with my Tascam US-800 Audio Interface, and PC, to record a high school chorus concert, and have gotten very good audio reproduction from this microphone. I placed one of these microphones as a soloist microphone, and one as a piano/instrument microphone, and have gotten great results from both. The reproduction of the sound was very good. The mic seems very solid in build, and able to possibly take a little abuse, which is good with a travelling recording system, but I definately wouldn't TRY dropping one, even though they're a nice metal case, and metal grill. I'd recommend these mics to anyone looking to get a good reproduction of sound for both vocals, and instrumentals, on a budget. I have yet to try these with micing guitar amps, but that's my next step, as well as drums.", "id": 777}, {"review": "I use this in my recording studio to allow musicians their own level of monitoring in their headphones for recording and playback. So far I've had this item for about a week, and it has worked flawlessly, and given the exact results I needed. Musicians love being able to control their own headphones, rather than having the engineer in the control room raise and lower their levels.", "id": 376}, {"review": "I bought this headphone amp for in the isolation booth of my recording studio. The idea was to give the vocalist/instrumentalist personal control over their own levels, without the engineer having to change any settings manually. The item works GREAT for that, as long as you're not using a powered microphone. If you are using a powered microphone you get a crazy loud buzzing, and interference when the monitor, and microphones are plugged in. Plus, the hum/buzz is so loud you can't hear anything from the microphone. The only way I've gotten rid of the buzz is by running an unbalanced mic cable from the headphone amp to a Direct Box, and then into the board.  I'm told that a Hum eliminator would do the trick, but that's another $40-$100 I really wasn't planning on forking out. I'd rather have the engineer change the levels for the vocalist/instrumentalist than pay an extra $100 at the moment. Again, it's very good at what it does, if you don't power the microphone.", "id": 383}, {"review": "I just recieved these in the mail today, and these seem to be much better quality than the original pegs in my guitar! Not much else to describe, they're fairly simple to use, and they're selling you 12 of them, so I have a spare set now! My original pegs were also white, on an all black guitar, so I'm totally excited for the new look these pegs give my guitar. I definitely recommend these for anyone that needs/wants black pegs for their acoustic, or acoustic/electric gutiar.", "id": 817}]