[{"review": "While I'm spectacle on what I want to &#34;clean my baby with (Fender P Bass) and after reading many feed backs on Amazon, I decided to try this kit. My Bass is not that old, but really needed to be cleaned and polished. This kit really make it so clean, it looks better than when I purchased it new. No greasy residue either. My fret board looks so good to. Just don't use it on maple wood (the lighter color), at least that is what the directions states because it my yellow this lighter color. I can tell you that the rose wood is nice and deep colored red. The other cleaners and polishes are great too. I will definitely purchase this kit again when I run out of the supplies.", "id": 95}, {"review": "I have a Electric Bass Guitar and needed to Capo. After looking at &#34;reviews&#34; I like this one the best. I'm very happy with it and it works great without any problems. The size is &#34;Just Right&#34;, not too small or Big ...", "id": 116}, {"review": "I have a bass guitar and sometimes us a pick. Seen these and they work great when needed. Looks good too :)", "id": 117}, {"review": "I like the 3&#34; wide for my bass. Fits nice and made well. Seems to be secure fit (leather holders are thick).", "id": 188}, {"review": "I usually use the Pro Steels (by D'Addario)  but these sound and fit nicely with my Squire Fender P Bass. Amazon seems to have great prices and it's nice to have them delivered too.", "id": 197}, {"review": "I have tried some others and was not to happy since they really did not tune the strings correctly (the sound was off slightly). This seems to be good for a &#34;quick tune&#34;, but like the pelal with cord plug in better. The pedal types are much bigger and you will have to carry more stuff out when going to a gig. This does work in a pinch without a lot of bigger equipment.", "id": 799}, {"review": "Tried this and was not happy. Seemed to want to be off too much. Got the Fender FT-004 instead. This one does have a great view on the LED, but if it doesn't tune right, what's the point? I would try the Fender. Just a note. if you want a great tuner try a pedal corded tuner. I would try one at a guitar shop before purchasing. Just a thought.", "id": 811}]