[{"review": "Been using these for longer than a decade, and met many people who prefer minimal picks , and jazz III among them. This is the closest to playing with bare hand that I can get.", "id": 68}, {"review": "No sign of wear and tear. and the holes are really tight, minimizing the likelihood of the guitar breaking free occasionally (it never once came undone in all these months, not sth you can say about all guitar straps)", "id": 282}, {"review": "I used AC30 for years, lost them, and decided to make a change and buy these.Sound quality of AC30 wasn't anything to write home about but had decent cleans and gains, but this one has a horrendous clean (tried with my strat and tele, play jazz/blues mostly), and mediocre gain, you can get a lot better sound even with the free amp programs for ipod and computers (buying a 25-35 buck connector cable), though, granted those tend to have feedback problems when you use certain gain-y settings.For people worried about CONSTRUCTION, these turned out to be very sturdy (AC30s i previously used did, but the built/materials are exactly same).Even if you're determined to settle for the mediocrity of phone amps, go for cheaper models, or simply buy AC30, the latter has acceptable cleans..", "id": 491}, {"review": "Title says it all I guess, it gives you the small pick feeling without the thickness (that I'm not crazy about in Dunlops), and the traction is certainly better in my oversweating hands. Bought these 3 months ago and I've got to say they're very durable too, certainly more so than the small-pick alternatives I tried.", "id": 580}, {"review": "I have an unusually wide and fat thumb, and though tight at first, all of them got comfortable after an hour of playing (each). No complaints", "id": 617}, {"review": "Pretty decent sound, and it's not too small for an adult to play, but having no pickup on the left hand side severely limits the warm, jazzy tones you can get. Still very satisfied.", "id": 738}, {"review": "Had no issues in the 2 months. There is a red pick that is supposed to say inside under your 'real' picks, which helps with its looks.", "id": 167}]