[{"review": "Fits MXL Cube mics perfectly! Sturdy and easyt to setup. Ordered two more.Rare to get items these days that exceed expectation", "id": 393}, {"review": "I have a LOT of pedals.... including many delays and echos...The MXR is just little more organic and warm in tone and response then my Aqua Puss, EH Delux Memory Boy, Ibanez, Boss, and lets not even get into the Behringer stuff...  :)I like the chorus-like mod button.  Very lush and sweet to listen too.  Not as feature rich as some of my other delays, but a tad more appealing to the ear then the others to me.  Simple to use, compact and well built.  I like using this clean... but even it's ability to take some distortion is pretty good.This is simliar to my favorite echo (the Morely ECV from the 70's) in that is has that real warm surrounding sound to it.  Lush is the right word.Hope this helps.", "id": 507}, {"review": "This works well...A few cons:1. it is not variable speed. on/off in either direction with full torque. Not so bad... but variable speed would have been nice.2. it is a little loud.Other than that... does what it should as expected.", "id": 522}, {"review": "TC is very overrated.Many pedals I have out performs this in my opinion.  The vintage BBDs (MXR Vintage DElay, Morley 70's echo) for example just take it.  But for newer pedals I liked the MXR Carbon Copy and Ibanex DE 7 much better.", "id": 742}, {"review": "For a cheap pedal I gave this a try.  Very versitle.  Can get many different types of sounds and drive from it.  The knobs are a little tight, but that just makes feel tough I guess.  I like much more than the Joyo fuzz.  THis can give some cleans and drive to distortion.  You really need to work with it a bit with your amp and find that sweet spot.Certainly not the best overdrive, distortion, or effects pedal I have used.  But for the budget I do receomend it.  It is cheap and very has a good range of tone options.  I ran it into a Fender Camp 600 and they seemed to get along well.Hope this helps.", "id": 797}, {"review": "Okay... just strung these up and ran them through three different amps and about 25 different pedals (metal, overdrive, echo, reverb, fuzz, etc).  So keep in mind that they haven't broken in yet as I do this review.  But I do feel confident in what I report here.They are not as nice in full warm tone as the pure nickels.  On the high gain metal muff, fullbore, guytone metal monster, swollen pickle, and big muff they sound really nice.... a lot of harmonics and output captured. For that 5 stars easy.  I don't think they are very versatile though below the metal shredders threshold.  Other's may feel differently I am sure.  Then again, Ernie Ball even states they are very bight high output.  So you are getting what they say.However, for a warm bluesy tone I couldn't get anywhere close to my sound like I can with the pure nickels.  For that 1.5 star.  Average to 3 I guess... :).  Forget about the nickel wound steel all together (those are really lame).  Either pure nickel or these depending on your style at the moment.  For shredding go cobalt... for warm/woman tone go PURE nickels (that's PURE folks!!).  I also really like the d'addario pures.Also, these really did let full chords ring out on a heavy metal channel.  Hope this helps.", "id": 823}, {"review": "Tried these on Les Paul style with Jimmy pgae wiring harness and through four different amps and about 25 different pedals (metal, overdrive, echo, reverb, fuzz, etc). So keep in mind that they haven't broken in yet as I do this review. But I do feel confident in what I report here.They are not as nice in full warm tone as the pure nickels. On the high gain metal muff, fullbore, guytone metal monster, swollen pickle, and big muff they sound really nice.... a lot of harmonics and output captured. For that 5 stars easy. I don't think they are very versatile though below the metal shredders threshold. Other's may feel differently I am sure. Then again, Ernie Ball even states they are very bight high output. So you are getting what they say.However, for a warm bluesy tone I couldn't get anywhere close to my sound like I can with the pure nickels. For that 1.5 star. Average to 3 I guess... :). Forget about the nickel wound steel all together (those are really lame). Either pure nickel or these depending on your style at the moment. For shredding go cobalt... for warm/woman tone go PURE nickels (that's PURE folks!!). I also really like the d'addario pures.Also, these really did let full chords ring out on a heavy metal channel. Hope this helps.", "id": 825}, {"review": "I used to buy a lot of wire form these guys.... However, you need to be careful and test everything you get from them on an XLR cable tester.I didn't believe it myself...I read another reviewer had an issue with XLR cables being wired incorrectly from pin to pin. So I took my handy cable tester and went through about a dozen cables.I got through only 4 monoprice cables before I found one that was miss-wired. Now I will be checking all of them for sure.Not a good start though.Glad the other reviewer made that discovery and passed it on.I suggest everyone check their monorpice cables. The testers are very cheap and may show problems you weren't aware of.", "id": 591}]