[{"review": "These pics are perfect for a jazz guitarist, and I actually like the coloration too.  The Ocean Turquoise wasn't nearly as nice a color and I expected a bluish color.  These are about .7mm and that's just right.", "id": 120}, {"review": "This is the best one out there BAR NONE  !  Really, this is a keeper.  Wish it came in different neon colors, as it would be really easy to find when you have broken a string on stage.  That would make this one the BEST.", "id": 161}, {"review": "D'Addario ALWAYS puts out a nice product.  The E and B strings never have enough coating, but still.  In comparison to others, they do a good job of getting the music out there in a bright and sustained manner.", "id": 198}, {"review": "Good unit for the money, for sure.  It is not road worthy however, in our opinion.  Still, for any smaller gigs, it does a fine job.  Delivery, packaging etc were very good.", "id": 684}, {"review": "You have just simply got to try this little guitar stand.  It folds up so small, and yet remains very stable in use.  Adjustable in a snap, but if you even forget that, it will grip your instrument better than a metal stand.  Anything can be knocked over, but this really works better than you might believe.  Goood !", "id": 880}, {"review": "I've been able to purchase 5 of these in different sizes for all my pickin' pals.  Lightweight, easy to transport in the back of your amp, or just put it in a bag with your music.  THESE are good values for the money, and do not fall over easily.  Those little grippers on the ends and the back actually work.  I mean really work well too.  Not so wonderful for uneven dirt or grass areas, but otherwise.  They are the BOMB !  whee", "id": 881}, {"review": "Levy's leathers could have made this guitar strap out of a softer material, especially on the edges.  It cuts into your neck horribly, even thru a shirt. Yukko.  The fake leather on the ends are unbelievably cheap.", "id": 482}, {"review": "Nice pic's that work well when you are really jammin on a tune.", "id": 626}, {"review": "Tuner works well for violins and mandolins especially.  Little harder to read than I would have liked, especially in sunlight.  It would be nice if there was a sound feature.  One other thing that I had in mind, so I'll say it here.  the people that purchase these should put out a Model that Says BLUEGRASS, and this 'blue' tuner would be an even bigger hit.", "id": 885}]