[{"review": "The description says the color is gold.  It's not.  More of a greenish yellow, but does what it is intended for.  I think I would stick with the black color though.", "id": 26}, {"review": "If you're looking for a 12-string acoustic, then what more could you want than the Epiphone DR-212?  The craftsmanship is excellent, the sound is fantastic and it's easy to tune and play right out of the box.  Add the limited lifetime warranty and Gibson support and this guitar can't be beat.  The price is amazing for what you get, and to top this all off, it has been chosen as a Guitar Players Magazine Editors Pick.  You don't have this guitar?  What are you waiting for?  Order it now while the price is this low!  Go ahead! Go for it!  You won't be sorry...", "id": 153}, {"review": "This pedal works like a charm.  Stays in place and works as de.scribed.  I would buy this again if I needed to replace it", "id": 251}, {"review": "I have been buying these stands for years and will continue to do so.  I've taken them to the studio with me and of course used around the house.  They do what they're built for and are as described.", "id": 258}, {"review": "These are the only picks I use.  They're Fender thins and the quality is one thing that Fender has kept consistent.  They arrived on time and I will order them again.", "id": 332}, {"review": "It's perfect for what it does and that is to hold your amp and tilt it a bit toward the ceiling.  Great price, great stand.  What more do I need to say???", "id": 517}, {"review": "This little amp is amazing.  It's loaded with a lot of samples of other great amps, AND you can plug it in to your laptop and record it directly and you can go online and download other samples directly to your amp.  I love it!  If you need a practice amp (and you can plug your headphones in to it so you can practice in private) then this is the amp you  should buy.  The price is right, and the size is right.  Enough said.  Buy it!", "id": 718}, {"review": "These strings are what I use on all  of my acoustic guitars.  The sound and tone are great, and the price is right.  They shipped quickly and I will order again and again.", "id": 198}]