[{"review": "So, these picks are really nice, but the picture is not what you will get.  These picks are translucent purple.  Other than the strange color, they are good picks.  They really do help with speed and accuracy.  Great for mandolin playing.Updated: Amazon has changed the image for this item, so now the picture really does show what you will get.", "id": 66}, {"review": "I love this system.  Every time I change strings now, I go through every step of this system, and what a difference it has made.  The fretboard cleaner and conditioner are great.  I never realized how dry the wood was.  The string cleaner is nice too.  I feel like I was neglecting my guitars until I got this.  The quantities of product in this kit are good, and the instructions are clear.  The two polishing cloths are adequate size, and washable.", "id": 95}, {"review": "This is a nice leather mandolin strap.  Fits fine on my cheap Rogue A type mandolin.  Amazingly, it is made in Canada, not China!  The leather is very smooth and flexible, not stiff like some cheap straps.", "id": 189}, {"review": "I bought a cheap Rogue A100 mandolin, and after setting it up I of course replaced the cheap factory strings.  I put these on, and what a difference.  These aren't too heavy, not too light.  They ring nicely.  I find that coating bronze strings with a good string cleaner, like Dunlop 65 Ultraglide, can help you avoid the dirty fingers and get much more life from the strings.", "id": 338}, {"review": "Got these to stop the pegs from slipping in my cheap new violin.  Added a couple drops, and it worked like a charm.  A must buy for anyone buying a cheap starter violin.", "id": 359}, {"review": "This is a really strong capo.  The spring is very robust.  Well padded, and will not damage your instrument.  I have used it on guitars (electric and acoustic), banjo, and mandolin.  Takes some hand strength to open it, but you don't want a weak capo!", "id": 603}, {"review": "I bought this to go with my Cecilio 4/4 electric violin, and it fits perfectly.  It is not too tight, nor too loose.  It is very well made.  This shoulder rest is very comfortable, and really helps get the right playing angle.", "id": 637}, {"review": "I am very impressed with the quality of this strap for how little I paid.  Nice soft flexible leather, and very adjustable.  I had to lengthen the slit one end to fit over the oversize strap attach fitting on my Fender acoustic electric, but other than that it fit perfect.", "id": 656}, {"review": "I wanted a wall hanger for my mandolin, and this works great.  The arms are adjustable, so the instrument won't rest on the pegs.  The foam is good, and the hardware is included.  Plus, the price is great.", "id": 779}, {"review": "This is a very comfortable strap.  Because it is cotton, this strap is more flexible than many nylon straps.  It fits the guitar perfect, and is easy to adjust.  Well made, and you can't beat the price.", "id": 658}]