[{"review": "Without changing my pickups or polishing my frets, I thought I'd try to get a little more sustain switching up strings. At first I thought I had got a bum buy because the I had to bring the action up a bit to account for the over brightness of the strings. Had my tone all off and I was ready to dig my other set back out of the trash..... played on it for a half hour (went through the exact same thing with the Polywebs I put on the RG655) then retuned, sounded pretty good. Played for another half hour and retuned and it actually sounds great now. Dropped the action back down and it's smooth as silk in an hour's time. VERY HIGHLY RECOMMEND", "id": 107}, {"review": "I wasn't expecting much for the price but have to admit I'm very pleased with the tone these strings produce straight out of the package. After several hours of play and 2 tunings, they're spot on and sound sweet as cream butter. Great product and very highly recommend", "id": 198}, {"review": "I put these in my Ibanez EW acoustic-electric as a cosmetic upgrade and the tone and sustain is absolutely amazing, not to mention they look fantastic. They fit like they were made for this bridge but rubbed a bit of pine tar in the holes with a q-tip to make sure they seated fully. Absolutely tickled with the look and performance. VERY HIGHLY RECOMMEND", "id": 206}, {"review": "They're 2 days on and sound fantastic already. I've come to expect nothing but excellence from Elixirs, they're the best I've played on to date, whether electric or acoustic. I very highly recommend these to anyone looking to get great tone straight out of the box", "id": 295}, {"review": "What else can be said about them, they're good picks. They strum well, they pick well and they look good", "id": 574}, {"review": "String changes usually take me 10 to 12 minutes each but I restrung all 3 of my guitars in less than 13 minutes (one is a floating tremolo). The spanner is smooth, the cutter is strangely very clean cutting (usually use electrician wire dykes) and the pin puller is nothing fancy, but does the trick quickly. Awesome little tool and very impressed with it. A++++ on every function, would consider maybe putting a few small rubber inserts on the handle for those sweaty hands, but other than that, it's perfectly perfect. VERY HIGHLY RECOMMEND", "id": 94}, {"review": "I got these because I hate changing strings on a floating tremolo any more than I absolutely have to.... at first I thought I may have made a mistake because the tone was all off (super bright sounding on first installation).... played for a half hour and retuned, sounded better. Played for another half hour and retuned, sounded even better. Played for another few hours and they sound fantastic. Will update after I get a hundred hours on them (about 50 days from now). Will say that they handle bends very well and dive bombing deep on the trem hasn't hurt them yet.... VERY IMPRESSED", "id": 102}, {"review": "It's a tuner that tunes nearly as well as a rack tuner for a fraction of the cost. The fact that it looks like it's made out of Bat Armor is a huge plus. For a clip-on, you can't beat the accuracy this little unit gives you.", "id": 811}]