[{"review": "Zero issues with this cable so far.  It feels fairly cheap and light weight but it has survived for months of plugging in, unplugging, and packing between practice spaces.I'll update this review if/when it breaks.", "id": 6}, {"review": "I'm impressed with these EXP16 guitar strings.* What I ExpectedA more dead sound than the non-coated strings they replaced. Coated strings usually lack the bright high-end brilliance that uncoated light strings have.* What I GotA very bright, yet not to twangy sound.  When I put Light strings on my acoustic, I'm going for easy playability and, most of all, a very bright and airy sound.  These deliver on both counts.* DurabilityThe coating on these strings are supposed to prolong the time between changes.  So far they are holding their tone and brightness.  I will report back after three months.  My last set started to sound dull, and exhibit more tone variation after six months (when viewed with a very sensitive tuner, it seems that my dirtier strings detune sharp a bit more on attack, the harder you strum them.  This is confirmed by the fact that they just sound out of tune to me when they get dirty).* ConclusionI will be ordering more of these.  I think they perform very well for the price. Love the bright light gauge sound and playability.", "id": 130}, {"review": "This is a really cheap microphone.  I'm usually amazed how good &#34;cheap&#34; mics sound (e.g. the shure pg line is fantastic), but I'm not amazed by this mic.  It sounds like a cheap mic.  It handles high sound pressure ok, but sounds &#34;tinny&#34; and is more prone to feedback than a nicer mic.For the price, however, you should not expect any better.Likes:- Price.  This is essentially a toy.- Stand and cable too!Dislikes:- Sound quality.  Maybe you want a &#34;lo-fi&#34; sound?  You could make it work.Overall, this is a really good bargain for an extra back-up or kids mic.  It is not a horrible mic.  It is usable for applications like speaking.  For hi-fi music recording, however, you'll notice it is a cheap mic.", "id": 422}, {"review": "These balanced patch cables are great.  This is the third set of various music cables I've purchased from this brand and they are all great quality for the price.  Love their XLR microphone cables too.", "id": 440}, {"review": "With drum pads, I basically either get 0 velocity, or max.  And I have to really hammer on them to trigger.  Hurts after a while.Likes:+ Size+ Assignable knobs.+ Works good w/ Ableton LiveDislikes:- Drum pads!Keys are pretty cheesy but workable and expected for this price and size.I'm looking to upgrade after a month.. Want better drum pads.  :-/", "id": 723}, {"review": "Likes:- Pretty smooth.  Minimal fret noise and squeak compared to some- Bright, strong mids.- They do seem to stay in tune well.  Havent had to change tuning once they settled in.Will update this review with more experience as I play on these strings over the next week.", "id": 897}, {"review": "These may be my new favorite bass strings.Likes:- Bright.  I'd call them &#34;very bright&#34;, except they don't seem to have the harsh twangy tone I'd expect.  They seem bright, yet still soft.- Clear.. The lows sound present and clear.- Consistent flex.  Once I had these on for a couple of days, the tuning seemed very stable.  The tone seems to sharpen less when they are played hard, compared to my last strings.- D'Addario brand.  To me, these guys have a long history of making excellent strings.- Playability.  These feel pretty supple and effortless to work with.- Price. I feel like I should be paying more for these strings.Technology:- New design. &#34;Textured round&#34;.  This is a round-wound string with a hex-shaped core.Overall, love these.  Especially for the price.", "id": 896}]