[{"review": "I have been using the EXPs for some time now on electic-acoustics and they have become my go-to string.  I find the coating to be less noticeable than on El***rs and tonal variations to be less from string to string and set-to-set.  Highly recommended.", "id": 130}, {"review": "I already use the EXL111 as my go-to electric string and tried these as part of the Vine program.  I have to say I really couldn't feel the difference.  From what I can see the only real difference in this balanced set is that the D string gauge is .25, whereas the same string in the EXL111 set is .24.  Since the string construction and plating is the same, I have to assume these will have the same longevity. I guess as long as both are still available (EXL111 being phased out?) i will be selecting solely on price.  Either way you can't go wrong as D'Addario makes a fine product at a reasonable price.", "id": 868}, {"review": "I have the original version of this capo and it works just fine as does this one.  However, it seems theu have made a slight modification which increases its value from my viewpoint.  Yhey have added a channel on the capo onto which slides a bracket which is included.  This bracket holds the NS micro tuner, of which I have 3.  I had considered anther capo which came with a tuner for certain applications.  However, now, this ingenious little bracket enables me to use a tuner in tandem or not depending on my need.  A simple modification, but bordering on genius.  The capo itdelf id wuite capable as it is a spring attached capo with a micro adjustment screw/spring which can be helpful with guitars that go sharp when a capo is employed.  Highly recommended.", "id": 894}, {"review": "I usually don't use anything lighter than 10s because I think the tone starts to get thin on both the highs or the lows.  I had already tried these in the 10 gauge size, and when these were offered via the Vine program, I thought what the heck.  I have a guitar which I believe the tension is always high and tried these on that instrument.  They do seem to help the string tension issue and the low end sounds (to these 62 year old ears) quite comparable to the 10s.  However, I do think there is still a thinning of the high end, but that's subjective.  I gave the 10s a 5 rating, and, realistically, I would give these 4.5 id I could.  If you're into 9 gauge strings I recommend these, but I'll stick with 10s and 11s.", "id": 897}, {"review": "This capo seems to handle quite nicely.  Spring loaded trigger like a Kyser (still my personal fave) but with an added tension adjust adjustment on the spring.  In time this will probably become my favorite as there seems to be some benefit to the tensioner helping to keep the guitar in tune.  The only issue, if you could call it that, was that I have always used the Kyser's that have the non moving side of the squeeze handle above the neck as opposed to under the neck like this one - after many years of playing, muscle memory sometimes has me reaching to the wrong place when adjusting position on the fly.", "id": 843}]