[{"review": "This is the first time I've used the Dunlop Straploks system.  I've always used the competition.  These work just as well.  I guess you just have to make sure you lube the little ball bearings once in a while.", "id": 44}, {"review": "I bought this to keep the saliva on the mic to a minimum.  Should work just fine.  I also bought the green one.", "id": 178}, {"review": "This was recommended by a guitar repair shop, and I have found it is a well rounded product that all guitar players should keep on hand.  It will polish, and lube things like Floyd Roses.  Do your strings get funky from the acid in your skin oil?  Wipe them down with a little DR. Duck's Ax wax before you place your guitar back in the case.  The secret is always use the least you can get away with.  Too much for polishing and you will be rubbing it off forever.", "id": 348}, {"review": "I use this boost in the effects loop so it's after the preamp section of the amplifier.  It gives the boost I need for my leads without effecting my tone whatsoever.  I will always have one of these on my board.  Very well made.", "id": 372}, {"review": "I have moved on to the Carbon Fiber and 3mm Lexan Jazz III picks but these Ultex picks are also very nice.  They are a little less bright than the Carbon Fiber Picks which in some cases is actually preferrable.  In my opinion (At least at the moment) the Jazz III picks are right at the top of the list with the best picks you can buy.  Once you get used to the small size there is no going back.  The large picks feel like your holding a refrigerator.", "id": 413}, {"review": "I've bought a number of these for use on my Pedal board.  They have performed excellent with no failures, noise, or loss of tone.  Recommmended if you don't mind a molded cable.", "id": 578}, {"review": "I really like the soft flexible cable these have. They were perfect for my pedal board. Highly recommended. You will find yourself wanting more than you purchased.", "id": 663}, {"review": "Having trouble with my usual D'Adderio strings I decided to go back to the a well known brand.  These are solid strings that never let me down.  They go in tune and stay in tune.  I just wish they had a little bit slinkier feel to them.", "id": 679}, {"review": "I bought a number of these because after the first one I used I fell in love.  They have a fuller sound than other picks and the grip on these is fool proof.  However they don't pinch harmonics well at all, and they will not do scrapes up the Low strings at all.  Two disasters for Classic rock music.  I never seen picks that wouldn't do these things, however I really struggled with these things that seem so easy with other picks.  However minus these two quirks, these are fantastic picks.", "id": 686}, {"review": "These tuners just seem OK to me.  I still have to touch up my guitar when finished with this tuner.  The accuracy in my opinion just isn't there.  Still nice to have for a quick touch up while practicing.  The price is right.", "id": 811}, {"review": "You can't go wrong with these picks if you enjoy a full size pick.  They have a better grip and a more full sound (to my ears) over the Tortex picks.  I have since went to the Jazz picks but these picks are a solid product.", "id": 65}, {"review": "These are the thickest picks I've ever used.  However, I am really liking them.  The tone they give seems better to my ears than anything I've tried and my speed picking has improved.", "id": 164}, {"review": "I have had really good luck with the planet wave patch cables.  They haven't had a huge amount of use, but none of them have went bad or caused any excess noise, and I've bought over 10 of them.", "id": 662}]