[{"review": "Works for my Behringer XM1800S Mics. It came with a smaller thread adapter on it already. Idk what mics use that but is something to note.", "id": 224}, {"review": "Great for video/photo work or even theater. It won't handle well at a large space. If you are a light fog, this is the job for almost any situation.What I'll be using it forDj work to show laser beams and light beamsVideo work - use it to make a hoax car crash or meteor crash site (that's what you are seeing in movies)Photo work - not so much for general photography because it can make people think you shot at too high of an ISO.", "id": 256}, {"review": "I bought them at 45 dollars. Use for small music gigs and DJ/MC uses. They are great for DJ uses or other things where the quality of the voice isn't so important, as long as you can be heard and understood. I recommend for use of: 1. Small music venues (smaller bands), Djing, public speaking, band practices/rehearses, etc.For higher quality microphones at a reasonable price, look at the Audix OM2 when it's around 80 bucks, or Audio Technica products.", "id": 405}, {"review": "Despite being so small, it will fill most rooms Completely! These are lasers! You can buy one of those cheapo keychain sized lasers and those go for miles so you know this thing will deliver. The patterns they go in are mesmerizing no matter the pace. I haven't tested the sound-feature but I've seen it on videos. I recommend this to anyone want to be entertained!", "id": 729}, {"review": "What was thought to be a DOA model, ended up being a mistake on my behalf. My iPhone 4S, which I have had for about a year now, must've had enough damage and wear to the dock connector so that it works fine...unless trying to use the JAM.In The Box: Comes with a simple instruction manual that has about three steps.It comes with the JAM and two cables (USB and IOS). It is bigger than I had imaginedIt's almost the length of an iPhone. Feels nice, and is very light. The cords aren't very long.", "id": 764}, {"review": "The product is here and I am glad the size is right. The colors punch out nice and will1. Help my vocal mics last longer so singers don't drool on my mics.and2. Help out during soundcheck. &#34;Hey, can we get blue turned down a little?&#34;Products were intact but on an quick examination I saw small tears in the foam. I will update if that matters in the long run.", "id": 806}]