[{"review": "I like this strap lock very strong very sturdy! Keeps things in place.. one problem.. The coating will wear out in a short time (a few months) and if you never take it off it might rust a bit on the inside. This might make it a bit hmm I don't want to say hard to lock, but you'd better make sure it is actually locked every time you fit it on by tugging on the thing to be sure, Mine has un-clipped a couple times because I didn't check. Our climate is humid so it's rust friendly which could contribute to why I'm having issues. However once clipped properly you shouldn't have issues! Great buy", "id": 44}, {"review": "if you like this guage you'd like these.. I just tried them, just to try.. but I've confirmed I like heavier gauges.", "id": 105}, {"review": "A couple inches behind my bridge is where it lives and I've never had cause to remove it. At first I thought I'd hate the look of it there, but it's never bothered me one bit. Reaching for pics is never a problem. I just wish there was a size that worked well with jazz III pics. This one works with regular size pics and to fit the jazz II I have to add a regular pic in there first then put a jazz III in it works out so not too much a big deal.", "id": 167}, {"review": "believe it or not I've been putting off buying one... I'm so glad i got it now I love looking at my guitar in this thing and now I even want to pick the guitar up more than ever!... Id have to say im happy with the quality can't see anything to complain about really.", "id": 258}, {"review": "ever since I saw a vid with mark tremonti where he says that he heard a lot of musicians used Jazz 3 picks, and after having tried them that he simply couldn't use an other pick.. I decided to try them out.. and I fell instantly in love with the regular jazz III picks!I always had issues holding picks and keeping them &#34;put&#34; while i played and the jazz III was no exception so it didn't bother me..Meaning I didn't really feel like there was a problem other than me, being that problem... Then I read about this new Ultex thingyit looked like a jazz III and every one seemed to like it..sooo I figured why not have a go at it... I was skeptical about this &#34;impossible to drop&#34; thing which I read..so i was dieing to feel them... Well they came.. i tried them and after playing for a while I didn't even notice that I hadn't once readjusted my pick..... NOT ONCE ... it was like there was no pick.. i started paying closer attn and more and more i realized that this thing really is what its hyped up to be... it stays there... to me that's just freaking incredible! holy @#$@%# wow! I love this thing love it love it!", "id": 413}]