[{"review": "I have had this amp for quite some time and find that it does exactly what I want it to!  It is so much easier to carry around and needs no outlet.  Turn in half way up, you get a clean sound...crank it maxed and you get that distortion that made it so famous.  I own a piece of the legend and music history!", "id": 76}, {"review": "Great stand, durable, folds down nicely and really does the job!  I keep one at home and just ordered another one for school.", "id": 519}, {"review": "I was rather skeptical of this little box amp, but it works great.  My acoustic gets a pretty hefty electric sound with the tone and overdrive adjustments!  Not sure how long the 9V battery will last, but the advantage of such a small box, with such a sound is worth a couple of batteries.  I have been playing on and off for the past three hours and it is just fine!  Well worth the money spent!  And it is small enough to fit right into the pocket of my guitar bag...one less thing to tote!  Looks really cool too!", "id": 605}, {"review": "Right out of the box, playable!  I did a tune up of the strings and they are holding pitch well after a couple of hours of playtime.  The electronics are just fine on the guitar I got.  I did have to adjust the string action down a bit, but hey, that goes with the territory.  There were some minor flaws in the finish, but for the money spent, this is a real workhorse and plays great!", "id": 714}, {"review": "I have a couple of clip on mics that I tried out.  This one is definitely the best.  I use it on the head stock of my soprano ukes and right in the sound hole for my bari uke.  You do have to find the sweet spot, but once you do, it works great through my Pignose amp, and actually fits right inside my Pignose.  Great value and price too!", "id": 759}, {"review": "I read many negative reviews on several sites.  I can understand how the quality may not be consistent, but as a seasoned folk and ethnic musician, I must say that the set I just purchased is quite good, especially the lower pitched harps in G, A and Bb.  There are minor tuning issues with all instruments, especially folk instruments.  This is what gives them their charm and voice.  I find my whole set to be of very adequate quality and I will not need replacement harps right away, as many have stated they had to do.  The set is quite nice, for the price!", "id": 693}]