[{"review": "These are perfect strings for a gig or a long practice session. The strings keep their tone for a long time. Can easily last upto a month on daily practice for 2-3 hours.", "id": 156}, {"review": "This strap is value for money. I was surprised when I got it - I didn't expect something so good at this price! The material is shiny, blue and doesn't look cheap and the strap is generously wide. The ends are leather with one side having a golden EB logo. Goes well with my black Squier Strat. Highly recommended!", "id": 282}, {"review": "I expected this to come with a DC adapter. Nowhere is it mentioned there wouldn't be any or I could have ordered one. The product is good, surprisingly loud. The bass is too much for the body and the battery cover sort of rattles (once the battery popped out by itself when I played a low E) but that's no issue. I have only used it with a 9V battery so far and noticed a continuous noise on a high gain. I hope that doesn't happen with an adapter. It's a nice little amp, good for carrying around. If you have long fingers, you can sort of hold it between your outstretched thumb and middle finger along it's height - it's that small! A guitar strap, a backpack and a 5ft cable and you could easily walk around the house playing it. The distortion it gives is good. Not good for palm muting. This is nice for practising Randy Rhoads, The Doors -type of rock where not many effects are used.Also remember the DC adapter has a polarity outer ring + and inner -. Many adapters come with the reverse of this polarity so make sure you check that before plugging in one. It's easy to change the polarity, open the box of the adapter and exchange (needs soldering, obv) the red and the black wire places!", "id": 391}, {"review": "The yellow material has a rough texture coated over it that gives it a nice rubbery grip with a smooth snappy tone!", "id": 413}, {"review": "These cables are VERY good. The metal heads at both ends are of excellent quality and you can unscrew the grip to change the pins. There is no play when I plug these into my guitar nor are they too tight- that is, the pin diameter is perfect! There's also a white protective hard paper at both ends to prevent internal short due to fatigue (which is how I lost the last two cables and which would be expected from daily guitar practice)", "id": 419}, {"review": "These pick have a permanent, fine coat of rough finish over the translucent material. It wears off and smoothens out around the tip on usage but that does not affect the tone. In fact, I found it increases speed. These are perfect for a fast-paced style of picking. The tone is bright and snappy!Good quality material ensures I won't be needing another set for a long time!", "id": 626}, {"review": "The grip is excellent. But I prefer the 1.14 Sharps over these. These are sturdy and look like I won't be needing another set for quite some time", "id": 54}]