[{"review": "Everyone here seems to be complaining about the same thing- packageing and shipping. Well i bought all my picks from the music store so im rating the picks only. Ive been playing a few years and own a takamine acoustic and a fender strat. I mostly play my acoustic and use light strings so i dont need a heavy pick. I started using med fender tortose shell celluloid picks and really liked the look but as a beginner i dropped them more. My friend left a thin pick and i tried it. Since i mostly strum on light strings this was nice. The pick had a little more give so i dropped them less. Ive only broken 1 pick and it was cracked when i got it. I started reading all these great reviews how the dunlop tortex was great so i ran down an bought some thins. The tip is a little more rounded. I tried them and they feel alright but the fenders were louder and brighter sounding no doubt about it. So its back to the fenders. Also something i learned is when i play a guitar that has a dark pickguard i use a light colored pick (pearloid) and a red pick for a white pickguard. The contrast helps you see what your doing. These are good picks and you have a good selection of colors instead of the dunlop that are color coded and your stuck with no choice. These are a little more slippery but you will get used to them the more you play. I dont drop em anymore. Personally i dont see any need for a heavy pick unless you play bass. The med is pretty stiff.", "id": 120}, {"review": "Not sure if these are more on the brass side or the bronze? Not really to my liking compared to the phospher bronze. The EXPs are nice strings. They have a nice feel to them along with less string noise. And they last. My two acoustic  guitars, a Takamine Mini jumbo and a Gretsch jumbo, both made from mahogany are both nice sounding guitars. I figured i would try these 80/20 strings after using phospher bronze. Only real problem i noticed is the 80/20s seem brighter and they ring longer. I prefer the warmer tone. And since my guitars have alot of \"boom\" already, i dont need the extra ring to complicate the sound with overtones when strumming fast. I imagine these strings may work in some instances, but i am going back to the phospher bronze for my guitars.", "id": 130}, {"review": "Not sure how to rate this tube? Replaced a Chinese preamp tube in my Champion 600 and couldnt tell any difference in tone. Maybe it is built better? But thats yet to be seen. I did put a EH6V6 in with the Chinese preamp tube and did notice an improvement but the EH6V6 only lasted five minutes and shorted out. So i sent it back. I ordered a TS 6V6 and am still waiting for it. Maybe NOS is the way to go with the preamp tubes? Time will tell.", "id": 514}, {"review": "You need this to get the most out of your Super-Champ XD amp. The only way that i can see an improvement is to make the end pcs out of aluminum instead of plastic. No telling how long the switches will last? Fender tends to make good products. Price isnt too bad but this item should come with the amp IMO.", "id": 535}, {"review": "I bought this amp back when i didnt know much about amps. If you want the metal sound for practice, then it is hard to get a better amp for one bill. But with the hybrid amps (Vibro Champ) going for not much more, you get better sounds and more settings. I am selling mine and ordered a Super Champ Xd used in new condition for two and a half bills. This Line 6 amp has a flat sterile sound that isnt very warm sounding. From now on its tube amps for me, even if i have to pay the price. A good tube amp should last a long time and hold its value well, too. Like i said, for a first amp at one bill, the Line 6 isnt too bad. Maybe some day i will be able to afford a Princeton Reverb?", "id": 619}, {"review": "Well worth the [...] bucks i paid. Analog with true bypass. Easy to use with one knob. And has nice high quality chorus effect. MXR built like a tank. Works with my Boss DS1 AC adapter too.", "id": 672}, {"review": "First real harmonica i have owned. Read all the reviews and this harp was recommended by many. The price is right and the quality seems good too. Didnt take me long to start to pick up some techniques such as bending and single/double blow/draw. Still trying to get the overblow. I am far from perfecting the techniques but this harp is pretty easy to bend notes on. It has a good seal also. Only change i would like is a more rounded shape in the back.", "id": 828}]