[{"review": "I've used these strings for longer than I'd care to admit.  String sound is a personal thing.  These work better for me than any others I've tried.  To my ear they have a balanced timbre across the sound spectrum. The five star rating is a reflection of my personal taste. Others may prefer a different sound.", "id": 198}, {"review": "This holder, and just about every holder I've ever bought, doesn't hold a harmonica at the right angle for me.  They all need one more joint to adjust the angle. I've had Hohner racks before so I was prepared.  I use harmonica holders for kazoos.  This one has a decent spring and may not require the use of duct tape or wire to hold the kazoo in place.  I may add the wire or tape just for the kazoo aesthetic.  The angle for kazoo use is fine.Obviously not everyone's head and neck are the same as mine.  This holder may work well for harmonica for some people.  If you can, you should try on holders before you buy.", "id": 354}, {"review": "I put two pickups in my resonator guitar, a magnetic and a transducer.  This is the IMD--improvised musical device--solution to using both pickups without building a little box with two volume controls.  I plug two cords into the mixer, one from each pickup, and blend and balance the two pickups.  It works.  It cost a a little more than buying the parts to build something like an electric guitar wiring setup but it works out of the box so the labor cost is almost zero.  Bonus, it's an active device so it can boost the signal.  Only con is that it runs on 12 V and doesn't have a battery option.  I can live with that.", "id": 374}, {"review": "I have K&K pickups in other guitars.  This is the first one I've bought that had the smaller transducers.  It needs a preamp unlike the now discontinued Pure Western with the larger transducers.  Like other K&K pickups it sounds darned good.  With a decent PA head and good speakers you can get a very natural sound with hardly any tweaking.  The pickup is easy to install if you can ream out the end pin hole to accommodate the strap jack.  This one comes with an ingenious DIY installation jig made from, I'm not kidding, cardboard, golf tees, and double sided tape.  It makes placement a snap.  The best pickup is still an external mic, but for noisy situations where feedback is a problem these pickups are the answer.  You can induce feedback but you can go to an adequate level for most situations.  They sound much more natural than a magnetic or under saddle pickup.", "id": 416}, {"review": "I've used thumb picks for over forty years on a variety of acoustic guitars.  My thumb nail can't pluck the strings when I damp them with the heel of my hand.  These are adequate in the sense that you can strike the strings with them and they stay on.  They have a dullish sound compared to my favorite, the long gone National clear thumb pick or the current Dunlop clear.  I like the sound of the Ernie Ball thin celluloid picks but they aren't strong enough to grip my thumb.  The major problem with these is they aren't large.  They're like most other brands' medium.  My thumbs aren't Tom Robbins huge, but my hands are bigger than average.  These picks cut off the circulation in my thumb if I use them for more than fifteen minutes or so.  I think I could brighten up the sound by sanding them down, but that's a lot of work for something this cheap.Don't buy these if you have a large thumb.  If you like a less bright sound, and some people do, and have a medium sized thumb, these might work well for you.", "id": 617}]