[{"review": "It really pains me to give anything but a 5-star review to a BOSS product, since I'm such a big fan of their product line and build quality overall.  Those compliments apply equally to the CS-3 Compression Sustainer.  And it does do the job reasonably well without me having to worry about putting a less-reliable brand in my signal chain.However, there are some minor issues with this pedal that you need to know.  The two most common complaints that I see are that it adds \"noise\" to your amp and that it changes the tone a bit.  The former complaint is probably true, though if you're enough of a hobbyist to use a Compression Sustainer, you're probably already contemplated using a noise gate/suppressor, such as the BOSS NS-2.  Problem solved.As for the latter complaint (changes tone), that's also true, but it's not necessarily a bad thing if you LIKE the tone that results.  The whole point of the CS-3 is that it's supposed to cut out the extremes of your tone and sustain it.  This can result in a muddy, \"neutered\" tone, though you can play with the TONE and other settings to help it.  I also find that with the settings all at 12 O'Clock, the output is too quiet compared to other pedals at default settings.Really, while BOSS pedals are considered to be \"expensive\" compared to many of the other effects out there, the CS-3 should really be viewed as a \"budget\" or \"entry level\" compressor, when you consider that most of the quality compressors are either in rack units or something like a Keeley Compressor costing north of $200.  The best thing you can say about the BOSS (even compared to the similarly-priced MXR options) is that the CS-3 gives you a great deal of control over your compression for a reasonable price.  The biggest negative of the pedal, in my opinion, is that the resulting sound might seem a little too...compressed.But there are a lot of things you could do with a CS-3, and it works best paired with other pedals (chorus, delay, some distortions) that you're trying to smooth out.  Ultimately, it's a pedal that could have been better, though there aren't too many significantly better alternatives until you get north of $100 anyway.", "id": 34}, {"review": "There's some element of nostalgia with the DS-1 that I've just never understood.  I know they're cheap.  I know they're incredibly durable (as are all BOSS pedals).  I know everybody had one or tried one at some point, and Kurt Cobain (apparently) used them with his Fenders.But I also know that I've almost never been happy with the tone I get when I step on the pedal.  It's incredibly thin and harsh, and lacks proper sustain, even cranked all the way.  I've used it on Marshall solid state amps and Vox tube amps.  Fender single coil pickups and guitars with humbuckers.  You can mess with the TONE and DIST dials all you want, but there has to be dozens of other affordable pedals, and even on-amp distortion, with a richer, deeper tone.Coincidentally, I also used the BOSS OS2 Overdrive/Distortion for many years, which is supposedly merges/blends a DS-1 with an OD-1.  That pedal isn't ideal either, but if I turn the knob all the way to \"distortion\", it's a much better tone than I ever got out of a DS-1.Then again, it is very dependable and usually only $40 (or less), so I can't really give it a bad review because it probably does belong in everyone's collection.  That just doesn't mean you'll want to use it all the time.", "id": 35}, {"review": "I held out from trying the Boss SD-1 Super Overdrive for many years.  Like many guitarists, my first distortion pedal was a Boss DS-1, which was durable and aggressive, but also extremely frustrating.  I might have formed some negative impressions about Boss, when it was probably unfair to do so.The SD-1 is widely owned and very affordable (usually around $50).  It's similar in a lot of ways to the Ibanez TS-9 Tubescreamer, except that a Tubescreamer reissue costs twice as much.  A lot of guitarists consider the SD-1 to be more of a \"rock\" overdrive, while the TS-9 is more of a \"tube/blues\" effect.  There's probably some truth to that, but both of them are excellent pedals.However, the SD-1 really impressed me with its transparency and versatility.  You CAN simply plug into it and use it alone with a clean channel.  But that isn't necessarily the best use for the pedal - it excels as a \"booster\" pushing an already overdrive amp, or stacking with other distortion/OD pedals.  One of the best settings is turning the Level all the way up and the gain all the way down.  This adds just a little bit of grit to your tone, and really sounds great.A feel that lot of people give the SD-1 mediocre reviews for reasons that aren't fair.  You hear things like \"it cuts out too much bass\", when that's really what the pedal is supposed to do.  The midrange hump, when set up properly, can take away the muddiness of your tone and help you cut through a band during live playing.  And, like I said before, I feel as if it's MORE transparent in retaining elements of the clean tone than the TS-9, though preference between the two is entirely subjective.But you also know that it's a Boss pedal, which means it's as durable as they come.  The thing will stand up to years of abuse, and can be used in any number of roles.  If you're looking for a single pedal to make a small amp sound \"big\", there are probably better options in this range.  (Try the under-appreciated MD-2 Mega Distortion, or the excellent Joyo Ultimate Drive).  But if you understand what this pedal is supposed to do and use it for that purpose, you'll understand why this thing has been popular for over 30 years.", "id": 38}, {"review": "I acknowledge that this is a minority opinion - perhaps I just had bad luck with my unit and the attempts to repair it afterwards.  But while I loved the sound and functionality of this wah-wah pedal, it would literally last me a few months at a time before it became unusable.  I suspected that the potentiameter was shot, so I had that replaced, but the same problems reoccurred.  Like a horrible static noise as soon as started using it.Good product, but hopefully they make them more durable than the particular unit I had.", "id": 41}, {"review": "Didn't think I'd be compelled to review something like a guitar pick, but the Dunlop Ultex has really impressed me thus far.  I use the .60 thickness, which is equivalent to the orange plastic Dunlop pick.  The orange pick is my favorite for acoustic and most electric playing, but they do wear down and fray on the edges, and have a little more friction that I'd like.This Ultex seems very resistant to wear and has surprisingly little drag over the string.  I find the matte finish very easy to grip and hold.  It gives just enough to use for smooth strumming, while being rigid enough for individual notes.Some reviewers have noted that they crack after some use.  If that turns out to be a problem, I might reconsider my review.  But out of the box, they perform as well as any pick I have used!", "id": 54}, {"review": "First of all, don't expect any new tuner to work as a \"drop-in\" replacement.  Drop-in replacements for tuners basically don't exist unless you have the exact type of tuner, and in that case, you aren't doing an \"upgrade\".  You'll likely need to bore out additional diameter for the peg hole with a drill press or tapered reamer.  Or, if there's a Guitar Center or guitar shop nearby, have a tech do the work for you.These tuners arrived quickly and are very attractive, with a nice vintage look.  They would look great on a either a Strat or Tele.  Unfortunately, my Squier Bullet had a slightly smaller headstock, which meant that the low E string's tuner was too large - the wing for the screw hung over the edge.  Therefore, I will not be installing these on my guitar, but that is not the fault of the tuner.Functionally, these are one of the easiest tuning keys to rotate, and I've heard the hold tune just fine.  Check the back of your headstock for fit, but if that's a \"go\", these are a great option!", "id": 114}, {"review": "If you listen or read what many pro guitarists and techies have to say about DigiTech effects pedals, they'll tell you to stay away from them...except for this one.  That's because the DigiTech Bad Monkey Tube Overdrive is an incredible value that could go head to head with any pedal made by BOSS or the $100 TS-9 Tubescreamer.In fact the TS-9 Tubescreamer is the pedal the Bad Monkey is best compared to.  This is not meant to be a heavy distortion pedal with endless game - it simulates and overloaded tube amp that adds crunch and a little gain to an otherwise clean tone.  Notes will sing and chords will really crunch, especially in blues and classic rock.  But since the pedal works well as a level/gain boost, I've heard of guitarists turning on the Bad Monkey in conjunction with other distortion effects, to really push them to new levels.But the best feature of the Bad Monkey by far is the two-band EQ.  Virtually any distortion pedal has a \"Tone\" control that will make the tone darker or brighter.  But since one band EQ basically takes away bass to add treble (or vice versa), you may not find the sound you want.  That's what's so great about the Bad Monkey - if you feel like your tone is too weak, you can fatten it up.  If it's too muddy, you can add treble.  And you can make those changes without compromising the parts of the tone that you like.Construction is extremely durable - die cast metal, and probably heavier than a BOSS pedal.  The switch is more similar to a BOSS than an Ibanez pedal, but I find that easier to use.If you're a beginning player or a player on a budget, this would be an outstanding pedal to own, along with a more traditional high gain distortion pedal.  There's really no need to spend the extra money on a Tubescreamer, if that will prevent you from buying something else you need for your gear.  But even for player where money is not an object, don't overlook the Bad Monkey.  It might just be the only tube overdrive pedal you'll need.", "id": 145}, {"review": "First of all, a little Amazon 101 - review the PRODUCT, not the service or the vendor.  Giving out 1-star ratings because you had a shipping issue or because some third party (like Fender) didn't get you the right model is unfortunate, but it has nothing to do with the product itself.  All you do is create the impression that this is a poorly-designed product, when exactly the opposite is the case.I have a Fender 5-way in my loaded pickguard as part of a Squier upgrade.  Beware that traditional Strats are 1 3/4\" thick, where as many Bullets and Affinity Strats are slightly less than that.  As such, you might have the bottom of this switch hitting the inside of the guitar.  You might need to either live with this or shave/sand out a portion of the interior if that's the case.But the switch itself works great and, really, is quite inexpensive relative to its importance!", "id": 214}, {"review": "I've tried several different strings on electric, and Ernie Ball Slinkys are the only ones I really trust on all of my guitars.  The fact that they also happen to be among the cheapest strings you can find is a nice bonus.  But they sound great, and are far less prone to breakage than other brands I have tried.  The 9's are super fast and easy to bend, but I've started using 10's more often on my Strats, which creates an even more robust sound.  They're an industry standard for a reason - you don't need 15 dollar strings!", "id": 226}, {"review": "The Danelectro FAB series is supposed to be everything we hate about effects pedals.  Cheap.  Mass-produced.  Housed in a plastic casing.  But the FAB series offers affordable effects ($15 to $20) at surprisingly good quality, and end up sounding as good as some pedals that cost 3 times more.  If this pedal cost $50, I might gripe about how tight together the input/output/9V jacks are.  I might also complain about the weird position of the Mix, Speed, and Depth controls on the top of the unit, or the small footswitch.  But at this price, for it to sound THIS good, I can't complain at all.Don't expect the FAB series to be good at everything.  But if there's and effect out there that you only use once in awhile (especially anything involving modulation or delay), the FAB series is going to do it well, and do it for a fraction of the cost of other pedals.  It's just a great option to have for casual/budget guitarists.", "id": 319}, {"review": "In the reviews for this item, there seems to be a lot of debate over what the Fender Mini Tone Master is and how we should evaluate it.  Is it a toy, or is it meant to be a serious bedroom amplifier?  Do we review it compared only to other \"mini amps\", or do other small combos costing under $100 creep into the discussion?  Well, I bought one for myself and the conclusion is this: It isn't the best way to practice guitar quietly at home, but it's also also fun little product at an affordable price that sounds slightly better than you'd expect.APPEARANCE/DURABILITY - Actually, the aesthetics of the Mini Tone Master are one of my favorite things about it.  This is a $40 conversation piece that I wouldn't mind having out on my work desk as a reminder of one of my favorite hobbies.  It just so happens that it's a functioning amplifier you can plug into and practice with also?  The component actually used to make the amplifier are cheap, yet are put together in a convincing way.  Take a step back and you'd swear the hard plastic housing was actually vinyl or leather.  The \"grill cloth\" over the speakers is a nice facade for the hard plastic facing that protects the speakers.  Actually, while the amp is cheap, it's also fairly durable.  In fact, I just dumped it off my desk reaching over to write this review, and it seems to be working fine.  (Phew!)  It should also be noted that this amp is powered either by a 9V battery or a 9V DC adapter (a BOSS pedal supply adapter will work, for example).  While the battery option is obviously nice for portability, the red \"ON\" light seemed noticeably dimmer with 9V's, and I can't say how long the battery will last.  If you plan to have it in one place most of the time, the adapter is the preferred way to go.SOUND - The concept of this amp is pretty ridiculous if you think about it - a one watt output with TWIN 2\" speakers.  Given that each speaker is smaller than the \"tweeter\" on a large stereo speaker, you won't be surprised at all to hear that there's virtually no bass in the sound.  It sounds like a poor 10W solid state amp, only shrunk down to a few inches.  At the same time, that's kind of a remarkable feat for a miniature amplifier, and it puts out a fair amount of sound.  I opted for the Mini Tone Master over some other options because it actually has a fair range of tones.  Low Gain/High Volume produces pretty good clean tones, and with humbuckers and the gain turned up, it can get a bit raunchy.  Unfortunately, the tone control either does nothing, or behaves completely irrationally.  I haven't figured out which yet.  I had it at \"5\" most of the time, but it didn't seem to cut much treble as I turned it up.  Actually, it got the brightest around \"7\", and then almost became more muffled beyond that.  But again, for a $40 mini amp, my expectations were not that much to begin with.  I do like the four knobs, and the decision to make the power knob the same size as the other knobs was a subtle touch that prevents the cheaper feel of an on-off flat toy switch.I expected the speaker to overdrive/break up if you pushed it too hard, and not in a \"tube-like\" manner.  That wasn't necessarily the case, but there are other problems.  Something internally rattles after the volume goes above \"4\", and it's not the speaker being overpowered.  This is a common issue with cheap amps, and I might even pop it open to see what is rattling around.  And the sound quality isn't objectively \"good\" by any means, but it is good enough to play amplified electric guitar and to hear the basic characteristics of your instrument and playing style.ALTERNATIVES - The primary reason I rated this 4* instead of 5* really isn't any of the issues above (I am happy with the amp), but it's limited usefulness compared to the many alternatives for home/quiet practicing.  My favorite of these, by far, are the Vox Amplugs, which are headphone jacks stylized after different famous amplifiers.  The sound quality those things pump into your headphones is of far greater quality (and volume/fullness) than anything this mini amp could do.  Also, they are offered at $40 or $50, so it's simply a better value.  Another alternative is to plug into a smartphone and practice with software.  While sound quality and volume are often a problem with smartphone apps, the possibilities for effects, modeling, and recording are endless.If you think about recent improvements in small size Bluetooth speakers, you realize that the sound quality on a device of this size could be far better than what the Mini Tone Master offers.  At the same time, those speakers can cost up to $200, and premium sound quality was never the point of this amp.  Your opinion of it will depend on your expectations, but if you don't take it too seriously, it's a cool little device.  And, in my book, anything that allows you to practice more guitar than you would otherwise is nothing to laugh at.", "id": 391}, {"review": "The Behringer UCG102 device is an aging (yet affordable) piece of hardware that offers the intriguing option of plugging your guitar directly into the USB port of a computer.  This opens up a number of possibilities for recording or simply for playing with headphones.  For the budget player, it could be argued that a mere $32 investment unlocks a world of free amp modeling and recording possibilities.However, while the actual hardware is compact and seems function properly, there are some significant problems here.  First and foremost, there is the problem of getting the device to work, getting the software to recognize it, and configuring it to run without significant \"latency\" (which is a delay effect where you don't hear a played note immediately when it's played, which can make monitoring anywhere from frustrating to impossible).  The UCG102 runs on an ASIO driver.  They include an older version with the software, and you can snoop around online and find other options.  But that doesn't mean it will necessarily work with your software, or work well if it does.  For example, Audacity is a popular \"freeware\" program you can use to record and mix audio files on the computer.  I've been told that Audacity doesn't work with ASIO drivers, and when I got it to record, the latency issues rendered it unusable.You do receive two other software options with the device.  The first is energyXT2, which I believe includes a license for the compact version.  In theory, this program should work like Audacity and contains a number of amp models and effects, in addition to drum and bass track loops.  However, I have had little luck figuring out how to monitor and record with this program.  I'm sure it CAN work, but if you need a computer science degree to figure it out, that's really not ideal for a budget product.The second item is a trial disc with Guitar Combos by Native Instruments.  So far, this has been the most impressive of the options offered.  You can demo three different amp simulators (Vox, Fender, and Marshall) and then enter a code to unlock one of the three.  I like that it gives you an interface similar to a real guitar amp, which allows you to dial in some realistic tones.  It's also the only program I've been able to get the headphone jack to play through both ears in (there are problems with recognizing mono vs. stereo).  I adjusted the sound quality to get latency down to 8 miliseconds, which is just into the range where I don't notice it as a problem.  Still, while the models sound good, I'm not sure how often I would bother plugging into my computer just to do basic playing and recording.Shortly after ordering this device, I discovered that my sound card has a blue \"line in\" audio jack on the back.  By running a simple 1/8\" to 1/4\" audio cable from my pedal board to the sound card, I can do direct recording, which is monitored through my computer speakers (no latency) and sounds great.  Even better, this method works through Audacity and allows me to record and layer tracks.  If the UCG102 worked as advertised, it would be a more convenient way of doing this, but I simply can't recommend it for most people.  I feel like there's \"4-star\" potential somewhere in this device, but I doubt I'll ever have the patience to unlock it.  3 stars.", "id": 418}, {"review": "This is a terrific product.  While the price might seem a little high for a power adapter, it actually serves the function of what you might need several other adapters and daisy chains to accomplish.The key to the OneSpot is the 1700mA output.  By comparison, the Boss PSA-120 adapter puts out 200mA.  Since most stompboxes draw between 5 and 60 mA of power, you could only reliably chain up to about 3 or 4 of them with the BOSS adapter.The combo kit is a great value because it comes with a daisy chain for up to eight pedals, and some other parts for hookups to a 9V adapter or other jacks that I don't use on my pedals.  I use it with BOSS and Ibanez pedals and it works great.  Best of all, there's no added electric \"buzzing\" noise, which is a problem with many budget power solutions.Also like how the cable hookups are angled instead of straight - makes much more sense for a tight pedalboard.  No more 9V's and no more hooking up multiple cables every time - one simple plug and I'm ready to play!", "id": 428}, {"review": "I've had this pedal since the mid-90's, when I started playing in my teens.  While an EQ might seem like an odd choice for a beginner's pedal selection, I was mainly trying to compensate for the crappy bass and mid-range of the cheap CRATE and Marshall amps I used back then.  Since I have better equipment now, I haven't used it as much.However, as simple as it is, it is definitely a useful tool.  You can leave it on all the time to mold your sound with greater detail than most amps would have with knobs.  Or, you can the on-board volume to crank up the volume for solos or louder parts.The only negatives I recall from using it were that it added a bit of a hissing noise (but not so much that you couldn't trap it with a noise gate), and it seemed to take away from the sustain of notes just a bit.  Again, nothing that can't be fixed with other effects.  And if you think about how important equalization is with stereo equipment, it only makes sense that you might want that level of control in a guitar amp as well.I give it 5* despite the minor flaws because it does what it says and BOSS products are built rock solid.  I'll have this thing forever.", "id": 433}, {"review": "First off, this is a great, classic pedal that has shaped the tones of rock and blues artists all over the musical map.  It's actually a reissue of the pedals Ibanez made in the 1980's, though there's some debate over whether or not  the modern circuitry retains all of that original tone.  In my opinion, unless you're being purposefully picky or have the most elite of trained ears, you would never be able to tell the difference.  The construction is sturdy (metal and actually heavier-feeling than a BOSS pedal).  The LED light, for some reason, is difficult to see from an angle, but that's largely an irrelevant gripe.But let's be clear what a \"Tube Overdrive\" pedal is and isn't.  This is NOT a distortion petal like the Boss DS-1 or Metal Zone (MT-2).  It is also not a \"fuzz\" pedal like you would hear on a Jimi Hendrix song.  It is not meant for heavy rock/metal/grunge type music.  If you need heavy distortion to mask sloppy playing, the TS9 is not for you.What it DOES do, however, is to boost the signal at the front end, which essentially results in a more dynamic done with additional gain.  This can result in a very midrange-heavy \"blues\" tone (Stevie Ray Vaughan used it quite a bit), or even a nice \"crunch\" overdrive tone (AC/DC) for rhythm work.  Some guitars use it simply to boost their signal without adding a bunch of additional gain.  It also works well with other distortion pedals for that purpose.Long story short - the Ibanez TS9 Tubescreamer really is one of the more versatile pedals you will use - just don't expect it to create every range of sounds you need right out of the box.  For a cheaper alternative, consider Digitech's surprisingly good \"Bad Monkey\" overdrive pedal, which is half the price and gives you more control over tone.  I've also compared this to BOSS's BD-2 Blues Driver, which is an excellent, but very different style of overdrive.  (The BD-2 has a much hotter output and is more aggressive; the Tubescreamer is more subtle and works in the midrange while retaining your underlying clean tone and responding to picking style).  If you start with a good amp and guitar setup, the Tubescreamer will sound great.  It won't completely transform your tone, but it will give your current tones a boost, make those solos really sing and those rhythm chords really crunch.", "id": 446}, {"review": "I picked up this pedal used along with DS-1 Keeley modded distortion pedal not entirely knowing what to think.  Long story short, the mod DS-1 is getting returned and I'm keeping my Fulltone OCD.First, a word about the negative reviews...it tells you something when a small handfull of people completely trash something, but the 13 other reviews (as of Sept. 2012) were all 5-star reviews. It tells me that the people who ripped on the tone of the pedal didn't know what the pedal was before they tried it.  And anyone complaining about the price - this is a hand-crafted pedal that is extremely well constructed (the inside circuitry is pristine) and built to last for decades.  I think the ratings should reflect quality first and foremost.Now, let's talk about how the pedal sounds!  It's marketed as an overdrive/distortion.  I had a lot of people try to steer me away from it because I indicated I was looking for a distortion pedal, but I was actually quite surprised at how much gain and sustain the pedal has.  It is much more an \"overdrive\" in the sense that it keeps the tonal characteristics of your guitar and amp, but boosts the level in gain in a very full, rich sound.  The sound has a lot of \"bass\" to it, but unlike a Tubescreamer (TS-9), it's definitely not \"muddy\".  In fact, if you're tired distortion pedals sounding tinny and weak on a combo act, this might be exactly what you need.The battery is accessible behind 4 hand screws and moderately involved to get to, but an AC adapter is really the way to go.  It's a standard plug like you find on BOSS and Ibanez pedals, but you can use a 9V or 18V.  I've read some reviewers say that 18V gives you more headroom, while some actually prefer the 9V sound.  Honestly, I tried both and didn't discern any difference - it probably only matters at very loud volumes with cabinets.Finally, there is an LP/HP switch, and it's really a matter of preference and setup how you use it.  I've been mostly using the LP setting, which has plenty of output but avoids the shrill highs that I hate.  But in a live setting (or to use it as a boost for soloing), the HP setting could be quite useful, as it is designed the emphasize the mids and highs to \"cut through\" the other instruments on stage.If I had to summarize this pedal, I would describe it as a Tubescreamer you can rock with.  Which is not to say that it's \"better\" than the Tubescreamer, necessarily, but it definitely has a larger range of gain and tone.  Put this on your pedalboard and you may find yourself using it as your go-to for rhythm/chord sections, soloing, or both.", "id": 453}, {"review": "I bought the Vox Amplug AC30 and loved it so much, it probably doubled (or tripled) the amount of time I play guitar.  I loved it so much I went out and got the more expensive (by $10) Joe Satriani Signature Amplug.  I liked the Satriani model also because it covered a different tonal range than the AC30, and delay feature is a lot of fun.  But I had serious questions about the Classic Rock Amplug.  Why did have only a 4-star review on Amazon - among the lowest for any of the fabulous Amplug products.  Would it be only a \"one trick pony\"?Well, I have to tell you, I was completely blown away by how great the Classic Rock Amplug is, and I'm now even more blown away by some of these negative reviews.  I've tried out a number of effects pedals for plugging into an actual guitar amplifier, and many pedal users are seeking what they call a \"Marshall-in-a-box\".  In other words, they want a effects pedal that will single-handedly transform whatever amp they have into the sound of a miniaturized stack of Marshalls.  Believe it or not, the Vox Classic Rock on higher gain settings is about as close to a \"Marshall\" sound as I can imagine.  And it comes in a small, plastic headphone amplifier that runs on 2 AAA batteries and costs all of $39.99.Functionally, the Classic Rock Amplug is the same as the AC30 - three dials for gain, tone, and volume, an aux in jack (for MP3 players), a headphone jack, and an on/off switch.  But that's where the similarities end.  While the excellent AC30 model simulates the boxy, sparkly sound of a tube amplifier, the Classic Rock packs some PUNCH.  The low end presence on this thing (even through a $20 set of entry-level Sony headphones from Target) is significantly greater than on the AC30.  More importantly, the sound doesn't deteriorate with higher volumes.  There are plenty of ways you can try to play guitar through headphones, but most of them become a static-filled mess as soon as you turn up the volume.  Amazingly, the tiny Amplug has plenty of power on tap, and the \"overdrive\" is controlled through analog circuitry, with amazing clarity.But the real surprise in the Classic Rock Amplug (and the point upon which I disagree with several other reviewers here) are the clean and slightly overdrive tones as you roll back on the gain knob.  Several reviewers referred to the clean tones as weak, or claimed that there were no clean tones.  Yet, with both my Les Paul and a Strat, I was able to set the Volume at around 6-8 and the gain at about level 2 and get a very nice clean tone without loss of volume.  If any dirt was remaining, a slight rollback on the guitar volume further cured the problem.  Even better, playing a Strat into the Classic Rock with the gain set somewhere between 2 to 4 actually created a Tubescreamer-like blues tone!  This tone was one of the audio demos offered on Vox's website, but I didn't believe it for myself until I plugged the Classic Rock in and dialed in that tone.Long story short, the Classic Rock is extremely powerful, but more verstaile than I thought.  It can do the high-gain Marshall tones I expected, but also offers a wide array of clean or slightly-overdriven tones.  It might even be more versatile than the AC30 Amplug, though I remain pretty loyal to the AC30.  The good news is that the two models are different enough and cheap enough that you can own both.  Highly recommend the Classic Rock - 5 stars.", "id": 491}, {"review": "The Korg Pitchblack is probably, along with the BOSS TU-2/TU-3, considered one of the industry standards for compact pedal bypass tuners for use with guitar and bass.  Both the TU-2 and Pitchblack are excellent, and I don't really have an opinion yet as to which is better.  However, there are some strengths of the Korg Pitchblack that may lead you to prefer it over other tuners.  The primary draw here is the bright light-up display with wide color bars.  The tuner displays the note you are closest to, and the colors guide you to the perfect pitch, marked by the green light in the middle (almost like an airplane landing guide).  But not only do the lights indicate tone by turning on and off, they actually dim and transition into one another as you go across those semi-tones.  You could argue, therefore, that the visual guide is giving you a lot more precision than you would get from a simple on/off light.  The tuner works quickly and reliably.The build quality is outstanding, and it's true bypass.  When you step on the pedal, the tuner is on and the guitar signal is off.  The switch is also of the \"soft button\" variety, similar to what you find on some Vox pedals and many boutiques.  It has a nice feel to it, though it could be easier to bump if it's in a high traffic area.This is a great tuner at a reasonable price.  It really comes down to user preference, but I've heard many guitarists prefer this one because of its high accuracy and visibility.", "id": 504}, {"review": "Compression is possibly one of the most misunderstood pedal (or rack) effects for guitar players, but I can say confidently that the MXR Custom Comp gets it right, and makes it easy.WHAT IT DOES - First, a quick word about compression.  The easiest way to describe compression is that smooths and sustains the level and intensity of your guitar's pure tone.  When you play an uncompressed guitar signal, you can experience annoying volume swells if you strum too aggressively.  On the other side of the problem, you may want to use strummed chords or arpeggiated sequences for a continuous \"ringing\" effect, but find that the individual notes die out too soon.  A quality compressor pedal takes those extremes and normalizes them.  It also can \"sustain\" the notes by boosting the levels of individual chords or notes when they would otherwise fade away, depending on the settings.BUILD QUALITY - If there are complaints to be had about the MXR Custom Comp, they aren't related to durability.  MXR pedals, like BOSS pedals, are built with heavy-duty metal, yet the pedal is surprisingly light with the battery removed.  Unlike BOSS pedals, the switch is in the form of a metal button that \"clicks\" when you press it.  My understanding from veteran MXR users is that the switch is very reliable and long-lasting.  In my case, however, I intend on having the thing on all the time, so this is not a major concern anyway.One gripe with the pedal is the accessibility of the battery and internal \"Attack\" control.  The pedal has knobs for Output (volume) and Sensitivity (basically, amount of compression).  The \"Attack\" knob, which is found on some rival compressors, has to do with the degree of \"pick attack\" sound you want when you first hit the note, and whether the sound comes on aggressiveness or more subtly.  But on the MXR Custom Comp, you need to remove the back plate (4 Phillips screws) and adjust the Attack know with a screwdriver.  You also need to remove the back plate to get to the battery, though I've switched to a power adapter/daisy chain (OneSpot) for my pedals anyway.  So, yes, it's an inconvenience, but with this type of effect, it's not like you would want to adjust the Attack the way you would mess with Tone or Gain on a distortion pedal.  I consider this also to be a non-issue.TONE/SOUND QUALITY - The sound quality of this effect is outstanding.  It is far more \"transparent\" than other pedals I've tried in terms of retaining the tonal characteristics of my guitar, but leveling everything out for a great \"finishing touch\".  Whereas I used to think of compression as an \"effect\" I would turn on for a specific type of tone, I could envision always leaving this effect on with the MXR Custom Comp.  It simply makes my underlying clean tone and other effects more manageable and better sounding.COMPARISON TO OTHER PEDALS - The toughest question to ask about the MXR Custom Comp is whether it is worth the extra money.  The top-end professional compressors (Keeley pedals, rack units, etc.) are usually north of $200, which isn't practical for a casual player.  Boss makes the CS-3 Compression Sustainer, which is the pedal I traded in for the Custom Comp.  The CS-3 is more affordable (about $50 to $75 new) and more customizable, with 4 knobs on the exterior of the pedal, adding \"Attack\" and \"Sustain\".  It definitely does the job in terms of adding sustain, and might make sense if you only want to play around with compression from time to time.  But much like with MXR's entry level compressor (The Dyna Comp in the red casing), it simply isn't up to the quality of this pedal.ADVICE - While compression doesn't \"color\" your guitar tone the way a distortion pedal does, it's arguably as important to your overall tone quality as any other pedal.  If you're interested in compression and want the best option at an affordable price, I recommend the Custom Comp at $100 or less on Amazon, or used on eBay, where I've seen it go for about $70 to $85.  It may not be \"necessary\" for everyone, but very few people who try it will come away disappointed.  Turn it on, play with the settings for a minute or two, and then leave it on and strum away.", "id": 671}, {"review": "For those unfamiliar with Vox's amPlug products, these things are amazing.  I'm just old enough to remember some of the portable options of the 1990's, and they were mostly terrible.  What Vox has done with these tiny headphone amplifiers (which weigh virtually nothing, run for 10-15 hours on 2 AAA batteries, and plug directly into the guitar) is nothing short of amazing.  They have incredible amp-like tone and get as loud as you can possibly want.  Even through a pair of $20 Sony headphones, they sound amazing.  The star of the collection, in my opinion, is the Vox AC30 amPlug, which does a great vintage tube amp ranging from sparkling cleans to Top Boost overdrive.  If you haven't played an amPlug before, the AC30 one is $39.99 of the best money you'll ever spend.Now, getting to this specific Joe Satriani amPlug, it's impossible to talk about the tone without talking about the guitarist himself.  Fans of Joe Satriani (even casual ones) will recognize elements of this sound right away.  Satriani has a very distinctive sound, which he crafted over the years using a modified Boss DS-1 Distortion and (more recently) his Vox \"Satchurator\" Distortion Box.  It's a thick lead tone with a nice sustain, and colored with a delay effect.  Both of those elements are present on this signature amPlug.  You have a level control, a gain control, and a tone control.  There's also three switch positions: Off, On, and Fx.  The \"Fx\" position engages the delay effect, but the tone is otherwise the same.PROS:First, the price retails at $49.99, whereas most of the other models are $39.99.  (I believe the Lead amPlug is also $49.99 and also has a delay feature).  I think that the added delay feature and unique tone are worth the extra money, but this is admittedly a sort of \"niche\" product.  Overall, however, you have several amPlugs to choose from, and if you choose this one, $49.99 is still an incredible value for the ability to play your guitar virtually anywhere and enjoy quality tone.  The tone has a real sweet spot between \"3\" and \"5\" that really makes it enjoyable to play lead notes.  While it isn't necessarily and \"ideal\" rhythm guitar distortion, you can hit rich chords with nice sustain.  I prefer the tone on the higher gain levels, and you can really crank it up if you want to, but it sounds great at lower volumes too.  The delay is also surprisingly good - it's probably set to around the 400 milisecond gap, which is pretty standard.  Adds a cool echo \"fullness\" to your solo progressions, much like a classic Satriani solo.  Again, the overall tone is fantastic.  With the amount of gain provided, you can play most types of rock and dabble into metal guitar a bit (though I've always thought of Satch of more a technical, melodic guitarist than a \"metal\" guitarist).CONS:There are a few things to know about the Satriani signature model, but I don't think any of them should discourage you from checking it out.  While the delay is surprisingly good, you can't customize it.  You can't make the repeats shorter or longer, and you can't adjust the timing of the repeats.  Keep in mind that this is mostly a \"practice\" device for your personal use, however, and I still enjoy using the delay.  As for the tone, which I mostly discussed as a \"pro\" in the paragraph above, you should be aware that this is not meant to be a \"clean\" signal.  It is possible to get a somewhat clean tone by rolling back on the gain or lowering the volume of your guitar, but it's mostly distortion or bust.  The durability of all of the amPlugs has also been questioned by some.  The device is VERY lightweight and all plastic, except for the metal plug portion.  I don't doubt that you could bang it on something and break it quite easily.  The switches and dials may also fail over time.  But frankly, at $40 or $50, it's probably a better value than making it out of heavy duty metal and charging $100 for it, which would lock more people out of the market.  I would certainly buy another one (or several) if any of mine broke.  Finally, there as an audible \"hiss\" noise through your headphones anytime the device is on.  Slightly annoying when you're not playing, but I don't notice it at all once I start playing notes.THE VERDICT:One other \"dirty little secret\" to point out about these things: in addition to the Aux jack, which allows you to plug in an MP3 player and jam along, it is possible to use a 1/8\" to 1/4\" adapter and audio cable to plug this thing directly into an amp, PA, or anything with speakers.  You might be surprised how good it sounds.As an after-note, I wrote most of this review playing on my Jackson DR6, which has two Seymour Duncan Humbuckers, and it sounded great.  I later tried it on a Gibson Les Paul (which is usually my primary guitar), and despite the fact it also has two humbuckers, it did not sound as good.  The distortion was much more \"fizzy\".  Haven't tried it with single coil pickups, but I think that it would likely work well with a Strat-type guitar due to the overall \"roundness\" of the tone.The amPlug is a great invention that allows so many players to log endless hours practicing, irrespective of their budget or living situation.  The Satriani model brings its own special character to the series, and if you like the tone as much as I do, might become an instant favorite.", "id": 720}, {"review": "The Rogue Analog Delay is well-constructed and feels very high quality given the price.  It's similar in size to an MXR stompbox, though the knobs are more reminiscent of a BOSS.  Delay is a very simple effect that is increasingly available on modeling amplifiers to cheap plastic entry-level pedals.I really have no complaints about the Analog Delay in terms of how it performs and sounds.  It does a good job of creating that ambient short delay sound up to about 320ms, or slapback rockabilly on quicker repeats.  It's just too bad that they weren't able to stretch out the delay time a little longer, perhaps to 450ms or 500ms.  Once you get into that territory, there's a much broader array of things you can play, including the U2-style phrasing repeats.  That being said, a digital delay is probably better for that task anyway.But it isn't fair to compare this pedal to an MXR Carbon Copy, and if you're looking for something cheap and surprisingly high-quality to provide ambiance, the Rogue will do just fine.", "id": 725}, {"review": "There is no shortage of \"Tubescreamer clones\" on the market for guitarists in search of that warm overdriven tube sound perfect for blues, jazz, and rock.  The DigiTech Bad Monkey is one such example.  But the Chinese-made Joyo JF-01 Vintage Distortion just be the best, and it's half the price of a TS-9.About the manufacturer - Joyo hit the market a couple of years back and has now released about a couple dozen pedals that utilize their own form factor (very similar to an MXR in size and switch) but \"cloning\" the circuitry of well-known classic and modern boutique effects pedals.  Some people jump to conclusions about Chinese products, but don't just take it from me - do your homework.  The response to these pedals has been overwhelmingly positive, and there are great vendors/distributors within the U.S. that test them out and can ship them to you within a few days.  I'm definitely a fan of Joyo products.As for the \"Vintage Distortion\" itself, people have said it's based on either a TS-9 or the (more expensive) TS-808.  Frankly, while the latter is apparently warmer (and less mid-range heavy) than the former, I'm not sure there's any significant difference.  I played this JF-01 side by side with my TS-9, and it's probably one of the more exact \"clones\" in the Joyo lineup.  For example, the Joyo \"Ultimate Drive\" is an excellent (higher-gain) overdrive pedal based on a Fulltone OCD, but you can still notice differences in the resulting sound and settings required to get there (some of which are arguably BETTER than the original).  With the settings matched, the JF-01 performed almost exactly like the TS-9 in level, gain, and tone.  There probably is little more gain available on this pedal with that knob cranked full, which isn't a bad thing.  It's very responsive to your playing style and, again, it sounds like a Tubescreamer.I'll probably be keeping my Tubescreamer, if only because it's an iconic pedal that performs well.  But it's superior in name only - if I had to use the Joyo Vintage Overdrive in its place, I'd be no worse for the wear.  5 stars, highly recommended!", "id": 728}, {"review": "I recently picked up the TC Electronic MojoMojo Overdrive at a steal of a price, but I'm evaluating based on its inherent quality relative to the retail price.  I own many different overdrives, including light overdrives in the \"Tubescreamer\", and some ones capable of getting a bit more raucous (Blues Driver, OCD, Joyo Ultimate Drive, etc.).  To me, this is closer to the Tubescreamer family, as it does better as a clean boost or light overdrive.  Actually, the separate knobs for Bass and Treble and its darker tone remind me a bit of the Digitech Bad Monkey.BUILD QUALITY - Outstanding.  It has an \"MXR\" style click button press, but the mechanism feels sturdy and built to last.  The 9V jack is on the top, out of the way of the I/O jacks.  The battery compartment opens with a unique oversized flat screw/button that you can easily get open with your fingers, or maybe a quick turn of a screwdriver.  The thing is dense and build solid as a rock.  I always appreciate the extra weight with pedals because lighter ones are less crush-resistant, and tend to get punted around by your cables.  Finally, the 4 knobs are built will with some force feedback, and several of them are actually notched to settle into the \"12\" position, which is a nice touch.TONE QUALITY - Obviously, the tone quality is the most subjective part of this review.  I would not be at all critical of a reviewer who gave this a \"5\" and absolutely loved it, as several previous reviewers did.  But based on the pedals I have used and my experiences with the MojoMojo, it feels more like a \"4\" to me.  The tone is very warm, almost to the point of being muddy.  Whether the mod switch is a \"boost\" or a \"cut\", the pedal is bassier in the \"up\" position.  Don't get me wrong, I definitely appreciate the abundance of low-end frequencies, but it might get some tweaking to get that high end to shine through.  I could also easily see it getting lost in the mix if you play with other instruments.  It does a nice job of adding a bit of gain and saturation to your tone without coloring it too much with different character.  However, if you'd like a similar effect with a much more expressive (and brighter) output, try the Mad Professor Sweet Honey Overdrive, or its \"clone\" companion, the Joyo Sweet Baby Overdrive.EASE OF USE/VERSATILITY - Many overdrives only have the single tone control, so I was excited to see controls for Bass and Treble.  Still, I feel like this is a pedal that could be great with some amps, and very muddy with others.  I will update my review if my feelings change, as I have a few different combinations I want to try out.  I feel that the preferred use of this pedal is as a stacked overdrive pushing some other type of overdrive or distortion.  This is much the way you would use a Tubescreamer.  I will say that it is one of the more \"tube-like\" overdrives I have tried.  Hit the notes lightly, and you get a clean, transparent tone.  Attack them harder, and the higher output from the guitar will push the overdrive and cause further breakup, much like a tube amp.  However, if your hope is simply to plug into the MojoMojo into a clean amp and expect classic rock tones, you may be a bit disappointed with it as a standalone overdrive pedal.", "id": 749}, {"review": "Wanted to review this pedal because I felt some of the other reviews were a little lukewarm.  Distortion is incredibly subjective-it depends on your rig and your tastes. But the Badass '78 by MXR is a very nice pedal for a decent price.  It doesn't do metal or super high-gain, but offers some nice classic rock tones and can be quite warm if you back off on the tone knob. The crunch button adds brightness and volume and may or may not be too harsh for your setup.  However, the tone knob does do a pretty good job of rolling back the high end, especially if you activate the \"crunch\" button.The build quality seems to be pretty good, though I should note that while the pedal is the same size as other MXR pedals, it is significantly lighter.  I suppose this could make it more susceptible to denting and damage if it travels, but it should be plenty durable for 95% of users.  I really like the switch on this one too, it's easy to press and clearly clicks \"on\" once depressed.  One minor annoyance if you use the \"crunch\" setting is that the blue light (which is annoyingly bright like an LED headlight) stays on EVEN when the pedal itself is off.  This can be quite distracting if you rely on the lights on your pedal board to tell you which effects are on.  Not really a major gripe that detracts from the pedal's quality, but a frustrating design decision.Basically, if you get the right setup, you'll get great tone.  I got this pedal specifically to try and find a better alternative to the BOSS DS-1, which lacks mids and can sound harsh/abrasive.  The MXR '78 Badass is definitely superior in that regard, but a lot will depend on your rig and settings.  I find that this pedal really excels on playing single notes on the lower strings (think \"Walk this Way\" by Aerosmith, or \"Hangingaround\" intro by Counting Crows).  And if you pair it with a fat tubescreamer or other overdrive pedal, you could probably thicken it up a bit for higher solos.  Great pedal!", "id": 757}, {"review": "For most guitarists, tremolo is a very simple effect.  You simply want a pedal to control swells or oscillations in volume to give your tone a \"shimmering\" effect.  It's used in subtle fashion in everything from to 50's/60's rock and surf guitar to modern \"indie\" rock.  But most guitarists (like me) were never going to shell out $100 (or more) for a Boss or other expensive tremolo option.  In fact, there really weren't that many affordable tremolo pedals on the market.Enter the Joyo JF-09 Tremolo.  This pedal is simple, durable, affordable ($40 - $45), and it just works.  The only two controls are for Intensity (depth of the volume swells) and Rate (how fast the swells cycle).  The LED light dims rhythmically along with the \"Rate\" control, which is a nice visual indicator.As for the sound - the pedal sounds great.  It doesn't color or diminish your tone in any way.  I'm not a \"tremolo expert\", but the effect sounds as it should.  If you're the type to obsess over tremolo, then you probably aren't looking to save money anyway, and there are $200 boutique options from Catalinbread and others that have tap input and other features.  I'm not particularly interested in those, so the lack of those on the Joyo won't detract from my score.Regarding the quality and durability of Joyo pedals, there's a lot of discussion about that, but also some misinformation.  I've personally owned 7 of them at one point or another (yes, I like them that much), and I've yet to have one fail.  The early run of Joyo pedals is actually quite durable, and includes the JF-09 Tremolo and every pedal numbered from JF-01 through JF-17.  The more recent models numbered higher than that are all similar in appearance, and while many of them still sound great, they feel lighter, \"cheaper\", and the switch is a little more suspect.  I recommend ordering through a vendor that ships from the U.S., rather than trying to save a few bucks on a direct shipment from China.  Many of the U.S. vendors will test the pedal out before shipping it, which is a huge advantage.Highly recommended!", "id": 758}, {"review": "I really can't say enough positive things about the Apogee JAM.  Not even 3 years ago, I would have considered recording into an iPad or iPhone to be a &#34;novelty&#34;, and the interface products that most people use to hook up your guitar as &#34;gimmicks&#34; or &#34;toys&#34;.  Now, as of 2013/14, we have so many quality modeling programs, recording DAW's, and AudioBus to connect them to one another.  Whether you're a budding professional, or just a hobbyist aiming to record your own covers, the Apogee JAM (usually around $99.99) deserves a serious look.PROS -Extremely easy to use and widely compatible --&#62; No batteries required.  You get a small plastic converter with an 1/4&#34; input (for guitar cable) on one end and a digital output for 30-pin connector, Lightning, or Mac cables, all of which are included.  Virtually any serious guitar recording app in iOS (GarageBand, Agile AmpKit, AmpliTube, JamUp XT) will recognize and work with the Apogee JAM right out of the box.Crystal clear digital sound --&#62; The sound quality you get through the digital input is markedly better than using the headphone jack as an input.  You'll hear your guitar as it's meant to be heard, and with far less hissing and junk in the background.Considerably less feedback --&#62; This was actually the primary reason I decided to upgrade.  My Positive Grid JamUp Plug wasn't disappointing me in sound quality, but there was so much additional noise that went with it, it would easily cause my modeling amps in Agile AmpKit+ to feed back.  High gain settings (even something basic like a Marshall JCM900) were practically unusable.  Even with clean settings, I had the noise filter turned WAY up, and that still didn't thwart the feedback issues.  The Apogee JAM cured ALL of that instantly.  When I first plugged it in, I wasn't even sure it was on because I expected to hear constant hissing in the background.  What I assumed was a fault of the software was actually due to a poor interface.  The JAM's improvement in avoiding feedback, alone, made it worth its price.No &#34;crosstalk&#34; - When you do multi-track recording with a headphone jack splitter, you get a bleed-over effect referred to as cross-talk.  Basically, you are using the headphone input to monitor and play along with your track, but due to poor circuitry, this also gets fed back into the &#34;armed&#34; track you are recording.  Some people are bothered by this more than others, but it makes quality multi-track recording quite challenging.  I haven't noticed any of that using the Apogee JAM whatsoever, since it is a digital connection.  (You can still monitor your playing using the iPad's headphone jack separately, obviously).Gain control and LED gauge --&#62; Not a feature unique to the JAM, but I love how it's implemented.  When you first plug in the device, the LED light is blue to show that it is hooked up, but not being utilized by software.  Once the input is active in software, the light becomes green.  However, as you play and hit harder notes, the light may change to yellow/orange, or even red.  If it is getting into the red, your input level is too high, and may overdrive the signal.  You adjust this right on the JAM using a roller dial.  I tend to aim for a setting where the light is largely green and starts to touch yellow only in the more aggressive parts.  Works well.CONS -Price point is a little high --&#62; Admittedly, I wasn't thrilled about having to spend $99.99 for what I was already doing with a $20 headphone jack.  That being said, I researched all of the alternatives and repeatedly heard that this was the best.  If I knew it would be as good as it is, the price would have been of little concern.  Also, there aren't really any quality DIGITAL options that are significantly cheaper.Lightweight plastic design --&#62; I actually have no problem with the build quality of the JAM, or that it is made out of plastic.  At the same time, the fact that it is relatively lightweight means that your guitar cable may pull it off of a table.  I also would not advise stepping on it if it happens to fall on the floor.  But they do include two velcro strips to fasten it, and it's a problem you can address with common sense.Highly recommend the Apogee JAM.  It's a mid-level priced device that services everyone from complete amateurs to recording professionals.", "id": 764}, {"review": "As the reviews herein have indicated, there is a wide variety of uses for studio monitor like the M-Audio BX5.  With the proper cables, you can hook up everything from an iPad, to a home computer, to a musical instrument or stereo.  I will preface this review by saying that I am no &#34;audiophile&#34;.  I have a basic understanding of speaker and musical equipment, but my primary goal here was to find a small speaker that I could use to monitor guitar playing through either a preamp pedal or iPad modeling software.With those goals in mind, I was pleasantly surprised how good the BX5 sounded.  The goal of any &#34;studio monitor&#34; is to convey as much of the true sound of the source material as possible without coloring the tone with additional equalization.  There are some monitors in a comparable price range like the Rokkit 5 and options from Mackie and JBL - I have not tried those out.  But the BX5 performs we well or better than I hoped.For guitar playing, I use it in close proximity on a desktop.  I found that it had a surprising amount of low end punch for a 5&#34; woofer, given that my Fender tube amp has a speaker twice the size!  The bass is tight and articulate, which is what you want.  Again, if your goal is just to drown out the sound with additional base, go get a pair of Beats headphones or hook up a dozen subwoofers to it.  That wasn't really my goal.  But all that aside, having enough low end was important to me, and the BX5 delivers.  Using modeling of &#34;Fender&#34; and &#34;Vox&#34; type amplifiers, it also handled the high end &#34;chime&#34; well without sounding &#34;tinny&#34;.I should note that I got an XLR (microphone) cable that converts to TRS on the other side.  I had heard/read that this was the best way to get a guitar signal into the thing, though there are likely adapters and other cables you could use to accomplish the same thing.  There are both XLR and TRS inputs on the back.  The monitor is powered, so there's a power cable, as well.  There is a volume knob, but no independent bass/treble adjustment, as on other monitors.  So if you want that, look elsewhere, but if the monitor is actually relaying most of source tone, you shouldn't be using it anyway.  Really enjoying my BX5 so far, wish I had the budget/space for a 2nd one!", "id": 783}, {"review": "I've reviewed several Joyo pedals now and have loved almost all of them...not just because of the price ($40 to $50), but also because of their (apparent) durability and tone quality that would be appreciated at any price.  But ultimately, I decided that this is somewhere between a 4* and 5* review, and I just can't give it the 5* review I've given the other Joyo products I've tried out thus far.* Extremely high output and high sustain *When I first plugged this thing in, I had it set up similar to any other distortion pedal I would try out with my Les Paul and VOX combo amp - with the dials all at 12 o'clock (50%).  Big mistake.  This pedal has an EXTREMELY high output.  Depending on the Gain setting, I was achieving output parity with the clean signal with the Volume set at around 25%.  This isn't necessarily a bad thing, and it's certainly better than having no headroom to set the pedal louder (a frequent criticism of the BOSS DS-1), but it's something to be aware of.Also, I read several comments here that this \"isn't a high gain distortion\".  I couldn't disagree more.  This thing has TONS of gain.  I think people are thrown off by two things: (1) The name, which pays tribute to the MI Audio Crunchbox it clones; and (2) The clarity/transparency of the tone, particularly the higher-end range, that shines through at all Gain levels.  \"Crunch\", in my mind, refers to a punchy, cleanish tone that has just a little bit of breakup in its character.  The Crunch Distortion has a tone that doesn't really breakup or get \"fizzy\" as you turn up the Gain, but that's not what \"Gain\" really is.  The Gain knob increases the saturation and sustain of the note(s), but I think people are fooled by the fact that the sound doesn't crack up.  Hit a barre chord and see how long the note holds with the gain turned up.  This actually makes the pedal very useful for lead work, also, which is one of the JF-03's strengths.* The setup is weird, but workable *Because of everything I described above, you may use some weird dial configurations to get the tone you want.  My level is usually around 25% to 40%, and is still very loud.  The \"crunchy\" classic rock tone that other reviewers talked about does exist, but only at around 5% to 15% of the gain setting.  And I had the tone knob generally working from 9 o' clock to 12 o'clock, as it got a little too bright to go any higher.  (Again, this is with Les Paul humbuckers.)  Ultimately, what I decided was that this pedal has enough bass, not too much in the midrange, and very distinct high end frequencies that come through very clearly.  If you play gigs and are having trouble cutting through the other instruments, I'd imagine this pedal would do the trick!* It's costs less than half of many of it's true \"competitors\" *While the affordability aspect is distinct from \"quality\", it cannot be ignored.  Part of my initial disappointment was based on a side-by-side comparison with my MXR '78 Custom Badass Distortion.  The latter did have a fuller sound to it, and was arguably better for rhythm work.  But that's an $80 custom shop pedal from MXR.  Try comparing this pedal to a $40 Boss DS-1 or MXR Distortion + and it blows them out of the water (in my opinion).  I'm not sure want to roll with the Crunch Distortion being the only dirt box on my board, but if you used it with a specific purpose in mind (like a lead/gain boost), you could afford this and Joyo's excellent \"Ultimate Drive\" overdrive pedal for still less than most boutique or even BOSS distortion pedals go for.UPDATE - About a week into owning this pedal, I did revise this score from a 5* to a 4* rating.  If you graded the pedal in a \"vacuum\", I could absolutely see a 5* rating for the $40 price tag.  But ultimately, there are just a few more problems and quirks about this pedal that I haven't had with other Joyo products, so the score should reflect that.  Please note also (which I didn't realize before) that the internal trim pot for \"presence\" is NOT easily accessible unless you are prepared to remove the circuit board and the three jacks that are connected to it.  A distributor confirmed for me that this is necessary if you want to make the adjustment, and I have no interest in trying to take apart fragile components for a small change that might not even do anything.", "id": 794}, {"review": "Let's get a few things straight from the start - I love effects pedals.  I love the idea of a handcrafted boutique pedal (and have owned a few), and I'll also play the mass-produced BOSS and Ibanez stuff.  And if you put foreign/no-name brand in front of me, but the pedal is made well and sounds GOOD, I'll play that too.  All you need to know is that this pedal is well-constructed and sounds darn good for 40 dollars.Joyo is a Chinese company that essentially has makes their own form factor (a heavy-duty metal box with an MXR-like button switcher), and then clones/mimics/copies circuitry of popular boutique pedals that cost anywhere from $100 to $250.  And they've figured out how to ship them to the U.S. and sell them for $40 to $60 each.  I've recently discovered these pedals, and if money/pedalboard space were no issue, there's probably 8 to 12 of them I'd like to own.The \"star\" of the Joyo lineup, however, is arguably the JF-02 Ultimate Drive.  This pedal got some notoriety a few years back when an American company bought them in bulk, repainted them, and tried to sell them for almost $200.  The fact that they thought they could get that much for it tells you something about the quality.The pedal this is supposedly clone off of is the Fulltone OCD Overdrive, a boutique pedal that came out several years ago, and usually sells from around $150.  I own that pedal, and I've done a side by side comparison on my pedal board.  And while tone is EXTREMELY subjective, I'm not sure that I wouldn't go with the Joyo Ultimate Drive in a blind test.  While the 3-knob, Lo/Hi switch are clearly inspired by the Fulltone OCD, the pedals actually sound quite different.  With the exact same settings, the Fulltone will actually sound much brighter.  That's really saying something because the Fulltone is known as having a very well-rounded tone with a defined base.  Well, the Ultimate Drive offers even more bass and mids, yet the Tone knob can brighten it up quite a bit without losing that bottom end.It's actually extremely versatile.  I'm not sure that it would do low-gain \"crunch\" sounds very well, but if that's what you want, consider the Joyo Vintage Overdrive, the Joyo Crunch Distortion, or a Tubescreamer.  Right now, I have three pedals that are fairly similar and offer a great \"overdriven Marshall\" tone: The Fulltone, the Ultimate Drive, and the Marshall GV-2 Guv'nor.  While they are all great pedals, the Joyo really hits the sweet spot on my Vox Combo amp (using a Gibson Les Paul).As for soloing/lead play, I'm noticing all types of pick attack/harmonic response with the Joyo that I don't get with other stompboxes.  It really does act and feel like an onboard overdrive channel.  If you point all the knobs at 12 o' clock, some people may think it is muddy, but that Tone knob really does change the character quite a bit.  Sorry for the long rant, but I want people to know that just because you can't afford $150+ on a single pedal doesn't mean you can't enjoy a great overdrive stomp box.  Check the JF-02 out - it just might be your \"gateway drug\" to other Joyo pedals!", "id": 795}, {"review": "I revised a previous 4-star review after playing with the Joyo British some more and especially after using it for direct line-in recording.  I now rate it at 5 stars.The phrase \"Marshall in a box\" gets thrown around a lot, but usually the people using it have a particular Marshall amp in mind.  For example, the Wampler Plexi-Drive sounds like an older Plexi, while a MI Audio Crunch Box will do that 80's JCM compressed high gain tone.  On the recommendations of several people, I picked up the Joyo British Sound hoping it could clone the full spectrum of those different amps.Does the British Sound succeed at that goal?  Yes and no.  On certain settings, the British Sound does offer a convincing, tube-like sound reminiscent of a Marshall cabinet.  You can clean it up quite a bit, and it works very well as a \"foundation\" pedal, placed last in your effects chain to give the amp Marshall \"character\", but boosted by other overdrive and distortion pedals.(Note: The pedal is actually its own preamp, so the recommended use of it is to plug it directly into the power amp section of a combo amp, or into a PA system or mixer directly.  You can use it in  the effects chain into another preamp, but that will diminish its effectiveness)But despite those good traits, there's just a few things \"off\" about it.  First, it seems to add quite a bit more noise (\"hiss\") than some of the other Joyo Sound pedals.  Or perhaps it's just more noticeable due to the fact that this is supposed to be a \"Marshall\", so i turned it up.  Second, as several other reviewers noted, the Voice control seems exactly backwards of what it should be - turning clockwise makes it sound thinner.  On the other three Joyo Sound pedals, the opposite is true.  Functionally, this really should mean nothing, but it does make it a bit more confusing to dial in.If you read the manual for the Tech21 British (upon which this pedal is supposedly cloned), they claim that 9:00 on the Voice/Character knob would be JTM/Bluesbreaker territory, 12:00 would be Plexi, and anything above that gives you the \"presence boost of a 70's Metalface\".  I haven't tried all those amps, but perhaps it's meant to brighten up as you turn it up, and that's just a design choice.I think it's possible to get the \"Marshall\" tone you want out of this thing, but you have to work the EQ knobs with each adjustment of the Voice knob.  At this price, hard to complain too much.", "id": 796}, {"review": "I was very anxious to get this pedal in the mail and try it out so that I could write a review of my own.  The reviews on all Joyo products are extremely polarizing.  Some people love them and think they're every bit as good as boutique pedals costing three times as much, while other people (including a significant portion of the hardcore techie community) despise the whole concept and wish they didn't exist.  Having tried out this specific product - the Joyo JF-15 California - I can tell you that I'm extremely impressed for only having spent $40 to $50.First, a word about Joyo.  Joyo is a Chinese company, which for a lot of people loyal to American products, starts them off on the wrong foot.  Further adding to the controversy is the fact that many Joyo pedals appear to have virtually copied the circuitry of well-known Western boutique pedals, such as the Fulltone OCD (\"Joyo Ultimate Drive\"), Ibanez Tubescreamer (\"Joyo Vintage Overdrive\"), and MI Audio Crunchbox (\"Joyo Crunch Distortion\").  If you find that disturbing or appalling, I won't try to change your mind, but consider the following:  Joyo has found a way to manufacture surprisingly faithful \"clones\" of these very successful pedals at a price that even entry-level casual players can afford.  Larger companies, such as BOSS, DigiTech, and Ibanez, openly copy ideas, clone sounds, or borrow inspiration from other successful pedals.  Finally, if you want to pay more the boutique pedal, nobody is stopping you from doing that.  There are certainly areas where Joyo cuts costs by using cheaper materials, and the Joyo is absolutely not a one-for-one clone.  My personal opinion is that if Joyo has found a way to take the concepts of these pedals and make them cheaper...power to them.  But again, reasonable minds can differ.  My primary concern is: \"How does the pedal SOUND?\"The answer to that question is \"surprisingly good\"!  The specific pedal \"cloned\" by the Joyo California (from what I'm told) is the Tech 21 NYC \"Character\" series, which was a pedal series (apparently now discontinued) that modeled popular amps, such as Marshall, Fender, VOX, and Mesa Boogie.  Like the Tech 21 pedal, there are 6 on-board knobs, including one called \"Voice\", which essentially a transparency control - the more you turn it up, the less is sounds like your original amp, and the more it sounds like a Mesa Boogie.  There is also a 3-band EQ (Low, Mid, High), which seems to do a pretty good job crafting your tone.  Finally, there are Level and Gain knobs that work as if they were the corresponding knobs on your amp.  Fortunately, I find with the level gain at 12 'o clock, the volume is basically on par with your original signal.Trying to describe the tone in writing is difficult, and is obviously going to vary a great deal depending on your guitar, amp, and other cables and effects.  I run a Gibson Les Paul through a small VOX Valvetronix combo, and the resulting tone was good.  Most importantly, it sounded very different than the normal tones I would get through that amp.  Admittedly, I do not have much experience with using an actual Mesa Boogie amplifier, but I think people get a little too wrapped up in making that direct comparison anyway.  Obviously, if want the true sound of a Mesa Boogie half stack, you're going to have to go buy the real equipment.  But the tone that I found with this pedal was very full-bodied, yet still retaining clarity on the high strings.  The \"Drive\" knob works better at the lower and mid-level gains - it is capable of higher gains, though I did find the pedal to become somewhat noisy with the Drive knob past 3 'o clock.There are two ways to think of this pedal.  First, you could use it as an \"always on\" amp modeler if you really like the tone it produces.  In that case, you could turn the \"Voice\" up and keep the \"Drive\" low, while adding other distortion pedals effects to that base sound.  Second, you could think of it strictly as a \"distortion/overdrive\" pedal, and turn it on only for parts of songs where you want that effect.  However, one very nice (and very \"amp-like\") feature of the overdriven tone provided by this pedal is that the tone cleans up very nicely when you turn the volume down on your guitar.On a final note, the build quality on the Joyo California \"out of the box\" looks to be fantastic.  The switch is a \"click\" metal button similar to those used on MXR pedals.  There is a back cover for a 9V battery, or there is a well-placed DC 9V adapter jack, which works with standard 9V adapters such as BOSS and OneSpot.  Sorry for the length of the review, but I wanted to provide some good information based on my experiences, since I struggled to find honest reviews while I was doing research.  I can't promise everyone will like it, but considering the poor quality of the $40 pedals I used to buy from DOD, Danelectro, and Ibanez SoundTank growing up, it's pretty hard to regret giving the Joyo California a serious look at that same price.  Enjoy!", "id": 797}, {"review": "I'm going this stompbox as I always do, based on the quality of the pedal and what it does - not necessarily whether than tone is \"useful\" for my particular setup.  Viewed in that objective light, the Joyo JF-13 AC Tone is an excellent pedal for $40 to $45.There are two ways to think of the JF-13 and the other \"Tech 21 clones\" in this line (California, American, British Sound, etc.).  The first is the obvious one, which is to use it as a stomp box at the end of you signal chain.  This box basically takes your guitar input and any other effects you add and then tries to \"clone\" a VOX AC30 amplifier into the speaker.  How effectively it does this really depends on your settings and the quality of the amplifier it self.  At the end of the day, if your amplifier (particularly the budget, solid state ones) has certain limitations that you don't like (too bright, not loud enough, too muddy, breaks up too easily...), no pedal (including a $200 boutique one) is going to fully overcome those deficiencies.But the second way to think of the JF-13 is as a preamp, where the output would go directly into a recording device, PA system, computer, or tablet.  I don't have enough experience trying that (though I did a little bit with the Joyo California) to say how well that works, but I've heard great examples of it online.  Also, having the convenience of amp-like controls (with 6 knobs) is certainly very convenient if you like to play/record in that manner.As for the sound of the pedal, it's very good.  I've heard complaints about the pedal being noisy if you turn the gain all the way up, but I wouldn't let that concern you.  That's true of virtually any distortion/overdrive pedal, it can be cleaned up with a noise gate/suppressor, and I think the better use of this pedal is on the low- and mid-gain settings anyway.  The \"Drive\" knob is like the gain knob on an overdriven tube amp.  It's a very nice tone, responds well to picking, and cleans up well if you reduce guitar volume (which many pedal distortions do not do).  The \"Voice\" knob is hard to describe.  Basically, it morphs the tone into something deeper and \"punchier\" as you turn it up.  But that also changes the impact of all your other settings, including drive, EQ, and level.If I had one complaint about this pedal (even compared to the California, also a very cool pedal), I was a little surprised how much this pedal \"wants to be dirty\".  It's tough for me to envision leaving it on all the time if it overdrives so easily.  But, again, I think part of that is you're basically running through two preamps if you play it through a combo.  Check out some of the YouTube recordings as to how it sounds directly into a speaker or recorder - it could be completely different in that context.  At any rate, it's a very intriguing device at only $40, and I could see finding new uses for it in the future I haven't envisioned yet.UPDATE (April 2013): I actually sold this pedal, instantly regretted it, and then bought it back.  Now that I understand how to use it properly (by bypassing the preamp of my combo amp, through the effects loop), I am able to get some great sounding clean tones out of the pedal.  It really is an excellent value, either as a \"foundation pedal\" or as an emergency tool for musicians who might end up somewhere they need to plug directly into a PA/Speaker system.  I won't be letting the AC Tone go this time :)", "id": 798}, {"review": "I have owned many solid state and modeling amplifiers, including a few of the Vox Valvetronix series.  However, this is both my first Fender amp, as well as my first true &#34;tube&#34; amp.  First, some clarification is needed on &#34;tube&#34; vs. &#34;modeling&#34; amp.  The Fender Super Champ X2 is absolutely a tube amp - it has one 12AX7 and two 6V6's, and they are involved in both the preamp and power amp stages.  However, the amplifier has a modeling component on top of that true tube tone, which is what allows it to project different &#34;voices&#34;.  Contrary to what some posters have written, Channel 1 does also have some front-end modeling, except that the the model is fixed for &#34;Blackface&#34; tone and controlled by a separate volume know (no gain control).  Channel 2 offers 16 different &#34;Voice&#34; presets and 10 of these model a variety of vintage Fender amplifiers, including the Tweed Deluxe, Bassman, Deluxe, Princeton, and Twin.  Settings 9-15 model a variety of other popular amps, including the Vox AC30 and Marshall.Overall, I found the available tones to be excellent.  Unlike my Valvetronix, where I more or less settled on a particular setting and used it at all times, I could really see myself flipping between the different models and seeing how they respond to different guitars.  One thing that should be noted if you plan on changing models frequently - you may have to adjust volume, gain, bass, and treble to dial in the same amount of volume as you move from amp to amp.  However, I found the levels to be much more uniform in output than in other amps with a modeling component.  Also, the X2 does not suffer from a lot of the excess noise or &#34;hissing&#34; you hear with digital modeling amps.The tones that come out of the 10&#34; speaker of the Super Champ X2 are very rich and touch-responsive, as you'd expect from a tube amp.  The amp has TONS of high-end sparkle, but some of the settings only start to open up if you increase the volume (true of many amps).  The stock speaker, which is Fender's own design (and has a ceramic magnet, I believe), is frequently criticized as a weak point.  However, it is certainly passable and if you are new to tube amps (or only intend on playing at bedroom levels), you're unlikely to take issue with it.  The Eminence Ragin' Cajun is a commonly suggested replacement that apparently adds significant amounts of output and low end.  But, again, the amp is plenty loud and full-sounding for its size.  Better intended for home/studio use than most gigs, but it excels at what it does.That brings us to the effects section and the Fender FUSE software that works with the amp via USB cable.  Frankly, I'm not a fan of most on-board effects with combo amplifiers.  I prefer to use pedals for modulation, delay, and some overdrive/distortion.  The good new is that the on-board reverbs (which include spring, room, hall, and a few others if you install them from the software) are quite good.  You can also reassign the presets to different effects.  So, if you want a flanger with a reverb, you can have a setting for that.  If you want a different type of delay mixed with a particular reverb, you can do that too.  The Tap Tempo button is a great modern convenience to go with those effects.  But, as I said, while they represent a good value for players that don't want to invest in pedals, I'm more likely to use my Boss DD-3 than the on-board delay, and so on.The build quality of the Super Champ X2 is largely excellent.  The grill is wound tightly and with the same convincing shimmer of some of Fender's more expensive amps.  The amp weighs in at 24 pounds and is extremely portable with the handle on top.  One thing I did note, however, is that the knobs protrude and seem like they would be very easy to damage while transporting, so I will have to be careful about that.  Also, there are a couple of seams for the tolex material on top of the amp that look like they could have been hidden better.  But overall, the amp looks very well constructed.  I was initially concerned about the digital aspects taking away from the tube amp aesthetic, but everything is mapped to vintage-looking knobs, and from a few feet back, the amp looks just as much at home in the 60's as it does post-2000.Overall, I think this is an excellent value and a quality amp that I hope to enjoy for years to come.  I'm only really scratching the surface of its potential, but it makes great Fender tone sound easy.  The Fender FUSE software could be a little more intuitive to work with, and I wish there were a better way to know what each of the Voice and F/X settings correspond to without consulting a chart.  But it's a great little amplifier that's all the power you'd need for hobbyists and studio recording, and it could probably handle some smaller gigs as well.", "id": 819}, {"review": "The US Dream is supposed \"clone\" of the Suhr Riot, and is the only one of the \"new\" model Joyo pedals that I own.  This is a high-gain distortion pedal that covers the gain range of something like a ProCo Rat, but retains its clarity even at higher gain settings.When I first pulled it out of the box and plugged in, it sounded great, but I wondered if it might be a little bright.  I was pleasantly surprised when I rolled back the tone knob to around 10 o'clock, and it rolled off the harsh high end while retaining clarity and fullness.  At least with my setup (Les Paul into a Vox Valvetronix 40-watt), this is one of the few distortion pedals capable of full-sounding power chords and singing high leads.  Unlike some distortion pedals that have a \"fizzy\" (DS-1) or \"cocked wah\" sound (Boss Power Stack), I was really pleased with the tone all over the neck of my guitar.While Joyo makes several dozen effects pedals at good prices, this is one of the first three I would recommend, along with the outstanding Ultimate Drive and the warm-sounding Vintage Overdrive.However, it's worth noting that the build quality is a bit suspect on the \"new\" model Joyo pedals, which are notably lighter than those numbered JF-17 and lower.  The weight is comparable to an MXR '78 Badass Distortion, except the switch and output jacks are more suspect.  Still, if a pedal SOUNDS great and has yet to fail on me, I refuse to trash it in review until something on it actually fails me.  I think if you take care of it and use it reasonably, it should last for awhile, but if it doesn't, being out $55 is still better than being out $100+.", "id": 832}, {"review": "Wow.  I have been impressed with a lot of Joyo's products, but their Sweet Baby Overdrive was one that came highly recommended, and hasn't disappointed.  I held off a little bit until the price came down, but the truth is that this thing is worth every penny it's sold for, and then some.As the description says, this is a \"mild overdrive\".  It won't give you the \"Brown Sound\".  It's not meant for metal.  It's almost like adding a tube-amp \"gain\" knob to your existing rig, add subtle yet dynamic saturation and sustain to an otherwise clean tone.  Chords and notes blend together beautifully without crunching up or fizzing out.  Unlike many \"tube\" overdrive pedals, this thing has tons of volume on tap.  You can set the \"Drive\" to 0 and still have a nice loud clean boost.  Turn up the drive and it can do blues and rock.  But I think of it more as an enhancement to your clean tone, as opposed to an \"effect\" that transforms it.  In that respect, it actually reminds me of the BOSS OD-3 Overdrive, which is a vastly underrated pedal (though the OD-3 probably offers more gain).The Focus knob is interesting - it doesn't act exactly like a tone knob.  As you turn it up, it doesn't remove bass, but changes the gain structure a little and opens up the tone.  The lower settings are bluesy - the higher settings are bright and dynamic.  But chances are, both will sound good.There are some concerns you could have about the build quality - the switch may not be built to last 20 years, and having to remove 4 screws to get to the 9V jack is annoying.  I also wish they'd put the 9V adapter jack on top instead of the side.  But those are mostly minor gripes.  It's an excellent overdrive and an incredible value.", "id": 833}, {"review": "As thrilled as I have been with the Chinese-made Joyo overdrive and distortion pedals I've tried out in the recent past, I felt like the JF-10 Dyna Compressor was somewhat of a risk.  I had been using the very excellent MXR Custom Comp already, but was frustrated with its lack of external controls and versatility.  Also, it's one thing thing for Joyo to \"clone\" the circuitry of a distortion pedal, but could they do it accurately with an \"always on\" effect like compression?Well, Joyo has absolutely done it, and they've done it well enough that I'm selling my MXR.  Compressors are hard to explain, and even harder to demonstrate on a YouTube video, so let me offer my explanation of what this pedal does, and why you should give it a try for only around $40.The primary effect of compression is to \"level\" or normalize the output across frequencies.  Particularly with a clean signal, aggressive playing can lead to annoying volume swells.  Also, certain notes sustain, while others seem to die out too early.  Compression \"smooths\" over these problems and levels everything to a polished, presentable sound.The secondary effect of compression is that the pedal can sustain single notes and chords by increasing their level after they would normally die out.  In this area, the Joyo JF-10 is superior to many other compressors because it gives you \"Attack\" and \"Sustain\" knobs.  \"Attack\" refers to how soon the compression effect kicks after the note is struck.  Turning the knob up produces a \"chicken picking\" effect where the note is very clear and pronounced.  Adjusting the \"Sustain\" knob, obviously, increases the length of time that the note or chord continues to play at volume.  Like most compressors, there is also a \"Level\" control to change the volume of the compressed sound.Of the compressors you can actually find under $100 (such as the MXR Dyna Comp and BOSS CS-3 Compression Sustainer), I like this one the best.  The MXR models have a good clarity of tone, but with only two knobs, the lack of customization is a problem.  You may want high sustain or attack for playing U2-type guitar parts, but might find excess sustain too \"messy\" for punchy AC/DC riffs.  The Joyo allows you to make this change easily.The BOSS CS-3 is a good pedal that has controls for attack, sustain, and also tone, but the pedal produces a lot of noise, and the resulting tone sounds too digitized.  Also, a \"tone\" knob on a compression pedal strikes me as an admission that the pedal is CHANGING your tone, which good compression really shouldn't do.  The Joyo Dyna Compressor sounds like MY guitar and amp, it just puts some polish on the final product, and allows me to add sustain and \"punch\" if I see fit.  Great pedal, and amazing value!", "id": 834}, {"review": "The EXH Hot Tubes compact pedal offers a very unique sound and is difficult to review from an objective standpoint.  I had no knowledge of or experience with the original full-sized Hot Tubes pedal from the late 1970's.  And, frankly, many of the reviews I read online about both the original and the reissue were less than flattering.  I think part of that hatred comes from the fact that you have an analog pedal without actual tubes that claims (both in the name of the device and in the artwork on the casing) to sound like an overdriven tube amplifier.  Really, though, if you think about it, doesn't EVERY overdrive pedal (including the venerable Tubescreamer) make that same claim?When I plugged into the Hot Tubes, I was surprised, but immediately intrigued.  I actually ended up purchasing this over the excellent East River Drive, which was very good, but also a very &#34;familiar&#34; sounding clone of a TS-808.  What the Hot Tubes does is anything but &#34;familiar&#34; from an affordable OD pedal.This pedal has a significant amount of output, and (unlike many other overdrives) it has considerable low end.  In fact, it likely even adds bass to your sound.  There is a tone circuit bypass switch that I do not fully understand.  Basically, with the switch off, there is no tone control, and they advertise this sound as &#34;powerful&#34; and touch-responsive. Since the pedal trends to the darker side of things, however, I actually left it in the &#34;on&#34; position and worked the tone from the 12:00 to 1:30 settings.The gain structure is as bizarre as it is unique, though it actually starts to make sense if you think about how gain responds on an actual vintage tube amp.  From the 7:00 (0%) setting up to around 12:00, your tone basically remains clean, provided you started with a clean signal.  My setup was a Strat into a Fender Super Champ X2, which is a tube/hybrid amp with a great clean &#34;Blackface&#34; setting.  However, the Hot Tubes completely transforms that tone.  That setting on my amp is normally bright with some great upper end chime, but the Hot Tubes offered a thick, smokey tone that was mostly clean, with maybe a bit of muffled grit mixed into it.As you start get past 12:00 on the overdrive knob, the amount of gain increases exponentially.  At this point, the pedal behaves more like an overdrive, though the gain is almost fuzz-like.  Some people have described it as a &#34;Jack White&#34; type of sound, but I'll really leave it to individual users to decide if they &#34;like&#34; it or not.There are aspects of this pedal you could be objectively critical about.  First, I want to make clear that this is a DARK, bassy pedal.  In that respect, it is completely different from the EXH Soul Food and East River Drive, both of which have some measure of bass drop.  The tone circuit only helps to open up the tone a slight bit, but it could do more.  I do not believe this is the type of overdrive you would stack with - it might actually benefit from a brighter overdrive stacking INTO it.  If your rig is already on the dark or muffled side, you may want to stay away from this pedal.  That being said, I would definitely recommend &#34;try before buy&#34; with this one because it is different in hard-to-describe ways.For now, my rating is 5 stars - solid EHX construction, very compact, accessible 9V jack (on the top where it I like it), and a unique overdrive sound at an affordable price that doesn't sound at all like the other overdrives I have.  It certainly won't be for everybody, but so far, I like what I hear.", "id": 890}, {"review": "My guitars largely stay at home, so they don't require the heavy duty protection of a large hard case.  Hard cases almost always cost 70 dollars or more, and also take up about twice as much room, which is problematic for storing multiple instruments.  In most cases, a good soft gig bag with padding should protect your instrument against light bumps and bangs, and costs about 1/4 of the price of a hard case.I bought two different variations of the Fender Gig Bag, and I believe the one pictured here is the one that has Fender Medium guitar picks as zipper handles, which is a cool touch.  The case fits my Fender/Squier Strat guitars (or other guitars of a similar size) snugly.  There is not a ton of padding, but more than you might think from the pictures, especially on top.  The pocket is fine, and there are a variety of adjustable handles and straps.  I can't say that the zippers will withstand years of use, but for most uses, they should do just fine.  Glad to have this as an affordable option to protect my guitars.", "id": 473}, {"review": "Not much to say about a chrome neckplate - it's largely a cosmetic item.  But my old one (with the serial number) was corroding pretty bad, and I liked the look of the new one.  A few people have mentioned that it's thinner, but assuming you also have the \"pad\" underneath (which you should) that was not a problem for me at all.  Anybody who dented theirs likely overtightened the screws.  Installation took all of 5 minutes and the neck is set up exactly as it was before.  Looks great!", "id": 475}, {"review": "The MXR Carbon Copy Analog Delay is a relative newcomer on the pedal scene, but has become instantly beloved by professional, semi-professional, and amateur guitarists alike (I would be in the latter category).  As a longtime user of the Boss DD-3 Digital Delay, it was a bit jarring trying out the Carbon Copy.  But after playing with the controls a bit and appreciating the pure quality of the tone it produces, it quickly won me over.There isn't a great way to explain the difference between digital and analog delay other than to say that the former is more precise and percussive, while the latter provides more warmth and ambience.  The \"Mod\" button is suppose to add additional modulation to the tone, though I don't hear a dramatic difference.  But no matter what setting you use, there is something undeniably more \"real\" about the delay effect of the Carbon Copy versus other delays I have used.  Rather than repeat your notes verbatim, it almost sounds like a haunting middle ground between the reverb/echo effect of a large hall and digital delay.The range of this delay, fortunately, is quite wide.  I believe it goes from 20 to 600 milliseconds.  To give you some perspective on that, slapback delays (such as rockabilly \"Stray Cats\" echo) are very short, probably under 150 milliseconds.  Rhythmic \"U2\" delays are usually around 350-450 ms.  Then there's even longer delays with a lot of repeats, a la Pink Floyd's David Gilmour.  This pedal is capable of all of those (though the \"U2\" style delay is better achieved with digital).  One note on that though - whereas the DD-3 uses three different knob range settings to cover its delay time, everything from 20-600 ms is covered with one sweep of the Carbon Copy's knob.  This makes it very convenient, but also a bit touchy.To summarize, the Carbon Copy is outstanding alternative to digital delay and at an attractive price point.  It covers the sounds of delay pedals over twice as large (and expensive), and belongs on any delay aficionado's pedalboard.", "id": 507}, {"review": "This is actually my first experience with a Biyang pedal.  I heard good things about the build quality, but didn't end up with a Biyang until I needed a reverb pedal.  Turns out that reverb is a relatively expensive effect to find in a compact pedal.  Most of the popular options or $100 and up.At around $59.99, the Tri-Reverb has a distinct advantage in price, but don't underestimate its quality.  As some other reviewers noted, the reverb can get EXTREMELY deep and lush, if you so desire.  I found myself with the \"Blend\" and \"Time\" knobs around 30% for a practical spring reverb.  There's a multi-switch for Hall, Spring, and Room.  There are subtle differences between the three, but I'd be lying if I said they sounded dramatically different.  The A/B switch isn't well explained, but if you're in \"A\" mode, the effect is much more dramatic.  I found that operating in \"B\" mode was similar to the type of reverb I had enjoyed on my amps.  (Note: it has a stereo input and output, but I only use one Input/Output, so I can't comment on that).At the end of the day, it's a fairly simple \"always-on\" effect, and the Biyang does the job without costing a fortune.  But what makes it 5-star worthy in my book are the little pieces of attention to quality.  Having a thumb mini-screw to open the 9V compartment (instead of a plastic door or needing a Phillips screwdriver) is a big deal.  Also love that the 9V jack is on the top of the unit, away from the other jacks.  The pots are smooth and easy to turn, and the mini-switches and footswitch are \"boutique\" level quality.  This is a great reverb pedal - I don't think I'll ever need another one.", "id": 699}, {"review": "I received this as a gift for a smaller pedalboard I was assembling - my plan was to try something different to compare against the Boss NS-2 Noise Suppressor on my other board.  While I love the build quality and simplicity of the one-knob setup, I can't say (yet) that I like it better than my NS-2.  With the caveat that I may not have it wired up 100% correctly, I felt that it did kill most of the excess noise, but not all of it.  Good product, but maybe not the best of all the options at the same price.  Will update this post after I play around with different arrangements and get more experience with it.", "id": 740}]