[{"review": "This is a very nice guitar strap in light gray.  The strap material and the double-leather ends are heavy duty and should last a long time.  I got this at an awesome price too!", "id": 74}, {"review": "The Jim Dunlop 83CB capo has a powerful spring and works on both 6 and 12 string guitars.  Just squeeze and slide it where you need it.  Available in several finishes to match your taste.", "id": 116}, {"review": "This unit has a wider handle than most of the inexpensive string winders.  I've restrung a dozen guitars in the past week, including two 12-strings, and it is holding up well.", "id": 161}, {"review": "Attach one of these to your guitar with the included adhesive strip, and you'll always have a spare pick at the ready.", "id": 167}, {"review": "This is a sturdy strap with a nice pattern and double-leather ends.  The color stands out well on the black background.  Available in various colors.", "id": 172}, {"review": "This is a sharp looking strap that looks much nice in person than in the photos here on Amazon.  The strap feels sturdy, and the material is just slippery enough to make moving about easy.  Definitely glad I bought this!", "id": 273}, {"review": "I like these strings for their warm & mellow tone.  They are easy on the fingers, and I prefer the silver-wound basses.", "id": 409}, {"review": "I own several of the Snark tuners.  The SN-1 settles quickly, and works with a wide array of instruments.  Tuning couldn't be simpler.  Just clip it to your instrument and strum or play a note and, in an instant, there it is.  The display is bright and easy to read, and the graph has a lot of resolution.  The SN-1 senses frequency through vibration.  It is transposable, and it offers a metronome feature.  The SN-1 is finished with a rubbery texture and is a beautiful &#34;electric blue&#34; color.", "id": 706}, {"review": "I own several of the Snark tuners, but the Snark SN-2 is my personal favorite.  It settles extremely fast, and works with a wide array of instruments and couldn't be simpler.  Just clip it to your instrument and strum or play a note and, in an instant, there it is.  The display is bright and easy to read, and the graph has a lot of resolution.  The SN-2 senses frequency through vibration, but it also has a selectable microphone pickup.  It is transposable, and it offers a metronome feature.  The SN-2 is finished with a rubbery texture and is a beautiful &#34;electric red&#34; color.", "id": 707}, {"review": "I purchased a couple sets of these to try them out.  They are small and unobtrusive digital tuners which can be left attached for easily keeping your instrument in tune.  They seem slower to lock then my Snark tuners, and the visual scale is not as precise, but they do seem to work fairly well.  The ratcheting mechanism holds tightly on my guitars, and they can be stored in the case attached.  Its nice having a tuner right there at the ready whenever you need it.UPDATE:  Downgrading my rating by 1 star.  Having used four NS MicroTuners for a couple of weeks, on four different instruments, I have to say that, in comparison to my Snark tuners, the NS Micro Tuner is slow to lock, and difficult to tune precisely.  With the Snark (any of them...I have several models) I can usually pluck a string once and tune the string in seconds.  With the NS Microtuners, I have to repeatedly pluck a string, and the tuner is slow to display the adjustment.  Sometimes I have to pluck a string several times before the NS Microtuner acknowledges a string has been played at all!  It is also very difficult to get the tuning precisely on target. |E| would be a perfectly tuned \"E\", but one of the side indicators is always flickering and getting it perfect takes patience and repeated effort.  I still like having them clipped to an instrument for a quick check, but when I want to be precise (and fast) I always reach for the Snark.", "id": 785}, {"review": "I love the Snark tuners, and I own several different models.  They all work great and of the various models, I prefer the SN-2 (red).  I got the white one because I just liked that it was a unique, Amazon-only model.  The SN-13 display is like the display on the SN-8, and offers lower resolution than the SN-1/SN-2/SN-5 displays.  Still it works beautifully, and the glossy white looks nice clipped on my Pearl White APX700.  Its also easy to find should you drop it in the dark.", "id": 861}, {"review": "A bonanza of handsome peal celluloid guitar picks in a variety of thicknesses.  An inexpensive way to find your favorite pick.", "id": 878}, {"review": "This will make your fretboard smile!  It takes a dry, faded, fretboard and makes it look like new.  A few dabs goes a long way so this 4 ounce bottle should last you a long time.  If your fretboard is really dry & faded, apply heavily and allow it soak in.  Continue applying until the board stops absorbing and then wipe dry.  I was amazed at how this made a dull & faded 40 year old Fender fretboard came back to life.", "id": 234}, {"review": "This thing is a TANK!  I don't think you could break this beast if you wanted to!  The last string winder you will ever buy!", "id": 683}]