[{"review": "I just got this yesterday so I don't know how long it will prolong the string's life but I have noticed a difference already. It's a lot easier to play since the strings feel a lot smoother which makes this worth buying for that alone. Also, it's cheap so I would give it a shot if I were you. I'm really happy that I \"discovered\" this product, in fact, I'm already ordering 2 more.", "id": 72}, {"review": "I was looking for a crunchy type distortion but this is more like a overdrive. I don't hold it against the pedal though. I have a Marshall Class 5 and this pedal actually sounds a little bit like the overdrive I get from the amp, I say this as a compliment. In my case, however, why would I want to replicate what I already have? I'm gonna return it and save up some money to get a BB preamp. You should check out the 78 Badasss Distortion from MXR too.", "id": 460}, {"review": "This is a great analog delay, analog meaning you're not gonna get a lot of crazy sounds and delays that last forever. If you're looking to get creative with lots of weird sounds, get the Boss Digital Delay. This pedal is intended to just color your tone a little bit and it does so in a spectacular way. I'm very pleased with it.", "id": 507}, {"review": "I couldn't be happier with this pedal. I have a Les Paul/Marshall Class 5/BB preamp/EP Booster/Analog Chorus and Carbon Copy... I used to get this annoying hum and feedback when I cranked the amp up, even when I just plugged the guitar straight to the amp, but those days are long gone, now everything is nice and quiet. I even have the trigger knob all the way down and it still does its job, I haven't noticed any difference in tone so far. I was scared that the Smart Gate was a better option but this one has worked like a charm and it's cheaper, not to mention it has its own effects loop. I don't understand how the Noise Supressor or the Decimator could be better than this one, I mean, the pedal will get rid of the noise yes or no.", "id": 740}, {"review": "I was very disappointed when I tried this thing. I bought it so that I could play along the songs that I have on my Ipod but the guitar sounds really distorted (don't thing I haven't tried changing the settings on the effects/amps). Also is very uncomfortable to use since you are surrounded by all those cables. If you want to record what you play, you're probably better off saving some money and buying the Boss recorder or something like that. Being able to slow the songs down is somewhat useful but forget about playing along to it, it sounds so horrible is unbearable.Update: July 8, 2012. Against my better judgement I brought the Slash Amplitube app just to satisfy my curiosity and let me tell you is much much better. I guess the tittle of this review stands, the free app sucks but if you pay for it it'll be actually useful. I added two stars to the product.", "id": 710}]