[{"review": "I figured at this price I wouldn't be able to use this strap to secure my Dean from Hell guitar. But figured if it wasn't up to being a reliable strap for my expensive & pretty heavy ax that I could always use it for my Rock Band guitar. And I'm rather certain that this strap will outlast the Rock Band guitar. So very pleased with this strap & would recommend it for any beginner with a inexpensive guitar that's likely 1/4 plastic and very lightweight.", "id": 74}, {"review": "Not much I can add to the review that isn't well covered already. It's a nice bag that offers some protection for your equipment. There are some design flaws that I could see giving some people trouble over time. But overall it's a great product.I just wanted to add that it will work for the HD500X with enough room for all the cables/power-supplies needed for effects pod & digital wireless rig.", "id": 165}, {"review": "Quality strap that fits tight & secure on my signature Dime and matches the Dean From Hell lightening graphics perfectly.", "id": 273}, {"review": "In fact, I don't think this Hosa GTR215R cord lasted 2 hours. One step on the cord and it came apart. This purchase is the very reason why I'm looking to buy a wireless system. Maybe if you're using this to run a PA I would recommend it. But if any performer is hard on their cords I wouldn't recommend this item....but to be fair, I would recommend wireless to any performer. You'll end up saving money over the long haul.", "id": 419}, {"review": "I love the freedom the G30 gives me. I'm a real klutz with my cords...especially on the ML designed guitars. So I figured this product would actually end up saving me money over the longrun. The sound is a lot more, there. Between this & the Bill Lawrence humbuckers that the sound is unforgiving and those mistakes will come through real clear...making you work on your technique and become a better player.I took off a star because I don't like the prospect of being a slave to Duracell. I am hoping that rechargeable batteries will be good enough for my needs and I'll give it 5 stars.Side-Note: the 2 foot cord they provide was junk for me. I suggest ordering some better ones.", "id": 670}, {"review": "While I wouldn't trust these to hold up my electric guitars, I have found other uses for them and have 2 of them now. The 1st one I used to try and hold my Dean From Hell guitar but it just mashed that foam around the yokes into nothing and didn't want it to damage my baby. So I ended up using it to hang my Rock Band guitar. This 2nd one I'm using to hang up my Beats Pros.I chose this product over some simple hook to hang my headphones is because of the foam covered yokes. I figured if you spread the weight over 2 cushioned points instead of a single unprotected point of a hook that the head cushion would hold up better. And the distance of the yokes means that the ear cushions won't ever touch the wall.This is a fantastic product if you understand it's limitations. I would recommend this for acoustic instruments, any type of RB/GH guitars, and probably your lighter/cheaper/mostly plastic electric guitars...or even headphones that you'd like to baby.", "id": 779}, {"review": "Like many others floor space is rather limited at mi casa. I also have a dog with a nasty habit of having to &#34;mark&#34; everything that comes into contact with the floor. So needless to say your basic guitar stand was not an option with my $700 Dean from Hell. I had ordered this product prior to my having gotten the guitar (hoping that they would all arrive at the same time) so I was unaware at how heavy the Dean was. This one looked sturdy enough...and it would be, if it were an acoustic or lightweight/hollowbody electric.But the fact that I had to bend out the pegs just a smidge, so the end knobs won't chew up the neck when trying to access/store the guitar, had me doubting the longterm durability of this product. Don't need to come home 6 months from now & find the guitar on the floor with the headstock accross the room. It should hold up long enough for me to order the Hercules. Once I get the Hercules I'll be using this mount for my Rock Band guitar controller.", "id": 810}, {"review": "I had intended to carry this, with my keys, attached to my chain wallet. But the wallet hasn't arrived yet so be warned it is a little bit of a pocket space eater. But I suspected it would be before I ordered it so I don't count that against it. Holds 3 medium picks with grip exceptionally tight...almost annoyingly hard to get one out. Will be sure to update if wear & tear has any effect on the grip on the picks. But so far, so great and would consider purchasing this for my musically inclined friends.", "id": 265}]