[{"review": "I have a Line 6 Vetta II with a Floorboard that takes care of all my needs for effects (for gigs and in my studio) including a wah pedal but sometimes I take my smaller Marshall down below to jam with friends. I just needed something low-priced that would do the job for me in that situation and I ended up with something a lot more when I bought this pedal. I got it yesterday and have been playing with it for hours now. I really like it and for the price, I don't see how you can beat it. It seems well-made and I think, or I hope, it will hold up well with normal care. I've only ever used my Line 6 Floorboard and before that, an old Crybaby for wah effects before but I'll tell you what I really like about this pedal. It's spring-loaded so it comes back up by itself. It says you can remove the spring too if you want but that feature combined with the fact that it turns on when you step on it and turns off when you step off of it, allows me to be much more creative in my playing and use of the wah. I don't even have to think about whether it's on or off which is liberating and it allows me to use the wah in ways I never could before like on half a riff or certain parts of a passage. I also like that you can really step on it without worrying about switching it off like other wahs. The only reason I didn't give it five stars is because there's some sort of semi-annoying hiccup in the sound sometimes. It only seems to happen in the last part of the sweep when the pedal is coming up, so I can avoid it if I try. I don't know if it's just mine or is something inherent in this pedal. I'll update this review if I ever figure it out.", "id": 379}, {"review": "I've been playing in bands since 1969 and have used every wireless ever invented and this beats them all, hands down!", "id": 670}, {"review": "This tuner is great and well worth the $15 you will pay for it at most places but I've seen it as high as $30-35 and that is just a rip off.", "id": 724}, {"review": "I love these clip-on tuners. I have several but this is the first one I purchased that is a bit of a pain because there is not angle adjustment for viewing it easily. I have to move the guitar neck to see it right and that makes it inconvenient.", "id": 893}, {"review": "There are so many reviews of this little jewel, I won't bother going into details but it's everything I could have hoped for and more. The sound quality is amazing and it's very easy to use. I'm using it for so many things including a music player for my truck. I take it everywhere and it has never let me down. I had to get my own carrying case but for the quality versus price and accessories that ARE included, I have no complaints.", "id": 463}, {"review": "I'm so glad Ernie Ball decided to put out this tool. I've been using the manual kind for years and have been tempted in the past to get an attachment for my cordless drill. The reason I never did was that I was worried it would be too powerful for that purpose. This is made for string changing with just enough power and speed for the job and the right head to fit all kinds of tuners. I love it!", "id": 522}]