[{"review": "It does what it says. It a Kyser Quick Change capo. This capo is great for changing keys in the middle of a song or anytime you are in a hurry. Highly recommended.", "id": 26}, {"review": "I bought mine used three years ago and it works great. It works for a Metallica, Pantera type sound. You can also get good rock sounds with the gain turned down and eq. adjusted.", "id": 36}, {"review": "I use this mostly with my Honeytone mini amplifier and Reel Echo tape echo simulator. Works very well with no problems. A lot of Danoelectro pedals may eat up batteries and this is a great alternative when you have access to Ac voltage outlets.", "id": 40}, {"review": "This is 10 watt walkman size guitar amplifier. The controls are Volume/ off, Tone, and overdrive. It also has a headphone jack. In my honest opinion, it is a good headphone amplifier to use when to need to practice without disturbing people around you. The speaker sound is fine for a clean sound ( like jazz, or country) or semi distorted and more (rock). If your looking for an small amp. that will do metal this may not be for you. Defintely get the Danelectro DA-1 AC power adapter instead of batteries because you may go through them quick. Overall it's pretty good.", "id": 302}, {"review": "This 7 band eg. is a great way to change the sound of your guitar. It has more flexability than just a tone knob. It's easy way to get scooped metal or just fine tune the sound of you amp and guitar. Highly recomended!", "id": 433}, {"review": "I have only used one of these with a hybrid tube amp and a solid state but I hear that it will work with either tube or solid state amplifiers. It really gives my amplifier a warm overdriven sound. This pedal can be used to boost your guitar sound during solos or certain guitar parts. This pedal has three preamp settings: Ts9, Hot, +, and Turbo. It's great for solos and warm blues or rock rhythm guitar. One nice thing about this is it responds well to how soft or hard you pluck the strings. For example: if you set on the \"Turbo\" setting and pick with your fingers it will clean up nicely. If you pluck hard it will make a smooth distorted sound. If you want a metal sound, then I recommend the Metal Zone by Boss/Roland.BOSS MT-2 Metal Zone Overdrive Distortion Pedal", "id": 447}]