[{"review": "I didnt have my research done correctly and ordered these because i wanted &#34;vintage&#34; for my &#34;relic'd&#34; build. Clearly my mistake that these do not fit the cheap necks sold here on Amazon. But no worries, Amazon sells adapters to make the &#34;large&#34; holes in the neck fit the &#34;smaller&#34; vintage tuning key posts.1 star off for not looking like the higest quality. I'm happy though and this was a good purchase at the right price.", "id": 114}, {"review": "Mounted and this looks like a solid product. I was working on a new replacement neck and had no mounting holes. I just looked at pics on the net and got them close. I like them.", "id": 115}, {"review": "Its poorly made with attention to detail. I ordered them to fit on my dual mic clamp purchased here at Amazon. But they will not screw down all the way and are losse. It is useless!!! Other mic holders from different manufacturers work fine.", "id": 135}, {"review": "Not a lot of moving parts on this piece. LOL Its a simple piece to attach to your strat body.", "id": 218}, {"review": "But didnt work on the el cheapo drop in pickguard/pickup setup that I got here on Amazon. Other than that, they look cool in the package. LOLI suppose this gives me a reason to build a whole other guitar just to use these covers. ahahahahahahYeah, thats right....", "id": 222}, {"review": "I just installed these on my Chibson LP from overseas. I had to rout out the holes a bit and make them ever so slightly larger.. I took a slightly larger drill bit and turned it backwards, not forwards, by hand slowly, until it was perfect. I also put some blue masking tape on the headstock just in case I slipped. Took me about 1.5 hours.The ones that came with my guitar were really close to these in appearance. Really close, but they were terrible in operation. I have no problems spending the 50 on these to improve the guitar. Haven't played them yet, but all the reviews were good, so here goes.....Update:  Played for a couple hours. First thing I notice is that they are geared lower than the old Chibsons and the other tuners on my other guitars.. You tune it a full turn, and the tune moves up slightly. Which is plenty of nice fine tuning adjustment.This fixed the Chibson tuning issue. I'll order another set for my other Chibson.Also, I have two Epiphones. I believe these are nicer than the Epi's.So I bought based solely on the reviews here. I wasn't disappointed. In fact, I am pretty impressed. good replacement for \"iffy\" tuners. They worked for me...", "id": 270}, {"review": "I would say as long as you dont try to use this as a floorjack, it will work just fine for you. I dont wrench the arm around like all star wrestling and it appears to work fine for me. I love the way it sits right on top of the headstock and you can tune instantly. Nice and bright, easy to see.  Had it about 4 weeks now and on all of my guitars. Remember its a guitar tuner, not an impact wrench.", "id": 811}, {"review": "I didnt have any issue with this when I went to put it in my strat build. Not a lot to say about it really. Its metal and it works. Switchcraft is usually a good product.", "id": 884}, {"review": "Came with more screws than i needed. They were the right size. No issues. Thanks. You shouldnt be disappointed with this item.", "id": 215}, {"review": "What to say about this except that they mounted properly, came with the right screws and I didnt have any issues. LOL", "id": 220}, {"review": "I just cant get enough sustain out of the high E.for my taste. Tried them on Epi LP and a PRS. I'm no Eric Clapton, and I dont use 4 amp heads nor do I employ 3 guys to work on my guitars, but thats my impression. Just not enough umph...", "id": 396}, {"review": "Never really had to mess much with this item. Its a quality piece of metal with the nice F logo on it. Mounted my cheap Amazon start neck just fine.", "id": 475}, {"review": "Haven't used it with the singer in my band but hooked it up to my amp for a short test. It doesnt appear to be DOA and as some of the other reviewers say, it doesn't appear that I have to be within centimeters for it to pick up. I looked at all the wires inside and they look OK. Nothing out of the ordinary.I'd say if you were Carlos Santana, you might want a better mic, but for those of us in garage bands and local bars, for the price? come on. How do you beat it?", "id": 690}]