[{"review": "I first want to mention that this is a pack of 6 picks. The product description didn't mention that, but I was pleased to receive more than three!My son told me he needed some new picks, and since lately he's been playing Ozzy Osbourne songs I knew he needed a better pick than the standard Fender picks he's been playing with for three years. After hearing him play with these picks, I've noticed he can play faster and more accurately with these. The finger grips help tremendously and these have really helped to bring his playing to the next level. My only complaint is that they sent us a pack of purple picks. I wish we could choose the color, or maybe they could send a color assortment. We'll be buying these for a long time to come.", "id": 66}, {"review": "D'addario is a company I've been using since I first started playing guitar and these strings live up to their title. They DO have a warm, bright and balanced tone and they last 3-6 months for me even after playing hours a day. For people who finger style on the acoustic, it is very comfortable on your fingertips. These strings can produce very good sound with little effort, I almost always use light/light medium picks with these strings and it can get to the volume I want.", "id": 130}, {"review": "I bought my son a thousand dollar Epiphone limited edition electric guitar for his birthday just a few months ago, so when he told me he would like an acoustic guitar for Christmas, I told him an expensive one was not in our budget.We went to the local music store and tried out several models but he kept coming back to this one. The sound was absolutely fabulous, much better than his current acoustic guitar that cost more than twice as much as this one.The store manager told us that for the price this guitar cannot be beat and that he bought one for his son as well. In my opinion, this was as good as other brands costing three times as much. I'm not sure how Takamine is making these quality guitars for so little money, but if you're looking for a starter guitar, or just looking to add another guitar to your collection, this would make an excellent choice.I inspected the guitar we took home and found a few places where the finish was not quite as smooth as the rest of the guitar, but overall the quality and sound cannot be beat for this price.We also went with this cutaway version so my son can have easier access to the higher frets vs. theJasmine by Takamine S35 Acoustic Guitar, Natural.", "id": 183}, {"review": "This assembled in just a couple of minutes without the need to refer to the instructions. The bench is comfortably padded and very affordable.", "id": 306}, {"review": "If you are prone to losing your guitar picks, this is a good set of 10 picks to have around all in your choice of a single color per pack. The quality is a bit better than the cheap fishbowl picks at the music store, but not as good as my favorite picks,Dunlop Big Stubby Picks, 2.0mm.", "id": 577}, {"review": "I've been playing guitar for about 7 years now, and I've always used the Kaiser capo, but since I got this planet waves one, the kaiser just gathers dust in my guitar case. Although they're both just tools to hold down the strings on a certain fret, the planet waves is much easier because it uses spring action with little effort, while I can recall the kaiser taking a lot more work to actually get it onto the guitar. Less pressure is involved, and I kind of like the fact that the rest of the capo, that isn't actually barring down the frets, is under the guitar instead of over it. The product conceals itself well to those who aren't playing the instrument and it has great use. I'd recommend this to anyone who wants the best capo out there.", "id": 843}, {"review": "I generally use D'addario with my acoustic guitar only, but I decided to try it out on the electric and I am very satisfied. It has the same light feel as their acoustic product, but it can make all the sweet tones I want it to when hooked up to an amp. I'm not sure on how long it lasts because I only put them on the guitar a few days ago, but they seem just as perfect as they were when I put them on. I would recommend you try these strings on your guitar because they work for me.", "id": 868}, {"review": "This microphone only records in mono, and if you're unsure of what that means, it doesn't capture sound to it's full potential, and doesn't create a left/right feeling. All recordings sound like it is coming from just one direction, and though this is useful for some things such as podcasts, I wouldn't recommend it to a musician looking for great voice quality. It looks nice, and it would b e great for a Skype call, but it really wasn't what I was expecting when i opened the box up and tested it out. If you're looking for a mono microphone, this is however a very good mono microphone.", "id": 712}]