[{"review": "I bought this speaker to replace the stock one in my Fender x2 champ. It has much more weight to it and a way larger, heavier magnet. It has way more bass and is louder than the stock Fender.It sounds much better than the stock one because at the higher volume levels the stock speaker craps out and sounds flubby.  This one solves these issues and sounds great at all levels and settings. Great replacement and a definite upgrade. Makes the champ a SUPER CHAMP.", "id": 287}, {"review": "This is the wah I was looking for.  Very versatile and built in boost feature is great too. buy it...you wont regret it.", "id": 323}, {"review": "Great pedal.  Get it. You wont be disappointed for basic delay needs.  Great tone.  Dont waste your $$ on others with similar specs.", "id": 791}, {"review": "This amp sounds phenomenal for such a small package and a single 10 inch speaker!  It sounds great right out of the box.The overdrive channels amp models are some of the best I've heard from modelers, pedals etc. Not much use for any of my many pedals with this amp because better tones are already in the presets and I havent even looked at the fuse software yet.I am very happy with this amp and it sounds great at lower volumes.  If you mic up this will work for small gigs.  The build seems very good.I don't think you can find a better sounding brand new amp for this price.", "id": 819}, {"review": "What makes it better is that it is a kit with most of what you need to power up to 8 pedals.  It comes with various adapters and even has rubber caps to cap of the power outlets you arent using! Powers pedals that have negative tip -like boss, maxon, ibanez, etc, etc.  Even has one reverse adapter for an oddball positive tip pedal!  Also adatper to connect your battery only pedal by connecting to the battery clip!!!One of the best features is that the power plugs are at right angles so they don't stick straight out on pedals that have side jacks...takes up less room on your pedal board.  Also the 8 plugs stretch further out than most other daisy chain cables.The other great feature is the power capacity is greater than boss..it can put out up to 1700mA...which is how it can run up to 8 pedals.A great item at a great price. No brainer solution for anyone with a few pedals or more.", "id": 428}, {"review": "This is very simple to use and it records for 5 minutes....so that is awesome! The playback sound is very good quality.", "id": 869}]