[{"review": "**Update 9/7/12**Ok I've been using these for a few weeks now, and I have to say I keep going back to them. They make the notes sound like bells. It's holding up better than I expected (I am a relatively soft player) and I'm adjusting to the 'stickiness' mentioned below. I am liking these more and more as time goes by. Glad I tried these!**Original Review**Recently I got the itch to try different 'unique' picks... these, the dunlop primetones, felt picks, metal picks, etc. I get annoyed by the plastic clicking sound from regular thin picks.These are interesting. They perform quietly and give a more mellow tone. They do however stick to the strings and it becomes difficult to use them, will need some getting used to. I wish I had ordered the hard version rather than the medium, as these are a bit softer than I was hoping.Probably won't be a daily driver, but interesting none the less.", "id": 243}, {"review": "Idiot-proof, compact, extremely sturdy. All metal enclosure with good quality jacks, simple to understand LED readouts. Runs on 2 AA batteries.Features that set this apart from the slightly cheaperPyle-Pro PCT10are:-'Test tone' function which sends a known volume signal down the line. Very helpful in level adjustments down long chains of equipment.-'Intermittent' issue indication - This is what made me choose this model. If there's even the shortest dropout, the LEDs indicate it. Intermittent issues are the most annoying and can be difficult to troubleshoot.My only complaints:-The a small screw holding the battery cover on stripped immediately when initially inserting batteries. It was like carving a bar of soap with a knife. Quite frustrating. Used my Dremel to change it from phillips into a slotted screw, and managed to get it out.-There's an included belt clip that attaches with two screws on the back. This clip blocks access to the battery compartment, which is ridiculous. Luckily I have no need for the clip. I used one of the screws intended for the clip as a replacement to the stripped battery cover screw.-No rubber feet on the bottom + metal enclosure + battery cover screw = sliding around and marring whatever it sits on. I stuck some re-purposed rubber feet on the bottom.After the few 'problem solving' situations mentioned above, this thing is a 5 star product. Too bad they couldn't go the extra step to make it 5 star out of the box.", "id": 318}, {"review": "Bought this to tune my hammered dulcimer. The clip is a bit larger than I expected, but it just fits on to the bridges under the strings. If I had paid more attention to the picture on the site I would have known how large the clip is in relation to the 1/4\" plug.It does it's job, picking up vibrations from the instrument rather than noise from the room. Works well while other things are going on around you. It seems to track 'truer' with this clip than with the internal microphone, meaning it doesn't bob up and down as much. If that holds true for other instruments, I may start using this clip on everything.I saw one review mention that the clip they received was not labeled Korg. The one I got is labeled, both on the package and on the clip.", "id": 474}, {"review": "These strings aren't anything fancy, but they sound great. A good old standard that I've used since I was a kid. And this is the best price I've found.", "id": 500}, {"review": "I have recently been itching to buy a classical guitar, as that's what I learned on as a child. I can't afford it at the moment, so I decided to give these a shot.These do not turn your steel string into a classical guitar by any stretch of the imagination. I didn't expect them to - but a guy can dream, can't he?Anyway, what they did provide was very warm and clear sound to my normally overly-bright Takamine. It also helped with the rather high action. They play and sound softer. It's almost like having a new guitar.During the stringing/stretching process I broke the G string (go easy, they are silk after all) and so had to use a standard bronze replacement. I asked my non-music oriented girlfriend if she could pick out the 'oddball' string and she got it right on the first try.. that's how much of a difference these strings make. They sound less 'metallic' - that may sound obvious but my point is that it's a big difference, enough for her untrained ears to hear.I'm still saving up for a classical, but I really love these strings, and will be using them on my Tak going forward.", "id": 613}, {"review": "I've bought quite a few tuners over the years. These are small, responsive, easy to read, and the fact that they work on vibration means they can be used in a loud setting without interference. These are great!!At first I was turned off by the 'toyish' appearance, but decided to try it after reading the reviews. Let me say that in person they look nicer than in the pics, and they perform way better than I expected.", "id": 706}, {"review": "I've used more than a handful of USB/Firewire interfaces over the past decade. In the past, it's always been a crapshoot, regardless of brand or reputation. Instability, incompatability, and frustration abound with audio interfaces. That being said, this has been the best interface I've ever owned.The size is fantastic, the preamps sound great, it has phantom power, it looks cool, and most importantly, it's been rock solid ever since I installed it two and a half months ago.I frequently leave my PC on 24 hours a day with this plugged in, and as of yet I haven't had a single crash, dropout, 'pop' etc. It's performed flawlessly since day one.Regarding sound quality, my recordings have never sounded better. I've used this to record electric guitar straight into the unit, acoustic guitar via condenser mics, dynamic mics, hammered dulcimer, cello, synth via direct input, and it handles it all flawlessly. I'm seriously impressed with the quality.Finally, it's small enough to take with me when I want to record at a friends house on my laptop.I've used it with Reaper, Sonar X1, Guitar Rig 5, Cubase LE, all without a hitch, on two PC's - Both Win 7 64-bit. The drivers gave me no hassle installing, and as I said above, ROCK SOLID.Your mileage may vary, as I stated earlier audio interfaces can be quite the crap shoot. Same setup, same hardware, etc, and one person can have wildly differing results. That being said, I would definitely recommend this unit, as it is my favorite of all time, and I've used everything from crappy firewire mixers to high-end MOTU interfaces.Great for the price, and if 2-in/2-out works for you, it should perform better than interfaces costing twice as much. It performs better than my old MOTU 828 mkII that I got for five hundred.", "id": 801}, {"review": "I've had string winders for years, but never a multifunction one like this. I recently bought it for my niece, and taught her how to change her strings.The different size gaps make it 'grab' the tuning pegs much better than my old one. I was able to use it on an electric, steel string acoustic, and classical, and it grabbed them all rather well. The string cutter works well, and the peg puller does also. So handy!", "id": 94}, {"review": "Recently got the itch to try some different picks out just for fun.. these, rubber picks, metal picks, etc. I play guitar.I'm not crazy about these for that purpose, but they aren't made for guitar obviously, so I can't fault them. They seem to be made well made. They are larger than I expected, and rather thick.Obviously these are made for ukes, so my review is probably not helpful to many. If you're like me and were looking for some variety for the guitar I'd suggest the rubber picks instead. They give a similar mellow sound without mudding up the tone, and they are easier and more comfortable to use also. Heck, maybe uke players should try those too?", "id": 775}]