[{"review": "Arrived quick. These are good replacements or upgrades. Work much better then the other style of string trees.  I would recommend this.", "id": 115}, {"review": "Good upgrade for my Squier Deluxe Strat. Although, note that if your pickguard isn't a Fender made brand, the hole in the pickguard maybe a little small. Not to worry. All I did was took a drill bit the same size as the &#34;screw&#34; (where the knob goes on, and drilled the pickguard, thus it fitting. Over all nice purchase.", "id": 216}, {"review": "They fit fine. Works as described lol. Comes with the screws and the &#34;cotton&#34; washers so you dont scratch the body.", "id": 220}, {"review": "I purchased this for my love of playing guitar. I like blues style and classic rock. This 25 watt amp will get the job done. It is not to be expected as a high quality amp by any means. After a few months of playing the bass knob just blew. So I had no bass control. Arrived pretty fast and had no issues as far as tears or dings in the packaging. You just have to mess around with the knobs to get the tone you want. Took me like half an hour to get the right amp settings.This amp is rated 75 watts, so technically you could upgrade the speaker to say a 50 watt (into 8 ohm). I would definitely recommend upgrading the speaker to a celestion or Jensen. I'd recommend it, but don't buy it if your looking for a really decent tone. It's just a practice amp.", "id": 223}, {"review": "Great strings. Bends are easy. Stay in tune well. Shipping was fast and I'd definitely recommend these. John Mayer, and other of my favorite musicians use these strings, there great.", "id": 226}, {"review": "Nice quality fretboard oil. Has a nice scent to it, and remember a little goes a long way. I would definitely recommend this. Worked nice on my maple unfinished fretboard.", "id": 307}, {"review": "I ordered this so I could plug my guitar into my computer and record music. Works well. Quality German manufacturing as always. Nice. I would definitely recommend this. It worked with my windows 7 starter, Acer netbook.", "id": 418}, {"review": "Nice F logo upgrade on my squier deluxe strat. Installed easy and the screws and everything were correct. I would recommend this :)", "id": 475}, {"review": "Good upgrade, Fender vintage springs. Use 5 of them (in my case) and they work well. I would recommend this.", "id": 676}, {"review": "This tuner is great, and it being so low price makes it even more better, standard shipping took 2 days to reach me in Mass. I was pleased for that. The tuner comes with a 2032 (circle) battery, and its as simple as pushing the power button and strumming the guitar strings. I'd definitely recommend this product to a friend. I'd buy it again. Its a nice little tuner, and my guitar is sounding great. This is a very well made product.", "id": 706}, {"review": "Works well, arrived fast. No problems. Works as described. A good purchase for a low priced capo.Works for acoustic and electric", "id": 304}]