[{"review": "The M48 is well built, sturdy and well balanced enough that I have no concerns about tipping, even when it is loaded with several music books and a folder of sheet music. The tray is wide with an appropriately sized lip, and is moveable up and down with a moderate effort. Once in place it stays there with no slipping. For all of the solid construction it does not feel heavy and it is easy to move around, although it would be a little awkward to transport it in a small car.This is one of those purchases where there are a number of alternatives, and I always have some concern that it will not be what I want when I get it... in this case it is a winner. Delivered when promised in good condition and appropriately packed.", "id": 158}, {"review": "The other reviews for this foot rest called it sturdy and well built. They were right. It can be adjusted to a number of different heights to suit your particular needs - and based on the design of the stand it will stay where it's put. One of the best parts is that while it is stable enough to be the main foot rest where I play my guitar it can be collapsed flat and it easily fits into a bag or backpack - probably around half of the thickness of a chord book, although heavier, as it is steel with a rubber tread on top. It feels like I will own this for a long time - a well priced, good value.Edit2/2013After owning this for around a year and using it every day I find that it still looks and works like new. I recommend it highly.", "id": 321}, {"review": "A little large and not really light, but folds down and the tray folds in a clever way. Fits into the supplied bag with shoulder strap. Very well made, although the bag is a little lower quality. Sturdy enough to hold a big binder, 300 page spiral bound book and not feel at all unstable. Goes up and down and tilts back. No slippage.", "id": 357}, {"review": "This guitar strap was so inexpensive compared to the other ones I was concerned that it would be flimsy and look terrible. Since I planned on using it as a mandolin strap I figured it would be alright if it wasn't strong enough for a guitar.I was pleasantly surprised to find it well-made with a clean, simple appearance. I am getting another one for my acoustic guitar and may replace the leather strap on my electric guitar with one of these also.", "id": 658}, {"review": "I like the way the Snark attaches to all of my guitars and a mandolin. It reacts quickly and is not over-sensitive. The way the mounting and dial articulate make it easy to set up while not interfering with the tuning knobs. Easy to read and for the very low price a great value. However, and this may be my own fault, I often need to snap my finger against the dial to get it to start reading. I say my own fault because I put the battery in wrong the first time and had to pull it out with needlenose pliers. That may have damaged a contact. I play with a number of other people that have Snarks and they all work properly. I would buy another one without hesitation.", "id": 706}]