[{"review": "If you're like me, you probably bought this to hook up an XLR microphone to a digital recorder or a PC.It works fine for the handy type recorders.But forget hooking this directly to a PC.  Way too much noise.", "id": 7}, {"review": "These have a lower profile and can fit and bend into the places the ones with thick metal ends can't.", "id": 11}, {"review": "Had this for about 3 years now - it works great, and for 30 dollars, it was a heck of a bargain.The construction is ok - it's plastic with a metal + rubber bottom, but seems sturdy.  Battery is easy to get in and out, and comes with one (but is not shipped connected to the terminals).Signal wise, if on, it adds a tiny amount of hiss and static, which raises the noise floor by a hair.  The noise isn't noticeable unless you are paying attention when turning it on or off.  Besides, if you are boosting the high end, you are going to get hiss.Works great in front for a clean or unclean boost, but I tend to use it in the fx loop - where it does what it's supposed to do.  I think it's a must for getting the most out of an existing amp setup, especially if the amp's EQ isn't doing it for you, or the cab or speaker choice is less than optimal - this thing fixes it all!I would definitely choose this over more expensive EQs, but I tend to take good care of my stuff.", "id": 84}, {"review": "More knobs are not always better.  In the case of this pedal, the controls are really sensitive, there's a pretty big mid hump that's hard to dial out, and the low end control can make things really boomy, or add a little chunk to the sound.  You can do a lot with it, but I struggle to find what it does best, because it doesn't really do edge of distortion well (it doesn't clean up), and it's not a really high gain distortion pedal, but it can just add a bit of tightness, hair metal mids, or thump to a standard OD sound.  Basically, if you have your amp set for 70s rock, you can stomp on this and get Motley Crue or maybe Bark at the Moon era Ozzy.Like a tubescreamer, this thing lets a little bit of the clean signal through so you hear the distorted guitar mixed with clean signal.  The circuit design is nothing like a tube screamer, but it can work as a substitute ( I think if you wanted the tube screamer sound, theJoyo JF-01 \"Vintage Overdrive\" Pedalwould be better just for simplicity sake and being more of a clone).So it's not bad, but its just not on the level of boutique pedals and their clones.  If you get tired of it, give it to your bass player or try it with a bass for an interesting tone.", "id": 145}, {"review": "Just be aware that the ends are so big that some vertical input boxes, like my Danelectro Fish and Chips, can't be used with these cables because the input and output are too close together.", "id": 207}, {"review": "I bought this based on video reviews on the net.  My first impressions:To my ears, if the OCD / Ultimate OD simulates \"fat\" power tube distortion, this pedal simulates a lightly distorted tube pre-amp, with a bit of edge, sharpness, the kind of edge the tube amps have.  The focus knob seems like a tone knob, maybe more in the upper mids than the treble, but it does the job well.I wish it had a bit more gain.  Surprisingly, this pedal with the gain on 10 and the tone on 10, gives me a great metal tone all by itself!  If i boost the pedal with say a few db of clean boost, it gets me exactly where I'd want to be (a dry, tight metal tone, kinda 5150ish.  And while this isn't the purpose of the pedal, it is how I've ended up using it just because it sounds better than any amp sim and produces less heat than my tube amps.  It's tight, its raw, there is no fizz and no boomyness, just a healthy low end.  Crank the knobs on this thing to 10 and you have a very aggressive, tight tone that makes even my Marshall Class 5 tight and grindy enough for Scandinavian style metal.Over all though, this is great for lightly distorted / edge of distorted sounds.  It gave my clean tone a sharper, more \"amp like\" tone (that is, midscooped slightly with the tone knob in the middle.) I think this would be great for Hendrix covers on his cleaner stuff, it just has that chimey, vintage amp character (very early marshalls, older fenders) with the ability to go from clean to dirty with simple attack variation.  If your clean channel is overly \"flat\", this will liven it up to more \"sharp\", scooped tone, which to my ears sounds more vintage.Basically, from Hendrix to modern de-tuned metal (with a definite mids emphasis - not \"80s marshall mids\" but  modern mids emphasis).", "id": 833}, {"review": "Well, it's a solid chunk of metal.  The lights on it are either all on or all, off, so they are useless to me.You can power any lightweight 9v, 12, or 18v stompbox with this.  Just watch the milliamps because I don't think this can deliver much more than a few hundred per box.My only issue with it is that the included patch cords are all the same length.  Would have been nice to have a few really long ones.It is more expensive than a one spot, but I guess this is a neater solution and at the very least, I can actually use my all the stompboxes  I want now.", "id": 852}, {"review": "I've always been partial to .88 picks.  I used the standard dunlop nylon for years.  The max grip just is very difficult to drop, effortless to hold on to.  Because it's so effortless to hold, I can focus my attention on other things.", "id": 680}, {"review": "JCM800 in a 30 dollar box? Not quite.  You can't really get there without actual tubes being distorted.To me, its good for getting that kind of over the top, wild 80s midrangey Marshall sound.  To me though, it sounds too much like a pedal, and not enough like the real deal.  To me, the Hot Plexi sounds more \"real\", closer than this.  That being said, this pedal can be cleaner than the hot plexi.BUT, if you turn the tone down, and scoop your amps mids significantly (I'm talking about 2 of 10 on the knob, where 0 of 10 is too much and gives you \"Kill em all\" style hollowness that isn't good), it gives a nice dark, throaty, lower-mid rich tone that would be great for metal.  Yes, you're not supposed to scoop the mids on the amp, but this pedal is nothing but mids and scooping them tames the fizzyness.  So it's like Ghostbusters ....sometimes you just gotta cross the streams, and it works to filter out some of the harshness. I'm not even talking about Vintage Metallica scooped, its just scooped enough so it doesn't sound harsh in the high end and mids and sounds more like the Black Sabbath to Scandinavian metal tone I like to dial in (basically dark and dry, has a ton of mids but doesn't sound like Boston at all).I use it with a Marshall Class Five, pedal's tone at about 3 of 10.  Amps tone controls (Marshall Class 5 through a 4x12) at Bass 3, Mids 1 or 2, treble 6, set to headphone mode for a darker tone.", "id": 794}]