[{"review": "its a patch that goes over the spot where your beater beats on the bass drum, guess it provides some useful purpose like kicking thru a bass drum skin, came with a few which is nice, price was right, so why not...go for it!!!", "id": 73}, {"review": "What can I say that has not been said before about this excellent cymbal?.... great choice to add some trashy color to my cymbal set up (all Wuhans because they are cheap and blow away most of the big boy companies). One thing that surprised me was how BIG the sound was and how nice it cut right thru my other cymbals. You cannot beat this price or quality of this cymbal. Placed it on top of my 18' crash and it looks great!!!", "id": 144}, {"review": "I bought this pedal to replace one that was not working with my Yamaha Motif, simple and easy set up, just plugged it in and it worked fine, no complaints. It's great to have sustain again on my keyboard again. Well constructed pedal, a nice addition to my recording studio. This pedal works with the Yamaha Motif, that was my main concern when ordering. No other review stated that, so I figured I would mention for the next guy or gal who orders as that caused my some anxiety when ordering ( I hate returning things...LOL),", "id": 147}, {"review": "Wuhan makes great products for the money. I have the 18&#34; medium crash and so I decided to try the 16&#34;, both are great cymbals for the buck. If you close your eyes you would swear you were using a Zylgian from the 60's or 70's. Nice tight crash with some great overtones heard in more expensive cymbals,  With any cymbal it is the way that you play it that makes it sound great, so with a little drum finese you can get a great sound out of it, the 18&#34; is a bit warmer than the 16&#34;, the 16&#34; sounds well smaller and a little less sustain a bit colder than the 18&#34;, bought 4 Wuhans, the 16&#34;,18&#34; 21&#34;(ride) and a 12&#34; splash. Will review each one as they come in from Amazon. Why the 4 stars?....well its not a higher end or classic zylgian but damn close, if your on a budget like I am, go for Wuhans. I have been a producer and multi instrumentalist for years, this is a really good product and excellent 16&#34; crash. Wuhan really impresses me. There are some great video's of Wuhans on You Tube, you should really check those out before buying Wuhans, or any cymbal for that matter. I am very pleased with this 16&#34; crash!", "id": 292}, {"review": "I am giving this item 5 stars because it is awesome litle mixer, was not expecting much for the price but this little unit (it is very small) as I went from  Mackie 1202 to the Berhinger 1202 (anyone see a similarity here), this is basically the same as the Mackie mixer but slightly smaller, recieved it, hooked it up and it worked perfect, few minor adjustements and sounded as good as the Mackie, perhaps better, plus it took up less space on my desk. Only weird thing about this unit and it has been mentioned before is no ON & OFF switch, why?....problem solved by using a power strip and using the power strip to power the unit on and off, the only other way to power it on & off is by unplugging it from the back to turn it on, and plugging it back in to turn it on, using the power strip to avoid much wear and tear on the power source connector, this was really stupid of Behringer, never ever had any kind of mixer without a power on & off button. All in all for the price, I should not complain much, will pick up another for my daughters studio as it is that good.", "id": 370}, {"review": "cable works perfect no defects, cystal clear sound, constructed well, use them in the studio, no noticiable problems, do not know how road worthy they are because I am a studio rat and not performer.", "id": 465}, {"review": "This is a excellent Snare Wire, used it to replace an old noisy snare wire that rattled on my old Pearl Snare Drum, quick and easy to replace, came with straps to secure but did not use them as I prefer string. Improved the snare sound by 100%, no more rattle, snare now has a very fat tight crisp sound, well made product that did the trick. Product came with simple clear to read instructions with pictures, if you follow the instructions your strand will work perfect. Great Product at a excellent price.", "id": 526}, {"review": "wow...so pleased with this $12 microphone, packs less of a punch than the Shure SM 58 but works great, very happy so far, used it to microphone some percussion and it worked great, could not really tell the difference from the real thing. If it breaks...so what...it costs 12 bucks, great microphone for someone on a tight budget. Highly recommended.", "id": 690}, {"review": "you really have to have a lot of wind inside you to play these harmonicas, they are great but you really got to blow hard to get them rocking, adding distortion to them helps to brings out a better sound live or in the studio. These fit my budget and plus you get EVERY KEY you need for any song......WOW... Hohner has been around forever, well constructed instrument and very reliable company.", "id": 693}, {"review": "This is a great microphone for 10 bucks, (did I just say $10?....LOL) it does not have the same sound as a Shure SM 57, but it is kind of close. I used it as an overhead microphone on drums, recorded an acoustic guitar with it, and it worked perfect. Seen some reviews about &#34;hiss&#34; from this microphone, the &#34;hiss&#34; is from the cheap XLR into 3/4 connection (who uses that kind of connection anyway?, would have been great if it included a real XLR but cannot complain) after I swapped out the cheap cord and replaced it, hiss was gone, a no brainer really. I have been a producer/engineer for over 3o years, this is a great utility microphone, if you need an overhead, or a microphone to put in front of a guitar amp, slap it on percussion etc... it will work just fine, the sound, it is quite clean actually, for $10 it is a steal. If this one last a few months may pick up a couple more for my studio, as I can never have enough microphones. Every microphone has it uses. I would not recommended putting this up for a vocalist but as a utility microphone you cannot beat price and quality, well constructed pro like product.", "id": 777}, {"review": "These headphones are 100% amazing. I could not believe the sound quality. I have been an audio engineer for over 30 years and let me tell you these headphones will match those worth $200-$300...nice wide spectrum and frequency response, you will love them, well worth the price. (no I do not work for Tascam)... the first pair I bought the cord got stuck and was yanked and broke very easily....so I ordered another pair, because the sound is amazing, I just need to be more careful next time!!...but this headphone has a very delicate cord connection and construction...I have yanked my Senhieser's millions of times and the cord never broke, so be careful with the cord on this headphone...it is not the best, but the sound is superior.", "id": 870}, {"review": "these work better than anything else I ever used to muffle drums and get out all those annoying overtones while recording, think this product came from outer space because man could not make a product so great that is so cheap that works so well.", "id": 892}, {"review": "This is a great cymbal stand sturdy, tight, well made, using it with a 18&#34; crash and does not move or rattle, amazingly well constructed stand for the price, going to replace my other flimsy stands with a few of these, great product. I am not a giging drummer and do not take apart and dismantle the stand at all, but it is a great stand for my studio/practice kit. Being honest don't know how it would be for a gigging drummer, but for what I am using it for, more than does the job.", "id": 138}, {"review": "it's a guitar stand that holds your guitar so it don't fall down during a gig hurting potential fans and thier friends....well constructed....awesome price.", "id": 601}]