[{"review": "I bought these a while ago but just got around to using them last week. I don't ever remember the non wound strings being bronze but these are. To me it looks weird but they sound so much better than my ancient strings that were on there.", "id": 59}, {"review": "Don't know what it is but I love the sound of these strings, placebo? Maybe but IMO these are the best sounding strings I've played with.", "id": 88}, {"review": "I love these strings, been using them forever and via Amazon Subscribe and Save I get them for a really good price.", "id": 156}, {"review": "I've been playing guitar for 25 years and when I was first getting started for what ever reason I hated Super Slinkys with a passion. I was a Fender or D'Addario guy and EB SS were beneath me.Fast forward to a few weeks ago when I got a used Jackson with DEAD stings on it. I wasn't sure I was going to keep it but wanted to give it a chance with new strings. ALL of my guitars are setup with 10s but the Jackson needed 9's and I didn't want to bother setting up the Floyd Rose for 10's on a guitar I might not keep.I came onto Amazon to find some inexpensive Prime eligible strings and these came up, WTH I'll give them a shot.Wow these are some good sounding strings. I have no idea why I didn't like them before, maybe my hearing is much worse than before? Who knows. Anyway I ended up keeping the guitar, a Jackson DK2M.", "id": 227}, {"review": "What happened to all the Korg tuners that had LED lights on it? Don't get me wrong this tuner works great and makes tuning to E flat much easier than on a non Chromatic tuner but that's ALL I use it for. I prefer my older tuners that light up, This screen is really dim and there's not a back light. My guitar room isn't super bright and it's very difficult to read.Guess that's why the price is so cheap.", "id": 330}, {"review": "These replaced the stock tuners on my Squier Deluxe Stratocaster and were NOT a drop in fit. There are two pegs on the tuners that didn't line up with the holes from my stock tuners in the headstock and required me to drill additional holes. I was somewhat expecting this thou so no starts taken away.These make string changes so easy and I love the ratio of these tuners. Because they are staggered I was able to ditch the string trees as well.", "id": 387}, {"review": "Nice solid no frills guitar strap. I used this on my stupid heavy Agile guitar and it helped a lot.", "id": 659}, {"review": "This bag is super cheap and flimsy with almost no protection for your guitars at all but since it's reflected in the cost.", "id": 781}, {"review": "I used to use a lot thinner pick until reading an article from Paul Gilbert saying that in order to play fast you need a minimum of 1mm. These things are great and yes, I can shred faster now!", "id": 61}, {"review": "I replaced the metric pots in my Greco LP and needed new top hats. These look great and work perfectly.", "id": 80}]