[{"review": "I bought it 3 years ago here at amazon and I couldn't be happier.  This was my first electric and after over a year of owning it, I got a way more expensive Fender Strat and I still prefer how this Epiphone feels; it is really lightweight, a lot more that even other Les Pauls and the distance between frets is smaller than the one in other guitars I have tried, this makes it VERY easy to play, it stays in tune and it looks really REALLY lovely.I like it so much, that I decided to add a pair of Slash's Alnico IIs on it, that cost more than the guitar itself, this only made it sound incredibly awesome and improve the sustain, good ol' crunchy-bluessy rock.Call me cheap if you want and I wouldn't care, this is one of those items that makes you wonder, how come there's others way more overpriced and just don't find a way to justify that a \"real\" Gibson Les Paul will sound $800 - $1000 better.It wasn't until recently (after 3 years - I estimate somewhere around 1000 hours of heavy use) that it started fretting and that's why I gave it only 4 stars; but what would you expect from a $200 guitar...?  I'm sure this can be easily fixed by any guitar tech and it will continue been the sweet-tone machine it has always been.  If you're learning, looking for a first electric or just want a \"practice\" axe that will not dissapoint you, just go ahead and buy it, don't give it a 2nd thought and do it.", "id": 30}, {"review": "Sounds simply great!  As greasy as a Pignose has to groan and as simple as it has to be.  Great on bass notes and can also get clean with highs; it does sound different when opened and by moving the guitar volume, it changes its distortion (the louder, the more distorted).  The Pignose power supply (Pignose AC9 Power Supply for Pignose 7100) is helpful when been home, but also works with 6 AA batteries.  You can also amplify it's sound by connecting it to a higher-watt amp.  It comes with really nice looking stickers.  I'm planning to keep it for years.Update on review(Jan 9, 2013).I admit that it might be more expensive that other 5 watt amps, but as time goes by, I just fall more in love with my Piggy!  I've learned to use better it's own volume combined with the guitar's.I have other amps of higher power that can get a LOT louder that the Pignose, but I just LOVE the level of distortion it gives; I cannot get this crunch with the other amps, no matter how much pedals, bells, whistles I have tried... This crunch is unique and the world loves it, as simple and plain as that.  The good thing is that it has an output at the back to connect it to louder amps and like that you can have at louder volumes that unique crunch I so much fell in love with.The 7 chords give a clean amazing sweet-grumble (the one that make teenage girls sigh for you...) with high volume on the Piggy and low on the guitar.", "id": 76}, {"review": "Sounds a lot more than what you expect, this is my 2nd Honeytone (one at home, one at work).  You can use it with batteries or with a 9V adapter, it has a clip to hang it on your belt or wherever you want, it also has a headphones input.  It gets way to distorted at high volume, but come on... it's a $20 amp; it does what it has to and does it well.", "id": 303}, {"review": "Extreamly easy to use, you can tune any instrumet witn this.  The display is bright and clear, easy to see in the dark.  You can tune by sound with the microphone or by vibration; the clip is excellent to hold it to the instrument.  The price couldn't be better, I just can't believe how come people purchase a lot more expensive tuners when this excellent product exists.", "id": 707}, {"review": "The Danelectrode has a knob that allows you to set how much volts you want to feed your pedals with (3V to 9V), by giving less power to them, you can get some really spooky sounds; great fun, but can also help give you your characteristic sound.  I also like the fact that you connect it vertically on the outlet, this allows to connect any other stuff to the same outlet because it does not take all the space on it, like other adapters do.  The price is great, I'm planning to have several of this.", "id": 760}]