[{"review": "I have been using these for months now with 5-string bass. I think these are even more useful for bassists than guitar, as I often find myself playing with fingers, then suddenly a \"pick song\" starts and... where's a pick? I usually have to offset it, and with the tuner placement I can only fit one pick, but I still find them indispensable. And no tape or other sticky stuff!There is also a model made specially for bass. [Updated] I now have the bass model on all of my basses. It is definitely better for thicker strings.The guitar model is now on my Gibson Explorer. I do love it, but the \"spreading strings\" on the headstock makes it less secure than is perfect. So, still highly recommended if your headstock has a \"straight through\" design, not so much if you have a jackson or other radically angled headstock. (They should make a Metal Edition for that. :) )", "id": 29}, {"review": "[review updated after more time spent with the mic]Well, there's definitely some detail missing in the mids, but it has a generally pleasing \"very fat\" (aka muddy) tone. Makes a fair snare drum mic. Needs a bit of EQ for almost any practical application. I don't think I'd use it to track the vocals on anything, but it works. You'd be better off with a similarly-priced small-diaphragm condenser and a windscreen.", "id": 159}, {"review": "It's a bent piece of metal with conveniently spaced slots and some sort of black coating...powder coat? paint? who knows? it's black.It's heavy enough that it doesn't flex unnecessarily. It has some heft to it, so if you're trying to keep your rack super light be aware of that. The coating is strong. The pre-stamped slots go sideways so that if your gear does come loose, it slips sideways and not forwards, protecting the knobs.I recently had to drill additional holes in one for a homemade piece of gear with totally random mounting hole locations, and it took a while to get through.I like it enough that I bought another one.", "id": 269}, {"review": "Have used them for months with no failures. Decent quality ends and build. There's really nothing else to say about them, and I'm saying it now to reach the minimum length requirement. Buy some now?", "id": 438}, {"review": "This is working for me quite well and is part of my keyboard stage rig now.I'm mounting it to a heavy duty On Stage brand double X stand. The resulting arrangement is reasonably stable, although if you put a bit of pressure on the mic stand you can rotate the Attachment Bar. I could tighten the handle further to prevent this, but am worried that this will begin to deform the X stand, and it is not a problem on stage. I am not worried that it would damage the Attachment Bar, as it is quite heavy duty.In general, it's strong enough to hold a typical stage mic on a small boom arm.", "id": 495}, {"review": "Cheap, works great for playing and foot controllers. Will not handle bulk dumps, so I have to use a different interface for programming and backups.", "id": 565}, {"review": "I love the pads and the knobs. I used it with Live 8. The software side requires a bit of configuration to work with some software, but ultimately was stable and functional EXCEPT...With my laptop, the USB power supply must be noisy, because the LPD8 will lose its connection and power if you even gently touch one of the cables--however, it works fine if I use a (very cheap!) powered USB hub in between. I suspect that it does not contain adequate filtering for the power supply. So it may not work in some configurations.Lose a star, because I really love it but in my configuration I am not willing to add a gratuitous USB hub and another wall wart to my road rig. Nice try, akai.[Updated update! 12 jan 013]I have tried a different LPD8 to compare--it does not have the problem! On the systems where my old LPD8 would be flaky, the new LPD8 is rock solid. It appears that I have a broken one with an intermittent problem. If yours has this problem, send it back while it's still in warranty.So that's nice. Now it's really a great product that I can, um, sort of recommend to everyone. However, considering that AKAI \"professional\" has us doing their QC for them, I'd suggest saving the shipping box in case you need to return it for an exchange...at least for a few weeks.", "id": 628}, {"review": "If you're a bass player and use a pick, you need one of these. If you are a bass player and *sometimes* use a pick, you *really* need one of these! I bought one for every bass and a spare.Wedgies work better on bass than guitar, because the strings are thicker and usually parallel. I have a guitar wedgie on my gibson explorer, and it is a bit loose because of the angled headstock spreading the strings--but the bass ones stay put.Really, these things are great.", "id": 175}, {"review": "I ordered two of these, one to hold music, and one to hold a netbook computer. I am very happy with how it performs in both situations. High quality, solid support, and good design decisions all around. The angle adjustment is very solid and it should be able to hold a very heavy book of music or a medium sized computer.The arm is just long enough that if turn the platform sideways, you can lean the music stand back next to the mic stand that it is attached to. I will try to add pictures when I get a chance.This is really two products that work together: a short boom arm with a mic attachment, and a narrow music stand that mounts onto a standard microphone thread base. I am using one stand attached to a mic stand, and a second with the arm removed, mounted directly onto a &#34;Gibraltar Multi-Mount Microphone Clamp&#34;. Major bonus points for making a solid piece of gear that is also modular and flexible.Note: the music stand easily detaches from the adjustable-angle part for storage. This is great, but be aware that the lock nut does not do a good job of &#34;locking&#34;, so if you turn the stand upside down, the it will fall off. This could be a problem if you experience frequent random gravity fluctuations.Final verdict: I own two, and am considering buying one of the full-width (MUS-ARM 2) models also.", "id": 592}]