[{"review": "Have them on four guitars. Never a malfunction. Easy installation and use. Watch out for bridge interference when screwing in the back lok. Might require a slightly shorter screw on some basses.", "id": 44}, {"review": "Received a new 500w Hartke 2x10 bass combo at church, tube pre and ss power amp. The preamplifier has one 12AX7. It was an EH. It went very microphonic after about ten hours playing time. After talking to Larry Hartke, decided I got a bad tube. He would not send a warranty replacement. My suggestion - new stock tubes are probably not tested prior to installation. Replace all stock tubes with tested tubes from someone like Doug's tubes, tube depot, eurotubes, or some other reputable tube vendor. I don' t trust ebay tubes and won't spend the hard earned cash on NOS. Replaced with a JJ, but should have used a Tungsol reissue.", "id": 229}, {"review": "What can you say... at less than $30(incl shipping), it's a steal! I was looking for a VERY inexpensive version of the popular Sansamp, and this does it for me.  Decent SVT, flip top or \"fat tube\" tone, and a nice quiet DI.  I go DI to the house, and the output into my old Seymour Duncan amp/Aguilar GS410 cab. Great tone!! I'm using a 9VDC Class II wall wart (found it in my \"spare parts\" closet) vs 9V batteries.  With the wall wart, no DI hum = Great! Does eat batteries, so get yourself a power supply. Never use the foot switch; if used at all, I use my finger.  If broken or lost(who would steal it?), I'd buy another in a heart beat!", "id": 378}, {"review": "I bought this tube to test in a friends Fender HRD in the PI spot. He wanted more clean tone and was willing to have less overall gain. He liked the result when I switched out the GT 12AX7. I want to try a JAN 12AT7 next, but the JJ is doing a good job for now. Also interested in swapping out his GT (Sovtek) 5881's for JJ 6L6GC's.", "id": 459}, {"review": "My first amp with EL84's is a totally scratch built older single channel Trinity AC15, which is based on a Lightning. Initially installed JJ EL84's after reading so many good reviews about them. They sound great to me (personal opinion of course), and are priced right. Thought about New Sensor Mullard RI's or Sovtek EL84M/7189's. Glad I went with the JJ's, and not looking back. I'm running 365VDC on the plates and 340VDC on the screens. First set, one red plated slightly. Bought a second set from Doug's Tubes, Ruby EL84CZ's (select matched JJ's). Performing nicely with a stock MIM Strat. Also using a Sovtek 12AX7LPS in the PI spot and a post-PI master volume, just like Matchless.", "id": 687}]