[{"review": "This winder makes changing strings a breeze and I like that there's an integrated cutter to trim off the excess string.  I also love the part on the end that pulls out the pins from the bridge.  So, this item is three tools in one!", "id": 94}, {"review": "The strings on my new Yamaha FG700S were too hard and noisy so I ordered these and what a difference in the feel!  Playing went from painful to pure pleasure!  I did notice that the tone of the low E string was a bit dead, especially in drop D tuning so I put that one Yamaha string back on and got better sounding lows.  For that, I gave four stars instead of five.", "id": 409}, {"review": "This does the job but it's fairly thin and not all that well padded.  For twice the price, you can get a really nice Yamaha hard case that is way more than twice as good.  The strap that came with it is no great shakes either.", "id": 865}, {"review": "This product does what you want and is easy to take on and off.  Definitely a great value for the money!", "id": 116}, {"review": "For under $200, I'm amazed at how nice this guitar is!  First, it was perfectly playable right out of the box - all I had to do was tune it.  And it stays in tune nicely too.I did replace the strings shortly after getting it.  There was nothing wrong with the original strings - no rust and they sounded fine - I just wanted something softer so I put on Dedario Silk and Steel light strings, which are much easier on my fingers and have a nice mellow sound.  I am a novice transitioning from a nylon string guitar so I needed the most gentle strings I could get.  Now this guitar is a joy to play.  Problem is, I get nothing done because I can't put it down!!!And the spruce top is pure eye candy as are the mahogany back and sides. And I like the mother of pearl Yahama inlay on the headstock. Very classy! The quality of build and finish on this instrument is top notch.  It just exudes quality and feels solid and balanced in your hands.You can spend a lot more on a guitar, but why would you want to when you can get something like this???", "id": 360}]