[{"review": "It's simple, basic, but I don't think it does that good of a job. This is because it doesn't really humidify that much and doesn't extend very far into the guitar.", "id": 71}, {"review": "What you see is what you get. It's cheap, It's basic, and It works. The best thing about this synthetic product is the price, and color options!", "id": 74}, {"review": "This product is a must for anyone with a rosewood fretboard guitar. My fretboard hasn't been cleaned/oiled in 15 years so it was extremely dry. The cleaner removed visible grime, the polish cloth shined up the frets, but most importantly, the oil returned the fretboard to a deep beautiful color and feel. I am very pleased with the product.", "id": 96}, {"review": "I have used all kinds of strings. These are what I use on a regular basis. They work, they sound great, and their longevity is impressive. Most of all, they are cheap.", "id": 198}, {"review": "For a while I had the SN-5 tuner. But I bought this one and I'm glad a did. It's fast, accurate, reliable. The product picture can be a little deceiving. The color is a a metallic blue (almost navy). It's got some good features although I don't use them. I'll use nothing but snarks!", "id": 706}, {"review": "Whenever I played with traditional strings, my fingertips would turn green. This was because bare metal would react with the salt and sweat from my fingers and oxidize (similar to the Statue of Liberty). This corrosion causes the strings to become duller and worn out. The defining feature of this product is the coating which is meant to prevent moisture from causing this reaction. Therefore, your strings last much longer. Traditionally, the coating has reduced the sound quality of guitar strings. However, this product is wonderful! For the first 3 days the strings sound strange. But after they stretch out a little, they sound perfectly fine. My fingers have stopped turning green; proof that the product works! I have yet to buy another set of strings.2 months later:These strings have been great, but I do have to admit they do not last 3 to 5 times as long as advertised. They last about twice as long.", "id": 717}, {"review": "All I wanted was a simple tuner... that's what this is. If you just want something cheap and basic with only one button then this product is perfect. Pros: Works fast/accurate and can recognize full chromatic scale. Cons: Built with cheap plastic so it may break if continually dropped. Also, tends to get confused when there is interference from other instruments in a loud room. FYI: Snark makes more complex tuners(Which are actually cheaper on amazon) that also have 3 or 4 extra features.", "id": 724}, {"review": "Everything I would want in a gig bag! A quality bag for a quality instrument. What you see is what you get.", "id": 473}]