[{"review": "I have one of these, as well as several other microphones. The SM58 is a good all around mic - the reason it's an industry standard/go-to, but the Beta 58A is a better (in my opinion) vocal-specific mic...basically giving (again, in my opinion) a higher quality sound. The SM58 by comparison sounds muffled/muddy, where the Beta58A is clearer, stronger, and more articulate. If you're used to the SM58, then the Beta58A can sound thin and harsh, but, that is adjustable at the board - end result is that it's a tighter sounding mic with more clarity.Pattern-wise, it does better at rejecting unwanted sounds - I play drums and use this mic for that reason, is that it picks up less of my drums than a SM57 or a SM58.", "id": 23}, {"review": "These strings are good. Nice tone, last a decent amount of time, and they're cheap. Color coded ball-ends make it easy to string without having to pay much attention. I use these on all my electric guitars now, where before I used Dean Markley 11-52 (mostly Les Paul scale) - I moved to these when I got a strat-scale guitar. I don't remember why I picked these, other than they are cheap and readily available everywhere, where Dean Markley can be hit or miss.", "id": 156}, {"review": "Going to these from what I was using, I can fit 2 more pedals on my pedalboard, so mission accomplished!", "id": 207}, {"review": "Bought a couple of these to build pre-loaded pickguards for strats. They work just fine, nice solid feel, screws included, and white or black tips. There are two rows of connectors", "id": 214}, {"review": "Ordered 6, and out of 6, I have exactly zero flat washers. Doesn't match the picture. Caps are marked 223K, so, looking that up, they are 0.022uf. Pot, lockwasher, nut, and cap are what is included.", "id": 216}, {"review": "It's a cheap speaker stand. Heavier, in terms of weight, than I thought it would be. Cheaply made, the safety pin is kind of a joke. Overall though, it'll do the job. I would not use this at the highest height setting, but one or two notches lower, else it starts leaning.", "id": 329}, {"review": "3 long, 3 short. Drop in replacement for both my MIM and MIA strat. Added mass, easier to tune. Good, cheap, easy upgrade.", "id": 387}, {"review": "These aren't the dirt-cheap - these actually have some nicer connectors - mid-grade level. They aren't the cheap type with a rubber boot that pretends to be a strain-relief - these are screw on plastic bits with a more sturdy housing. Decent cables and aren't too expensive. Will buy again...", "id": 423}, {"review": "Subjective: Nice thing is that it's fairly transparent - there's no changes to the top/bottom end that the tone knob can't fix, and it's fairly good in the transitions area. All gain pedals can do gain - but how it transitions from dirt to clean is what sets them apart...this handles it well. Pluck a string and let it sit, and it slowly cleans up. Some pedals it slowly cleans up to a point then it just goes to bleh.That said, setting it with the volume all the way up, and the drive all the way down, and roll off a bit of the tone knob to 11:00, and using the switch on LF - into the front end of my Mesa Boogie Roadster on Ch3/Modern = pure GOLD. That's the sound I've been looking for out of this amp!So far I've only used it on a few of my amps, and, so far, I've not found it to be unusable or even as a one-trick pony. I'm impressed, and that says a lot for someone who just a few years ago, hated the idea of putting anything between his guitar and his amp...if the amp couldn't do it 'naturally' when it comes to dirty tone...then it's the wrong amp...I still think that way, but a good pedal up front can add a nice twist...and goose that front end a bit where shifting channels might not be what the Dr. ordered...", "id": 453}, {"review": "My main headphones before were HD-280's, which I thought were pretty good, until I got these. I have several pair of HD-280's, one for mixing audio, one for practicing with drums (since they have decent isolation), and one for 'her' to use.I have one of these, and the amount of detail is great. I have a set of M-Audio BX8a's, and these have a touch more clarity, which considering the price difference...wow. For mixing audio though, can't use headphones when it comes to getting the stereo imaging right, but, I think these will get used for mixing more and more, with the finalizing on the BX8a's.I didn't know headphones could sound this good.", "id": 458}, {"review": "These are as described - these work with fender switches (which, turns out they include those screws), and fender pickups. Used them while building a few pre-wired pick guards.", "id": 599}]