[{"review": "I own three units capable of tremolo: Boss TR-2, Line 6 MM4, and the Boss SL-20 Slicer (like a tremolo on steroids). Plus my amp is a Twin Reverb so it too has tremolo. If you are unfamiliar, tremolo modulates the volume as if turning it up and down rapidly.The Boss TR-2 is the simplest of the three stompboxes to operate, with three controls: \"Rate\" of modulation, \"Depth\" of modulation (how much does the volume vary), and a \"Wave\" shape (jagged, square, or somewhere on a continuum in between). Unlike the other Boss stompboxes I own (CE-5 & PH-3), the TR-2 does not seem to compress sound so that it seems like you're \"playing in a fishbowl\" (as another reviewer puts it).The \"Wave\" control is what gives the unit its sonic versatility, so it is a nice feature to have. Most tremolos have it, but not all. For the price, it can give you a decent set of classic tremolo sounds with nothing too crazy. It is the unit that Tom Morello uses on \"Guerilla Radio,\" and it does well with tremolo classics like the Smiths \"How Soon Is Now?\" I hear no volume drop problem like other reviews suggest, and this is something I am sensitive to because I generally turn modulations on/off over the course of a song rather than leave them on full time.Like all Boss stuff, the box is sturdy and I like their big, quiet footswitches over any of the little, clicky ones on other units. The color is a sort of a dull military dark green, not the most attractive thing but not bad either.The small Boss effects do not come with a power cable, so you will have to factor that into the cost. Boss instructions tell you that you need their particular adapter, but I don't know anyone who says this is a must. I run it off a pedalboard power supply and it seems to work fine. If it didn't I would not buy Boss product period.Bottom Line:(1) Gives a decent array of basic tremolo sounds, nothing crazy(2) Not a bad price (factor in a power cable)(3) Simple to operate(4) Nice casing and footswitch; drab color", "id": 39}, {"review": "The MXR Phase 90 is a classic stompbox popularized by Eddie Van Halen. At present, I own an MXR Phase 90, a Boss PH-3 Phase Shifter, and a Line 6 MM4 Modulations Modeler (with a few phaser patches), so I can compare these three units.The Phase 90 has a single \"Speed\" control that sets the rate of the phase, so it is simple to use. If there is a single knob, that is a good indicator that the manufacturer feels pretty good about the sound of the unit. In this case, I agree.The MXR Phase 90 is by far the cheapest of these three units. In my opinion, it also gives the best sound within its capabilities, and actually seems to boost the volume slightly. The Boss PH-3 gets a slight volume drop but it is workable, and the Line 6 MM4 has a volume drop that for me is hard to use on a guitar pedalboard because I usually don't leave modulations on for an entire song, but turn them on/off in different sections (unless its a chorus).Of the three, the Phase 90 has the least versatility. You can imitate the Phase 90 sound on both of the other units (the Line 6 MM4 does a slightly better job) and both the PH-3 and MM4 have more sonic possibilities. Also, the Boss PH-3 will give a lot more spacey extremes than the Phase 90 which stays in a \"normal\" range. But again, of the three the MXR Phase 90 sounds the best of the three at what it can do.Bottom Line:(1) A classic pedal at a great price(2) Great sound & slight volume boost(3) Simple to use(4) Limited sonic possibility, \"safe\" or \"normal\" guitar sounds (no crazy extremes)(5) Beautiful bright orange color, you can't miss it(6) Compact size does not eat up pedalboard space", "id": 177}, {"review": "First of all, I love the Crybaby 535Q and I recommend this wah pedal. I will tell you my wah pedal story.Several years ago, I bought a Crybaby GCB-95 and, even though I did not use wah very much at the time, I think it was in the shop twice to get repaired within a year. Fortunately, it never gave out on me during a gig, but it was only a matter of time. Finally, I gave up and just stopped using wah pedals completely.A couple years ago, I bought a Digitech XP-100 whammy wah, mainly for the whammy effects to learn how to do Morello's style. Since it has some digital wah patches was available, I started to use them too and was happy because it doesn't have a treadle that will break like on my GCB-95. The wahs were usable, but just did not sound as good.Finally I was supposed to play Alice in Chains, \"Man in the Box\" and the Digitech was just not going to cut it. So, it was time to get a real wah. I searched around on YouTube for demos and talked to people to see what they used. I chose the 535Q because people told me that they've never had a maintenance problem with them, and it is very versatile.You can get several kinds of wah sounds by tweaking the dials,and they have some great suggestions in the manual to get started. I set mine on the Cantrell setting and have left it there because I mainly use the wah when playing early alternative 90s hard rock styles. That setting works will in songs like RATM, \"Bulls on Parade\" as well, including to create the white noise for scratch DJ sounds.I still do not use wah pedals terribly often, but it is nice to have a reliable wah that can do whatever I need it to by simply adjusting a couple knobs. I think that as long as I need a wah pedal, this one will suit my needs in many styles, and I think it will remain on my pedalboard for years! It is definitely one to consider, and the price is not that bad.", "id": 323}, {"review": "I own several Electro-Harmonix pedals and overall I like the brand (even though the owner appears to me to be a sexist pig clown boy in many of his YouTube videos). Of those I own, two of them are the smaller versions of the GIGANTOR classic E-H pedals, one of them being the Little Big Muff.First of all, if you have no idea of the difference between fuzz, overdrive, and distortion you should look into it before you buy anything. These effects are used in different musical styles and produce different sounds, so your choice will depend on what exactly you plan to do. Do some research by looking on YouTube, looking at Dave Hunter's book on effects, and testing them out at a store.If you are looking for a basic fuzz box, the Little Big Muff will give you nice sound similar to (if not the same) as that of the Big Muff Pi, depending on the exact year/model you have. I think the tone is great, but as with most basic fuzz boxes, there are only so many different sounds that you can get out of them. It is simple to use though, and it makes a lot of noise.As a bonus, these don't take up a lot of pedalboard space compared to the Big Muff Pi, yet will give the same tone. It is great for punk, alt rock/grunge, and classic hard rock like Hendrix and Black Sabbath.I also have a germanium (red) Dunlop Fuzz Face Mini, another good small version of one of the classics, and the Fuzz Face mini that gives you the most low end emphasis of the three (the blue silicon and aqua Hendrix models boost treble more). To quickly compare it to the Little Big Muff regarding sound, the Fuzz Face does not have a tone control, but I think it gives a better control over the fuzz saturation. While the Little Big Muff will give you more control over the tone (EQ), like many EHX pedals it goes from zero to crazy rather quickly. In this case when you begin turning the Sustain, it is not long before you are in very fuzz saturated zone. As you increase the amount of saturation, you get more sustain but less control of the dynamics so all your pick attacks begin to sound the same. So, I'd say while both the red Dunlop Fuzz Face Mini & the Little Big Muff are good tools, each comes with its own disadvantages.Though some E-H units come with power supply, this one does not and you will need to get one unless you like changing batteries. Although few pedals come with power supplies, I think its lame not to include them and you will need to factor it into the cost of the unit.If you are into looking at pretty pedals on your board, then you might be able to find a prettier fuzz box than the stark and dreary industrial-looking Little Big Muff. I like pretty things, but the sound of this unit is too good to pass up and it is a great tool to have in your kit.Bottom line:(1) Gives the classic Big Muff fuzz sound(2) Does not eat up pedalboard space like the old GIGANTOR models(3) Noisy (not always in a good way) when on, but has true bypass when off(4) Has tone control (EQ), but the \"Sustain\" saturates very quickly so you get less fuzz control (limits dynamic control of your picking)(4) Simple to use, but limited sound palette(5) Decent price, but power supply sold separately(6) Bleak appearance (not shiny, colorful, or sparkly)", "id": 448}, {"review": "When I do my reviews, I consider how well does the stompbox do what it does versus the price. I give the MXR Custom Comp five stars because, while it sounds nowhere near as good nor is as easy to use as a Keely, you will pay substantially less. On the other hand, it sounds better than a Boss CS-3 and is more versatile than an MXR Dyna Comp. It is also cheaper than the MXR 76 Vintage Compressor (which has no LED or AC adaptor). So, I think that the MXR Custom Comp is worth considering when shopping for a compressor. You should watch demos on YouTube and many stores sell MXR so you can try one out. If you want an inexpensive compressor with LED, AC adaptor, and a versatile sound palette, then the MXR Custom Comp is pretty good.Anyone who argues that compression does not change your tone has not fully explored the potential of a compressor. If you would like some evidence, consider a song like The Fixx \"One Thing Leads to Another\" which was created in part by cranking a compressor up. The manual gives three settings you might try--\"Chicken Pickin',\" \"New Wave Reggae,\" and \"Chime Bloom\"--each of which sounds different. The MXR Custom Comp can also give you volume boost if you wish to use it for that function, and I think it does so wayyyyy better than the Boss CS-3 (which seems more apt at volume drop, you have to crank it all the way to get a boost).One problem with this compressor is that there are four control knobs, two on the exterior (Output & Sensitivity) and two in the interior (Attack & Trim). In order to set it as the manual suggests, you will have to open up the case with a screwdriver and turn the two dials inside the box. Because of that, I just set it on \"New Wave Reggae\" (for 80s sounds, funk, etc.) and manipulate the external controls as needed. If I was playing country, I would simply switch it to \"Chicken Pickin'\" and leave it. If you are playing multiple styles, I would seek a different compressor like a 4-knob Keely.A second problem with the MXR Custom Comp is noise. If you crank the Output up, it creates a buzz (in my rig) that can be taken care of with a noise gate. The Dyna Comp does the same thing, but I did not hear that as much on the Keely or Boss CS-3.I find that leaving the compressor on all the time sharpens my tone without taking it over, but at the same time I can easily vary the Sensitivity to get different tone/sustain. It can give an awful lot of bell-like sustain on clean sounds and works great with a chorus pedal.BOTTOM LINE:(1) Nice compressor for the price, especially if you want versatile sound palette, good volume boost(2) Hard to work with due to interior controls (dumb!)(3) Generates noisy signal when cranked(4) Gives sound like MXR 76 Vintage Comp with less cost, plus on/off LED & AC adaptor at cheaper price(5) Good compressor in its price range (Keely is far superior in sound but you pay for it!)(6) OK paint job, doesn't really catch my eye", "id": 671}]