[{"review": "I know this is a great product.  I've had a set before.  I have to knock off a star because a part was lost during shipping that renders the product useless.  The product comes in a clam shell package.  For me it shipped with some heavier stuff that impacted the package and let it open some.  There are two retaining clips that slipped out and since the main shipping box wasn't fully taped up one slipped completely out of the box and is probably on the floor of some warehouse or truck somewhere.  I found the rest of the small parts in the box and the larger parts still in the clam shell package but without the one retaining clip the system is useless.The product is too inexpensive to bother with a return.  If I find a retaining clip that will work (I do have one to compare with) then I can use it.That said, I'll say again, the Straplok System is a great product.  I know, I've owned another set for more than twenty years!", "id": 44}, {"review": "I read several reviews of pop filters on Amazon and was surprised by how dissatisfied many were.  Finally I just went with this one and I'm pretty happy with it.  It seems quite servicable.  It is a double filter and attaches to my stand well enough.  The arm is just a little weak butit does stay put if you just don't bump it.  I guess there is a balance between stiffness and ease of possitioning it.  I think possitioning it would be a little easier if the arm was just a little stiffer.I can blow on it directly (not quite as hard as blowing out a cake full of candles) and I feel nothing on the other side and hear no wind rumble in my mic.So then, I'm gonna keep it and use it 'till it rots or gets lost.", "id": 46}, {"review": "This is a tough unit, easy to set and locks tight.  The materials are robust.In a home studio there is never a lot of room and I didn't want a big boom hanging off the other side of my mic stand.  This fit the bill perfectly.  On the package there is an illustration of this being used at the end of a long boom to hang a mic in the perfect possition, and yeah, one could totally do that with this.This is a simple device and no corners were cut in its manufacture.", "id": 142}, {"review": "This was exactly what I needed for the price range I could afford in a crunch.  My old mic just wasn't cutting it going into my computers USB audio interface.There are nice changes in sound texture from different angles.  It is really sensitive to pop and breath so a pop filter is critical for vocals.  It is recording my guitar beautifully.I've even been able to record nice quick tracks for copyright recordings of both my voice and guitar.  I've set the stand low and angled the mic towards the guitars sound hole (slightly back) and sing into the top at about 45 degrees and back a little.  I found a quick comfortable balance and the result is warm and clean.I'm very happy with this unit (price considered but I'd have to pay a LOT more to improved on it).  I'll probably get another one.  I kind of wish I'd have bought that combo kit.", "id": 254}, {"review": "The question was, &#34;Did it meet your expectations?&#34; and it certainly did.  It is heavy duty but also light.  Well, placed on a light duty cheapo stand it might be a little heavy but and basic quality stand will handle it no problem.  It really seems well engineered and made of quality material.", "id": 592}]