[{"review": "Man this is perfect! Some people says that the cs3 is noisy but I thinks that depends on what type of electric conections you got at home or place you play, if you don't have a independent circuit for your pedalboard there's gonna be a lot of noise, most of all bcuz of the compression (obviously)... For me this is PERFECT, doesn't make any noise with my conections... Tottally recommend this!", "id": 34}, {"review": "For me thia is the best cables ever.. i mean they give the original and natural tone of ur instrument, doesnt lose signal strenth and a very important thing, they do help to avoid most noise.. :)", "id": 127}, {"review": "These are the original, perfect fit on my american deluxe strat, so durable I got them for a while and they are still brilliant and making my guitar looking beautiful :D good stuff!", "id": 215}, {"review": "For me this is the best guitar tuner. It does the job correctly and doesnt go crazy when you're tunnin so, geat ;)", "id": 504}, {"review": "I had a custom-made pedalboard, made with wood also, it was great in therms of protecting my pedals and with the space but maan it was heavy, only with 7 pedals and that was getting me problems with my back and shoulders... with this i have 13 pedals and i wont say that its not heavy bcuz it is, but is the same weight but i got 13 pedals!! Thats a huge difference.... the only thing that i maybe dont like is the bag, i know it wont last A LOT OF TIME, but in general is the best pedalboard ive had and i wont change it.. maybe for another bigger like the pt3 but still gonna get pedaltrain... the best", "id": 544}, {"review": "Trustable, quiet, good materials, durable, etc... Maybe these are not the best when its about helping with the space on the pedalB bcuz of their large plug'heads', but they do a perfect job with my guitar signal...and honestly, for me, that's what I need... Good stuff to have!", "id": 578}, {"review": "This power supply is unbelieveble versatile... when i first saw this i believed it was only for 6 pedals but it turns out it can power up A LOT pedals better than any power supply out there.... this power up my 12 pedals i got in my pedal board and i can even power more... im buying 3 more and it will work, only with this!! Thats why i say this is the best on the world!", "id": 713}, {"review": "When its about wah effects I'm too careful cuz not all brands make it well. When I found this one I can be shure that there is no more wah sound out there, crunchy, warm and with the clarity of this... I prefere vox in wah effects, and this its a great choice and its too cheap for the quality you get!! 100% happy with this... Recommended!! :)", "id": 451}]