[{"review": "Second one I bought. Lousy build quality and only lasted 3 months. Went through two of these before I learned my lesson. Don't waste your money on this junk. I love Planet Waves stuff normally, but these are junk.", "id": 168}, {"review": "I have two of these for my acoustics, and when I get another acoustic...I'll be buying another one of these. Nice quick release without having to tie anything. I have one that is over 5 years old and still works like a charm.", "id": 174}, {"review": "No complaints at all. I use this for vocals and recording acoustic through a Pod Studio UX2. Have had tons of compliments on the sound. People can't belive its a 50 dollar mic when I tell them. Such a fantastic price on this, can't beat it.", "id": 327}, {"review": "Just got this in this week. Looks nice and works as intended. For 22 bucks, can't really go wrong. I use this with a Behringer C1 and have had no trouble getting it to fit. It's a bit snug, but I would prefer a snug fit over a loose fit.", "id": 584}, {"review": "Great mic for the price. Is it a SM58? No, but sounds pretty damn good. It's light, don't know if it would handle major abuse, but wow...for 12 bucks. you really can't go wrong. Plus, they throw in a cheapo cable for a backup. It also looks pretty damn sharp. Don't see how they even afford to make these things for this price. If you want a really good SM58 clone, I would recommend a Behringer XM8500. If you are looking for a back up mic, or you are a cheapo, this will probably satisfy you. I would have knocked off a couple of stars if it was over 20 bucks, but for 12 bucks...I don't think you are gonna find a better microphone.", "id": 690}, {"review": "It's a great little tuner, great accuracy, but unfortunately, they are a bit on the delicate side. The first one started working about a week after i bought it. Just broke down. The second one i purchased had a break when it arrived. After piecing the two of them together, i have a nice stable tuner. But beware...these are manufactured on the cheap.", "id": 762}, {"review": "5 stars because it works as its described, and has a nice display. I like this better than my old Snark. It's got a better build quality than the Snark for sure.", "id": 799}, {"review": "Throw this right in my little storage bag I use for my gigging materials...microphones, cables, straps, tuner, etc. folds up easy, fits great. Seems stable enough.", "id": 880}, {"review": "Has a nice smell, works like a charm. This bottle will probably last me 10 years. Good cheap price...a recommended purchase.", "id": 307}]