[{"review": "The e-bow is a great tool for any musician looking to get a really neatethereal sound out of their guitar. Great tool!", "id": 401}, {"review": "Great ukulele! Very light which is nice. Intonation is spot on looks beautiful too.A perfect soprano ukulele for a beginner or an experienced player looking for a nicelooking affordable ukulele!", "id": 536}, {"review": "Great bag, well padded the shoulder strap is nice! perfect! and very good price!What you would come to expect from lanikai!", "id": 593}, {"review": "I love this uke! it came fast. such a solid built uke feels like a les paul nice and sturdy!sounds amazing, intonation is perfect and never slips out of tune. it has a nice mellowtone unplugged and when you plug it in it sounds amazing! the finish is amazing perfectone of my favorite instruments i ever, owned totally worth buying for the priceyou will not regret it!", "id": 772}, {"review": "You can't go wrong with aquila. Amazing song, very warm strong tone also carries a nice volume too.Long lasting, made with quality. Improves the sound greatly on less expensive ukes in other wordsit can make a 50 dollar uke sound like a 100 dollar uke!", "id": 829}, {"review": "I'm a seasoned player of almost 10 years. I have owed a 300 dollar martin soprano uke which I had to sell in a time of need for rent money. I've been sad ever since. I'm in a tight spot now and just wanted something to play. I just got this uke today. Now aesthetically this uke isn't as pleasing as say a martin sorpano...but..... it sounds amazing for the price. nice bright sounds perfectly intonated too! I have owed a lot of cheaper ukes in the past too and they all sucked bad with horrible intonation. This ukes sound is at least as good as a 50-100 dollar uke! seriously impressed. I see they make a mahogany version i think du200? which is basically this but with mahogany which has a little bit of a brighter more bassy full tone. I may get one in the future its only 40-50 bucks on here amazing! anyway this uke is 29 bucks you get a uke made of nice solid maple wood over all a nice full tone which gets good volume well intonated too!I see some people complaining about the strings....and how it goes out of tune fast.when i got my martin soprano which wasn't cheap it did the same thing. best thingis to stretch out your strings nylon strings take a while to stretch out and set beforethey hold a tune for a long time.Anyway this diamond head DU-150 soprano is probably the best affordableukulele i have ever played. Its perfect for even us seasoned players who happento be broke poor artists! excellent!!!!!!!!!!! would recommend this brand to anyone!", "id": 840}, {"review": "Great little tuner very accurate and portable!nice bright screen perfect and the price is right!Its nice it has a chromatic tuner on it too as wellas guitar and bass too! very handy! i useit to tune my baritone, concert and soprano ukes !", "id": 846}]