[{"review": "I got this after seeing many of my church friends using them.  I got this one so I could use it to tune my guitars a ukulele and a violin.  It does all of them well.  I'm going to buy a couple more as gifts.", "id": 707}, {"review": "I got the irig thinking i'd use it for performance, but he app leaves somthing to be desired.  I had a very hard time fining a tone I could live with, plus, once you add any of the virtual pedals, the feedback was rediculous.", "id": 710}, {"review": "I ordered eight of these after reading the reviews.  I have five guitars, including two Les Paul's and they hold them just fine.  I give them four stars.  The are fine for, I believe, all guitars at home, but I wouldn't use them for retail or something like a school.  They are made if ABS plastic and at the point where the arms swivel it's just a rivet the holds them together.  The wall anchors that they send with them are a joke.  like the other reviewer said, you really should find a stud to mount them to, but if you must use wall anchors, use the burly moly ones that bore into the dry wall.  All in all these are sturdy and stable (when anchored to a stud) and I'll use more if I have the need.", "id": 779}, {"review": "I had been using a regular music stand for my ipad but our stage is a little bouncy, so i wanted something that would grip the iPad.  this stand does the trick.  I don't have to worry anymore about my iPad falling off of the stand.  Some people have said that it's not as safe when you rotate it to the portrait position.  I have not found that to be true.  Since I've had the stand, I have never droped the iPad out of it.  A lot of the other clips clamp on to the stand with the mic.  Because of the way that I stand with my guitar, it's hard for me to see the thing when I use the clamp kind.  This one uses the Mic clip treads and because it's on it's own stand, I can put it anywhere, at any height and see the iPad.  The only drawback is, you can't have your iPad in a case.  Or you have to find a case that's ultra thin.  Otherwise it's great!", "id": 793}, {"review": "It's well built enough to stand up to regular use.  I use mine for recording and some performance.  It' works great.", "id": 279}]