[{"review": "Great inexpensive strap.  Really, what more can you say?  I wanted something to hold my guitar up, and it does just that.", "id": 74}, {"review": "These are great for connecting effects pedals.  I really don't know how else you would do it in a small space, without making your pedal box look like a plate of spaghetti.", "id": 181}, {"review": "This is a great invention.  I have five different guitar effects pedals and a loop station all attached to this.  It really saves on batteries and extension chords.  It is well worth the money.", "id": 191}, {"review": "I bought an extension for it, and so this plug has allowed me to stop using eight batteries. Hard not to like that.", "id": 192}, {"review": "I replaced the original Indiana guitar tuners with the Fender Locking Tuners, and what a difference!!!  I had to drill some holes in my headstock, but that was accomplished by tightening the new tuners on and leaving an indentation from the feet after removing them prior to drilling.  Then it was a simple matter to drill new holes and mount them.  The locking mechanism is great!  It acts like a vice in a woodshop project.  And all I need to do is put on new strings and lock them down, tune them, use the tremolo bar a few times to stretch the strings, retune a couple more times, and they just don't go out of tune anymore, regardless of how many times I bend the strings.  These are highly recommended for anybody who is tired of going out of tune.", "id": 387}, {"review": "There is such a thing as too much.  You'll find it in this pedal.  I have both this and the Boss distortion pedals, and prefer the Boss.", "id": 450}, {"review": "They said you could hook up a volume pedal to raise and lower the note you're playing up to three octaves, but I could never get that feature to work properly.From video reviews I've heard on YouTube, this Harmonizer does not even come close to the Boss version, but it costs about $100 less.  Since I am not a professional musician and I am just playing around with it, it works just fine.  And ... you get what you pay for.Addendum:  I've now owned this for a while, and discovered that it can turn my six-string Strat into a bass, by turning the balance knob all the way to the right, and my pitch on the second from bottom position.  In fact, when I record my Dean Edge bass onto the Boss Loop Station and then record my Strat on top of it using the Behringer  Ultra Shifter/Harmonist, I cannot tell any difference in tonality.I am thinking of selling my bass.  It has just become a needless expense.  Needs the neck adjusted twice a year, the strings are expensive, and it is harder to play then my Strat.", "id": 505}, {"review": "This bridge is heavily constructed, so the amplified sound is much more vibrant and alive.  It must weigh twice as much as the bridge from my old Indiana Custom S-Type Guitar.  I'm glad I replaced it.  Now I have a lot more guitar for my money.  I probably spent $200 total on my Fender bridge assembly, locking tuners, and Tex-Mex pickups, as well as the original $59 for my used guitar, and I would say I now have the functional equivalent of a $500 Fender Stratocaster, based on sound quality and ease of fingering.  This was time and money well spent.", "id": 677}, {"review": "I find that if I play this pedal along with my Boss Super Chorus pedal, my guitar with Tex-Mex pickups captures a lot Gilmour's sound tonality.", "id": 35}, {"review": "I got this for my Boss Loop Station, but it doesn't work very well.  I keep hoping I'll find something it DOES work well with...", "id": 52}, {"review": "I replaced the tremolo bridge assembly in my Indiana guitar, and what a difference!!!  The original equipment spring  tension was so stiff that the tremolo didn't even work.  Now it sounds great!", "id": 676}]