[{"review": "The industry standard for live performance, the SM58 has withstood the test of time and for good reason. These are the only microphones that I perform with, and the on/off switch makes it easier so I don't have to power down all of my gear when I am done practicing...I just turn the mic off.", "id": 20}, {"review": "At first I thought this would be a gimmick, but it was cheap so I figured what the hell. Once I had it, however, I realized how invaluable it was. When performing live, I always had to make sure to stand the exact same distance away from the mic of the volume would change based on my distance from the mic. Once I got this little guy though, I just sing right into it and even press my mouth up against it at times. Volume remains constant, white noise is gone and the sound is crystal clear. It also protected my mic in a fall once too. Can find anything better for this cheap.", "id": 178}, {"review": "I bought this capo thinking it would look slicker without the clamp handles sticking out but what I found is that although it looks cool, it's complicated (which for a capo is saying something). The release lever makes it difficult to get a good amount of pressure on the strings and nearly impossible to put it at the top of the guitar when not in use.Bottom line: If you don't mind the extra effort and don't plan on keeping it on your guitar when not using, then maybe you will enjoy it. For everyone else, look elsewhere.", "id": 266}, {"review": "As a guitarist, I lose and find picks everywhere. I hate buying them because I know they are somewhere in my house but I just can't find them. With this, I take all my old credit cards, student ID cards, playing cards, etc. and make my own. I now have an unlimited pick supply and they are all unique to me. It rocks, pun intended.Bottom Line: Every guitarist should have one. No excuses.", "id": 784}, {"review": "I bought this to replace an actual full-out PA and was VERY pleasantly surprised.Pros: GREAT price, VERY loud (as well as clear). Also compact and very durable.Cons: None.Bottom Line: As a monitor look no further. I use it as a PA for practicing and it is a God-send. Buy now!", "id": 410}, {"review": "Not only are they inexpensive, but they hold up very well. I have a ton because I keep one on the end of each guitar. Furthermore, they are very accurate as well. SO worth it just to not have the hassle of finding a tuner every time I want to change tunings.Bottom line: Inexpensive, well-made, accurate, time-saving. Buy it now.", "id": 811}]