[{"review": "sad right?i do play instruments (guitar & piano) some drums but it's not why i bought these drum sticks.My old roommmate stole my drum sticks so this was the next cheapest thingthey play well on the pads.i'm sure they'd have nice action off a snare drum and high hat in real life...", "id": 151}, {"review": "What can i say?  this is a xlr cable.i just have to stress if you want gear that will last for a while and not have a crappy connection somewhere buy decent cables.This one has quality ends on it and that makes me happy that this investment will last years down the road.So buy a decent quality cable like this one and not the cheapest!", "id": 169}, {"review": "Just got mine - fast shipping from amazon thank you :)It has a great weight to it very similar to a real piano.  I was a little lost when i plugged it into my Yamaha S90ES - similar to the newer versionYamaha S90XS 88-key Balanced Weighted Hammer Action synth(I SHOULD OF READ THE DIRECTIONS ON THE BOX)  - the polarity needed to be changed on the pedal found on the back!woops - i was in constant sustain there for a minute - scared me that my pedal was broken.anyways it instantly makes my awesome electronic keyboard sound so much like a real deal pricey piano!awesome!", "id": 251}, {"review": "I like this cleaner - it's gentle on my guitar finish and it doesn't smell bad either.", "id": 351}, {"review": "works with myOn Stage KS7191 Classic Double-X Keyboard Standi got it to attach my mic to it - using this stand by On Stage as wellOn Stage MSA7040TB Adjustable Microphone Boom, Blackworks as advertised.  You just twist the knob to apply pressure so it fits in the tube.also comes with the stopper so you can quickly remove this attachment bar and reattach it.", "id": 495}, {"review": "I have a Martin D35 acoustic and strapping it with the string knot around the neck is honestly a bit annoying to do - so i figure what's a $10 investment going to do for me?make things easier and CLEANER LOOKING - that's what!i like it because it really just makes puting the strap on the guitar that much easier and removing it again an easy task.I bought the martin strap to match the color.Martin 18AMS2 Martin Leather Guitar Strap - Brownjust being a martin brand nut i suppose!", "id": 568}, {"review": "I cannot express how over sized this pedal is - it's ridiculously big and it's unnecessary.if you are lacking space on your pedal board u may want to look elsewhere or retrofit the insides into a smaller housing as i will do.Again - please be aware of the dimensions - this thing is soooooooooooooo hugeit sounds good though - though it does rob tone", "id": 308}]