[{"review": "These patches will greatly extend the life of you bass drum heads. Even if you use felt beaters on your kick pedal these pads greatly increase the strength and toughness of your bass drum head in the exact place it is needed most. As far as I can tel these do not change the sound of your head much if at all. They stay exactly where you put them so be sure to get it right the first time.If you have a double bass kick pedal I highly recommend either this patch or one from another name brand company.", "id": 73}, {"review": "In the past I've always just guessed at how tight to make each lug on my drums. This takes the guess work out of tuning your hides. Each setting doesn't correspond to any particular octave but once you get the sound you want at least you know all of the lugs on that hide are pretty close to the same torque. It's also easy to use.B", "id": 112}, {"review": "I bought this for my daughters acoustic guitar so she could play through an amp. It fits very well and sounds great!", "id": 129}, {"review": "I had a Cannon brand clutch and I bought this one to replace it. What I like about this one is how the release lever works. On the Cannon the lever was vertical. This made actuating it a less natural motion. With this one you hit it with a down stroke of your stick and it releases. That motion is much more natural and this makes it easier to use. An argument could be made that this one coule be easier to actuate accidentally but I have had no issue with it.Aside from the actuation of the release it is also well made and works very well.", "id": 150}, {"review": "I like this mic very much. It sounds very nice for vocals and seems to be very well made. I do not use it in a professional capacity though but it certainly seems well enough made to stand up to plenty of use.", "id": 213}, {"review": "Does the job of removing dust from you records without harming it. The handle folds down when not in use to protect the bristles. Over all a nice product.", "id": 260}, {"review": "I bought this to connect a Technics TT with an Audio Technica cartridge to my newer Onkyo receiver with no phono input. The unit did work but I had to turn the volume to 80 (out of 100) to get any reasonable volume. In addition I have an Onkyo M3040 connected to the receiver that I use for as a zone 2 amplifier. With this preamp I am getting some serious spikes into the amp. They are not audible but the lights would dim and the volume from the zone 2 speakers would drop. I do not have this problem with any other source so it appears to be some signal from this preamp.This unit may work perfectly fine with a Behringer mixer but for my use it doesn't meet my needs at all. I am returning it.", "id": 363}, {"review": "Recently I was looking for some heads to put on a set of Starion shells that I modified. My original plan was to use a set of Attack heads on both the resonant and the batter side of these shells. That decision was based mostly on price. Not completely though as I have used the Attack heads for resonant heads with very good results. The Attack heads that I bought though are single ply. To me that make them great candidates for resonant heads but I think a two ply head is better for a batter head. I gave the Attacks a shot on both sides but I wasn't completely happy with the sound and felt a two ply head would just be the better way to go.In the past I have used Remo heads for batter heads almost exclusively. I still very much like the Remo Pinstripe heads but decided to give these Evans heads a try just to try something different. I am very happy I did! These Starion shells now have a very nice sound with lots of resonance. The most noticeable difference between these G2's and the Attacks is that the tuning range seems to be much wider. The Attacks had a very narrow tonal range where they resonated. The G2's seem to resonate everywhere! From very loose to moderately tight they have very nice sound and resonance. I have some Moon Gel damping pads installed to cut down on some of the resonance but doing it this way instead of choking the drum offers a much better sound. By adding, removing, or moving the Moon Gel pads around I can control exactly how much resonance the drums have without having to change the heads tune.I should mention that I am still using the single ply Attacks for the resonant side. With the G2's on top and the Attacks on the bottom these shells sound great! Also, on the bass drum I have Attack no ring heads on both sides. I also have a pillow in there for damping and this bass drum sounds just amazing! So, the Attacks have their place but on the batter side I am very impressed with the sound, tuning range, and ease of tuning of these G2's. If you've never tried them, give them a shot, if you have you likely already know what I'm talking about!", "id": 395}, {"review": "So far this cable has worked very well. It has had no issues at all. For the money you cannot even make your own.", "id": 444}, {"review": "Great sound and sensitivity. Very well made. These should last a lifetime barring any physical damage. Made in the USA to boot! These may not be the cheapest but they are worth every penny!", "id": 526}, {"review": "I like the sound and sensitivity these heads produce for the snare side of my snare drum. A work of caution though, like all snare resonant heads, these are very thin! They must be to produce the sensitivity in the snare wires required. But you must be careful. I tore a small hole in one of mine with the snare wires because the end of the snare wires were too close to the bearing edge. Not Remo's fault but it is something to pay attention to.", "id": 141}, {"review": "I don't know a lot about guitars and strings. I bought these for my daughters guitar and they sound very nice on there.", "id": 156}, {"review": "In life you mostly get what you pay for. This stand really isn't an exception. Getting what you pay for though doesn't mean that it won't do what you need it to do. This stand is light weight and inexpensive because of it. The great thing is, it doesn't need to be any heavier or needlessly fancy to do exactly what it needs to do. It's a great choice for someone looking to keep their guitars from becoming damaged while they sit out waiting to be played. Even though they will not get damaged while laying around they are still easily accessible for you to play as opposed to having them stored in a case.For $10 a pop you can afford to have one for every guitar. Putting them on display and allowing them to be handy when the urge strikes you to play. You now have no excuse for your expensive (or cheap) guitar to get beat up from laying around.", "id": 258}, {"review": "These are nicely made and the one I bought is working well. I'm very happy with it and will buy more as I need more.", "id": 465}, {"review": "I bought this for my daughter for Christmas. She thought it would be neat to make picks from different materials. She has used it many times using things such as old ID cards, plastic laminates, and expired credit cards. In all cases it cut a perfect guitar pick.", "id": 784}]