[{"review": "The strap arrived ontime and the package was in great condition.  The strap was easy to attach to my banjo and is very comfortable.  I would recommend this strap to anyone looking for a cost effective banjo strap.", "id": 101}, {"review": "I purchased this for my 10 year old daughter.  She is learning to play guitar and the classical guitar I gave her was just too wide for her little fingers to reach.  The action on this guitar is perfect and required no set up..was ready to go out of the box.  I almost kept it for myself as a knock around guitar it is that nice.  I have been playing for about 30 years and was really impressed with the quality of this guitar and the sweet, full, rich sound.  If you are looking at this guitar, buy it!  You will not be disappointed!", "id": 148}, {"review": "I bought this for my 11 year old daughter to help her keep up with her picks.  She loves it and is doing much better with not losing pics.  I stuck this on her amp so she would not mis-place it.", "id": 233}, {"review": "These strings sound great and so far have held tune well after a couple of days of stretching.  I have them on my Luna 12 string and the sound is rich.  I would purchase them again.", "id": 274}, {"review": "I bought this strap for my Luna 12 string.  The strap is very comfortable and durable which is exactly what I needed.", "id": 483}, {"review": "This tuner is easy to use.  I have a guitar with a built in tuner that just doesn't seem to be perfect on pitch.  This tuner is and I am very happy with this purchase.", "id": 706}, {"review": "This capo does exactly what it should.  It clamps the strings tight to there is no buzz and it does not change the tune of the guitar when used.  I have 4 Kyser capos, one for each of my guitars and will never buy another brand.", "id": 42}, {"review": "I purchased this for my daughter who is 10.  She is learning to play guitar and needed a bag to protect the new guitar I bought her.  This bag has plenty of storage, offers good protection and the guitar fit perfectly.  I am going to purchase another one for my guitar.", "id": 309}]