[{"review": "I bought these picks because I liked the color of the picks.These picks surprised me with how good quality they actually are. I play guitar everyday for around 3-5 hours a day and I have yet to break one of these picks. Very nice quality and very cool color to them. They are also priced very good.Much cheaper buying them here at amazon instead of a quarter a piece at the guitar store. Recommend these picks to anyone that plays guitar. Additionally, they are very fast at shipping them to your door. Three days after ordering them they were sitting on my door step.", "id": 120}, {"review": "I bought this guitar about 2 years ago and I have played tons of different acoustic guitars from Taylor to Fender and more. This is by far the nicest acoustic guitar I have played. The action is very low and the guitar stays in tune very well. I love the chrome tuners and this guitar stays in tune for far longer then any of my other guitars. Additionally, this is my favorite guitar and I would recommend this guitar to anyone wanting to play acoustic. This guitar could very easily pass as one of the 1000 dollar guitars. The guitar has no finish which I prefer because when you are done playing your guitar is not covered with oil smears from your hands. I love Takamine for producing such a beautiful guitar at such a great value. This guitar will last forever because it was made so nice. Recommend to anyone whether pro player or armature I promise you won't be disappointed and I have been playing for 6 years so I know what guitar players are looking for in a good guitar. Thanks Takamine!!!!!", "id": 148}, {"review": "This guitar sounds awesome and stays in tune very well. I am now a fan of Takamine. Their is nothing bad I can say about this guitar and I would take this guitar anywhere. This is my 4th guitar I have bought and is by far my favorite guitar. I have 2 electric guitars and now 2 acoustic, this being the second acoustic. I wanted a cheap guitar I could take anywhere and not have to worry about it being scratched up, except I got the guitar and looks too nice to let get beat up. People are complaining about the guitar not having a glossy finish. It wasn't supposed to be glossy to give it a richer look. If this guitar was glossy it wouldn't be as nice sounds stupid but it is true. You have to see the guitar face to face to understand what I mean. This guitar I would recommend to anyone. I am trying to get my friends to buy one so can all have a acoustic guitar, lol. Thank You!!!!!!", "id": 183}, {"review": "Great little pedal for a very reasonable cost. This pedal is durable too cause I have owned it for about two years and it has held up great so just because it is a little cheaper does not mean it is not a good pedal. Sounds great too.", "id": 355}, {"review": "I bought this harmonica to go with my guitar and add a little extra music. This was a very nice harmonica and comes with a nice case as well.", "id": 826}]