[{"review": "This is a well made, low noise and low cost cable. Unless you make a lot of money with your recordings, this will do just fine!", "id": 21}, {"review": "Got a packet to try but I found they are better than the Gator screws that came with my case! My equipment is very secure. Highly recommended.", "id": 22}, {"review": "These are the best strap locks in my opinion, good quality, easy to install and remove, secure, and they look good.  All my guitars have these locks on them and I'm very satisfied.", "id": 44}, {"review": "These are high quality cables, both construction wise and in audio quality.  I use these shorter cables if I have to run bits of my rack to external amps/units, ie: unplugging and plugging in a lot, and I find these cables stand up to more abuse than the average cable.  I'm satisfied.", "id": 47}, {"review": "Pretty basic capo, goes on and comes off easily. Fits quickly and tightly, I expected a firmer grip but it works well anyway. Good price!", "id": 116}, {"review": "Not much to it, does what it should, holds a standard mic. Pivots in 1 direction only. Not the best build quality in the world (actually fairly thin plastic) but for $5 what else can you ask for? Should last a few months at least.", "id": 135}, {"review": "Firm picking surface but flexible body so feels a bit more natural than a rigid pick. They are slightly larger than a normal dunlop pick but much the contoured body makes it much easier easy to hold, I can play all night without dropping it.", "id": 170}, {"review": "This pick is great, highly recommended!  I love the sharp attack of the metal tip but the flexible body means the attack is not overly aggressive and metallickey sounding. I also I prefer the feel of a flexible pick. Grip is very good. This is my new favorite rock pick!", "id": 171}, {"review": "Good cheap mic cover, fits ES-57 ok, could be a bit tighter I suppose. Anyway it only needs to keep goobies from getting in my mic!", "id": 178}, {"review": "I use this all the time for testing audio cables and it works great! It's got an all metal housing and seems sturdy too. Battery lasts for months. Well done Behringer!", "id": 318}, {"review": "Good cheap basic metal slide, sounds like it should. Only problem is I prefer to wear it on my ring finger but I have big hands (viz XL and XXL gloves) and the slide is too small to fit except on my little finger. A bit annoying but not the slide's fault I guess!", "id": 340}, {"review": "I agree with all the other reviews. These are high quality sounding, very comfortable (I have a big head too!), durable headphones with a nice long cable and spring reinforced headphone jack. Unless you make money with your headphones (or have money to burn) you probably don't need anything better than the M50's. The only thing I would change would be to get rid of the collapsible cans - they make the headphones take up less room when folded (good for travelling) but I'm old fashioned and prefer rigid phones, they are a bit quicker to get on and off when you don't have to unfold them and flip the cans in the right orientation. No big deal though! Comes with nice screw on 1/8\" to 1/4\" adaptor.", "id": 458}, {"review": "This thing is really comfortable, holds the weight of my les paul nicely. Its slightly wider than most other straps which helps distribute weight better, I can play for 2+ hours and my shoulders feel fine! I feed the narrow end through 3 of the strap holes and it sits flat and looks good. Well made, feels very strong.  Texture is very nice, doesnt slip.  Overall a very good product.", "id": 481}, {"review": "Large pedal board plenty of room for all pedals including octaswitch. The included velcro works well for me, I haven't had any pedals fall off yet! Cioks PSU fits underneath with a couple of modifications. I'm careful with my stuff so the soft case suits me fine, I can sling it over my shoulder and carry guitar/amp all at once. Plus it has a large useful pocket on the front of the bag. If you travel a lot the hard case will probably be better though.", "id": 489}, {"review": "This thing is simple to set up and has a nice warm tone that I like for clean delays.  I also got the TC electronics nova repeater which has more options, tap tempo and stereo out, I use that one for distorted delays and dotted 8ths. They are both great pedals that I use all the time.", "id": 507}, {"review": "I use the 21' cable. Great build quality, looks professional, sturdy plugs, and most importantly it sounds great! I like the smooth fabric sleeve, it doesn't stick to things like a plastic/rubber cable can.", "id": 587}, {"review": "I use 2 to stereo mic my egnater, works great, nice sound, to my ears not much different from an SM-57 and is a fraction of the price. It's not an audio professionals mic but good enough for me! Too noisy for hand held vocals, put it a mic stand instead.", "id": 594}, {"review": "Nice accessory, hold plenty of sticks, and the angle makes it easier to get to them quickly.", "id": 641}, {"review": "I like these short planet waves cables for short runs where there won't be a lot of abuse going on. They have good quality connector jackets similar to Monster cables. There are better made cables out there but few are in this price range.", "id": 663}, {"review": "These picks sound great, very durable and grip is the best I have used. My main complaint is the very small size,I haven't got enough room to vary my finger position and get different tones out of the pick. I find the Dava master control more to my liking for most things, but I still use the jazz III's from time to time when I just want a simple clean pick tone.", "id": 686}, {"review": "I keep one with my guitar and one at home and never had a fall. Its small enough to keep in my guitar case and cheap enough to replace if it gets lost. What more could you want?", "id": 746}, {"review": "I also have a keeley 4 knob compressor but I'm preferring the Xotic pedal right now. The compression is more agressive than the keeley but I find it easier to dial in a good sound, especially using the blend knob, I like to retain some dynamics to my sound. The high/mid/low switch is great, I like it on mid or high, really makes the harmonics come out. There is more volume on tap as well, and I can see how it could also be used as a useful clean boost.  The Keeley has a more dynamic and transparent sound but I also find it's noisier than the Xotic. The Xotic is a fraction of the price though and better overall value I think.", "id": 866}, {"review": "Small footprint, simple to use, one button, one knob and does not suck tone out of my guitar. It's only got a basic feature set but that's all I need. Reasonable price too. Highly recommended.", "id": 869}, {"review": "Good metal distortion tone with bags of sustain but sucks a lot of tone (most metal pedals do) and is moderately noisy. If you are looking for classic rock sounds you won't find them here. Can get muddy at times but there are plenty of settings to tweak to get the sound you are looking for. I find it useful for high gain leads and palm mute rhythms but note definition is not so good with chords. For the price this pedal is a good deal though!", "id": 36}, {"review": "Holds ~8-10 picks depending on thickness. I stick it on top of my amp so ive always got a pick close by.", "id": 167}]