[{"review": "I now use this cable to run from the output of my pedal chain to the input of my Fender Amp. After I bought Monster Cable to hook up my pedal board I thought I would try another one and update my guitar. I had been using a high end Planet Waves cable that I bought in the 1980's... Once I found out the input jacks on the new Monster cable didn't fit into the Fender Strat jack I was a little disappointed... I didn't return it and as stated I use it for the output on the pedal board. Save your money... I went back to my Planet Waves Cable...I payed $30.00 back in the eighties for the Planet Waves which now comes in at around $50.00. What I'm getting at is you get what you pay for. I thought Waves was a lot of money back in the day...but I haven't bought a guitar cable since this one...20 plus years and still working...Planet Waves wins.", "id": 1}, {"review": "What can I say that you haven't already read about this amazing pedal? If you thinking about buying the other green overdrive pedal you can save big green with this pedal. If your looking to play out with it know that it's cheaply made and can be destroyed in seconds. Have a backup. Take great  care when plugging and unplugging from this pedal. That alone can cause problems... As far as tone goes it rates very high on the Tone God List. You can go from clean to outright mean with this pedal. It has out muscled my 2 other more expensive name brand overdrive pedals and yes it has earned a permanent spot on my pedalboard. I use it mostly as a clean boost so the pedal is always on and I never turn it off once we start playing. I leave it plugged in on the board all the time. I reach down and use my hand to turn it on and off. I carry a backup pedal... I LOVE THIS PEDAL!...just don't ever drop it...", "id": 381}, {"review": "On the plus side it does the job, powers your 9V pedals and doesn't break the bank...on the down side this unit can be a bit noisy depending on which wall socket you have to plug into. Neon lighting can raise Hell with this power supply...but who ever said playing out live was gonna be easy? Best to have a noise gate handy...just in case.", "id": 428}, {"review": "What can I say? First it's MXR...enough said. This company (Dunlop) gets it right with the MXR line. I was a Boss guy but was never really happy with the delay or chorus from them. I don't hate Boss and use their Super-Overdrive in my chain. I already own a MXR Dyna Comp & Phaser 90 pedal so I took the leap and bought this delay. Wow! It's so much warmer than the Boss. Side by side the MXR won hands down...well at least for me. It goes from slap-back to space shot very easily... It's a great pedal that may well replace how much reverb you use... I'm really happy with this and would replace it god forbid...", "id": 507}, {"review": "I've been playing guitar for over 30 years both teaching & performing and never used a pedalboard. I used to carry the FX's in a briefcase and setup the ones I needed. I'm old school when it comes to these boxes... I run compression, wah, overdrive, super-overdrive, delay & reverb pretty much in that order. Sometime I use a phaser or a tremolo... I also have a few distortion pedals laying around as well but don't use them much. I currently have 8 pedals setup on this board. I have room for one maybe two more. The board itself is built like a tank and travels well. The bag that comes with it is road worthy for local gigs but I wouldn't take it on tour without a metal case. I did go ahead and Velcro down all the pedals that I always use leaving a little room for add ins. Be sure you want to Velcro down the FX chain because to get the best, most secure, it won't fall off the board when you pick it up off the floor...I found that I had to remove all the rubber feet from each pedal. The Velcro is very strong and may test the durability of some of your cheaper pedals. Use great care when removing them from the board as you can easily rip the backs off of some of them. Low end wah pedals and boxes made out of plastic be warned....Boss, MXR, Mod Tone and other high end, well made pedals work best once set on the board. You can run any number of power sources to it. There is plenty of room for all my needed connections...I leave the choice of that to you the reader.At the end of the day it's easier for me to move my FX pedals around and setup on the gig is in minutes. Plus it looks much cleaner and gives me a little more room on tiny stages and less chance of tripping over a cable.. I'm very happy with this product and would replace it should anything happen to it.", "id": 544}, {"review": "I've been using this amp for a few months and I'm very pleased with the overall quality and performance. I was looking for a small studio amp and watched the demo video on YouTube. I ordered it through Amazon and it arrived quickly. The amp has two shades or flavors as I call it. I only use the clean side or input one. This is what Fender calls Blaceface Clean. No matter how hard you push that channel it won't break up and sounds great with no FX's running. I really haven't used channel two much. These are all your pre-sets which many amps are doing these days. I'm pretty much old school and like to find my own sound. However they do sound very good and you can change a lot of these settings both from the front panel and through your computer. The amp itself hooks right into your USB connection such as Gargeband or other recording boards or software. The amp is all tube and sounds better the longer you leave it on... It's a loud 15 watts... I have used this amp on smaller gigs without any problems. If your looking for a studio/home/1st amp you can't go wrong with this guy. It's now my go to amp in the studio. You can make this amp sound many different ways and with an FX chain in front of channel one (how I run it) the sky is the limit. Haven't used the software that you need to download from Fender but will look at it later. right now this amp doesn't need to be tweaked for me...I loved it right out of the box! Give it a test drive and let your ears decide...", "id": 819}, {"review": "I've owned more than one overdrive pedal in my 30 years of playing guitar and the only one I still have on my pedal board is the Boss Super Overdrive...Sweet Baby is well on the way of living up to that legend as well. I have nothing but high praise for this amazing pedal. It really does react to your playing style. Unlike other overdrive pedals I've used this one really gets smooth when you back off of your string attack and starts to growl the harder you dig in. As far as the pedal goes it is pretty much the same as a lot of them...instead of a tone knob they call it \"focus\", there is also a volume and drive knob. The sounds I can get out of the Sweet Baby are some of the best I've ever used and easy to dial in. I own a lot of pedals but lately I keep my chain setup real simple...the guitar goes into a EHX-Crying Tone wah pedal, then the Sweet Baby, then a Boss Super Overdrive (used as a lead solo gain boost... I don't use Distortion pedals.), next is an MXR Micro Chorus followed by an MXR Carbon Copy Analog Delay. The whole chain goes into the 2nd channel of my Fender Deluxe Reverb amp. I use the foot switch that came with amp to turn on the tremolo when needed... I play mostly Blues and Classic Rock. The Sweet Baby is well made and I don't see it failing me anytime soon. You can spend hundreds more on name brand pedals but what works for me at the end of the day is alive and well in this \"clone\" overdrive tone blender...Update: this pedal has since been returned. It went out with me on a few gigs and didn't hold up to life on the road. The connections inside the box came loose and became a major problem before a few gigs...I have since put my Boss Super Overdrive back in the chain...while I truly loved the tone from this product in the end you get what you pay for.", "id": 833}, {"review": "Let me just start out by saying that I've been playing guitar for over 30 years and have owned a lot of different pedals over all this time. I still own most of these units except for this one...the JoYo compressor. My setup is a very simple one...starting with a Stratocaster to compressor, wah-wah,  super-overdrive, boost pedal, delay, then straight into the front end of a tube amp with reverb & vibrato. I don't want to get into a long blown out history of all the compressor pedals I've tried over the years but I know why you want one and how to use them. This thing simply didn't work right out of the box. While the outside of this stomp box is all metal, the inside is full of very low grade parts from China. Loose wires and bad components were everywhere on the board. I ended up sending it back for a full refund. I don't in anyway blame the seller. They took care of me without a hitch and I would buy from them again...just nothing with the name JoYo on it. If you're only buying these based on price I would say buyer beware...you get what you pay for.", "id": 834}]