[{"review": "I'm a huge fan of D'Addario strings. They hold their tone & tuning longer than others I've tried, and when you buy the bulk packs you can't go wrong on quality + value.", "id": 156}, {"review": "I recently acquired a Guild six string that I strung with my usual EJ16 strings, however, it just wasn't playing or sounding as good as I knew it could.  After tweaking the action and restringing with EJ17 Mediums, that Guild has sounds great with plenty of punch & power to spare.Overall, I rely on D'Addario strings for all my instruments. What's not to love about a 300+ year-old, family-owned company that (beginning with the days of catgut) has been responsible for dozens of string making innovations?  Beyond great tone & playability, these suckers are reliable as all get-out. These days if a string breaks, I know right away I need to check the nut & saddle, because these strings don't snap unless something on the instrument caused damage. In fact, I used to snap strings every other performance before I learned to properly hone the string rests on my instrument and use NOTHING but D'Addario strings. I haven't broken a string during a performance in years, and believe me, I ain't being gentle with 'em.", "id": 198}, {"review": "I've relied on this stuff for years, and it has yet to let me down.  I play my guitars quite frequently, and they tend to collect a fair amount of sweat, etc., during a show. A couple sprays of this product and a quick wipe down with a guitar chamois return my axe to its shiny self, with zero degradation to the finish. I've even used this on matte or light finishes with good results.Tip: a little goes a long way. I play every week, I use this stuff every time I put away a guitar, and it still takes me at least a year or so to finish a bottle.  I figure this stuff costs me about 25 cents per month.  :)", "id": 351}, {"review": "I've owned and used this for a few years now without failure or flaw.  The pots all still work without adding noise, and in general the device does exactly what I need it to do.  You won't find a better deal than this on a basic headphone amp/mixer.", "id": 376}, {"review": "I've been using these on my acoustic guitars (and straps) for over a decade.  They're sturdy and convenient, and so much more attractive than adding a shoelace to your strap.  The ability to quickly disconnect the strap for storage (or when you don't need the strap hanging from your guitar, e.g., sitting in a chair) works exactly as advertised.  I've purchased several of these and can't say enough good things about the product and company!", "id": 174}, {"review": "I've been using Dunlop Tortex picks for years, with the .60 and .73 being my mainstays for acoustic & electric picking.  They feel great, they're easy to hold on to, and they have exactly the amount of give & attack needed for my style of playing.  If I have any complaint, it's that the edges wear down with use, sometimes quite rapidly.  Still, they play so well, it's worth the cost of regular replacement.", "id": 455}]