[{"review": "Haven't had this long, but so far, it's just about perfect. I had bought another On-Stage side boom earlier and was greatly disappointed by its flimsiness (On-Stage MY550 - see review). This one on the other hand is rock solid and much more adjustable, AND only costs a few bucks more (fourteen buckos at present). I've got a 13\" gooseneck and a light-ish condenser mic with a shock-mount on it, and it's as steady as can be. I'm convinced even heavier loads will be no problem. If you're in need of a side boom, look no further.", "id": 143}, {"review": "Simple enough, right? Works as advertised. A great simple idea that I'm glad someone put into production. For my taste, the loop is too long where it wraps around at the headstock/nut area, so I just tied it up snug. I had been using the Martin leather strap holder where your strap hooks onto a plastic button, and this is far more secure because straps sometimes work their way off of the button on the Martin holder. However, folks with brand new shiny expensive guitars might want to take note: while the nylon lace that wraps around is nice and strong, it is fairly rough and abrasive, and my experience is that it will very definitely wear at the finish of your git in that area. Won't rub the finish off or anything to that degree, but if you're freaky squeaky clean about maintaining cosmetic perfection on your guitar (which I am NOT), you will definitely notice the finish rubbed and dulled and even chipped a bit there at points of contact. I can think of a million simple solutions to that, but that's another story. Overall, great little item.", "id": 174}, {"review": "OK, it was cheap (nine bucks at the time), the design looked good and sensible, and it seemed a perfect solution to a real need. I bought it without hesitation. HOWEVER(!), once hooked up, I was very surprised how flimsy it is. I have a 13\" gooseneck, a light condenser mic and small shock-mount on it. At the slightest movement of the mic stand this attachment flaps up and down like crazy and will continue this way for a something like a minute if not stopped by hand. Obviously, any small bump into the stand will once again set this off. Using it at home, I've gotten away with not touching the stand while recording by being very careful, but obviously this unit is far from ideal. Since then, I've gotten another sidemount boom from this same brand, and though I haven't really put through its paces yet, this other unit is rock solid and far more adjustable and reliable, AND only costs a few bucks more (On Stage MSA9508 Posi-Lok Sidemount Boom). For anyone considering this product, I HIGHLY recommend bypassing this one and forking out just a few more bucks for the On Stage MSA9508 Posi-Lok Sidemount Boom. You will be far far happier.Cheers!", "id": 246}, {"review": "I wanted to like this. I really did. The idea of an amp this portable and cheap just made me think, &#34;Perfect&#34;. However, the unit I received was cr@p, and I'm going to assume it was defective and not blanket all the positive reviews with dispersions. The one I got kept cutting in and out. You might be playing a solo line and you might hear about 75% of the notes or something. And when holding a chord, the sustained sound would cut out after a few seconds. Frustrating.I did weigh whether or not to try a replacement unit. The so-so sound and overall quality however didn't compel me to give it another go. Bummer. Any suggestions for an amp of similar size and portability?Cheers", "id": 303}, {"review": "In case you're wondering about the difference between this Hohner harmonica holder and the Hohners costing more than twice this one's price, this one is made in China while the others are made in Germany. Now, I'm definitely not one of those who automatically dismiss the quality of Chinese made products. I have, in fact, many musical items of surprisingly good quality made there. This item however has some of the good, AND some of the more stereotypical problems of Chinese goods. Pros: Cheap. Sturdy. And unlike some reviewers, I love the taller height. Far far better for you ergonomically not having to stoop and scrunch your neck and windpipe. I also like the tighter springs, though that does take a little getting used to. But the secure feel of your harp is worth the slight extra effort. Now, the Cons: It's true what others have said: the plastic neck tube smells. Not as bad as some have said, but an annoying chemical smell is definitely noticeable. I cut that off and got a big wide replacement tube at TAP Plastics for a buck (make sure the one you get is wide enough to slide over the bends in the neck loop bar thingee - I got the 1/2\" diameter). 2nd and perhaps bigger problem is that the metal is NOT bent evenly. Mine was distinctly taller on one side than the other, and the neck loop was WAY off. I did my best to bend all parts to even, but the flat metal part is tough to shape. The reason I didn't return it is that I figure most of them are equally uneven: I just picture a bunch of poor souls slaving away bending these suckers by hand, with little or no machine help to ensure consistency. With the work I did on it myself, it works fine and is now fairly even, and like I said, the taller height is just about right for me. It's just annoying that some of the most basic expectations aren't met (like holding your harmonica at an even height on both sides). All this said, the bottom line is that I prefer using this OVER my German made Hohner holder because it's better ergonomically (taller), holds my harp more securely, and the traditional dual butterfly nut design just works far better and with less effort than the \"nouveau\" single butterfly nut design of my more expensive German Hohner. Knowing what I know of its drawbacks, I'm still tempted to pick up another as a back-up or spare. It's a great deal if you're willing to do a little work on it.", "id": 354}, {"review": "Hi Folks! OK, this thing is cheap. That's cool. But a cheap item you can't use is money thrown away. Before buying this I had read various reviews of some folks liking it and others saying it's too small. Well, I want to clear this up once and for all. IT IS TOO SMALL! Specifically, it is too short to reach across all six strings if you go past the third fret or so (depending on your guitar), AND it doesn't open wide enough to be able be slid down past the third fret, even on a skinny neck. This thing really is a puzzler. I mean, who the hell would make capos this size, especially when they could've made capos that actually fit for the same production price and sold them at the same price? Someone somewhere is just plain ass stupid. HOWEVER, a positive from this whole mess is that I finally found a capo to use with my ukulele, and for way cheap, ha ha. But if you are looking for a capo for a guitar of any size, this is utter garbage. Cheers!", "id": 809}, {"review": "Soooo bummed. I simply love the sound on these cans, but the speakers are just too dang close to the surface (not deep enough in the cups) and press down hard on my ears. The max time I can wear them is like an hour, and then I can't wear them for a day or so due to residual pain. I guess if they used thicker pads to deepen the cups, that might help. Also, on most of my other phones, the speaker areas have fairly flat surfaces, while this one has the speakers jutting out of the cups and are covered by just one thin nylon sheet. So it's kind of like double trouble. However, these really do have great sound (especially the tight bass clarity). If it weren't for the discomfort factor, I would be using them all the time. As of now, I hardly use them at all. In fact, when I first tested these out, I was ready to hop on the computer and order a couple more. But I'm glad I waited to really give them a more prolonged test. Of course, we are all of varying shapes and sizes, ha ha, so they might work for you where they don't for me. If so, you've got a bargain on some great cans. If not, ouch. Cheers!", "id": 870}]