[{"review": "Best 12-string capo I have ever used--and that's over decades.  Works easily and flawlessly.  Very well made.  Five Stars", "id": 42}, {"review": "We all have different tastes in guitar picks, I know,  As I wrote elsewhere, the Dunlop Tortex are awful for acoustic, in my opinion.  These Ultex are much better.  Not as noisy, better feel.  Still not my favorites.  I'll have them with me for spares.", "id": 54}, {"review": "I've been playing guitar for over 40 years, and these Tortex picks are nearly the worst I'v ever used.  They are so noisy that they overpower the guitar strings with their clackity-clack noise.  Dunlop Ultex picks sound much better.", "id": 61}, {"review": "I admit I'm not the guitar flatpicker some of my friends are, but I find this pick to be perfect for picking mandolin.  The picks have almost zero flex to them, meaning the player has solid control.  I like 'em--even if they are purple.", "id": 66}, {"review": "D'Arrario does sell some fine strings.  While these are not my very, very favorites (strictly because I prefer a slightly lighter gauging on light strings), they still do just fine--much better than some other brands I've tried.  I would not hesitate to buy them again.  Good-sounding and playing all-around strings.", "id": 198}, {"review": "Nice picks.  A bit small for my preference.  Great for picking, kind of harsh for strumming,  Quality seems top-notch.  Some guitarists will love these.", "id": 413}, {"review": "This cable seems top-notch to me.  Some complaints I heard had to do with this brand not lasting.  (Of course, those guys abuse their equipment.)  Maybe that will be something I'll encounter, but this cable appears to be very well made--and it works great.  I take very good care of my gear, so I expect this one to last.  Only gave it four out of five because I'd rate some other cables slightly higher.  This a great cable, the length is perfect for practice, and I'd buy another.", "id": 419}, {"review": "Over the past couple of months I've been replacing guitar straps.  This one seemed ideal for an everyday all-around strap.  And, it would be, but the holes are too tight.  Really a major chore to get over a strap button.  I had to elongate the slits just to force on the strap.  I've probably bought dozens of straps over the past forty-plus years, and I never had this problem until the latest straps I've purchased--so this strap isn't the only one with which I've had an issue.  A tight-fitting strap isn't in itself a problem, except when one needs to take it off!  Yikes!  Otherwise, this is a nice strap.  Oh, I tried the strap on three guitars, just to be sure the first wasn't an anomaly.", "id": 656}, {"review": "This is a nice leather strap, not thick, but very functional and nice looking.  I found it a bit uncomfortable with a heavyweight electric guitar, but should work just fine with an acoustic.", "id": 659}, {"review": "This pick is well designed for mandolin playing.  Unlike standard guitar picks, it has generously radiused corners.  It's also stiff and comfortable to hold when playing.", "id": 771}, {"review": "I like using these strap ties far more than I do tying a strap to the neck.  They are a great idea.  I found the button on the strap somewhat difficult to install the strap, but eventually got it on.  I have two of these, and I use them.  I'd definitely recommend them to anyone who doesn't like tying on their guitar straps.", "id": 886}, {"review": "This my second Hosa guitar cable.  (The other one is shorter.)  Like my first Hosa cable, this is a high quality item.  I'd definitely buy more cables of this brand.", "id": 6}, {"review": "I would give these picks five stars, but I do have a couple of other types I prefer more.  Still, these are nice picks.  So far I've only used them on 12-string guitar, but I'll soon be trying them out on 6-string guitars.", "id": 62}, {"review": "I've been playing guitar since the late sixties, and have to say, this string winder and cutter is fantastic.  I use it regularly.  It is durable and effective.", "id": 94}, {"review": "These picks seem well made and have a solid feel, but I'm not sure I like the sound of them.  Like so many other guitarists, I go through a lot of picks, searching for what feels and sounds the best for what I do.  I don't this is it for me--at least not on acoustic.  Whatever I didn't like about them got drowned out when I tried electric.  Since I've been playing more acoustic lately, I might or might not buy these again.", "id": 170}, {"review": "I'm primarily a guitar player, but I do have a decent mandolin that had factory strings on it.  Those strings made it hard to play, so I tried these D'Addario mandolin strings.  What a difference!  These strings are great!", "id": 408}, {"review": "Unquestionably a top-of-the-line manual string winder, but still the user must careful not to scratch a guitar's headstock.  On some tuners this might work great, but on various of mine, still sloppy.  For now I'll stick with good old fashioned fingers and thumb.", "id": 683}]