[{"review": "This is a pretty strong cable. I wanted something I can plug into my top loaded amp and the jack would stand out in case I'm sitting on the amp. the angle does the job. seams strong , seams like it will last.", "id": 47}, {"review": "These strings actually save you money because you don't have to change em much. I keep em on a year or so and I play alot, out door indoor. constant abuse. they never rust. When they break I change em.now..I'm not a player who likes new strings to begin with so I like not having to change em..they really hold up. There are better sounding strings yes. But if your plugin in anyway, you can tweak the tone.The tone isn't bad, just not as good as a martin uncoated string.but if you like longevity and less squeak. these are great.", "id": 99}, {"review": "This stuff is great. The other guys are always coming over and grabin a shot or two cause I leave it in the pedal board. Iv'e been using this for years. I like smooth slippery strings for speed and ease. Humidity  not a problem with this stuff. .", "id": 173}, {"review": "It's works. Nice and small. Cool looking. Does the job. Seams sturdy enought. Might even get a blue mic. I use with a MoJave", "id": 200}, {"review": "I tried it for iPad. It kinda wobbles up and down. It has a light strip of metal without a bracing design so it flaps up and down when something heavy is attached to the end such as my iPad.  I only recommend it for something light weight.  There's better ones out there. See my review on the music stand. That comes with a solid extension arm...", "id": 246}, {"review": "To heavy....it doesn't stay where you need it. slips down becuase of wieght.. get something else or larger strap to dispers wieght of the guitar...", "id": 452}, {"review": "I use this for my iPad.  I drilled bigger holes to lighten it up a bit. It's solid and works great, very adjustable... Good seller to...", "id": 592}, {"review": "Use this alot on all kinds of electronics. It gets crackling knobs going again. I've use it for years. recommend", "id": 14}, {"review": "Well I didn't expect much due to the price... But trust me this thing is really good...I've tried EH nano grail. I own the holier grail.  I've heard the boss verbs. And I really like this one. Save your money this pedal is good enough...I'll make a video and post it soon...", "id": 699}, {"review": "I've read its not really complete isolated, but it does the job. I didn't realise how much noise my one spot was adding. I A/B them both one after the other and it truly was quieter. the only Problem I have is my TC Helicon takes 12 volts input but 300MA. this pedal only supplies 100MA so the pedal didn't work in the 12 volt slit. Luckily however it does work plugged into the 9volt 300MA spot so im using it there. everything else in the other 9volt 100MA slots.it's a lot quieter now. I recommend trying it and saving some cash.", "id": 852}]