[{"review": "This little amp kicks major ass, dood. I think I may have blown the speaker or it's just how it sounds but it's great for a lo-fi kind of fuzz-e tone when the gain and levels are all the way up. The clean tone is really nice too, a little to bright for my taste, but for a mini-clip amp it's not too bad. I can take this plus my tele to my friends house and sit outside and just didtle away. Theres a headphon jack, a 9v power supply and that's in for plug ins, No line in so you can't plug you ipod or whatever to it and play along but oh well. If you have a big rig and you just want something small for like a camping trip with some friends this is pretty great.", "id": 303}, {"review": "For the price, it's worth it I guess. If you just want to try it, go for it, that's what I got it for. It sounds nice and adds a cool tone to my setup, but after playing on a few more expensive chorus pedals I would suggest saving up if you really need a chorus pedal. But for the price it's not too bad.Oh, and the casing isn't like a wimpy plastic knife plastic. it's pretty durable. Albeit don't throw this on concrete and expect great results but it could stand a few stomps.", "id": 319}, {"review": "Works great for the price!! I just started to get into pedals and I thought I'd try something cheap like this, and I was not dissatisfied. Don't mistake this for a distortion pedal for those who are new to all this, although you can get a distorted tone for this pedal, it just boosts the volume with slight raise in gain (For those who do know your shit please don't call me out on that, I don't really know and I'm just helping ones like me in simple terms,lol). It works great for switching to a more abrasive tone for solo'ing or just wanting to get loud in your songs.Definitely would pick this one up for a super cheap &#34;I just wanna try it&#34; pedal.", "id": 355}, {"review": "If you're in the need for a guitar capo, then this is a pretty good offering. For it being pretty cheap, I had to get it. Shipping was fairly fast, and it's ready to use straight out of the package. :D", "id": 603}, {"review": "Eh. I wish I had more of a passion to play it, but....ehh. It's not bad if you want a uke, but it's pretty small. I don't know what I was expecting. I don't know shit about ukuleles but I do know get a bigger one if you're not comfortable with small frets. If you wanna be that one fat Hawaiian guy, Israel Kamakawiwo'ole, go for it. but I think he played a little bigger uke than this, lmao.", "id": 840}, {"review": "They work great with my pedals! Not sure if it's the pedals or the cords, but I noticed with my full rig and using all the cords there is a noticeable hum in the background. I'm sure a noise gate could solve that problem, but oh well. I can deal with it.", "id": 847}, {"review": "It's a flange pedal, what else? For the price I was really happy with it. If I knew someone who was more skilled than me I'd get the workings inside a different case. The shape is cool, but I'd feel safer with it in a metal casing. The button is smaller than I thought, but it's not an issue at all; it's kinda easier to press!As for someone like me who is starting to get into pedals, for the price just to see how they work and if you want to invest in this realm, I would recommend this!", "id": 316}, {"review": "I have no idea what happened or if anyone else had this problem, but I got literally 8 plug-ins, and not the part where you can plug in an existing cable to make this into a chain. It's like I got an extension cord and male outlets on both ends. Soooo it's pretty much useless to me. I guess if you get one of those power blocks with 9v outlets on them, I guess you could plug this into it but I really see no point. I would've shipped it back I lost the packaging and just wrote it off as loss. I think I payed like $8 for it so whatever. I would recommend going to an actual music store so you can physically see both the male ends and the female end.", "id": 486}]