[{"review": "I used these on a Behringer XM8500'sIt fits tight and does not obstruct the tone greatly.I have not tested its wind screen capabilities.I use it to protect my microphones from singer&#8217;s saliva :-)Works great and does not fall off.", "id": 178}, {"review": "I originally was planning on purchasing 2- 3 packs of xm1800s, but after hearing the difference between the xm1800 and the xm8500 it was a no brainer.I was looking to get 5 vocal microphones on a budget for a band that sings loads of harmonies in every song.I really wanted Sure SM58&#8217;s, but the budget did not allow it.I normally stay away from Behringer due to bad experiences with their consoles and compressors etc., but these microphones were a game changer for me.They have a very full and even tone without any mud or extreme plosives, also an excellent output level to the mixer.I was able to EQ them easily for both male and female vocal ranges. I was told by all 5 singers that they could here themselves loud and clear through the monitors.I was also able to get a nice even mix on the front end.I do not know of anything better for the price in live vocal microphones right now.", "id": 213}, {"review": "Sound nice, but very unreliable BX5a Deluxe.I own a pair of YAMAHA NS 10s and EVENT 20-20s, and they are all currently working without problems with over 10 years use.2 years ago I purchased a set of regular BX5a's, and they lasted about 1 1/2 years, and then the faulty capacitors leaked.I just replaced them with the BX5a Deluxe model, and after only one week. one of the Internal amps will no longer power up.I need a pair of affordable AV shielded monitors that I can depend on, and these Cheap M-Audio Monitors are not it.I am back to using my 20-20's with slight AV noise until I find a decent AV shielded monitor.M-Audio was a much better company before Avid took them over!", "id": 502}, {"review": "Noise free cables with good connectors at an affordable price.I used them for acoustic drum microphones into a mixer without any problems.", "id": 602}, {"review": "Great product for the price!I am using it with Win7 64bit & Sonar XL Producer.I just held down the \"set-marker\" & \"record\" button while plugging the usb cable.I then let Windows 7 Plug & Play the Drivers (No Disk Needed).Next I set Sonar XL Midi Control Surface device as MACKIE & selected the nanoKontrol2 as the Control -Midi in and out.Now I have 8 channels of automation & stop, back, record, play etc.I am very happy with this product so far.I have to give it 5 stars on the price to performance ratio.READ THE INSTRUCTIONS!I do not recomend downloading the KORG software if used for SONAR XL.Buttons and sliders and great for the price.Cheers", "id": 741}, {"review": "I clipped it on the neck (head) of my acoustic guitarIt tunes up well and is very easy to readI turn it off after tuning but leave it on the guitar while playingI have not used it enough to test the battery lifeBut so far so good. Great for the price.All Pros and No Cons so far", "id": 811}, {"review": "It fits my acoustic well while giving minimum protection.Storage compartment could be larger, but good for extra strings and picks.You can&#8217;t fit a full sheet of paper or an 8.5&#8221; x 11&#8221;paper back guitar book in the zipper compartment.I would be careful of putting anything in the zipper compartment that could damage the guitarCross straps work well for carrying. Zipper system works well.It is a nice acoustic guitar bag for an inexpensive guitar considering the price.It fits my Jasmine ES31C Dreadnought Acoustic-Electric Guitar just fine.You really can't beat it for the price.", "id": 539}]