[{"review": "This Fender cable is the perfect length for me! Sometimes I find it a bit too long but I don't mind. The build quality is great and I know that it will last. The only gripe I have with this cable is that the metal sleeve gets unscrewed way too easily, requiring me to tighten it often.Sound quality is not affected, and the color is cool, definitely try this cable out.", "id": 3}, {"review": "I use this cable for small home recording projects. I do not take the cable around to gigs or shows, as I am pretty sure it wouldn't last longer than a few months of heavy use. The sound quality is fine and the metal connecters feel a little bit flimsy. If your looking for something that is cheap and will do the job, this is your product.", "id": 21}, {"review": "This is my second condenser microphone and I have to say that I love it. I previously owned an Audio Technica 2020 condenser mic which sounded thin and not as natural to me. I noticed that this mic does not really boost any frequencies like some other mics do in this price range. With this microphone, what you hear with your ears is basically what you get. Of course, room acoustics and microphone positioning all play a large part in the final sound.I use an Alesis mic preamp with a Focusrite 2i2 interface and the recordings sound clean. Another thing to mention, this is a variable pattern condenser mic. However, even with all the polar patterns that this mic has to offer, I usually just leave it on cardioid since I mainly use the M179 for vocals. Although I usually only record vocals, I also record electric guitar, acoustic guitar, and drums with the same microphone.Overall, my experience with this microphone has been pretty great. I think that for this price, it will be hard to find another microphone that can perform on the same level.", "id": 82}, {"review": "Great microphone, I use it with my cheap/budget Behringer mixer, the sound is good and if I turn up the gain it will pick up everything in the room. It is great for recording acoustic guitar and vocals, don't start layering the vocals though, it starts to sound kind of weird.", "id": 254}, {"review": "The quality and feel of this tuner is very good. Tuning the guitar is really easy, just put the batteries in (it comes with 2 AAA batteries) and press the red button to turn it on, then pluck the strings! This is my first tuner and its great already! It's very portable.", "id": 331}, {"review": "The Samson shock mount does work with the Audio Technica AT2020, yes. Does it work well? If you can securely close the little gap between the AT2020 and the shock mount then, yes. There is another reviewer on here who gives a very good tip on getting rid of that rattle when using this mount with the AT2020. Only other thing is that the colors don't really match up well but I don't really care, its a good shock mount.Ask yourself before you buy though, do I really need one? I don't really use mine since I have carpet on the floors that doesn't like the mic stand shake too much.", "id": 393}, {"review": "My Takamine guitar needed a strap button and this button does the job. The quality seems to be good and installation went fine.For those of you who are unsure about drilling a hole into the guitar, I would only recommend drilling into cheaper guitars (Unless you know what your doing, of course)", "id": 478}, {"review": "This interface is alright, nothing special, its for a guy on a budget. You can use it to record your old tapes or records and it will go straight through the interface to your computer via USB. There is pretty much little to no latency and it isn't noticeable. I plan on buying a tascam interface soon for around $70.00 and that should make things better for me. I will still use this to record anything on TV or like I said, old tapes. The software bundle is pretty much free, as you can find everything on the internet, they just bundled it together for you, which is nice.", "id": 597}, {"review": "I bought this strap because I thought the pattern was awesome! The comfort is okay, I never wear it for more than a couple hours at a time. But... just the design man, go planet waves!", "id": 657}, {"review": "I ordered two PDMIC58's and they came with an XLR to 1/4 cable included. However, the quality of these cables are mediocre at best, I recommend purchasing a higher quality cable with your order.Now to the performance. This mic is built like a tank, yes, as others have said. It is somewhat heavy but not too heavy, in other words, it doesn't feel like a \"cheap\".As for the sound quality, I would have to say 3 out of 5 because the mic doesn't sound as clear as I would like it to be. Now I'm not a professional, but this is just my opinion. I'm not saying it sounds muddy, but it sounds tinny, you'll have to see for yourself.Other reviews have also said that this is a great back-up mic or karaoke mic, I agree. However, if you are looking to record professional sounding tracks, you won't find it at this price.Value? To me, I think it's definitely a mic worth having, even if it's just laying around, at this price, you can't beat it. It's a great mic for the price.-Update-After using this microphone for a while, I find it to be somewhat lacking. Don't get my wrong though, for the price, it definitely performs as it should. However, if you are looking to make quality recordings, I would pass on this purchase.", "id": 690}, {"review": "I just received these cables today and the packaging they come in is quite simple. However, there are two zip ties that secure the cables together so you will need to be careful when cutting them not to damage the cable itself with your knife or scissors.These are, \"Value\" cables after all. However, they seem very sturdy and are perfect for budget home recording studio use. I like how Audio Technica made something like an XLR cable look so pleasing to the eyes.As for quality, so far I've been getting a clean signal, even with my cheap Pyle Pro PDMIC58. I had to replace the cable that came with that mic because it was really that awful. Hopefully the AT Value cable will hold up! I'll update this review if anything happens.If your looking for a decent cable for a low price, I would give these a try.", "id": 288}, {"review": "I'll start off by saying that I've had this interface for about 6 months now and it is still going strong. I think that anyone, especially the beginner, looking for an interface should definitely consider this unit. Not only does it provide 2 channels, but it also has monitor out and headphone out. This could also be a decent sound card for those who are fed up with integrated audio.However, I have a few gripes with the 2i2. The headphone knob feels a little flimsy and has a bit of give if you push on it. This is purely the \"feel\" and does not really hinder performance. But it makes the unit feel cheap, at the controls. IMO, the knobs and switches can feel a bit unsatisfying when the rest of the unit is built so strongly. Moving on, while on the topic of knobs, the level knobs for both channels could also use indicators, but once again, aesthetics.Why 4 stars?The problem must of started happening today because I never noticed it before. Or it could be just that, maybe I never noticed it. Anyways, shortly after I engaged the 48v phantom power, the interface started making a barely audible high pitched hissing. Once again, this is barely audible and should not be a problem if your microphone is far enough away. I hope that this issue does not show up in all of the Scarlett 2i2 interfaces. I would think that an interface should produce no noise as it in key in the recording process for many home studios. Hopefully, just my unit is defective and it isn't something that is common among the 2i2's.Another thing to note is that while Direct Monitoring is a feature on this unit, the volume levels coming from the direct monitoring is very low and makes it less practical to use. In other words, I am saying that you would have to essentially turn up the gain and record \"hotter\" and get closer to clipping to effectively hear yourself clearly though the direct monitor. Nevertheless, it is a feature that can be utilized though.So in the end, 4/5 stars! The packaging that the interface came in was very minimalistic, but yet appealing, thumbs up for that. I really like the build quality of the interface and Focusrite makes it very easy to record audio with this unit. The only issue that I would consider a big problem is the hissing from the phantom power being engaged. Overall, great entry level interface/sound card!", "id": 801}]