[{"review": "Purchased these strings after having tried the Blue Steel strings.  My son much prefers the Elixir strings. They last a lot longer than the Blue Steel strings did and he says the Elixir sound better, too.", "id": 100}, {"review": "Purchased these strings after having tried Blue Steel strings on my son's acoustic guitar.  He prefers the Elixir strings over the Blue Steel strings. He says they last a lot longer and sound better, too.", "id": 109}, {"review": "I purchased this for my son to use on his acoustic guitar.  I had previously purchased a fabric capo for him to use until I could get him a better one.  That did not last long. I ordered this one and he loves it.  It's durable and works perfectly.", "id": 116}, {"review": "Item arrived as described and on time - Way larger than expected, but my son loved it!  Says it's easier to use than the smaller cloths we've gotten before.", "id": 219}, {"review": "I purchased this for my son's acoustic guitar.  I was tired of finding it not in its case and lying on the floor, or against his dresser.  Since he got this stand, his guitar has been put away on it every time.  The security strap is a nice feature, to make sure the guitar doesn't get knocked off the stand.  Great value for the money!", "id": 258}, {"review": "Item arrived on time and as described.  My son loves this polish/cleaner.  He likes to keep his guitars clean and shiny.  They glisten when he uses this to polish them.  Great product!", "id": 351}, {"review": "Purchased this for my son to use on his guitars.  He absolutely loves it. Has been wanting a cloth like this for his guitars.  Prompt shipping, great price, great product.", "id": 572}, {"review": "Bought these for my son's electric guitar.  He loves this brand!  They sound great and seem to last longer than other brands.  Price is great!", "id": 107}, {"review": "Purchased this for my son who plays both Acoustic and Electric guitars. He's absolutely thrilled and loves this cleaner! Great buy, prompt shipping, great product!", "id": 730}]