[{"review": "I have many lengths of these Hosa cables and have neverhad a problem with them.I am not an active musician, so have not put any of them throughthe riggers of what happens on stage; so I cannot comment on thistype of usage.In my over 40 years (10 of them on stage) I have come to realize, thatyou should ALWAYS have extra cables (just like strings) with you, aseven the most expensive cables will sometimes let you down.", "id": 6}, {"review": "I agree with all of the reviews, but have found another area to use fast fret on: THE NUT. When tuning, the strings (especially the lower wound strings) hang up on the nut which causes the string to pop instead of slide as it would on a roller nut. Dab Fast Fret onto the nut before tuning, and this problem is greatly reduced.", "id": 72}, {"review": "If you are replacing your old butterfly trees, you can use the same holesclip and sand off the alignment pins, as they are not really needed, and justadd another hole to your headstock.Good trees for the price.", "id": 115}, {"review": "The Fender medium is my second choice for picks.My first is the 'Just Strings' pick that is the exact same shapewith a softer (less scrape) feel on the strings at half the price.Pick choice is like guitars and amps; everyone has a different opinion.", "id": 117}, {"review": "First off, let's get the dimensions out of the way; for some reason, finding these basic dimensions on a lot of guitars and cases is close to impossible; just try to find the dimensions of the DR-212 on the Epiphone web site.Length: 43\",  Bout length: 19-7/8\",  Lower bout thickness: 4-3/4\",  Lower bout width: 15-1/2\"So now you can look for a gig bag with the full knowlage of what size guitar you are trying to squeeze into it.The only thing that is out of the norm with these dimensions, is the 43\" length (Most bags are 39\"-41\").You can always opt for the Epiphone hard case: EDREAD, or World Tour RWG20D, or GBA100 (the bag I got).Now that the hard part is out of the way (finding a case), on to the review.As my title says, the guitar reminds me of my Samick ST92 which is a VERY well made 3/4 Spruce top acoustic which is also made in Indonesia.I have played guitar for over 40 years, so I  have a collection of over 100 guitars, and 11 of them are acoustics, but this is the first12 string, and I bought it just to have it around for songs like Hotel California, Etc., and was not willing to drop a lot of money on a guitar I would rarely use.I am very impressed with the build quality of this guitar for the under $170.00 asking price. It tuned up with no problems, even though the tuning process is arduous compared to a six string, and it takes about three tunings to get the strings stretched out. You constantly think you will pull the bridge out due to all that string pressure. The bridge plate on these 12 strings must be huge!I found that when tuning, you should up stroke the small strings so that you don't hit the large one right next to it.I have no fret buzz, finger rash, or problem areas with the fretboard on my guitar, and the strings sit low which I like.The nut is a bit sharp on the edges, but a file or sanding will take care of that.The strings are not that bad, and will do until the first change out.I have seen a wide range of reviews on this guitar, from terrible to fantastic, but the one I have is the later.", "id": 153}, {"review": "I have stayed clear of using pedals for most of my playing carrier (over 40 years), but after installing a Fernandes FSK-101 Sustainer kit and getting the same results as most other guys: Too much sustain on adjacent strings which makes the whole experience a joke, I decided to go ahead and try this compressor out and am very happy with the results. I play mostly clean (jazz, blues, rock) and this unit gives me at least twice the sustain as I would normally get without any pedals.", "id": 186}, {"review": "I have many so-called travel size acoustic guitars and have changed out all of the over sized strings that were installed on them (typically 12-54's) with these 10-47's (or 11-52's for beefy 7/8 and 3/4 scale guitars) in all cases, has brought the smaller guitars from duds to nice playing instruments.Three radical samples come to mind: On an old 1931 Gibson L1, the 12-54's pulled the bridge out.On an SX Traveler, you could not hear the Low E until I got rid of the 12-54's.On my Lil Martin, the lower bout started to delam under the pressure of the bridge pull.Short scale acoustic guitars are someplace between a full size acoustic and a Ukulele and in most cases are not set up for heavier gauge strings (even though the manufacturers insist on delivering them this way) due to their short scales, small frets, and light construction.If you can't hear the low E, or you are having problems fretting your strings, try these, what can it hurt?", "id": 199}, {"review": "You get a 10\" speaker and separate drive control volume with this amp; try to findthose two capabilities in another amp for around $90.00!!!!!!!!!!!!This is by far the best practice amp I have found in the past 10 years and I owna butt load of new amps.I have actually upgraded to a Champion 40, but still use this amp as much as the 40.Don't even think about it, this is one of the best (under $100.00) practice amps, unless you are looking for a gadget filled amp, and in that case you should look elsewhere, as this one is forturning on and going for it and not fiddling around with digital controls until you havejust lost most of your practice time.As an addendum, I would like to add that you should probably not try to replace the speakeras I have read from other reviewers. I have a few of these amps, so just for the heck of it,I put in a Celestion G10 Greenback (which costs more than the 25R) and was very disappointed withthe results.This amp is not being carried by a lot of retailers now, but can still be had new for under $100.00 if you just do an internet search.", "id": 223}, {"review": "I personally think this Seagull is over rated. A lot of reviewers are covering the muddy (not crisp) sound as &#34;mellow&#34;I don't think so.  I have over 115 guitars in my collection, and around 15 of them are acoustics.I have nothing against Seagull, or Canada, but bought one of these NEW off the rave reviews, and just recently (I have had both theS6 and FGX730 for five years) pulled the S6 out for another try just because I could not make myself believe it sounded worse thanmy used Yamaha; IT DID!Side by side I went through the chords on each guitar, and had to finally come to the conclusion that the Seagull had to go.With a price tag of $420.00 for the S6, and $282.00 for it's Yamaha equal, the FG730S, unless you just feel like throwing yourmoney away, I would stay away from this guitar, and look elsewhere.Oh, by the way, I have an S6 for sale!", "id": 432}, {"review": "At this time, I am using this switch on my Fender Frontman 25R to switch between the normaland drive channels. The 90 deg. jack is perfect for this (and a lot of amps),as there are no dials in this area. I have run into the 90 deg. jack problem, and the onlysolution I have found is to use a Mono to Stereo 1/4 inch gender changer, or a short monoextension cable (which is what I normally use, as the stereo jack presents added problems) as nobody makes a 1/4inch mono female to 1/4inch mono male gender changer, which I have found to be more than a little strange.This is a very old style switch that is made in China (like everything else) but works very wellfor this simple task. I have 4 on hand.", "id": 563}, {"review": "I like to attach ALL of my guitars by the neck/headstock instead of using thetop button, and have just used the typical shoestring in the past, but no more.Once you get this baby on the strap, it is not going anywhere.I have a few of these installed on guitars (and one bass) I play a lot.They (obviously) give a lot more support than a string, and will not dig in tothe finish as a string might.Give it a try, you just may like the way the guitar sits, as you don't get the neckdrop that comes with just attaching to the body of the guitar.", "id": 568}, {"review": "These are great picks, and YES, they are slippery.The reason is the material, and method of manufacturing:Delflex polymer picks are injection molded with a blend of acetyl, making them extremely durable and bright sounding. Unlike stamped picks, which are manufactured from sheet film and can have a different feel when rotated, injection molded picks have the same flexibility in all directions.These are probably the brightest sounding picks I have ever used, and it is well worth gettingused to hanging on to them.I use the 61MM for 10's on my solid body electrics, 76mm for my 11's on semi and hollow bodies,and 1.04mm on my Bass guitar; that's right, I use a plectrum on my Bass.You can get a pick that is easier to hang on to, but you may give away some of that bright snap to a softer to hang on to material like Nylon.", "id": 577}, {"review": "I have a lot of guitars and do all the work on them myself.A couple of secrets to installing the mike pickup:After you drill the hole, and are trying to figure out just how to get thejack into place from the inside of the guitar, do this;Get a guitar/patch cable and run it through the hole you just drilled until you can grab it throughthe sound hole. jack into the AXL and then pull it out the hole using your cable. You may have to dothis a couple of times to get the jam nuts set for the right depth, so having a way to make this processeasier is a big help. Also, I did not use the giant endpin collar that came with the assy, as it just takesup a lot of thread space to accomplish nothing.Finding a sweet spot on smaller guitars/ukulele/mandolin's can be close to impossible because the soundhole is actually so small, you can't get your hand in, and finger length is as far as you can go, so in most cases, go in the direction of the low E string side as this is what is typically lacking on the smaller instruments unless you have Jimi Hendrix hands and in that case, congratulations.Finally, on Travel guitars; GET RID OF THE GIANT STRINGS THAT COME ON SOME OF THESE THINGS!My SX traveller came in with 11-54's and I could not even hear the low E string. I had an old set of electric 10-46's I took off of a BB King Lucille, and just for the heck of it swapped them out; Man what a difference; actually so much difference that I really didn't need the AXL I just installed even though it's a fun addition.As far as an amp, I have a little HoneyTone that has been feeling out of place alongside my very large amp arsenal, and just may have found a home, as it is about as small as you can get to go along with the Travel guitar.", "id": 611}, {"review": "A modeling amp will literally model existing Amps, Artists, and Songs from different years.This amp does not have on board song or drum loops like the Spider Jam.If you are trying to get a specific sound of a band or musician or place in time, then this isyour amp.If you need a practice amp, go with the Jam.I have both amps and as far as I am concerned, the Jam is a far better modeling amp as it does what the Spider 4 does plus drum and song tracks that you can play along with plus a whole lot more, even if it is based on the Spider 3 technology with a JM4 Looper as its engine.While the Spider 4 (I have the 150) is a nice amp, it is VERY SPECIFIC to the user needs and isnot that flexible.I do not agree that both amps are worthless without the foot pedals, as I used the Jam for a longtime without, and only acquired the Express pedal when I ordered the Spider 4.Also be very aware that the Line 6 documentation on their amps is very, very lacking, to put it mildly, and there so-called on line videos and user groups are just as lacking as their documentation.", "id": 620}, {"review": "Started to take guitar lessons locally to balance out the DVD's and books, and my teach used a clip-on tuner and my interest went sky high. (I am a professional drummer with serious guitar envy)All I can say is GOODBY JACK-IN TUNERS.With this little baby it makes no difference whether you are playing an electric guitar/bass or an acoustic, and you can tune on the fly with the thing clipped on to your headstock all the time. Admittedly you can do this with with a jack-in tuner without the jack-in part, but the results aren't always that good, and you have to fish around for the tuner.The whole turn the amp down, unplug from the amp, jack into a tuner, unplug from the tuner, plug back into the amp, turn the amp up process every time something sounded a bit off always soured me and brought down my enthusiasm while practicing/playing the guitar, but those days are over. I need to keep my enthusiasm level high, and actually play the guitar instead of fishing around for a tuner.As far as accuracy, it is as good, or better than any jack-in tuner I have (I have three different brands).", "id": 706}, {"review": "I use the amp in my shop when testing out new guitar configurations (Pickups) on the flyand then if it sounds OK go to the big boys in my blues room.The amp will reach its max in short order, but again, for what it is and the price, it ishard to find an equal.", "id": 721}, {"review": "These dual amplified speaker cabinets are something new for me, as I am used to the normal dual cabinet, one amplified set up like the Behringer MS16 which I was trying to replace with these, but on second thought will set them up someplace else, as they do not have front controls, have only one trs or XLR connection point, require AC power for both, and as P Frary has stated are VERY dependent on input; they kind of worked with my Stanton S300, and not at all with my laptop.They are (as stated by other reviewers) very subtle, and may take some getting used to. Because of the dual amps, you don't hear the sound travel from cabinet to cabinet, as each speaker cabinet is a stand alone unit.I actually hooked one up like a guitar amp, and it worked fine; just a little guitar amp that sounded great.For your normal Stereo mini jack and RCA hook ups, I would go with the much lower priced MS16's which have multiple RCA jack in points, and one Stereo mini and full front controls.Addendum: 10/13I finally hit a home run with these speaker when I hooked them up to Sony CD changer unit I have for the living room, dialed in the speakers, and put them both on one on/off switch.  The soundis full, and fills the room.", "id": 783}, {"review": "Just got three of these in today and compared one to a used Fender standard (one strap) bag I also got in at the same time.The Chromacast has thicker padding that is covered with cloth on the inside while the Fender does not go thisextra step. The Chromacast also has many more pockets.The specs on the Fender and Chromacast do not back up reality, as the Fender advertizes 12mm padding, and the Chromacast advertizes 10mm padding. Someone is not telling the truth here, and I think it is Fender.This is a good medium class gig bag, that falls somewhere in between a dust bag (like the Burswood) and a Deluxe 20-22mm padded bag.The only thing the bag is missing, is a hanger on the back which the Fender does have.Chromacast should get rid of the plastic (expensive) hand grip on the front of the bag and just sew on a hanger on the back like everyone else.This bag is good for in house, and light use (no throwing it around) transport.If you are gigging, use a deluxe bag, or a hard case.At $20.00, this bag is a steal!", "id": 863}, {"review": "Every once and a while I play the bass guitar and while I use the Snark for my guitars, itwill not tune the bass; this tuner does a great job of that task, plus the guitar.", "id": 885}, {"review": "I used this on my guitar Tone and Volume pots and it clears up the crackle.Feels a little oily, but gets the job done and you don't have to replacethe potentiometers.", "id": 14}, {"review": "As stated, I use the D'Addario 9s and 10s on all my electric guitars except for theGibson LP's and I use Brite wires on those.I like the D'Addario's over the Brite wires because they have color coded balls and thismakes changing out all the strings at once a lot easier.I do not produce a lot of body acid, so strings last a very long time with me, no matterwho the manufacturer is, and I play many guitars in my collection so none of them gets heavyuse.The EXL strings produce great tone, and are great for bending.", "id": 156}, {"review": "I have seven of these that I use on my Ibanez AM73's, but they are perfect for anyAM series guitars (like the 93).The bag is well padded, and not to expensive.It seems it is always on back order which tells me they are very popular.The dimensions are: 41\"L, 14\"W at Bout, and 3\" Deep. It has two large zippers; the head zipper goes all the wayaround, and the bout zipper stops before entering the bottom area which is the ONLY draw back to thisgig bag, as with ALL deeper guitars, you want the bottom (bout) zipper to at least complete the bottom areato make placing and removing easier.This is the best gig bag I have found in the last few years for the smaller bout guitars that does not cost too much.", "id": 311}, {"review": "I have both the Fender G-Dec 15 and the 30 and the Line 6 Spider Jam just blows them away.The controls are much more intuitive than the G-Dec line (like hitting the level buttonto bring the drum beat volume down so I could hear my guitar over it), and I was able to immediatelybring up whatever backing tracks, or drum beats I wanted and the only time I had to lookin the manual was to figure out how to change the tempo which is very easy.I only mention these capabilities to compare with the Fender line.Once you go further into the amp and get into the dubbing/recording it takes a bit moreeffort and the proper foot pedal.The amp can get really loud and I don't see why you could not use it to gig with as long asthe venue is no larger than a standard bar or side show.Since I have only had the amp for a short time, I can't say anything about how it will holdup, but I have 8 other amps by different companies, and the quality is just fine.By the way, I have a G-Dec 30 for sale???Addendum:The following is my take between the Jam and the 4 series, do with it as you wish.A modeling amp will literally model existing Amps, Artists, and Songs from different years.The Spider 4 does not have on board song or drum loops like the Spider Jam.If you are trying to get a specific sound of a band or musician or place in time, then the 4 isyour amp.If you need a practice amp, go with the Jam.I have both amps and as far as I am concerned, the Jam is a far better modeling amp as it does what the Spider 4 does plus drum and song tracks that you can play along with plus a whole lot more, even if it is based on the Spider 3 technology with a JM4 Looper as its engine.While the Spider 4 (I have the 150) is a nice amp, it is VERY SPECIFIC to the user needs and isnot that flexible.I do not agree that both amps are worthless without the foot pedals, as I used the Jam for a longtime without, and only acquired the Express pedal when I ordered the Spider 4.Also be very aware that the Line 6 documentation on their amps is very, very lacking, to put it mildly, and there so-called on line videos and user groups are just as lacking as their documentation.", "id": 466}]