[{"review": "The Danelectro FAB  series of pedals offer a great sound without digging into your budget.  The D-1 Distortion effects pedal works great and gives me that  mind blowing distortion you would only expect from a more expensive unit...  The only reason I didn't give it 5 stars is &#34; It tends to be a little noisey &#34;  if you turn the gain up too much.  You can get a noise filter to add to you pedal board that will take care of this and any other noise problems you may have.  This series of pedals ( FAB ) have hard plastic cases and less expensive hardware than the more costly units but works quit well.  Danelectro offers more expensive units but I don't think the sound is much better, just the hardware is better, but thats my view!!!.  You can't go wrong with this product, Danelectro has been around for years and makes a great product...I have six Danelectro effects pedals and they all work great...", "id": 280}, {"review": "The Danelectro FAB  series of pedals offer a great sound without digging into your budget.  The D-4 Slap Echo effects pedal works great and gives me that Old Tube Amp Reverb sound that you would only expect from a more expensive unit.  There's no fancy bells and whistles but just good old manual adjustments that lets you dial in the sound you want with no effort at all..  This series of pedals ( FAB ) have hard plastic cases and less expensive hardware than the more costly units but works quit well.  Danelectro offers more expensive units but I don't think the sound is much better, just the hardware is better, but that's my view!!!.  You can't go wrong with this product, Danelectro has been around for years and makes a great product...I have six Danelectro effects pedals and they all work great...", "id": 315}, {"review": "The Danelectro FAB  series of pedals offer a great sound without digging into your budget.  The D-6 Fab Flange effects pedal works great and gives me that wobble phase shift you would only expect from a more expensive unit...  This series of pedals ( FAB ) have hard plastic cases and less expensive hardware than the more costly units but works quit well.  Danelectro offers more expensive units but I don't think the sound is much better, just the hardware is better, but that's my view!!!.  You can't go wrong with this product, Danelectro has been around for years and makes a great product...I have six Danelectro effects pedals and they all work great...", "id": 316}, {"review": "The Danelectro FAB  series of pedals offer a great sound without digging into your budget.  The D-2 Overdrive effects pedal works great and gives me that soft growl fuzz that works well when playing the blues....  The only reason I didn't give it 5 stars is &#34; It tends to be a little noisey &#34;  if you turn the gain up too much.  You can get a noise filter to add to you pedal board that will take care of this and any other noise problems you may have.  This series of pedals ( FAB ) have hard plastic cases and less expensive hardware than the more costly units but works quit well.  Danelectro offers more expensive units but I don't think the sound is much better, just the hardware is better, but my view!!!.  You can't go wrong with this product, Danelectro has been around for years and makes a great product...I have six Danelectro effects pedals and they all work great...", "id": 355}, {"review": "The Danelectro FAB  series of pedals offer a great sound without digging into your budget.  The D-8 600Ms Delay effects pedal works great and gives me as much delay as I need .  There's no fancy bells and whistles but just good old manual adjustments that lets you dial in the delay you want with no effort at all..  This series of pedals ( FAB ) have hard plastic cases and less expensive hardware than the more costly units but works quit well.  Danelectro offers more expensive units but I don't think the sound is much better, just the hardware is better, but that's my view!!!.  You can't go wrong with this product, Danelectro has been around for years and makes a great product...I have six Danelectro effects pedals and they all work great...", "id": 716}, {"review": "The Danelectro FAB  series of pedals offer a great sound without digging into your budget.  The D-5 Chorus effects pedal works great and gives me that soft phase shift you would only expect from a more expensive unit...  This series of pedals ( FAB ) have hard plastic cases and less expensive hardware than the more costly units but works quit well.  Danelectro offers more expensive units but I don't think the sound is much better, just the hardware is better, but that's my view!!!.  You can't go wrong with this product, Danelectro has been around for years and makes a great product...I have six Danelectro effects pedals and they all work great...", "id": 319}, {"review": "This Mighty Bright is  great!!!!  It clips to my music stand, has battery power or ac adapter ( included) and lights up the entire music stand with very little glare. If you need a light for reading music or for just reading, this is it.........", "id": 524}]