[{"review": "A nice concept that actually works, The cable is very nice, too with an adequate gauge. Try it out for yourself!", "id": 32}, {"review": "This tremelo pedal works nicely and it's great when you're playing through an amp without tremelo. Problem solved! The price was also very good.", "id": 39}, {"review": "I ordered these tuners for my Fender Blacktop Stratocaster (MIM). I just received these tuning machines today ... the pegs line up, so they drop right in. Remember ... the E-A-D are that tall capstans and the G-B-E are the shorter capstans ... it all works out. I've also put 5 springs in the block (I like stiff tremelo, bridge flush to surface) and replaced the amplifier knobs with conventional Strat knobs (had to get CTS split-shaft 500K pots for that and replace the solid shaft pots). The amp knobs they use get in the way of the tremelo bar. BUT, back to the tuners ... they just made this guitar perfect with holding tuning. Much easier and faster to change strings.I just ordered another set for my Strat H-S-S ... great guitar but could certainly use these tuners.", "id": 387}, {"review": "I bought two sets of these for two of my Fender 4x10 bass cabinets. I slipped them right in using the original Fender screws since they're machine screws (EB comes with wood screws). Very solid.", "id": 542}, {"review": "As with all Boss products, I've been very happy. The tuner is easy to use ... need I say more. I'm from the olden days of the 440 tuning fork for tuning, so this is GREAT!", "id": 647}, {"review": "The reason I stopped using amp stands was because I couldn't find anything collapsible and non-bulky. It works very well and is very sturdy ... I use it for a Hot Rod DeLuxe.", "id": 653}, {"review": "In a world of round wound strings, flat wounds (the original bass starings) aren't as popular. These are nice and bright ... love 'em!", "id": 664}, {"review": "Very durable cables ... I've used them all. Fenders aren't bad. I have used these without any problems whatsoever! See for yourself!", "id": 803}, {"review": "I've noticed that the two-button tremelo/vibrato pedals for the Fender Deluxe Reverb re-issue and Twin Reverb re-issue break down pretty quick. This replacement, so far, is hanging in there.", "id": 563}]