[{"review": "Oh Yeah, Love this item, sleek looking and very easy to maintain, would definitely buy again for next strap, thank you Jim Dunlop.", "id": 44}, {"review": "I bought this thing not thinking I would use it too much, but wanted it for future use, I was wrong, no more misplacing picks for me. Highly recommended, also fits on my guitar stand, very cool.", "id": 70}, {"review": "I really like this cord, it rolls easy, its long, and its got a great powdery feel to the material. I suggest having multiple of these so length wont be a problem, got 6 of'em myself, all sound great, (Right angle or Straight).Great buy, cant go wrong here.", "id": 168}, {"review": "Oh man am i glad I found this deal, no more $8.00 for strings anymore, there the exact same as you would get from the store, delivered through USPS, dont have to go anywhere, how cool is that, 5 out of 5 Stars, but of course, its ERNIE BALL.", "id": 226}, {"review": "Well, here's what i have to say, this strap is much shorter than im used to, but seeing how I bought this for an off guitar, that's ok. They really should put the length in the description, the length is 53\" max, where I like my straps to be 64\" max.It is a hard strap to get on the guitar, (I do not suggest getting this strap withDunlop Dual Design Straplok System, Nickel), these are great locks, BUT almost impossible to install on this strap.Overall great buy for a cheap little money saver.", "id": 285}, {"review": "Ive Been Using This Item For about 3 weeks now, and I love it. I Have a homemade pedalboard, the one spot combo is good for it cause its kept me from having to mount a power supply on the board. I power 7 pedals and Absolutely no noise distortion comes from the pedals with this hooked up, If anything it sounds better than a battery, FOR SURE.", "id": 428}, {"review": "WOW, I got more than I expected from this Chromatic Tuner, Sure it's a plastic case, but who would be rough on a pedal anyways, had it about 3 weeks now, and im impressed, I see people say the blue indicator light is too bright, but truthfully, its OK, because the tuner lights are plenty bright enough, if it is too bright for you, just put a little piece of black tape over the light, but like i said its OK cause you can still see the tuner lights, I use this pedal with theVisual Sound One Spot Combo Pack, works like a charm.", "id": 443}, {"review": "Oh Man, My Guitars have a new home, love this stand, looks nice and works excellent, currently I have a Strat Style guitar a bass and a Epi Les Paul hanging on this baby, but even with just one guitar it holds up just fine, No unsteadiness, no wiggling, Big space saver, definitely a Good Pick, Great for home use or on the road, it folds up nicely, great padding on heads and body supports, 10 out of 10 on this one.", "id": 516}]