[{"review": "For the price, can't beat it.  Works as well as any $15 - $20 one I would have bought at local guitar stores.", "id": 12}, {"review": "When I first saw this item I wondered:  Why is the regular guitar version $6.99 and the bass version only $4.99?Suddenly an amazing clarity came over me and I realized-- the bass version only has to tune FOUR strings instead of six.  So it costs less because we don't need to use it as much!But then I remembered there are 5 string bass guitars and I thought, okay... shouldn't they have a $5.99 one for 5-string bass guitars?Sadly the universal clarity became even more muddied when I realized with some dismay that there are even 6-string bass guitars.  Will this even work on a 6-string bass?  After all, that's 2 more strings than its intended purpose!These perplexing questions aside, I find this to be an excellent and ideal tool.  Its function is three-fold:1) String winder2) String cutter3) Peg pullerSo no more running for the wire clippers to pull a peg or cut a string.  All the tools you need to change strings are in this one reasonably-priced tool.  Made by D'addario, the quality lives up to the brand.  It's solid, the wire cutter and peg puller well designed.  It does everything it's supposed to do, does it well and is of good construction.PROS:  Good strong well-designed unitCONS: The winder is held on by a single screw and there are numerous reports of that screw coming unscrewed during use.  I would recommend putting a drop of super glue down in the screw thread area to secure the screw and prevent that happening. Because of this design flaw 4 stars instead of 5.I note that there are reviews here as old as four years... and it appears this device has undergone design changes during that time.  Some say the head bowl is so deep it can result in scratching of the guitar head.  Others report it being so shallow it slips off the keys.What I believe is that it is a mistake to sell the BASS and STANDARD GUITAR version on the same page.  From what I can deduce from the reviews, it appears some folks have inadvertently purchased the BASS guitar version, which does indeed have a wide and deep cup, and did not realize it.  Imho, the two products should be listed on two different pages for clarity.  It's obvious from the reviews that some folks have accidentally purchased the wrong unit.Some have reported the peg puller being \"metal\" and scratching the bridge.  The one on mine is vinyl and while it is hard enough to scratch the bridge if one isn't careful-- the same holds true for needle nose pliers.Bottom line is there is some responsibility of the user to pay attention to what they're doing, don't get in a rush, and be aware of the need to protect their instrument while using ANY modification tool. I suspect if one is going to get in a hurry and try to change strings 0 to 60 in 5 seconds... they may wind up damaging their guitar.  Turn on the light, put on reading glasses if necessary to see... and take your time and this device should work fine.  Be aware when reading reviews that many seem to be out of date (dunno why the company didn't simply start a new listing when redesigning the device).", "id": 94}, {"review": "Regardless of the string itself, I insist on honesty in advertising and marketing.  So when I was earnestly considering ordering this string I read the summary, in which it was stated:\"Elixir Strings are coated in a unique way to protect wound strings from your DNA and other contaminants.\"Ohhhh... protects my string from DNA!  Yeah, that DNA really messes up guitar strings all right.  In fact it's the worst contaminant EVER... worse even than the oils and acids on our skin... worse than the cells themselves that contain and hold the DNA from exposure because the DNA is the blueprint of those cells, contained deep within protective walls.  But somehow that nasty ol' DNA leaks out and contaminates our guitar strings!Honestly.  It's like none of us have ever attended a biology class because we're musicians?As I read the reviews, I noted review after review after review that seemed like some sort of marketing promo.  I noticed not one of those reviews indicated they had actually purchased the product from Amazon.  Hmmmm.The first honest review I found was one which said, \"These strings sound somewhat artificial.\"  Ah finally, one of the REAL reviews.Look, the product may be good or not.  It may be the best string ever or not.  But am I going to spend time and money testing a string that apparently can't stand on its own quality without bogus marketing hype?We're musicians, not morons.  If you want us to buy a string, be totally honest in the marketing.  A quality string will sell itself by performance, sound and long life.  No matter how heavy the marketing hype, if the string is bad you'll only sell one set.  If it's good... you don't need the hype.EDIT FOLLOW-UP:  After reading numerous reviews, this does actually seem to be a good set of strings.  Which means the product can stand on customer testimony alone and shouldn't need spin to sell.  Just sayin'.  ;)", "id": 103}, {"review": "One doesn't get much better than D'Addario strings.  In my opinion they're twice as clear as Martin strings and the EXPs just last forever.  I like the standard Phosphor Bronze just as well and use those as a less-expensive alternative.I certainly recommend D'Addario nylon strings on classical guitars.  I've heard no other string that has the crisp, clean, rich sound of this brand of strings.  I've used them for years and once in a while give in to the temptation to try another brand... but always come back to this one.Different diameter strings will sound significantly different, depending on the guitar you use.  I prefer this mid-range string set for overall depth of sound and mellow beauty of tone.  Any lighter and the guitar sounds \"tinny\", any heavier and I fear strings putting undue stress on the neck.  These are \"just right\".", "id": 130}, {"review": "I usually play classical (nylon string) guitar, but have an Ovation deep-bowl acoustic electric as well and after the original strings wore out, I never have found strings that I really liked (don't ask me why I never thought about contacting Ovation and asking them what they use from the factory.  One of those duh things I didn't even think of until just now).Based on reviews and questions answered here on Amazon, I purchased this triple-set of strings.  Instant gratification.  First, they tuned up quickly and retained their tune on a relatively respectable basis (no new string holds tune perfectly for the first couple of days, but these retained tune fairly well).  The sound is excellent, the playability comfy.  The tone of my Ovation was back.Here are my itemized observations:* First, three sets for $13 (currently).  Cannot beat the value for price.* BRILLIANCE.  What many people call &#34;bright&#34;, brilliance is the opposite of &#34;dull&#34;.  Some strings sound dull right out of the package.  These strings are brilliant, bringing out the full tone and maximum volume from the guitar.* TONE.  The natural tone of the guitar is allowed to shine through, no hint of &#34;tinniness&#34;, &#34;plunk&#34; or &#34;twang&#34;.* MELLOW.  Mellow is difficult to define, but the best definition I've heard is, &#34;Ah, that sounds nice.&#34;  Mellow is a string settling into a guitar and becoming part of the guitar.  It's a pleasantness that doesn't grate on your ears when you pluck a string.  These strings are medium-mellow, just enough to allow one to enjoy the sound without falling asleep.  : )* BALANCE.  At first the E overtoned the b and e.  But as the strings settled that became less pronounced and the strings balanced right out.  The trebles became clearly audible while the E and A provided just the right touch of bass.* COMFORT.  The 12-53mm diameter of these strings is comfortable to the fingers.  Thicker strings are often more difficult to play and can even damage some guitars.  Lighter gauge tends to cut into the fingers unless the guitar has excellent action.  These strings are just right-- especially the 53mm E, which provides the proper amount of bass without overkill or difficulty in strumming.SUMMARY:  These are excellent strings, which doesn't surprise me since I've use D'Addario classical guitar strings for years.  Martin and GHS are both good strings, but somehow D'Addario just shines.Thanks to Amazon enthusiasts who helped me decide to give these a try.  Highly recommended.", "id": 198}, {"review": "This string compares significantly to the Pro-Arte string.  The sizes are the same but it costs a buck or two less.  It's so similar I contacted D'Addario to ask them what the difference was.  They stated the Pro-Arte strings are made of a better nylon and to more stringent specs... but in all honesty I wonder if the strings aren't identical but these marketed primarily to students and schools as a more economical string.Whatever is the actuality-- both sets are of quality manufacture.  They're D'Addario... and D'Addario never produces junk.  Their cheapest string is as good or better than more expensive strings in other brands.  I've never used a set of D'Addario in any classification of guitar that I didn't like.For those who are curious, I'd recommend doing what I did:  buy a set of these and a set of the Pro-Arte (they're both pretty inexpensive) and compare and see which you like best... or if you like both equally.  I think it would be good to get several reviews here of such a test between the two grades.  Whichever set one ultimately chooses, can't go wrong with the quality/price ratio.", "id": 201}, {"review": "I notice mixed reviews here.  I suppose when an item sells for $2 instead of $20 there may be a potential for quality control issues.  But hey, buy 3 of them and if even one turns out to be bad, you're still way ahead on the deal.  Seems to me as good as any connector I've ever bought.", "id": 248}, {"review": "I've tried several &#34;portable amps&#34;.  For the price, the HoneyTone can't be beat.  It has volume, tone and overdrive knobs (the overdrive can go way too over, so easy on that one).  Comes with a battery but can be connected to a 9v adapter (important note: reverse polarity, negative central).  Interestingly I have found this amp seems to work significantly better with acoustic-electrics or piezo-based pickups better than magnetic pickups.  But for a small, portable, light-weight practice amp which one can hook to a belt and attach an earphone... they don't come much better.  It has a belt clip on the back but you'll have to supply your own earphones and 9v adapter if you want them.  Battery is included. Of course a guitar cable is a required extra.Well worth the money.", "id": 303}, {"review": "I've played guitar for some 35 years and have found D'Addario strings to be of consistently good quality.  They are one of maybe three companies I trust to manufacture a good set of strings no matter what classification of instrument.  Whether classical (nylon), acoustic (brass) or electric (nickel)... their strings produce excellent sound and are durable.Like any string, one needs to match size and construct to personal playing style.  That comes through reading reviews and quite often, simply testing.  But I've never played a set of this brand that I didn't like.  They always provide vibrant tonal quality.And no I don't work for D'Addario; just a long-time fan. : )", "id": 349}, {"review": "Item body is plastic rather than metal. This is to be expected at this price.  I would not call it \"sturdy\" but at least it's $25 instead of $125, and it works.  Professional musicians may not be impressed as there are some occasional noise issues (as I've found to be true with many Behringer products).  Nevertheless for what it is... it works reasonably well.Received this item in good time.  There's only one real dislike I have about the item:* The battery access is... goofy.  To access the battery one must take the foot pedal off by \"inserting an ink pen into the hinges\".  Two hinges, two hands... a tricky process at best.  Not the easiest battery access I've ever seen.  However to be fair, relatively minor issue and not insurmountable.  I became relatively skilled at it in short time.Initially the product didn't work.  All I could hear was static out of the amp and thought I had a defective unit.  But then I noticed the gain was turned up right out of the box.  Turned it down and the sound got much better.  Traced an additional problem to an old unshielded guitar cable; replaced that with a good one and sound smoothed out.This is a sensitive unit, with a wide gain and tone range.  It has excellent Bass and Treble tuners.  It did seem to be somewhat sensitive to movement noises so apparently there is no noise filter of any kind in the box.  Jiggling of guitar cords could cause static and cut-out.  That could be cord issues or box issues.  I'll experiment more later.It does have some hiss that is easily audible in a room environment.  Behringer seems to have a problem with hiss in their products, dunno why.  But once the sound comes out it's difficult to discern the hiss; it's not extremely loud or annoying... it's just there.Bottom line this is a cheap unit at a cheap price.  It does the job and should work fine for most instances where such a device would be needed (such as with passive pickup--non powered acoustic instruments).  I'd recommend it for those who need such a thing simply because of the relative ease of use (foot petal on-off switch) and the relative low cost.It's just so-so in my estimate, but in some cases so-so is good enough. : )", "id": 382}, {"review": "The HoneyTone is aptly named.  It has a long reputation for having excellent sound for its size. That reputation is earned.  It has double the volume of a portable amp I own that's twice its size.  The tone range is generous (from mellow to high treble).  From what I've seen and heard, the &#34;overdrive&#34; function is fairly useless in an amp this size.  It tends to go distortion to the point of garble.  My guess is specific guitars may work well with the overdrive, but I have no use for it as I prefer clear tones.  It is possible to over-volume the amp (as with any amp) so i don't max it out, but for a portable or practice amp, it works very well.  I've bought three of these now and plan to buy more.  I don't know as I'd pay $40 to $60 for it, but the Amazon price (currently around $20) makes it a great value.  I hope it's around at this price level for a long time as it's great for hobbyist projects or for box guitar amping.", "id": 605}, {"review": "I purchased this instrument brand new, on an impulse whim due to a managers-choice sale at a local music shop that I simply could not ignore.  It was brand new, unopened, in box.  They allowed me to examine it prior to purchase. In that environment I thought it a nice instrument.However, it can be difficult to properly examine an instrument in a busy store, and that store was VERY busy and noisy.  It's when you get it home and can examine it leisurely in peace and quiet that the details stand out.This is indeed a 6-string ukulele.  It measures a bit over 28\" top to bottom and has the sound of a baritone uke.  I have heard throatier and more mellow instruments in the same price range.  The advantage to this of course is it's 6 string, so if you're a guitar player you can achieve the ukulele sound and portability without learning totally new fingering.... that is of course, until you realize that while it has 6 strings, it is not tuned like a guitar.  It's tuned to ADGCEA rather than EADGBE.  One cannot simply play guitar music on this instrument; all such music has to be transposed or new chord name recognition learned.  Being a total newbie to ukes, this was news to me until I got it home and read the instructions.  So my primary purpose in purchasing this-- to have a small portable guitar, hit a snag.Now that's not totally the end of the thing, because you can be a little inventive and use alternate string sizes to tune this to standard guitar tuning.  It takes a bit of experimentation but it is possible to set this up to standard guitar tuning if one doesn't mind buying a couple of string sets and playing mixup.  So all is not lost there.  It was just an unexpected surprise-- mainly because I didn't research the instrument prior to purchase (it's rare that I impulse buy).So tuning aside we get to the quality of instrument.  That's where the Yamaha really falls short.  This is an oil rather than a lacquer or shellac finish and in several places the oil was still visible and could be wiped away by hand.  There were a couple of glitches in the finish straight out of the box.  That this was a \"rush job\" out of a factory with no finish work at all was blatantly obvious.There are no strap pegs; those will require being added by hand (not difficult, but extra expense and time).The action is of course too high.  That's not unusual-- in truth it's quite common in off-the-shelf stringed instruments and came as no surprise.  But along with the other failures in workmanship it stood out here.However, the thing that bothers me the most:  if I wasn't aware this is a Yamaha Guitalele... I'd think it's was a cheap knock-off child's guitar.  There's not one thing about this instrument that says \"quality\"-- which is quite disappointing.  This instrument sells for about $100.  That low cost is obvious.  This is a \"cheap guitar\" in every way.  I can't honestly say it's a toy, but it reeks \"beginner instrument\".  The tuners are as cheap as they come,  the finish is cheap, there is no decoration, no protective edging. The finish is-- unfinished.I bought this solely based on the number of positive reviews here on Amazon-- and I respect those reviews.  People have different tastes and for some folks this has a \"home made\" feel that they will love.  However I've been playing guitar for (mumblety mumble) deca...uh... years and I know the difference between quaint and cheap.  I own two Ovation guitars, a Peavey electric bass, a hand-made violin and an Epiphone electric uke (which is of such higher quality it's not even a contest. And no I'm not hawking Epiphone.  Facts is facts, that's all.  You can read my very-positive review on the Epiphone on Amazon).When I got this  home and took a good look at it, I found no sign of quality or craftsmanship, nothing that said anything more than \"this was made as cheaply and quickly as humanly possible\".  In truth the only positive thing I have to say about it is that it does have a spruce top and the strings are of reasonably decent quality.Other than those two factors, one can find $40-$50 full-size guitars all over Amazon that equal or surpass this instrument in quality.  The only benefit this would offer is its smaller size and ukulele voice-- if someone particularly wants an inexpensive portable guitar tuned like a uke.  Other than its portability, I find no special merit in this and even at its relatively low price... consider it over-priced (or rather, under-made).One must grant it's largely a matter of personal taste and expectation.  But low quality is low quality.(Edit two weeks later:  I just today saw the Cordoba at a local store-- a direct competition to this instrument.  The Cordoba is MUCH nicer.  It's built better, has better sound, and is finished out much more nicely.  Sorry Yamaha, but facts is facts.  Had I seen the Cordoba and Yamaha side by side, I'd have bought and kept the Cordoba.)That's my honest review.  I know some will disagree.  But others know exactly what I mean.  This isn't an expensive instrument so one really can't expect super-fine quality at this price. However-- I paid about the same price for my electric uke and it is superb quality from top to bottom.  As mentioned, the Cordoba is a better instrument and costs the same.Fortunately the local merchant has a satisfaction guarantee and I was able to return it.  I simply cannot recommend this instrument unless there are no better options-- and frankly, there are.", "id": 747}, {"review": "First we have to realize this is not a $200 pickup or even a $50 pickup.  It's less than ten bucks.It has a specially-designed clamp that is good for attaching it to the sound hole of a guitar.  As such it is not going to work for an instrument without a considerable-size sound hole.  It also will tend to get in the way of those who play directly over the sound hole, as it is quite easy to hit and will pick up any contact noise.It is more sensitive than cheaper competitor devices.  Unless you run it directly into the amp within a distance of 8 ft you are also going to need a 1/4\" to 1/4\" coupler (to allow it to connect to an extension guitar cord).  You will need such extension as this tends to have significant feedback issues if the amp is too close or facing the guitar.It is a passive pickup, so you will need either an amp with a passive-specific input or a preamp mixer or other preamp device. If you don't have a preamp system, this will do you no good.So because of the limitations I rate it as above.  For what it does though-- providing a passive pickup that can be quickly switched out between instruments, it does okay.  I believe there are better pickup concepts out there for about the same amount of money, including adhesive-disk mikes.  I would prefer to permanently mount a pickup of some kind and there are many low-cost pickups out there to choose from.  But this is a slightly different concept (removable) that for the price is worth checking in to.", "id": 759}, {"review": "This is a cheaper alternative to the &#34;String Swing&#34; wall mount-- considerably less expensive.  It works fine.  It's easy to mount, easy to adjust and holds the instrument well.  The only downside is that the wall anchors aren't the heavy-duty plastic screw-in types but the smaller drill-a-hole-and-hammer-in-place types, which are neither as convenient nor as solid a mount as the others.  Of course you can always purchase a couple of screw-in heavy-duty mounts and you'll still save considerably.This of course doesn't have the beautiful hardwood finish of the String Swing.  For the lower price you get black plastic.  But it's sturdy enough, it looks fine and it does the job.  If it had sturdier wall mounts I'd give it 5 stars.  As it is, the cheaper and less-trustworthy mounts bring it 4 stars and a nod for being an inexpensive alternative. It is great for hanging ukuleles and mandolins and with sturdier screw-in mounts, should hold any size guitar.", "id": 779}, {"review": "This is a product that is unique, tiny and would be very useful-- if it were more accurate.  The problem is it's just not responsive enough.  To get it to work one has to place it low on the headpiece (next to the nut) and strum a string pretty loud for a consistent register.  Placing it at the top of the headpiece it simply doesn't pick up enough string vibration to register well.The problem with placing it next to the nut is that it then makes it impossible to hang the guitar on a wall-mount guitar hanger.  That may seem like a small issue... but not if you use such a device regularly (as many home-players do).  Myself, I have 5 guitars hanging on my living room wall.That doesn't make this valueless.  You can always clip it on the top of the headpiece and then move it when you're ready to tune.  Thus I give it 3 stars.  However there are other more responsive tuners, such as the capo-tuners we've seen on Amazon lately.  They're about the same price (actually, the capo tuners are a bit less-expensive) but I've found the capo-tuners to be considerably more responsive.So bottom line, I'm not impressed.  These aren't an expensive tuner comparatively speaking, and that's good.  But they' really don't do all that great a job.  They're unresponsive enough that I honestly think a person might break a string before realizing the tuner isn't responding to the current string pluck.Note to Ovation guitar players:  this is not the clip-on tuner for you.  There's simply no place to clip it.  Fortunately my Ovation has built-in tuning, but if you have an Ovation Acoustic, you'll want a different tuner.", "id": 785}, {"review": "* SHIPPING.  The Epiphone comes wrapped in  protective foam, inside a gig bag, which is inside a sturdy standard tri-shaped box, which is itself shipped inside a HUGE box twice its size and totally surrounded by sturdy bubble plastic.  That huge box is then inside yet ANOTHER huge box.  Honestly, to protect this better they'd have had to contact Tony Stark.  It would take real skill and intent to damage this thing in shipping.  EXCELLENT job.  5 stars on that alone.* SIZE. Overall length 24\".  Fretboard 10\".  Nut to bridge 15\".  So good overall medium-size.  I like that it's a bit larger than a 20-21\" soprano uke.  It is \"concert\" size (which I greatly prefer over soprano.  Frankly, I'd like to see a baritone version).  The 24\" length is an excellent size for both adult and youth / child fingers.* QUALITY.  From stern to port, this instrument shines.  Beautifully lacquered flawless finish, protective edging, plastic finger-guard (which itself was guarded in adhesive plastic), solid neck screw-joined to heavy-wood body.  The whole unit is heavy-wood and very durable.  Nevertheless the sound is quite good.  The tuners are acceptable quality (nothing amazing, but they work well).  The frets are actual metal and not molded into the fingerboard like cheap ukes.  The amp-jack is chrome-metal back-plated to the body; it's NOT coming loose.  Strap holders are already mounted, saving users the hassle.  And of course, the impressive EPIPHONE and LES PAUL signature stamps on the head for sheer class.* SOUND.  I found this to sound as good as most ukes right out of the box, despite the fact it's pretty solid-wood electric (I expected it to sound dull.  It doesn't.)  But I still bought a set of d'Addario strings (a brand I've loved for years) and according to other reviews here expect the sound to improve significantly once those are added.* ACTION. I've rarely seen a purchased instrument that has perfect action off the shelf and this is no exception. The action is fairly high (not uncommon with off-the-shelf instruments).  One will need to remove the strings (keep them for emergency spares), file down the bridge bottom (easily done with a flat surface and sandpaper) and add a new set of quality strings.  I'm a perfectionist when it comes to action (as are most players I know), so this will be tweaked.* DURABILITY.  It's very durable.  That counts for the gig bag too.  No cheap \"tent nylon\" there-- but thick nylon that will really resist tearing.  As others mentioned I'd still look for a decent hard case; they average under $40.  A good instrument is worth protecting.  But I'd say this could take some real punishment and still play well-- not that I'd go bashing it against a stage floor.  That would be goofy.* WEIRD SUGGESTION:  Hang on to the box it comes in.  It makes a great temporary \"hard shell\" case. It's made of rather sturdy cardboard and does a pretty good job of protecting the uke.  Great for hauling around in your car if you can't shell out for a shell. Seriously... that is some stiff cardboard.  Protects well.  : )* ELECTRONICS.  The sound is clear. Sadly there is no volume/tone control, no battery to preamp, and thus the signal to the amp was quite low.  They could have done better on that end.  But wow, at this price how can one gripe?Two solutions to this:1) Open up the end plate and totally replace the electronics with something better (including a tone and volume knob somewhere accessible).  That's the tricky way.2) Put a preamp on this. You can buy one here on Amazon for about 15 bucks. If you have a mini-mixer you can do the same thing with that.  Even with that little extra expense you'll come out ahead.Aside from the passive electronics... this is a PRIME instrument.  It is a mid-size uke so you can choose to string it either as a soprano (if you're careful and don't tune it too quickly) or a baritone (guitar 4th - 1st string, E-high), depending on the strings you choose.Considering what you get for the price... I don't think this can be beat.  Unfortunately, my extra-long fingers find this very difficult to play... something I didn't consider when ordering a uke.  But that's a physical difficulty and no fault of the instrument.  The product itself is excellent.", "id": 814}, {"review": "I see mixed reviews here.  At this price, no telling what the quality control is like but as I wrote in another review on this type of item, you can buy 3 of these and if one fails, you're still ahead of the game.  They're so much less expensive than what one will typically find in a guitar or electronics store, well worth taking a chance.  Mine seems to be fine, doesn't look or feel flimsy at all.  I can't see any difference between this and what I buy in a retail package.", "id": 249}, {"review": "After reading numerous reviews talking about the exceptional volume and tone of this amp, for the price (about $16-$17) I had to try it.When I plugged my acoustic into this, I was very pleased to find those reviews are accurate.  First, let's not expect $500 double 16&#34; sound from a portable 9v amp.  Once that reality is recognized, it's realized this puts out far better sound than one would ever expect from an amp this size and price.I would note that the sound you get out of this amp-- as with any amp-- will be directly relational to the quality of guitar and pickup you're feeding from.  I tried this on three different guitars and each one sounded significantly different.  One had very rich tone, another sounded &#34;tinny&#34;, another had a passive pickup and required I turn the HoneyTune up quite a bit more than the one with active pickup.  So it won't sound the same on every guitar.That said, if your guitar has good tone and your pickup is good, this amp is simply awesome.  I've had it only one day so I haven't put it through the test of time... but first-impressions are that I will buy more of these in the future (I need more than one portable amp).My sister visited and heard it right after I opened the box, and she was impressed as well.  Neither of us expected this kind of sound from such a small amp.  And I have to say, the aqua color is major retro.  Gotta luv it.I've been looking for &#34;the&#34; portable amp for some time.  This is the best I've found to date and the value for price is a perfect balance. I don't know as I'd pay the $40-$50 for this guitar shops often ask, but the Amazon price is perfect. : )One last thing:  Danelectro branded 9v battery included, same color as the amp. Priceless.", "id": 302}, {"review": "PROS:* Small. Easy to take with you or set on a small shelf.* If using USB, does not need external power supply.  Very convenient.* Easy-to-use, accessible controls.* Pre-amp power, works well with condenser studio mikes.* Plug & play with Windows 8.  Didn't have to install any kind of driver.* Variety of input options.  Dual track with low/high volume sliders.* LEDs make it easy to tell whether in the green or red range.  Easy to adjust.* Awesome for those who need a mini-mixer-- and costs the same as a USB-based preamp-only device.* Free shipping-- gotta like thatCONS:* Only one power setting, 15v. That may not be enough for some, but works great with my studio mike.* Line In / USB buttons somewhat confusing, non-intuitive.  However the manual shows exact settings for computer use.* As with other low-end Behringer mixers has a bit of a hiss that one has to balance out.  Can take some fiddling to overcome it.* It's pretty easy to overpower the computer's input and cause distortion.  Start the sound levels at zero and slowly bring them up until it sounds good.NOTES:I purchased this for use with my studio mike, which I hadn't been able to use with my computer due to pre-amp power needs.  Plugged it in, worked first time, no problems.This unit is very sensitive.  If used with a decent mike can pick up background noises from across a room.  With a bit of tweaking, is fine for studio work.  I use it for guitar/voice solo live Internet music shows.Overall, I'm quite pleased with the unit.  The only reason I give it 4 stars rather than 5 is because it isn't perfect... but then it's only fifty bucks.  For the price, overall quality, ease of setup, range, sensitivity and plug-and-play, I don't think one could find a better unit.  Two thumbs up.  I don't know how a Pro would rate this... but I definitely would recommend it to those doing recording on their computer with a studio-quality mike above the quality of the average \"USB microphones\" available on the market.  You not only get a pre-amp but a duo-channel stereo volume mixer in the deal.  Hard to beat at that price.ADDENDUM:  A few days after the initial review-- I just used the device on a live guitar/voice webcast.  No background hiss, very good, clear sound, crisp, no distortion, excellent transmission.  Friend recorded a video and the sound was precise and identical to the original performance.  Quite pleased with this little mixer/preamp.HINTS AND TIPS:Two good hints on this one:* Another user and I put our heads together and realized one can use a 6-volt lantern battery (or 3 to 4 AA cells), hook them into a USB printer cable and power this via battery.  It works great and makes this unit PORTABLE.* There are reports of this mixer interfering with the way the Windows handles sound. I have found this to be true. It pretty much takes over your entire sound system. For some folks this will be fine. For others, they may not appreciate this. So what I did was uninstall the drivers, remove it from the computer USB (which seems to defeat the purpose, but wait...)... and plugged it into one of those new portable-USB power supplies you plug right into the wall (they're available all over for between $5 and $10). This powers the system without hooking it into the USB system of your computer. What this does is allow you to use the functions of the mixer without altering how Windows handles sound, the programs it uses, or causing problems with programs like Audacity.You then run a LINE IN from your computer speaker output, a LINE OUT to your computer speakers or headphones, and you can still use microphones or whatever else you want. This is an excellent alternative to using it as a USB device. You are instead powering it from a USB wall-socket and simply using it as a quality mini-mixer (which function it performs very well). That's what I finally did and am still most happy with this device.In addition by using it in this manner you pretty much eliminate the relevance of what OS you use. You could use this with Windows, Mac, Linux or pretty much anything, because all you're really doing is setting it up as a mixer using standard line-in / out cables. Works very well in this capacity. Gotta love those new external USB power nodes. : )", "id": 782}]