[{"review": "I originally bought this for my guitar and it worked very well for that, so I tried it out on my 4 string uke and it works just as great. It's so much better than the elastic capos. So, it's doing double duty and going strong.", "id": 25}, {"review": "I love this guitar strap button. It's a great alternative to the invasive buttons that have to be screwed in. I actually purchased it for my newMahalo U-35PK Sparkling Soprano Ukulele Outfit in Pink. It works well for it's stated purpose and appears to be of high quality. The leather is nice and soft and the button fits snuggly into the leather hole. Check out my user name stinkylungs on Youtube to see a video I made of me installing it on my new uke if you want to see it up close.", "id": 122}, {"review": "I replaced the factory strings on myDean Playmate Avalanche Junior Solid Body Electric Guitar, Metallic Silver, 3/4 Sizeand what a difference in sound.  These strings seriously rock.  I also use D'Addario strings on my ukulele and I've had great luck with those. They withstand a lot of play and I don't have to replace them often. The best part is, the sound is so much brighter and louder.  Definitely recommended.", "id": 156}, {"review": "First off, I'm NO ukulele expert. That being said: I replaced the original strings on my newMahalo U-35PK Sparkling Soprano Ukulele Outfit in Pinkwith these. I know they stated Concert, however, reading up on this, they can still be used on a soprano or standard uke. Immediately I noticed a difference in sound on these strings. Like another reviewer said, it's not going to perform miracles on a cheap uke, but it sure helped out a lot. The sound is quite a bit louder and so much brighter as well. I'm loving the sound. Also, I really like the way they look on my pink uke; it's a nice touch.  I would definitely recommend these.", "id": 203}, {"review": "The Squier Bullet that I have is actually the model without the tremolo, however, everything else is just about the same as the model you see above. It's a nice guitar for the money. Nice size, action, and finish. It's not a high-end guitar so don't expect it to sound like one, but for a beginner, it's pretty sweet. I bought a more expensive blues guitar and had planned on trading this one in or selling it, however, I like it so much, that I plan on keeping it as a back up. Parts are pretty easy to come by (with slight modifications, but that's to be expected) and fairly cheap too.", "id": 555}, {"review": "I own several small tuners, including the Enote nano tuner and the Snark. In comparison to those, I would say its most like the Enote when it comes to size, but definitely more accurate and responsive.  In comparison to the Snark, its not as quick to respond but still does an adequate job tuning.  Its a great size and fits nicely in the pocket of a gig bag and isnt quite as large as the Snark. Anyway, it all comes down to preference I suppose.  I would recommend it.", "id": 785}]