[{"review": "I knoew I did not want any holder that took up too much room in my music room, not did I want something that would tip over if I blew air on it. My instructor of the guitar suggested I really read the information about all of the holders and then make my choice of the one that seemed to be light-weight yet sturdy to not fall over, looked professional, and could be the possibility of THE one I would recommend and purchase again. I really like the stability of the one I bought.", "id": 92}, {"review": "I was taking lessons from a very qualified instructor and he mentioned that I need a humidifier for my guitar. At first I was not sure what I was looking for. I found the product without too much difficulty. I had learned from my instructor that these are small, placed on the hole of the guitar, and was definitely needed to keep the guitar in good playing condition. I started looking through the computer pages and settled on the Herco Guitar Humidifier because of the recommendations of thew product. Now I feel I made a wise choice and will be able to keep my quitar playing good vibrations, and good music!", "id": 314}, {"review": "duriong my lessons, my instructor talked about several models of tuners that a guitarist can get. Some are old time one still with a kick, and the one he recommended was the Snark. Nor the shark, and that is what I thought he said when I first heard it. There were several kinds of tuners and I was looking for a good quality, made of sturdy materials, and was in a good price range. The snark I chose has been working just great for me.", "id": 706}, {"review": "After taking my guitar lessons...I never knew there were soooo many kinds of flexibility or thickness of picks for guitars. My instructor told me that I need a variety to see which one or two felt good in my strumming hand, and to see if I could pick out some melody's without too much problem. I realize the pick is not magical that it plays with out me doing the work, and I have been having fun trying all sorts of sizes, flexibilities, and strengths. Just go for the gusto and find what you like!", "id": 879}, {"review": "Works really well, was a great price, and was sent to me in reasonable amount of time. The capo is a nice addition to the terrific sounds one can get with the guitar.", "id": 808}]