[{"review": "For the price, fantastic.They do feel light and I don't trust the build quality at the key stress points (where cable meets connector), but then again I am not going to push it.Set your guitar down on it by accident when it's plugged in and...who knows.But for seven bucks it gets the job done. Recommended if you are doing the \"beginner\" thing and testing the waters.Otherwise, spend a few more bucks for something with higher chances of lasting.", "id": 6}, {"review": "These just sound great. Huge upgrade from the stock factory strings on our beginner Ibanez electric guitar. Good stuff, will certainly come back for more when the time comes. Cheap for what you get, and a nice sonic upgrade with a great feel.", "id": 226}, {"review": "I bought this and a Hohner Special 20 key of C harp to test them both out. This harp is a great harp, pretty much the exact same as the Hohner Special 20 in overall quality. \"Feels\" a little more airtight, brighter and louder than the hohner, but in side-by-side testing the effect is diminished.The Hohner Special 20 just seems to have this little extra...expression to it. More life or something.Both harps very bendable, etc. Real high quality.As for the replaceable reed plates...Amazon has this harp marked down to about the $25 level. Reed plate replacements are about $19. Now I realize that at retail that's half the price of a RETAIL harp, but only $6 less than a \"whole new harp\" otherwise.With this in mind, I would generally recommend beginners start with the Hohner Special 20. Just a slightly better or at least more fun-sounding and fun to play harp with a little more animation and expression available \"free\", in my opinion.", "id": 421}, {"review": "These will pluck Guitar and Bass strings decently. If you want one set to cover both applications, this is a good choice.", "id": 61}, {"review": "Feels great, sounds great, there's a little bit of magic in these strings. High quality classics add a touch of class to your sound.", "id": 93}, {"review": "We bought three of these and they are just great. Mounting holes are drilled right, screws pass right through and fit perfectly. Comes with big, beefy drywall anchors and feels just right. Holds the guitar out at a safe distance. Highly recommend this over the other (way cheaper looking) ones that are a few bucks less. Spend the extra few bucks on these and SMILE.", "id": 166}, {"review": "Spend a few more bucks and get a padded one. This one is comfortable for 10 mins then it's cramp time. Just save yourself the hassle, this one is too cheap to return and while it's \"OK\" it's not great for long-term playing.", "id": 208}]