[{"review": "...but for a small woman with small hands, it's difficult to operate.  It also exerts a whole lot of pressure on the strings, which can't be good for them.  I ordered a Schubb brand capo that's much easier to operate and doesn't smash the strings like a brute because the pressure is adjustable.  The only drawback to the Schubb is you can't clip it to the headstock, a convenience that's important to a lot of professional musicians.  I'm keeping both, if I need the convenience of this clip on style I'll use it.  When playing at home I'll use the more gentle Schubb.", "id": 116}, {"review": "Fender Medium, my favorite guitar pick, a dozen should last a while right?  When these slip away I'll order more.", "id": 117}, {"review": "When placing my guitar in a stand on the floor I always worry that someone (person or dog) will knock it over.  This hanger works great for hanging my guitar out of the way, safe and secure.  Yes, I could put it in the case, but when I'm playing on and off all day long that becomes cumbersome, so this hanger is convenient and secure for my beloved guitar.", "id": 166}, {"review": "I bought this so I can keep some extra picks handy... now if I can just decide where to adhere it, to my guitar or my music stand?  Or to the desk where I sit and play?  Maybe I should just get one for each spot and each instrument...  Yeah, I think a few of these would be nice.", "id": 167}, {"review": "I'm a gadget lover and this is a good one.  It makes it very easy to attach or detach your guitar strap to/from the headstock of your guitar or ukulele or other stringed instrument.", "id": 174}, {"review": "Not an exciting item, I'll admit, but they work as advertised and I do love having strap buttons on my instruments.", "id": 220}, {"review": "I clip this pick holder to my music stand and it's always handy, and very easy to use.  I use thin picks and was able to fit four of them into this holder.", "id": 265}, {"review": "I really like this strap, it's comfortable, adjusts easily, and the pick holder is really convenient.  This is my second one for my other guitar.", "id": 285}, {"review": "I looked at a lot of different straps before ordering this one.  I hesitated a bit because I couldn't find anywhere that they specified the width, but it was a good price, so I took a chance.  It's about one and a half inches wide, by the way.  I'm very happy with it and I like that it has the flexibility to attach one end to either the headstock or a button.  I can't think of any negatives, it's a nice, functional, non-flashy strap that does it's job well, and it's wide enough that it doesn't feel like it's digging into my shoulder.", "id": 715}, {"review": "I like this string winder, and it is convenient having the wire cutter there too, but the &#34;bridge pin puller&#34; is too small, and doesn't work on my instruments.  That's why I gave it 4 stars instead of five.", "id": 94}, {"review": "As others have said, the stretchiness of this strap makes the instrument seem much lighter and I am less likely to get an achy shoulder when playing for long periods of time.  It may take a few tries with different configurations of the attachable/detachable extensions to get it just right for you and your instrument, but don't give up, it's worth the effort.", "id": 352}]