[{"review": "I've used mine on my electric and acoustic guitars and it is easy to use, quick to reposition, frets the strings properly. It is cost effective and looks good. Nice to have a color option, not the usual black that everyone else seems to have.I need a wider one for my 52mm classic guitar's neck that is also flat. This capo cannot work with it.If I lost it, I would definitely get another just like it.", "id": 116}, {"review": "I placed mine on the back side of my amp, in a safe from bump spot. I keep a few picks in it for easy access and I always know where to find them. The double stick tape that came on it has worked well. It's a cost effective way to always have a few picks handy and not loose in a pocket, getting lost. Try one.", "id": 233}, {"review": "I'm a new guitarist and nobody else would want to hear everything I play. I however, am having a ball playing as loud as I want with as much or as little gain as I feel like at the moment with my Classic Rock Guitar Headphone Amp. My Rickenbacker 360 sounds just the way I want, with as much clarity or with all the &#34;smoke&#34; as I feel like dialing in for now. It is SO nice to be free of the amp and cable on the floor and can quickly plug in, put in my ear buds, and practice for a while anywhere I want, anytime I want. Downside: I wish it had a little reverb to dial in or switch on to closer match my full size Vox amp and the controls are small/hard to read but easy to learn. You do get a pop when you turn it on because there is no tube warm up time. Solution: Hit the switch before putting in your buds if your sensitive. I plan to pick up other versions of the amPlug from Vox to extend my fun. This was a good choice. Buy one!", "id": 491}, {"review": "I folds down to a very small size but is quite strong. I have a dreadnaught resting on it now, ready for use. It should work very well with any size acoustic guitar. Sitting by itself, the stand is small enough to be out of the way but is able to hold my precious guitar securely when put to use.  When I get another guitar, I will get another Fender stand to go with it.", "id": 92}, {"review": "My C5CE Washburn has been a very good purchase. I was looking for a guitar with enough space between strings so that my fingers would not mute strings accidentally while practicing cords. I prefer guitars having solid woods, not laminated like this one. It has the ability to plug into an amp, has easy access to the battery, has a built in easy to use tuner, and the wiring dose not rattle about. It has a good compensated saddle, the frets are level and do not buzz, has a truss rod in the neck, and has a bound rosewood fingerboard. I have always liked the sound of classic guitars, like the option to plug in, and am more impressed by sound than brand name.A person who has small fingers might be better off looking for a narrower neck. This is not a small guitar or a thin body guitar. It rings out very well, so it is not a quiet guitar but is not likely to disturb your neighbors unless plugged in.Mine has some edges not well stained, likely due to glue squeeze out during assembly. Top is a bit wavy, from buffing. Still has some orange peel but not a lot.  Lastly, the nut and saddle are too high for my preference. Some people may be turned off by the orange color of the top, sort of a classic color that I have gotten used to now.Other guitars in this price range are typically made with laminated tops or backs, this model is not. I was not clear enough above where I mentioned laminated woods.If something happened to it, I would be likely to replace it with another one just like it. A very cost effective, good sounding, well made guitar. Good job Washburn.", "id": 774}, {"review": "Small enough to keep along with your guitar to make sure it is in tune each time you play a little. I wish it was a little faster but it is close to as fast as my Sony and Korg plug in tuners. It clips onto the guitar easily, stays put, and is not intrusive by weight or size. The bars are easy to see and are accurate.", "id": 811}]