[{"review": "It is taking a chance on ordering a guitar online!I took the chance and got what most of the reviews already shared.Here's my take-PROS:- Cheap! $90 is very inexpensive for a guitar!- Well packaged for shipping- Arrived 1 day early- Fair quality. This is not a top of the line or even middle of the line guitar. It is a cheap guitar that does have some decent craftsmanship, but not stellar.- Good sound! This does have a very good sound- with new strings of course- Size: This is not a full size guitar, but larger than a 3/4. It is a \"concert\" size which I like!- It is a cut-away design without electronics! This combo is very rare!- Fair to good wood materials and furniture- Good design! This guitar sounds good, feels good, looks very good.- Matte finish: this comes with a matte finish, not shiny- I like thatCONS:- Strings- corroded poor quality strings- neck condition: Neck has slight bend, I needed to adjust the truss and file a few frets. There is still a slight dip and bump at the 12th fret causing fret buzz.- frets are not smoothed on ends- neck surface is not sanded well but smooth enoughI like this guitar. It's very inexpensive, needs a little work, sounds very good. I hope this information help you make an informed choice about a guitar purchase.", "id": 183}, {"review": "These are awesome strings! I put a set on my Strat and Tele. They offer a clean sound, feel good and can hold their own on a tremoo dive and a mad bend. I will be using this model and brand as long as they make them!Get them!", "id": 227}, {"review": "I was excited to get this product and use my electric guitar with garageband.This product plugs into the usb port and the guitar plugs into the 1/4&#34; port (the product specs does not show or say 1/4 plug port).My product has an orange USB light instead of a blue one. The support people at Behringer tell me that they changed the color to match their logo (sounds like BS to me).The problem I had and the reason I bought this is that I tried plugging my guitar directly into the computer with a 1/4-1/8 adapter chord. It works but the levels are too low. When I received this, I was hopeful that the levels would be higher and they are, but not by much. It is a step up from the adapter, but far from professional. I'd say the level is beginner/intro level sound and quality.I bought a &#34;like new&#34; product describing faded or damaged packaging. When it arrived, the pkg box was dented (I don't care) and product looked new inside. But, all the instructions described a blue USB light and CD of driver and recording software which this did not come with. Behringer gave me a link to download. I assure you it's crapware and beware. For the mac, garageband is far better and easier to use.Rock out!", "id": 418}, {"review": "I bought this as a second tuner for gigs. It is awesome!Easy to use, easy to see. Simple, inexpensive.Get one! You will not be disappointed.", "id": 706}, {"review": "Reading the product description may give you an idea about this product. I received, plugged it in and was impressed with the clean yet great sounding distortion. It's solid, well made and looks/feels like it can handle the world tour.Get it!", "id": 832}]