[{"review": "This is a great pedal to put at the end of your FX chain. I have it as the last on my pedalboard before my GNX4. It's always on & it only took me about a week to settle on how I liked it adjusted. There are only two knobs & I just played around with them untill I was happy with the sound. I do a lot of recording & I also checked the sound after recording. Can't reccomend it enough especially considering the price.", "id": 300}, {"review": "As soon as I kicked this pedal in at unity gain, the difference was obvious.  I am most please at the boost feature which is amazing for one important reason: the noise level is nothing like what I was expecting.  I keep my amp clean & I found that even at around 11:00 the noise was still almost unnoticeable. At noon & up it's there until you start playing but even then, it's still much lower that the guitar. There's also an almost expander/exciter FX going on which is very noticeable, especially when I compared it to my BBE FREQ BOOST. First rate pedal!", "id": 643}, {"review": "Although there is a great deal to learn to fully utilize this pedal, I was recording in an hour & had the software on my Mac talking to it. It sounds great with little of it's own noise. The percussion loops are fine & at least provide solid guides for recording. I have a GNX4 that I love & as far as this pedal goes, I am just as happy. I echo the other reviews that suggest getting the footswitch, it does help avoid having to spend a lot of time bent over & fiddling with the small knobs. ( Update ) The software works well & is very useful. It loaded right up with no problem. Memorizing the instructions will be a lot easier once I start using the pedal more often. That's the only problem with so many features squeezed into a small pedal. More than worth it though.", "id": 668}, {"review": "This gadget has stereo in for your monitor mix & a passthrough for you mic so you can get the overall mix set then add in your mic to get the \"more me\" setting. It's simple & easy to use. Works great.", "id": 383}, {"review": "With some trials using different tubes this pedal can add something that is very tough to get otherwise. I run my guitar direct because I don't like amps or having to cart the things around. There are so many shades of tone available that it's tough to really praise this gadget enough especially considering the low cost. I also found using a compresser before it helps. I have a Pigtronix Philosopher's Tone & it made a big differrence. I highly reccomend this tube pre-amp & encourage trying out different tubes to get the sound you want.", "id": 472}]