[{"review": "I wanted to experiment with a thin pick. I like the action but thinner picks tend to \"click\" over the strings and I don't care much for that. These are certainly pretty though, and the feel is typical Fender celluloid, smooth and a little slippery. Might be hard to hold with sweaty fingers. Celluloid is highly flammable, so be aware of that if you smoke (I don't).", "id": 120}, {"review": "This little geegaw is a stable tripod stand to hold the neck of your guitar while you restring it or perform other work. It folds into a nice small package you can store in the gear compartment of most cases. The rubber pads on the neck end prevent scratches and the feet keep it in place on the table. It may be best to invest in a non slip pad to place under the heel of the guitar body for protection and to prevent it from slipping around as movement can topple the stand if you're not careful. Sure, a suitably sized cardboard box or stack of books will also serve that purpose, but what else would you spend the $10 on?", "id": 163}, {"review": "This little music stand folds up small enough (after some disassembly) to fit in a pouch less than 2 feet tall and 2 inches wide. Once assembled, it stands straight and is more than sturdy enough for sheet music or most softbound books. The height is adjustable so you should be able to find a comfortable position whether you're standing, seated on a stool or in a chair. The angle of the tray is not adjustable. The legs are simple flat metal pieces and could be susceptible to being bent if you trip over it, so this might not be the best stand if you plan to keep it in one location. But for a portable stand, it's hard to find fault with this one, especially given the low cost.", "id": 230}, {"review": "This is a lemon oil used for cleaning and conditioning the rosewood fingerboards of guitars. This only gets done once a year on the average guitar, so if you're like me, this one bottle will supply you for many lifetimes. Other than that, it is what it is and does what it says. The applicator contains a dispensing valve so push down hard to open it when you want the oil to flow.The label says NOT to use this product on maple fingerboards. Doesn't say why, but my guess is it will discolor them, so be forewarned.", "id": 234}, {"review": "I have several different tunes, but the Snark is hands down the fastest and most sensitive. Has no trouble whatever picking up the low e-string on my Seagull acoustic, which flummoxes my Intelli 600. Having the tuner respond this quickly makes tuning go faster and easier. The only down side, and this is a matter of taste, is the garish color. You shouldn't leave these things on the headstock anyway as they can leave a mark, so the hideous color just encourages me to do the deed and put it away, which may be just as well.", "id": 706}, {"review": "I take workshop style guitar courses at a local Vo-Tech in a room that could not be any less suited to the purpose. People set their guitars on the desks from which they sometimes fall. Bad scene (sounds like an old \"El Kabong\" cartoon), and not what I want to have happen to my new Seagull Artist series guitar. This little Fender stand easily folds up into a package small enough to fit in the storage pocket of my deluxe TRIC case so I can take it with me to class.It's not the sturdiest, most secure or most stable design out there, but given it's extreme portability and the use I'll put it to, it's going to work great.", "id": 92}]