[{"review": "It's worth a few extra dollars and a little extra time to install these. It sure beats fixing a cracked neck, headstock, or guitar body after a guitar slips off the strap pins and falls for a great height!", "id": 44}, {"review": "I've been playing for more than 30 years. There are a lot of great products out there and I've tried a lot of them. I have to say that the feel and tone of these grey Dunlop Gatorgrip 2mm picks surpasses the Dunlop yellow gels, Fender 351 X-heavies, and Golden Gate or Dawg mandolin picks. This is just my opinion, but I hope you'll check them out because I'm sure you won't be disappointed!", "id": 65}, {"review": "These are a great alternative to phosphor bronze transatlantic cables for acoustic guitar! I would rather concentrate on making music. Why fight your guitar?", "id": 156}, {"review": "I have this on a green guitar with a green pickguard and black hardware. I think it looks great and I wish I could upload pictures!", "id": 208}, {"review": "If you want to breathe new life into an old guitar for about $20, then this kit is for you! Changing your pickguard and hardware is a great way to give your guitar some personality and help you stand out from the pack.", "id": 222}, {"review": "These really aren't a very good value. If I had to do it over again, I would probably get Wilkinson locking tuners which are much less expensive and a lot easier to install. If money is no object and you need the F trademark on your tuners, then I guess these are for you.", "id": 387}, {"review": "You really need to double the quantity and charge accordingly. The single order wasn't really enough to do one guitar and I doubt you could do a bass, either. I used the copper under a clear pickguard, which matched the rest of the guitar pretty closely. Then, I finished the pickguard compartment and the jack area with aluminum foil tape from my local hardware store.", "id": 694}, {"review": "I tried three of these on a whim and they impressed me favorably. In fact, they were so good that I purchased ten more when I went back to the same music store. My favorites are mandolin picks like Golden Gate or Grisman \"Dawgs\". The round side of the XH Dunlop Gels gives me a similar attack and a nice warm tone. I would recommend these to anyone.", "id": 69}]