[{"review": "Monster makes the best cables and a lifetime warranty doesnt hurt either. This isnt their top of the line series but it works great with my bass guitar rig and has for some time. You cant go wrong with Monster Cables.", "id": 1}, {"review": "Love this kit...it has everything you need as well as cleaning cloths....make your axe shine and look like a rockstar.", "id": 95}, {"review": "Popped one of these into my Hartke LH500 Bass Head it it sounds great....the stock tube was sounding a bit harsh and this one sounds a bit cleared and more defined....nice tube,", "id": 228}, {"review": "Needed a pre amp tube for my Hartke LH500 and ordered one of these....while waiting ended up buying and using a 12AX7 Groove Tube so this one still sits in my gear bag, waiting to be powered up. If that time comes Im sure this will be a great tube.", "id": 229}, {"review": "I heard alot about these stands and finally decided to buy one after my cheapo one fell over with my bass still on it.This is a nice looking, well designed stand and feels like it can withstand the rigors of constant use. However, the 5th time I took this to a show, I expanded it and one of the screws and nuts attaching the back leg to the support bar fell off and I never did fine the missing screw...wound up wrapping electrical tape around it to support my bass for the night. I ended up buying some screws and fixing it (which was also a pain as the nut needs to be inserted about 6 inches down the pipe and secured so you can thread the screw into it....not an easy task. I really expected better quality for $35.00 after such light use....still love it, but not to a 5 star level.", "id": 337}, {"review": "Its a nice stand....cheap, but should suffice. I wouldnt use it for a real valuable guitar but for a kick around gigging stand it should be fine.", "id": 519}, {"review": "My Hartke 410VX Cabinet was designed by an idiot....9 million pounds and no casters...not even holes for them. Who invented this thing, He-Man? Anyways, I bought these casters, got out the drill, and punched a few holes in the bottom of my amp, pounded these in, and now it ROLLS. Sadly one of the holes wasnt drilled quite straight making one caster a bit crooked so the amp veers to the right when I push it like a car missing a wheel. But its still better than carrying this beast everywhere my band is playing. Of course, we practice at the drummer's house and in his basement so I still have to carry it down and up his stairs, but that's life.", "id": 542}, {"review": "Needed an XLR cable for a gig and ordered one of these the week before...it got the job done, my bass sounded great through the PA, and the crowd loved the band. Home run!", "id": 692}, {"review": "Fantastic stuff....I sprayed it in my bass guitar's pot and now its like new. Wish I had found this stuff sooner.", "id": 14}, {"review": "You get what you pay for. This is a no-nonsense cheap guitar stand. Its adjustable, padded, and has a nifty rubber band that holds the neck of your axe so when you, a stage groupie, or your clumsy drummer trip on it, the whole mess falls over. This is perfect for your Fender Starcaster or screaming pink Hello Kitty guitar. This is not a good choice for your prized 1968 Jimi Hendrix Strat or 1964 Eric Clapton Gibson ES335. You might want to consider something a bit more sturdy for those.", "id": 258}]