[{"review": "There too many required words to type for a product that doesn't need that much explanation.  It mounts to any mic stand and is formable to any position you need.  sturdy.", "id": 46}, {"review": "I'm a professional musician and love these cables, they look great and perform great and feel a lot tougher than the rubber covered cables I've been using", "id": 47}, {"review": "I actually forgot that I bought the heavy and medium versions of this pick.  It's not a bad pick, I will continue to use them but I wish they had a softer center, or softer coating where you grip the pick to prevent it from turning or falling out of my fingers.", "id": 69}, {"review": "One of my conventional booms just broke because of cheap plastic parts that couldn't handle the stress of being tightened repeatedly.  I came across these and after reading the reviews figured I didn't have much to lose with a $7 price tag.  I was very glad I made the purchase and I'm going to order a couple more of this model and the 13\" model.  It's steel construction except for the oversized nylon knob used to adjust the angle and hold the boom in place.  It's solidly built and I don't imagine it will break easily.  The two pieces that move against each other have teeth, so once the angle is set and the knob tightened, it will not slip.  Get the 13\" if you want to reach amps sitting on the floor from a conventional stand.  7\" is great because it allows you to sing with an acoustic guitar without the extra length.", "id": 142}, {"review": "I have been using these strings for years and have been happy with them but the last couple of sets have lost the tone completely on strings 4,5,6 within 3 days of installing.  I play professionally and have a lot of experience installing strings, nothing wrong on the guitar.  Hopefully the next set will be better", "id": 198}, {"review": "Good stand, solid components, easily adjustable and the boom is good length.  I gave it too our drummer and he uses regularly without complaint", "id": 279}, {"review": "I've had this stand for about 5 years and have used it on stage for the last 3 years pretty steady.  The first thing that broke was the piece that keeps that upper shaft from pulling all the way out of the base when you extend it - the disclaimer here is that it was very cold and I immediately extended it to the maximum point always letting it hit the collar to stop it. It's plastic; Plastic and cold don't mix - The retainer piece broke and went flying and I was standing there with my guitar stand in two pieces right before a gig.  I managed to get it back together but now I have to be very careful when extending the neck. The other part that I've been having problems with is the upper collar that mounts to the top of the stand and holds the guitar necks.  It has come up completely off and I must continually tighten that hex screw to prevent the top from falling off.  I won't mark this stand less then 4 stars even with those issues because it really is a great stand.  Another person noted to pay attention to your guitar dimensions, which is very good advice.  Long bass guitars end up resting on the bottom leg of the tripod.", "id": 301}, {"review": "I've purchased a couple of of the blue 25 foot mic cords from this seller before - same as these.  I've had them for well over a year used in live music at least 5 times a month.  They've been stepped on, and treated pretty rough.  They are still supple and easy to wind up.  In contrast; I have other mic cords from a different manufacturer and the set screws have fallen out, they are stiffer and just haven't held up as well.  Having the multicolor cords makes it a lot easier to see which channel on the mixer is connected to which mic.  Very inexpensive yet reliable cord.  Highly recommended.", "id": 424}, {"review": "I'm a professional musician, playing 6-8 times a month.  This pedal does far more than I need it to do and has plenty of options for an avid guitarist that likes to figure out all the bells and whistles.  I really like the 38 second looping function.....that's plenty of time to get through some lengthy phrases, and it allow you to layer the loops so you can really get creative.  Don't forget to order the external power supply - I would have happily paid a little extra money to have it included....not sure why it's not.  Double A batteries last a longer time than I expected they would.  I haven't had a chance to play with customizing patches, etc, but I'm sure that I'll be pleased with what it has to offer.", "id": 582}, {"review": "I've only need to use this a couple of times and it worked well.  The cover is supple and easy to coil.", "id": 701}, {"review": "I love this guitar string winder.  The cutter was a real plus so I didn't have to track down my diagonal cutters.", "id": 94}, {"review": "These are expensive, they seem to last longer, but when they start to wear, they develop a 'fuzz' where - I assume - the nanoweb is wearing off.  It doesn't seem to affect the playability.", "id": 103}, {"review": "I'm pretty new to using mics and PA systems but have used dynamic mics in the past, recreationally.  This condenser mic is way larger and heavier than a dynamic mic, I was surprised when I took it out of the box.  It is as good looking in person as in the pictures.  Three things for the benefit of other newbs: 1.) I learned that condenser mics are very susceptible to moisture and so you have to purchase a windscreen if you're going to use this for vocals, since moisture from singing into the mic can damage it. 2.) This has a cardioid pickup pattern; you don't sing directly into the end of the mic like a dynamic mic.  This should stand straight up on a mic stand, paying attention to which way the mic is facing since it there will be a lot of attenuation on one side of it. 3.) It requires phantom power.  You need a PA that provides 48V power to use it.When I first used this mic, I tried singing into the end of it and couldn't hear myself very well.  Later in the evening I was standing off to the side and could hear myself so loud that I had to back away about a foot from the mic.  Then I remembered reading about the cardioid pattern and stood it up straight on the mic stand, paying attention to the orientation of the mic.  It was so sensitive that I really had to stay backed up from the mic and it was easy for two or three people to stand around it for vocals.  I have a Rainsong WS1100 acoustic electric guitar I was playing, and was able to turn off my amp completely because this mic picked up the instrument and my vocals so clearly.  Other musicians were impressed by it as well.  I payed just under a $100 for it, which I think is a great value for this product.", "id": 371}, {"review": "This didn't exactly fit my MXL V67G condenser mic, so I took out the bottom piece - which took a little work - then I was able to get the bottom screw plug of my mic to fit.  It's solid and works well.", "id": 393}, {"review": "Who doesn't love these tuners?  Easy to use, easy to read, and has options that I don't even use. Highly recommend this.", "id": 706}]