[{"review": "BOTTOM LINE UP FRONT: If you play an Orange, Vox, or Marshall, you don't necessarily *need* an EQ pedal, but putting one in your signal chain will take your amp to the next level.Why is this? Well, the Brits design their amps with wide and musical EQ but the overall frequency response is narrow. This has led many British amp manufacturers to include specialized tone shaping buttons on the control panel because they are well aware that British EQ isn't as dramatic as American guitarists want it to be. There is nothing wrong with this by any means - it's just an overall characteristic of British amplifiers.Secondly, any tube amp loves to be pushed with boost and dirt pedals to get extra crispy overdrive from the clean channel - since distortion channels on tube amps have a tendency to compress and limit the output slightly. This pedal is more than capable of providing that boost. +15dB seems to be right amount to push clean to dirty, or dirty to overdrive, or overdrive to distortion.LIVE PERFORMANCE: If you're in a rock band that plays small venues like bars and clubs, you've probably noticed that most bands have overwhelming bass/midrange noise (100~500Hz) that drowns out the vocals and clarity of the drums or any instrument for that matter. Applying EQ to your signal chain will allow you to clean up your tone by cutting some unnecessary low-end from the picture and boosting your high-end for better clarity.RECORDING DIRECT-IN: If you're using this pedal with a DI box or simply plugging directly into your audio interface for virtual reamping, you'll be able to get a more balanced signal if you want to darken your Strat or brighten your Les Paul.WHY 4 STARS? Yes, the noise. It's not bothersome by any means, but if you're recording with a mic'd amp or direct in, you will absolutely need a noise suppressor. I use my GE-7 with the BOSS NS-2, and the NS-2 completely removes the white noise generated from the GE-7. The result is an amazing, clean boosting EQ.IF YOU'RE ON THE FENCE... go ahead and get this thing. You won't regret it. It's not just for Tone Snobs, it can really make cheap gear sound way better, and take great gear to the next level.", "id": 433}, {"review": "BOTTOM LINE UP FRONT: The Behringer VT999 Vintage Tube Monster is indeed a monster of a pedal. Those seeking a hot rodded sound to your amp would be wise to check this product out, as the level of boost and gain derived from the stock 12AX7 is enough to push any tube amp's clean channel into saturated overdrive.Featuring 3-band EQ that ranges from barely noticeable to perhaps &#34;too much&#34;, I was surprised that I actually found myself backing off some of the knobs because I expected this to be a cheap pedal that needed it's EQ to be pushed to max in order to get any playable tone out of it. I was wrong. The Master and Gain knobs work exactly like a tube amp channel. The Noise Suppressor is a nifty feature that drastically reduces white noise.Roughly taking up the space of 3 standard pedals on your pedalboard, many probably wonder if it's even worth the real estate compared to other overdrives. However, when it comes to tube-based pedals, big is par for the course.The stock tube is decent to the point where you can get some musical tones out of the pedal. I personally don't plan on changing the stock tube any time soon because I want to test its limits, but the gain range is effectively Boss OD-1 to DS-1, so YES - it is possible to get some metal tones out of this pedal, especially those late 80s/early 90s Marshall-driven metal tones.I honestly can't say anything overtly bad or wrong with this pedal. I judge gear with my EARS and by its VALUE, not by PRICE, but honestly... for $50, you literally can't go wrong. There are worse pedals you could buy for more money quite honestly. Even with a $10-$15 mod to change the tube to something more your preference, you're still looking at a relatively inexpensive pedal with an amazing value. But if you're looking for other tube overdrives, check these out: Effectrode Tube Drive ($350), Maxon TBO-9 True Tube Boost/Overdrive ($263), and the Ibanez Tube King ($170).If you're on the fence with this thing, go ahead and jump over and get one.", "id": 472}, {"review": "BOTTOM LINE: The Orange Micro Terror is powerful hybrid amp head capable of driving any number of speakers you throw at it. It's low wattage guarantees crushing tube overdrive and classic British tones in the palm of your hand.WHY ONLY 3 STARS? For starters, this is what I would consider a \"novelty-boutique amplifier\", because it recreates vintage British sounds like a boss, but it's lack of clean headroom is evident. It's an Orange after all, and so if you want a dirty Plexi sound with only 1-channel to work with - this head is for you. Playing with a Les Paul, I tested it through a Marshall 1960A 4x12 and it sounds amazing. I also tested it through my custom 1x12 cabinet loaded with a Celestion G12H30. I was able to find the \"sweet spot\" on the Tone knob, which for me was around 1 o'clock, and with the Volume at noon and the Drive at max... I had entered a very musical, lush, and totally gig-worthy tone zone that Jimi Hendrix, Angus Young, and Jimmy Page would have loved to go on tour with. However, as much as I love eating British Crunch for breakfast, I consider myself a versatile player who needs a bright and heady clean channel AND that classic punch'n'crunch we all know and love AND a solid distortion for metal and beyond. Unfortunately, the Micro Terror is a ONE TRICK PONY in the Tone category, and for this (if we're starting at 5 stars) I have to subtract one star. I feel confident subtracting a star for tone because the Micro Terror doesn't exactly take pedals well either without generating too much noise, which leads to feedback. I subtract another star because this head is really only usable if you're in a rock band, already own a 2x12 or 4x12, and want something quick and small to use to rock out with. The problem is, if you're one of those people, you probably already have a solid amp head to drive that 2x12 or 4x12 in the first place. This puts the Micro Terror into Secondary status or useful as an emergency head during a gig if things take a turn for the worse. This leads me to my final point: if the intent is to purchase this as a bedroom practice or garage rehearsal head, then for the price you could get a much better product that has two GOOD channels instead of one simple (but GREAT) one.WHAT I LOVE about the Micro Terror is that it is something you can always keep in your arsenal. Having owned several different combo amps and head/cabinet variations over the years, the Micro Terror could fill that niche because it can be scaled according to your performance or rehearsal needs. If I were starting over from scratch, I'd probably buy two 2x12 cabs, a Micro Terror, and a bigger and more powerful tube head to drive both cabs if needed. This would give you perfect flexibility for band rehearsal, studio recording, small bar, big bar, club, or concert stage venues.(TO THOSE WHO THINK THIS REVIEW WAS UNHELPFUL: I've noticed this review, and pretty much any review of this amp with anything bad to say about it is getting unhelpful votes. It seems like, people want this to be a 5-Star Amp but always with the caveat of \"but it's $150, what do you expect?\" or they begin their rave review with \"For a $150 amp...\". Look, I don't judge gear just by price, I judge it by VALUE and with my EARS first. The reality is, you need a really nice 1x12, 2x12, or 4x12 to really make the Micro Terror sound amazing. If you're dropping $150 for the Terror, and probably another $150~$250 for a great cab... why not spend that $300 or so on a great ALL-tube 1x12 to begin with with 2 channels, better EQ, and the option to route to an external cab from the get-go?)", "id": 844}, {"review": "Let me begin with a Public Service Announcement: If you want to buy other EZDrummer expansion packs, YOU NEED TO BUY THIS PRODUCT FIRST!***IMPORTANT UPDATE*** Toontrack is scheduling the public release of EZ Drummer 2.0 in May 2014. If you buy EZ Drummer 1.0 from now until then, you will ALSO get the download for 2.0. Bear in mind, EZD2 is a completely new/different program from EZD1, and so I would jump on this opportunity considering you get the stock EZD1 Pop/Rock Kit (which has some very kit pieces) in addition to the EZD2 default kit (which is more reminiscent of the ROCK! expansion kit from what I've seen). EZ Drummer 2.0 also gives you the ability to mix/mash kit pieces from all expansions, and so to me this makes EZ Drummer a MUST BUY based on the sheer customization available. ***RESUME NORMAL PROGRAMMING***If you are an amateur musician and you want a quality virtual drum kit, EZDrummer is probably the best bang for the buck you'll find. It's very easy to use, very easy to program, and overall a well made product. You might be tempted to compare EZDrummer to its bigger and better brother: Superior Drummer 2.0, made by the same company. Superior Drummer is superior to EZDrummer, but is a little more tedious and more suitable for musicians who want an exact close-to-life sounding virtual instrument.There are ways to improve the off-the-shelf sound quality of EZDrummer immediately. YouTube has plenty of video tutorials on this, but what you want to do is open up your Digital Audio Workstation (Pro Tools, Cubase, etc), and set EZDrummer for multi-track output. From there you'll be able to tweak the different outputs EZDrummer has as if you were in a studio and had 7 mics at your disposal. Most high-end professional studios use about 10 mics to capture everything on a drum kit, and so 7 virtual mics is nothing to scoff at: Kick Drum, Snare Top and Bottom, Toms, Cymbals, Overhead, and Room. Once you have each of those outputs running, you can perform individual EQs to change the tone dramatically. Adding a touch of distortion/gain and room reverb will make the stock kit sound REALLY close-to-life. In reality, once you have additional instruments layered and everything mixed and balanced, it only takes a trained ear to tell that it's a virtual kit.As far as the expansions go, if you are looking to record a particular style of music, then I highly recommend buying the EZX kit that goes with that genre. The stock Rock kit is VERY GOOD (after performing the mods above)... but only for Rock. As for me personally, I did my best to EQ and tweak the crap out of it to get a nice metal tone, but in the end, I found the Rock kit lacking, especially since it's a \"tight\" kit (3 toms, 3 cymbals, 1 hi-hat, 1 snare, 1 kick).", "id": 385}, {"review": "I bought this pedal years ago, and like most guitarists who buy new gear, I fell victim to CONFIRMATION BIAS regarding the reviews I gave to my musician friends. Upfront, the pedal sounds great. In the store, if you demo this pedal, you'll quickly be able to zero in on whatever distortion you prefer... but over time, you'll get very frustrated with the actual tone of the distortion itself. Turn any of the knobs past 12, and you'll get some undesirable nasal/hissy/tinny frequencies that require compression, noise gating, and EQ to tame. The &#34;Top Boost&#34; does provide what it advertises, but if the pedal itself is already Dimebagged and you engage the Top Boost... it just sounds weird and unmusical.Electro Harmonix is a great pedal manufacturer, but I think they overstepped their bounds with this one. Where is this pedal now in my collection? Sold for cash. After deciding to bite the silver bullet and purchase a BOSS ME-70 Multi-Effects to simplify my gigging setup, I figured as nice as it is to have an Analog Distortion like the Metal Muff, it would never compete with the Digital Distortion onboard the ME-70... boy was I wrong. After getting the ME-70, I did an A/B test and the ME-70 took home the gold easily. This came at no surprise... considering both BOSS and MXR are respected manufacturers when it comes to Distortion sounds.What would I recommend you purchase? That depends. If you're in a metal band, and you're recording an EP, no pedal in my opinion comes close to fully-cranked tube-amp distortion. However, if your amp doesn't have a good distortion channel or capability, then a more conservative (and affordable) BOSS DS-1 for a more musical metal tone. The reality is, most manufacturers have great distortion pedals, so it really depends on your subjective standards for tone... since no two distortions sound the same. Personally, I recommend the MXR Fullbore Metal... the pedal I wish I had bought instead of the Metal Muff. The Noise Gate and Mid Scooper switches are far better pedal accessories than a Top Boost. The Fullbore also has a Mid Frequency shaping knob... which can dramatically shape the overall sound.", "id": 399}, {"review": "BOTTOM LINE UP FRONT: The MXR Fullbore Metal is a high-octane distortion suitable for modern metal music. It's 3-band EQ with adjustable Midrange Q gives the MXR FM the ability to model virtually every other distortion out there.WHAT I LIKE about the pedal is that it's small, easy to operate, and doesn't take much time to dial in the tone you want. I play with a Marshall JCM2000 DSL50 going into a 1960A 4x12 using a Les Paul Standard, and it sounds amazing. I love the onboard Marshall JCM-flavored tube distortion, but it is more in line with the New Wave Of British Heavy Metal (obviously), and not entirely suitable for modern American metalcore. The MXR Fullbore Metal gets me to where I need to go. This is nice because I can use my amp to have a good clean and overdrive channel, and then tap the Fullbore when I need to play metal.WHAT I DISLIKE is that this pedal generates a lot of white noise, so you have to be careful with the Treble and Mid-Q knobs. However I also noticed that the amount of white noise also depended on my amp's EQ settings as well, so know in advance you'll need to spend a good 15-minutes doing a proper setup for recording purposes.WHAT ABOUT THE EH METAL MUFF? I owned a Metal Muff for years, and this pedal totally blows it away. The big &#34;selling point&#34; about the MM is that it has a Top Boost. Big deal. I wrote a review for the MM on Amazon, but in summary, the Top Boost makes everything sound weird and unmusical. Comparing the Top Boost to the Noise Gate in terms of the big &#34;selling point&#34;, the Fullbore's Noise Gate (which has adjustable sensitivity) to me seems like a MUCH better feature when thinking about how tight you want your rhythm guitar or leads to sound.WHAT ABOUT THE BOSS ME-70? I currently own an ME-70, and being totally honest - I think the negative peer pressure and crap guitarist's give each other about multi-effects is because in their mind they think an old-fashioned pedalboard with a thousand bucks worth of pedals is &#34;real&#34; whereas multi-effects pedals are &#34;fake&#34;. This might be true to some extent, but modern digital modeling is getting so close to vintage analog signal chains... that at some point the trade-off does indeed make sense. (FYI: Dave Mustaine uses a DigiTech GSP1101 as part of his live rig). #endrant. Anyway, the Boss ME-70 has only a few settings useful onstage, but not so much for recording since in the end, they do sound a tad digital, and the ME-70 compresses your signal. The MXR Fullbore does not compress, and sounds analog, so it wins.FOR RECORDING PURPOSES? I bought this pedal because I wanted a dedicated metal distortion to use for my Metal EP I'm self-recording. In conjunction with an ADA GCS-3, I created an all-analog signal chain for direct interface that sounds amazing. Check out the ADA GCS-3 if you can. It's an amazing speaker simulator, and it can take any pedal you throw at it and convert it into a beautifully sounding emulation as if the pedal itself was it's own 1x12 combo amplifier. Anyway, through the GCS-3, the Fullbore basically sounds like a Mesa-Boogie.WHY ONLY 4 STARS? The Fullbore isn't for everybody, it isn't for every guitar, or every amp, but by itself, it's really friggin good. I suppose if it had a 10-band EQ and a 12AX7 preamp circuit, it would be &#34;the best metal pedal&#34;, but for a small piece of gear, it's probably the best analog distortion on the market.", "id": 638}]