[{"review": "Waited two months before reviewing my les paul 100 to make sure there were no issues.  I am very happy with the guitar.  It came well padded and was in excellent shape.  It was set up well and has played well out of the box.  Just did my first string change making sure I used the same gauge of string and didn't have to make any adjustments to the guitar.  Played as well after the change as it did before.  Was a little nervous about an online purchase and not being able to play the guitar before buying but when you live out in the sticks and it's a major trip to get to a real guitar store you sometimes take your chances.  Anyway it all worked out as the guitar is very easy to play, free prime two day shipping, no sales tax, and saved about $80 in gas it would have taken to make a trip to buy one in a store.  The savings in gas and tax paid for about half of my new Mustang 2 v2 amplifier.The only thing is on the epiphone site it states all their electric guitars include a cable in the box.  This one did not and from reading their forum it seems it is almost a normal thing for cords to somehow disappear before reaching the customer.  It is not a big deal to me but I thought I'd mention it for those thinking of buying a epiphone.  When I ordered this one I wasn't really sure if a cable would be included or not so I ordered one at the same time, I'm glad I did.", "id": 30}, {"review": "Just changed strings on my Epi Les Paul and this winder\\cutter performed flawlessly.  The winder fit the winding keys nicely and didn't come anywhere near touching my guitar's finish.  The cutter snips the strings with no effort.  Huge time saver and works as promised.  Very glad I bought the  Planet Waves Pro Winder String Winder and Cutter .", "id": 94}, {"review": "Well this cable certainly didn't last long as the title says 8 weeks.  Bought a new Fender Mustang2 v2 amp a week and a half ago.  Last night amp would turn on but wasn't putting out any sound from the guitar. Messed around a bit and it started to work.  Today same thing and it's obvious nothing is going from guitar to amp.  Thought I had a bad jack in my new amp and wasn't very happy.  Got out the old amp and guess what nothing there either.  At least my new amp is working and I only have to replace a $12 cord.Maybe I'm just unlucky and got a bad one and if I bought it at a local store I'd return it.  Not going through the hassles of mailing it back or asking for a refund.  Will just move on to another company's cord.", "id": 168}, {"review": "As the title says 8 weeks in and no issues at all.  It's comfortable and sturdy.  What else could you want in a guitar strap?", "id": 659}, {"review": "Looked at a lot of cases most priced $90 or above.  Settled on this one because of price, reviews, and measurements posted here in the reviews that assured my my guitar would fit.  I have an Alvarez AD60 (dreadnaught style body) and it fits in this case nice and snug.  Solid, well padded, sturdy latches, and everything lines up.  Very happy with my purchase.", "id": 859}]