[{"review": "If you're worried that the 3.0 mm is too big for your guitar, you're probably right.If you don't use a pick for your bass, then you don't want this either.But if you want to pick your bass, this is the plectrum for you!", "id": 66}, {"review": "I'm not sure how much extra utility you get out of the winder.  Maybe if you change strings a lot, then this could be a key part of you equipment bag.  The cutter part is nice, it is solid and effective without being too heavy, yet it does feel well made.  For the price, keep it around rather than tracking down other wire cutters when you need to change out a set of strings.", "id": 94}, {"review": "The shell and the lining of the case are perfect: hard on the outside, and soft on the inside.I opened up the box and my Epiphone Dot slid right in.The only thing that worries me is that the hinges feel a little cheap, and the lock cold be beat with a bic pen.I'm not traveling around with my guitar too much, so that's not a problem for me, but I would worry a bit if I were checking it on an airline.Otherwise, it works perfectly for what I bought it for - protecting it in my mancave / basement from dings and scratches.", "id": 157}, {"review": "I plugged in the amp, and I plugged in the bass, and there were no issues with the wire.  This is one of those products you don't want to overly notice, and in that it has done the job is is designed for.", "id": 168}, {"review": "I bought this set mainly because I wanted a cheap micro-fiber cloth to polish off my guitars.  For the price of just a microfiber cloth, this set throws in a polish.The cloth is just what I wanted. It is soft and I feel good rubbing it on my instrument. I wish there were a little pouch that came with it so you can keep it separate -- mine is right now in a ziploc bag in my basement with my other loose gear.  The polish is just that -- it is works to bring out a shine, but it is not a cleaner.  You also have to be careful about where on your instrument you get the polish; there is a bit of wax in there and it is not string-friendly.", "id": 194}, {"review": "I bought a bass from this site, and as much as I love the thing, I'm not an expert.  I popped my E string over-tightening it when I was setting it up.  I replaced the factory strings with these.  I'm told it sounds better now.  I think so as well, but I can't quite quantify it.", "id": 197}, {"review": "Saves your thumb on the strum;grips nicely in your fingers but not on the strings;A Totem of Rock and Roll in your grip.", "id": 243}, {"review": "I had put these on, and my wife picked my guitar to play, and she was confused.They do take some time getting used to.  They don't rip up your hand as much, and if you keep your fingers on the strings as you shift, there is less friction.  This is good, but it takes some getting used to.  I used that finger-tip friction to let me know where I was on the fretboard.  With these, I found myself over-shifting both high and low.I like them, and they sound nice, but i bought some round wounds to replace these when the time comes.", "id": 259}, {"review": "It works well for holding up a guitar, and it looks good doing it.  As long as you don't ask it to hold up a bass, you'll be fine (the price is hard to beat too).", "id": 657}, {"review": "I really dig these.  I have been playing lead with them for a couple of weeks, and the worst thing is that when I drop them, they are impossible to find on my beige carpet.  The one I'm using has barely worn with at least 10 hours of playing on it.The size of the pick is the same as normal, it is just more tapered.  I tried to pick out stuff on the bass with it, but it was a little to much work as I dipped it too far into the strings, so I reverted back to a wider gator grip 1.14, which works better with the bigger strings. I am still searching for the world's perfect all-purpose pick. This works until then", "id": 626}, {"review": "Unless you know what you're doing, these things are too small.  If you feel comfortable with your picking skills, the size and stiffness (along with the built in grip) are pretty good.  These are for lead, and not rhythm. The picture won't show it, but they are about the size of a dime.", "id": 686}]