[{"review": "nuff said.works great.latest purchace is used as a trigger on my drum machineused the CODA kick pedaltrigger a boss sound moduleplay it all the timealso use one on my Vocalist.  and eff mute.  and chan change.like the option of NC or NO.  saved my gig just tonight when one of my Midi controllers lost it mind an needed NO instead of normal NC.", "id": 52}, {"review": "Not expensive. Not cheap. Not exactly what I wanted.Like most all of the Behringer items it has good points and \"duh\" points.If you use it as an  A/B one input to 2 outs, then you can use the 2 volume controls.  I did not need it for that.If you use it as 2 inputs and 1 out, you only control the sum out, not the individual inputs (thought you could, which is why I bought it. the 1/2 page twice translated fact sheet almost makes you think you can, but you can not.... I almost sent them back.. I bought 2 for a special set up needing to adjust the 2 input levels that I was switching).the LED indicators when using it as a 2 in - 1 out  (like 2 guitars into one amp, or in my case a mando and a midi-guitar rig into a single line in ) ...  are ...exactly backwards...  the one on the right (red) is actually the input on the left and the one on the left ( green) is the input on the right.... which makes it about as confusing to use as getting a weinersnitchel coupon that is good only at a sushi restaurant.Operation wise, no hums, no buzzes but no one left on bass.When it is all said and done, I am glad I kept them.Amazon rocks. got them in 3 days. free shipping.  where else can you take the change you find in the couch to coinstar, get a coupon with no fee and buy musical toys.  who said Santa was a scrouge.  i am just glad he took a nap and the money fell out of his pocket.", "id": 375}, {"review": "i just got the 3rd monitor.  great price.  got here in 2 days ....so.  my first 2 units have a very bright blue ish color LED for power.the latest one has a very mellow amber color LED.anyone else noticed different color LED's ?comparing the units, the newest one seems to have a differnt type feel on the impact plasctic shell.weight and sound is the same.i use them for everything from full band to acoustic .  great for vocals and guitar.  as stated by others not much bass response ( but from a 5 in speaker what would you expect).mine have been dropped, wet, hot and never missed a beat.", "id": 654}, {"review": "use it on my mandobanjoacoustic guitarupright bassreg bassdon't leave home without itbut take and extra button battery", "id": 707}, {"review": "for the price of 1 ( one) saddle at GCyou get 2 of these and the nut assembliesi keep them handy for guitar setup changesordered on Monday, arrived on thursday", "id": 860}]