[{"review": "I've played string instruments for the better part of 55 years... Starting with a cheap Tijuana Wood box as a 5 year old, progressing to Martin 6 and 12 string Acoustic guitars, and a few electric Fender and Gibson units.... All good in their own respect.I decided to treat myself to a Les Paul for my 58th birthday but, not having the financial resources to buy a $3,000.00 git, I shopped and shopped... Finally settling on this Cherry Burst LP-100.It arrived in perfect condition, the slightly smooshed outer packaging notwithstanding. It was even \"sorta\" in tune... but a quick dial-in with the electronic tuner brought that right.Simply put, Nice guitar. After allowing the strings and neck to settle in together, I spent a few hours a week later adjusting string height, intonation, and pick-up distances, and now this LP *ROCKS* !!!If you're going to spend mid-range $$$ on a fine practice / performance guitar, you can't go wrong with this one, kids - Two Thumbs Up ![Suggestion: A Fender Mustang 1 or 2 amp makes this guitar sound even better...]", "id": 30}, {"review": "WaWa pedals come and go, and get modded and re-thunk....But I always wanted an original Cry Baby... So this was a birthday gift to myself.Not disappointed.Down the road I MAY add some of the gazillions of electronic mods available now to personalize the sound, but for the time being I'm gonna enjoy this pedal \"As-Shipped\".Very Good Buy, Great packaging, earlier-than-expected delivery - Thanks Amazon !", "id": 41}, {"review": "Ordered one of these Gig Bags for a new Les Paul - the hard shell cases are back-ordered, and I didn't want the guitar just sitting attracting dings and dust.Fits a LP Studio perfectly, has room for small items in an outer zippered pocket. Does the Job !", "id": 51}, {"review": "I haven't picked up a guitar in 15 years, but this was a LONG Winter and I needed something to occupy my time.I broke out my Strat and discovered that the amp was dead - mice had eaten the wiring.Crap.So - Online to see what defined \"State of the Art\".  This is It.If you need a basic practice amp that, with a decent laptop and internet connection, can help you produce ANY sound with a few simple instructions THIS IS IT.No Foot pedals or expensive add-ons [until you really have to have them]... Just pure creative sound that won't break the bank.Buy This Amp !", "id": 718}, {"review": "Case  arrived in great condition.Quite Roomy, fits my Vendetta AND/Or my Les Paul - Two exterior pockets for tools, extras, etc.2x Thicker padding than the Epiphone gig bag I got for the LP, but all these have to do is protect and keep dust away - I'm not hauling them to shows...Get One.", "id": 311}]