[{"review": "This pedal, fish and chips, which i find it to taste nothing like, works nicely.And was pretty cheap..I've heard some complaints/worries about the flimsiness of the plastic.As of 03.13 the plastic seems pretty thick/durable.The switch does seem of a poor quality, but if it did break im sure either send it in and get a new one or put a nicer switch in yourself.As for noise, It doesn't seem to add much, unless you have the gain switch at the end turned up high, and with distortion and what have you.I haven't gotten to blast (play bedroom level, technically) since i've gotten it, but it sounds good through the headphones.I'm using a squire strat, fryette sas distortion, now the fish and chips, boss me-50 all running into, for now, my vox vt20+, which is outputting to my headphones. soooo...Its sounding nicer that way.I cant wait to get it through my other amps.I've also heard of very very short battery life. I've got the standard 9v i think from planet waves and it's powering it just right, so far.Tomorrow's the real test, a few hours at least", "id": 84}, {"review": "These are a bit short, only complaint.But I should have known that going into a 6\" double right ended cable.Perhaps a straight to straight would be better.Anyway, besides that, they seem to be decent enough quality.I can see a few years of careful use.", "id": 181}, {"review": "this has a good weight, nice connections, and all together fender charm. pretty decent price compared to GC as well", "id": 214}, {"review": "I got this because at just around 32 bucks, its pretty much seemed like a stealcompared to other pedals I was looking at.But a few notes..If you buy this, definitely have/buy a 9v adapter with a (-) polarity.Also know that when people said that little blue light was blinding, well,they weren't kidding. I've put a little paper and tape over mine as well, however it isn't sticking.It might not have the best effects or effect strength, but as my amp has no built in effects, its better than nothing.If you're cheap like me but want effects, this is decent, although the chorus effect seems particularly weak.", "id": 430}, {"review": "Screws, just the right size. Shipped free as an add on item, at the time. No brains er...what else?", "id": 215}]