[{"review": "Ok...I bought this and after placing it on my pedalboard it was OVERKILL. I mean I had enough boost and gain from different pedals already so no use for it at the moment. I gave it to a friend of mine that had a simple pedal configuration (distortion and a flanger) and it made a huge difference when he needed to make a solo or bring some \"accent\" to a determinate part of a song.It's a cool pedal but I will recommend it for simple pedal configurations. It will bring the extra juice you need.Cheers", "id": 365}, {"review": "DOA...no good, out of the box,plug it, nothing.....no way to send it back (I`m not from the States)....meaning...I just wasted away $40 something bucks (add shipping)....I did bought a Behringer pedal before (Tremolo/Pan) with good results, but I guess there`s two sides to this particular low economy pedals....Well, I`ll man up and buy something else...", "id": 429}, {"review": "Little to say about this incredible little stomp box: no color on your sound, build like a tank, large display perfect for those smelly and dark bars and joints where all musicians play and it has KORG brand printed...and for me thats enough to trust this great tunner.Cheers!!!!", "id": 504}, {"review": "This little box will give it to you. I personally play bass and I have a thing for long effect chains. I count in my little arsenal with fuzz, distorions, auto wah, a compressor, octaver, bass booster and a nice DI Box. The MXR EQ helps me a great deal to \"recuperate\" definition and clarity after this long effect chains that I love. A great little box.So if you are looking for clarity, definition and even a little extra punch for your sound the MXR EQ will do the trick.Cheers!!!", "id": 182}, {"review": "Once you place the pedals on it, it's kinda heavy...but it won't hurt your back. I arranged 11 pedals on the frame and they fit perfectly.No brainer, built to last and the carrying case it's outstanding.Cheers!!!!", "id": 544}, {"review": "Yes!!!! finally...after reading endless tons of reviews on several types of recorders I hit the nail!!!! Ok..I play in a really LOUD metal band...none of us are record savvy or anything like that...we just want to rehearse and rock the hell out. But we needed a tool to catch band practices and of course remember \"that riff\" for the next rehearsal. We tried various recorders but always to complicated for just a practice, well the ZOOM H4N changed everything. Simple to use and the quality of the recordings are just....well INCREDIBLE...for such a little thing...no distortion of any kind (just be careful where you place it). I still need to read a lot of the users manual...but take my word...I hate those manuals...I figure how to use it (extremely basic) and just hit the REC button and rock out. Finally when I came back home I plug it into my pc and I was amazed by the quality of the sound...we recorded in 4CH mode with two extra mics...and man....I havent even tried the multi channel mode yet!!!thanks ZOOM...now rocking and basic recording it's how it's supposse to be....SIMPLE AND FUN.cheers!!!", "id": 581}]