[{"review": "I got these for noise reduction, barking dogs, loud trucks etc. They work well for that. The only drawback is that they fit very tight on my head. After a time the pinch is bit much. I have a small (7-1/4) hat size too. However, the price was great, and the sound is good. I'm no audiophile, but do play guitar, mando and dulcimer, and for me these phones deliver a good, well rounded sound.One other thing, these headphones are made for the studio, not for outdoor use.So, if you can deal with the pinch, I highly recommend these headphones for noise reduction and sound quality.", "id": 146}, {"review": "Simply, these are great cables. They snap right in, carry sound well, and come with a lifetime warranty. The 15' length is just about right, and at about one dollar per foot a good value. Recommended.", "id": 168}, {"review": "This pickup is pretty good at lower volumes. But it becomes a feedback nightmare at higher volume. The pickup is very, over sensitive.Also, spend some time where exactly you place the pickup, it makes a big difference! Try to put it near a solid part of the instrument so it does not pickup so much and make the cound like the bottom of a cave or something.", "id": 611}, {"review": "I really like the Cherub pickup. It is the easiest to install in my classical guitar of any pickup I've used. The sound quality is very good for a piezo pickup and better than at least one of the more complicated bar type in the sound hole type pickups I have. The pick wire out to the amp is skinny and only 8 feet long, but for 8 bucks it can't be beat.", "id": 759}, {"review": "I originally rated this pickup 5 stars. However after using it for some time on dulcimers, a mandolin and acoustic guitars, some problems have turned up.Basically the Cherub is just too sensitive. It works well at lower volumes, but as soon as you crank it up, feedback city that you can not stop easily. I put a rubber inner tube from a bike to reduce the sensitivity, but still feed back and funny sound.If you are looking for a pickup to use at a dance or some other loud venue, the Cherub will likely squeal as you crank it up.It sort of makes the whole acoustic chamber of your instrument one big pickup. You can talk into your instrument!", "id": 848}]