[{"review": "Awesome strings, did what I needed them to do (Drop A/B). Good tension.Only con is that Ernie Ball strings seem to wear out fast and lose tone. So for now I'm good but in a few weeks I'll need new strings. In which case I'll probably go D'addario or Cobalts.Still, decent strings if you need cheap strings fast.", "id": 97}, {"review": "Obviously these aren't top of the line strings but I used them to record a track in drop C and it sounded awesome. After about a week they started losing tone and started collecting skin.D'addario is awesome if you keep in mind that they're on the cheaper side.", "id": 156}, {"review": "I ordered these picks in bulk to use while I was recording/producing. I absolutely love these picks and swear by them. I've been a guitarist for almost 7 years and these were the picks that I landed on years ago and stuck to. I've had years of lessons, licks and picks and these are the absolute endgame for me! Perfect grip for leads and perfect thickness for Rhythms. I'd order again if I had to.", "id": 164}, {"review": "I bought this to restore the neck of an Ibanez that I had ordered used and knew needed TLC.After a few coats of this stuff the neck looked/played/felt like it was just out of the factory! It restored years of neglect in just a few minutes.When I bought this I though it wouldn't be enough. BOY WAS I WRONG. I'll have enough of this oil to last me awhile which makes me happy because I can get that new guitar feel out of my neck for months if not years to come.", "id": 307}, {"review": "Pretty simple tool, did exactly what I needed it to for a decent price. I'd order again if I needed another one!", "id": 347}, {"review": "Bought this years ago. It was a nice long cable that I bought figuring it'd be durable but it didn't last. Maybe it was my mistreatment of the cable but then again it should be built to gig... If I was better with wiring I'm sure it's fixable but all in all it didn't last as long as I'd hoped.", "id": 492}, {"review": "Although I never gigged with it I think this would be great for any musician who gigs with a 2x12 or a 2x10 combo amp. I used this with various fender and line 6 amps and it worked great for amplifying the sound. Would buy again if given the circumstance.", "id": 517}]