[{"review": "My problem is that I am used to playing Hohner Golden Melody and Special 20 harps.  I guess I should have paid attention to the other 1 and 2 star ratings.  These harps have no volume.  Don't waste your money on them.  I guess the only thing worth having is the case, but the case has no handles or carry strap.5/25/14 - I said the case had no handle, well I take that back.  There is a little strap inside that prevents the case from opening flat.  I was able to fold that little strap outwards and then zip the two zippers up to it.  With one finger I can carry the case with my quality harps inside.", "id": 293}, {"review": "I am a LONG time user of the big Fender triangular picks.  I play rhythm guitar in a bluegrass here in Columbus, Ga.  I play mainly a Martin HD-28, but also have a Blueridge BR-180 and a Seagull S6 Coastal Spruce.  I bought a set of these to try them out.While I have nothing negative to say about these picks, I still prefer my big Finder's.  I guess I'm just too used to the big pick.  While I was playing Katy Daley with one of these Tortex picks, I found that my index finger was hitting the strings, on occassion.If you haven't been tainted for the big Fender picks, then try out a set of these.  I guess I could get used to them, but will stick with the big Fenders for now.", "id": 350}, {"review": "I have one gig bag already (not like this Fender), and wanted another gig bag for a third guitar I bought.  This Fender is lots better then my other bag.  My other bag has the storage pockets on the broad bottom part but not the nice storage pockets up on the neck like this Fender bag.  The Finder's padding is a bit better than my other bag also, but, of course, neither is as good as hard case.I am handicapped with a prosthesis on my right leg.  I need the back pack straps on back of a gig back to help me transport my guitar, because I use crutches and they require my hands.  The Fender's straps are great.  The left strap on my other gig bag would often work its over and off my shoulder and then the guitar would hang all catty-wompass and it became difficult for me to carry.  The straps on this Fender stay put - love it.The guitar I tote in this bag is a Martin HD-28.  But, it can also my Blueridge BR-180 or my Seagull S6 Coastal Spruce.  Either of my three acoustic guitars fit the Fender gig bag perfectly.Like I said, its a great gig bag.  If I ever need another, I'll be getting another Fender gig bag.", "id": 469}, {"review": "I have two of them.  One in the guitar case holding my Martin HD28 and the other in the case of my Blueridge flattop.  Just clip it on about the nut and tune away.  Pickers playing next to me don't interfere with me tuning.Works great!", "id": 635}, {"review": "I played the Wedding March at my son's outdoor wedding back in April and I needed an amp so folks would be able to hear me.  I plugged in my Martin HD-28 and all went well.  The Martin has an Fishman Infinity Pickup (narrow style) in it and together with the pickup, this amp put out a real sweet sound.  As I said, the wedding was outdoors and everyone complimented me on the Wedding March, so I know they heard me - and I didn't even have to crank up the volume.In my den, when I practiced, I barely raised the volume, else it would have been WAY too loud.  So, in short, I'd buy it again.", "id": 703}, {"review": "I wasn't sure about all the hype folks were giving this cable, but I am now - it really improved the sound of my acoustic guitar through the amp.I did a little experiment.  I plugged in my old cable, played the guitar as I adjusted the amp until I got a pleasant sound from the speakers.  Then, I turned the amp off, unplugged the old cable and plugged in this new Monster Rock cable.  Next,  I simply turned the amp back on (the sound levels were already set and I did not touch them) and played my guitar again.  The volume was louder and I think nicer with the new Monster cable.I'm buying a few more Monster Rock cables to replace all my old cables.", "id": 125}, {"review": "I've been playing for about 17 years.  Most on my playing is with a bluegrass band here in Columbus, Ga.  My performance guitar is a Martin HD-28 and my practice guitar is a Blueridge BR-180.I wanted a third guitar just for kicks.  I'd been looking a Taylors, but didn't want to spend that much money.Enter the Seagull S6.  A fellow picker asked if I'd ever heard of a Seagull - I hadn't - he said they were nice guitars and I ought to check them out.  So, I did a little research.  I first read all the nice reviews here for the S6 and then went on YouTube and listened to a few.  My guitar is a Seagull Coastline Spruce S6 and I really like it. I choose not to get the cedar top version because the cedar is soft, and I understand that the spruce has more volume. I got the S6 today and this evening my wife, with her Taylor GS Mini, and I, with this S6, played Smokey Mountain Memories.  Nice, real nice guitar.I found that the action on this S6 is pretty good out of the box.  I'm going to take it to my luthier tomorrow and have him install a strap pin/peg on the heel and take a look at the action at the same time, if he can make the action better, I'll let him.  I'm also going to put on some Elixir Light strings.  I don't know what kind of strings are on it out of the box.But, the bottom line is that I am very happy with the playablilty and the action of this Seagull Coastline Spruce S6 acoustic guitar right out of the box.  I'm glad I bought it.", "id": 432}]