[{"review": "Having recently purchased an Epiphone EL-00 I went about changint the bridge pins and bridge itself from the installed plastic units to Graph Tech's Tusq material. It is hard to emphasize just how much they have improved the tone of what was a very good instrument to begine with. The top resonates with a greater sustain due to the vibrational transfer of the Tusq bridge and pins, the note to note defination went from very good to exceptional. This was one of the best modifications I have made to an instrument in many years of tweaking my instruments. I have a nut on the way to complete the upgrade...I can barely wait. I highly recommend this product it will give your instrument a new voice.", "id": 415}, {"review": "tubes come out of the same two or three places anymore...there is a definate consistancey issue and a few places where the seller (JJ Tubes) can specify specs to make their particular tube stand out. JJ seems to have a smoother sound than most. I've recently replaced the tubes in a little VOXAC4 mini and two Epiphone Valve Jr's that came with Sovtek EL84's and 12AX7's and am really impressed with the discernable difference in tone. There was a real payoff in this small change, the pre-amp tubes made the rest of the difference. You don't need to spend big money for tubes...these JJ's work really great.", "id": 687}, {"review": "This little tuner is so easy to use and see...I bought two more as presents. The price point was just unbeatable for such a stellar performing tuner. If you don't have a tuner or are looking for a new one, you NEED this one. A+++", "id": 707}, {"review": "This is a very quite tube and has all the gain you'd expect from a great 12AX7 tube. If your looking to push a power tube into distortion this little bugger will definately do the trick.", "id": 514}, {"review": "Behringer makes a LOT of electronics for guitar and bass. I have an FCB10 that I use and like, great controller for the price. The CS400 at roughly 20.00 is a decent pedal that will 'get the job done'. Is it equivalent to a Boss, Dynacomp, Visual Sound or Keeley compressor...nope. You will get 20.00 worth of use out of it though for sure. The housing is pretty flimsey and when you change the battery its a PITA. Just don't take a flying leap to stomp on it and battery consumption is really low so with a lot of use you may have to change the battery once or twice a year. Good pedal for the beginner at an unbeatable price point.", "id": 645}]