[{"review": "I purchased this to connect a Sennheiser E825 mike with guitar amps. This requires, of course, the addition of a 1/4 inch adapter plug. The cable itself has worked perfectly and proved both durable and of a suitable length at least for jamming with friends and playing in small venues. Recommended.UPDATE: I marked this product down one star after a connector fell apart during what I regarded as relatively light duty. The set screw fell out and could not be found. I've had similar problems with other Pyle products. If you buy them, I recommend tat you get a micro-screwdriver set as well so that you can tighten te connector screws before you have a similar xperience.", "id": 21}, {"review": "This is fine as a general stick-on inexpensive pick holder. It doesn't hold very many picks, but it really doesn't have to. I would give this five stars except that I really prefer the Planet Waves LED key chain/pick holder over this. It costs more but has more functional value to me. If all you need is something very simple, and you have a surface you can stick it on, then this is fine.", "id": 167}, {"review": "Dava picks are one of life's guilty little pleasures. They may seem pricey for picks, but they're still not that expensive. I bought this batch of picks when I realized my Davas from three years back were all gone.I use these to play slide. I also have Fender and Musician's Friend picks, but those are just the standard flat stamped-out pieces of plastic. The Davas offer a much better grip and a greater sense of control. And they just plain feel good to use. The other picks have more of a tendency to slip and slide, but with Dava you get a great grip.", "id": 170}, {"review": "This is a terrific value for anyone who wants something like the Shure SM58 but doesn't want to lay out $100. I bought it myself as a kind of experiment. I'm learning blues harp. I wanted to try out mikes that could be used for a combination of vocals and harmonic playing. For this reason, the mike had to be one that I could cup in my hands but also mount on a stand. While my Astatic JT-30 has the great shape and crunchy sound that harp players love, I can't (easily) mount it on a stand and use it for vocals.The spherical receiver makes the XM8500 pretty easy to cup in my hands. The torpedo body mounts easily on my OnStage boom mike stand. And the low-impedance output feeds nicely into my guitar amps with no need for preamping or impedance-matching (and no resulting noise or signal loss).The mike isn't perfect, but its low cost and generally excellent construction more than make up for the slight deficiencies. Here are a couple of more casual notes:1. The mike in the picture looked bluish to me. What I actually received was a mike with a very nice black finish.2. The product description seems to report a weight of 8.5 ounces. I measured this mike at 10.3 ounces. That gives it a substantial feel although the mike is still a bit lighter than similar dynamic mikes that I've used.3. The mike has 500 ohms impedance and a frequency response up to 16,000 Hz. Bluesmen prefer a cut-off at 10,000 to give a midrange boost, but tweaking can compensate for the extended range on this mike.4. The mike doesn't have an on-off switch, perhaps its  only real deficiency. These switches really are very handy.5. In actual use, the mike dosn't seem very susceptible to pops, and there is no hiss.6. The mike comes with a pretty substantial hard-shell carrying case with a molded foam interior that is more than enough protection. I find a smaller zippered case to be more convenient for pacing this mike in a suitcase, but if you are toting a fair amount of equipment around, or storing this at home, then the oversized case should work well.I hope this helps.", "id": 213}, {"review": "I purchased this to interface the XLR plug on a Sennheiser E825-S mike with the input on guitar amplifiers. it seemed to work very well in this role. It was well-constructed, with all the connecting points working precisely and securely.Somewhat after the fact, I started worrying about whether I should have instead gotten an adapter with impedance matching capabilities. I'm hardly a professional technician in this area, but I did do enough research to figure out a good working answer: Lo-Z (low impedance) microphones (say, 1,000 ohms or less) generally do not have to be matched to solid-state amplifiers, which are likely to have Hi-Z (high impedance) inputs in the range of 10,000 ohms. These amplifiers ae generally designed to accommodate a 10:1 impedance ratio (load to source). I calculated the signal loss of such an arrangement in the range of 0.83 decibels, which is incidental.This corresponds to what my ears tell me: this adapter works just fine without impedance matching. I can't say for sure whether that also holds for tube amps but will update my review if I have a chance to find out.UPDATE: since I wrote my initial review, I have discovered that Pyle seems to have a problem securing its connectors properly with set screws. If you purchase this item, I suggest you have a micro-screwdriver set handy so you can tighten everything up before you discover to your chagrin that a loose set screw has gone missing or caused your connector to fall apart.", "id": 249}, {"review": "I bought this two years ago for use with a Takamine. It hasn't seen heavy use. It wasn't supposed to. It sits in a corner of the living room, holds the guitar securely, and doesn't cause problems. Although it does make my ownership of a guitar more obvious, and my 91 yo neighbor was convinced for a year that I was drunk and  wailing away on the guitar at 3 am. At least, that's what she told the police.This stand is very similar to the slightly better selling Musician's Gear stand. They might actually be the same stand under different names. The pricing for both is very close if you consider shipping. If I were to buy a stand again, I would still get this one because it's available under Prime. The other one isn't. That gives this stand more value.The stand is very easy to set up. The lower cradle is not fixed and adjusts itself to the appropriate position for your guitar. This took a little getting used to, but it does work very well. The padding on the stand does protect my guitar well. Extended contact with the guitar surface has not caused any problems.Given the very low price, this is an excellent choice for a living room stand. If you're on the road or performing, you might need something a bit different, but I can definitely recommend this for casual players like myself.", "id": 258}, {"review": "This micro amp is a real blast in more ways than one. And it is NOT a toy. Don't be misled by the price--this is a real amp based on stompbox electronics, and while it may not be a Marshall stack, it is more than adequate as a highly portable practice amp as well as a performance amp for small spaces. It is certainly loud hough to evoke complaints from my neighbors in adjoining apartments.I bought this amp for use durng harmonica practice. To this end, I use the belt clip to mount it on my hip. Then I just patch in my mike, twiddle the controls, and go to town. The tone has been fairly pure although, with a mike at least, I can also get some pops, crackles, and squeals. This is pretty typical for anyone amping a harp, so the Honey Tone is not at fault. In general, this amp is pretty forgiving of the input. I've used it with a high-impedance mike (Astatic JT-30), a low-impedance mike (Behringer XM8500), and electric guitar (Fender Stratocaster). It handles these without noticeable signal loss.What is this amp exactly? My guess is that Danelectric took the circuitry for its overdrive stompbox, added a 1-watt amplifier circuit, and put the whole shebang into a retro case. The result is quite appealing. And the overall look and feel is one of quality. The case is solid albeit plastic. The three controls (volume, tone, and overdrive), while not detented, have the smooth control that you tend to get on better components. The input 1/4-inch jack and the mini jack headphone output are all solid. Someone in Danelectric had a sense of humor in touting the unit's \"leather\" strap, though. It is more decorative than useful.If you can operate an overdrive stompbox, then you know how to work this amp. The volume control is obvious. The tone control alters the bass/treble mix (but not very significantly, in my opinion). The overdrive control adds fuzz and distortion (again, not to a great degree). The instructions describe 16 \"sounds,\" but someone in Danelectric has a sense of humor. Otherwise, why label one setting \"Send the cats under the bed.\" Ignore the instructions and set the controls to whatever sounds good to you.As I said, this is small but really not a toy. I've personally found it very useful in practicing blues harp because it's so easy to set up and so ridiculously portable. And when I decide that I'm good enough to panhandle in Penn Station, this baby is going with me.", "id": 303}, {"review": "I bought this in lieu of the more expensive Lee Oskar rack. I'm not a regular rack player and just wanted something to experiment with. This rack is constructed better than I had really expected. It's easy to adjust. However, I found the fit around my neck and the angle of the harmonica to be a bit awkward. Getting he harmonica unto te spring-loaded holder can be a bit tricky. Still, this is a good deal.", "id": 354}, {"review": "Since I paid about $13 for this, I was not expecting a great deal. What I received was a decent enough floor switch for a Fender Mustang I or II. It works well as a way to switch between two user-determined presets on my Mustang II. Construction is about as good as I would normally get on a $13 item. It would be nice if the switch design allowed greater flexibility, but that's a function of the Mustsng II design overall. I'm not grading the switch on that.If you have a compatible Fender amp and can get this for less than $15, then it's a good deal. If prices go above that, best to wait it out or check the pricing of used units on the Amazon Marketplace.", "id": 563}, {"review": "There's just no way I'm going to give five stars to a piece of rubber. That's what this is. It doesn't even look quite as good as the picture, largely because the guitar picks laying on the top help a lot to dress it up. Without those picks, it's just black molded flab.The damnable thing is that this flab is actually quite useful. I bought this on a whim and cringed when I opened up the box. But for the last two weeks, it's been propping my Takemine up against a coffee table. The rubber is thick enough and non-skid enough that it keeps the guitar in place. Effortlessly. It may not be much to look at, but it works really well.The top portion that rests on a table surface is about 1/4 inch think. There's a nub in the front hat pushes up against the corner of he surface and fixes the rest in place. That's about 5/8 inch thick. The cost of materials is probably not more than 50 cents, but it's the design that sells this thing.If you can find this for less at a local shop, go for it.  I paid Amazon $6. Even at that, I consider it a good buy.", "id": 746}, {"review": "I can only repeat what everyone else has already said: this Kyser capo is designed and built very well. It's easy to put on and adjust, and just as easy to take off. There are probably a few capos out there that are a bit flashier, but this is still pretty stylish. And the price makes it a real bargain.", "id": 25}, {"review": "I purchased this for use with a Sennheiser E825-S microphone and the bestselling On Stage boom microphone stand. The mount has exceeded my expectations. The fit for the stand is perfect, with the mount pivoted so that the mike can be adjusted up or down. The part actually holding the mike is flexible and rubbery, making it very easy to slide the mike and its cord in and out. A screw tightens te pivot if this needs to be fixed more firmly in place. All in all, a very worthwhile and economical purchase.", "id": 247}, {"review": "This partial capo from Kyser has the same design, construction, and ease of use as Kyser's top-ranked and bestselling 6-string cano. It is definitely recommended. If you choose to go down he partial capo path, though, it's best that you either jam with friends who are familiar with partial capos or buy Randall Wolliams' manual on the partial capo, since its use is not intuitively obvious.", "id": 345}]