[{"review": "These have good tone, but I can't see much of a difference over other brands at the same price point. I initially experienced buzzing after the string change with these but I needed to adjust the truss rod. Came in a timely manner from Sam Ash. Thanks!", "id": 156}, {"review": "I have tried a few types of strings on my p90 Epiphone Les Paul, and I find these Ernie Ball Power slinky 11's to have a lot of power and punch to them, as advertised, and give me the nice tone I was looking for. The power and thick sound is due to these strings being a heavier gauge than the strings that usually come with a guitar. It will take a little more finger strength to play these but it is worth getting used to. These strings work well with the many different types of rock I play, and will work even fine with drop c tuning. They have also been as durable as strings get and do not lose their tone for quite some time. I prefer these power slinkys over D'addario xl 10's, over regular slinky 10's (which I used to like until I tried these), and even prefer them over the more expensive full nickel Rock 'n roll slinky 10's which surprisingly sounded boring when compared to the energy the power slinkys give you. I would say the power slinkys give off a sufficiently bright sound, but not excessively bright, and I would recommend them to anyone thinking about giving them a try.", "id": 239}, {"review": "I've been using a very cheap amp for too long and decided to try a tube amp. This thing gave me chills the first time I played it as my wife was staring at me with open mouth after I unboxed it and turned it on thinking at first \"you wasted our money on this\" which turned to \"dang this thing sounds good guess it's ok with me\" as I begin to shred on it with my p90 equipped les paul..The tons of effects are very nice and sound very realistic, and for 5 watts this think can play ridiculously loud and clear in a large living room or small venue, though I don't think it is loud enough for a drummer. It has line out and speaker out which is great, and this amp has nice build quality. Plus it's on sale right now so snatch one before they're all gone. I would gig with this miked or even record with it and plug the line out right into recording device. Note that this thing takes about 15 seconds to warm up so you can't just flip it on and play instantly (not a huge deal, just turn it on before you get situated). I wish they could have crammed a 10 inch speaker in it, though the 8 inch in there sounds rather decent for what it is and is very efficient. So stop thinking about it and just go buy it!", "id": 553}, {"review": "Does what a strap should- holds guitar fine and is built well for five bucks. I like the unique pattern on this thing too. Came in a timely manner, what else is there to say? Made in Canada.", "id": 657}, {"review": "As stated in the title, this adapter is what you need if you use your Danelectro a lot and are going through too many batteries. You can now plug it into the wall! As advertised, it keeps electric current hum to a minimum and has functioned fine for the year or so I've owned it. The reason I took off one star is because the wire is really thin and doesn't seem too durable, so because of this I have been very careful so it doesn't get broken. You might be able to find an off-brand adapter for cheaper but this one is made for the Honeytone so you won't risk ruining it.", "id": 40}, {"review": "Not too light and bendy, not too heavy and stiff, these picks are just right. Dunlop also makes quality picks, and I have yet to break one of these. They last a long time. I am a guy so at first I wished they weren't purple, but since Dunlop only codes their sizes with certain colors I like them so much I don't really care what color they are anymore. I bought a pack of these picks for much less money at my local music store so I would recommend looking there first. Now please stop cutting up milk jugs and go buy these. Now!", "id": 69}, {"review": "I have owned this guitar for about 2 years now, and it still has a great sound and is very playable, especially for the money. It stays in tune very well even though the tuners do seem a little cheaper than Epiphones I've owned in the past... but hey, they work so why change them? The overall fit and finish of the guitar is excellent for the price point, and mine has the flat black finish which hides fingerprints very well. The neck is fast and smooth and great for quick playing. The single coil p90 style pickups on this guitar scream with their own beautiful raw sound, and were the reason I bought this guitar. Take note that p90's do make a humming sound when you're not playing, which can be remedied by turning down the volume knob. This is why humbucker style pickups were invented, but the compromise of a humbucker is you lose a lot of the bite and energy that p90's give you. It really has the sound of a higher dollar guitar. I currently play it through a Fender Vibro Champ tube amp and this combo really makes playing guitar fun. I recommend this guitar if you're on a budget like me, or even if you're not on a budget and want a p90 equipped guitar in your stable.", "id": 816}]