[{"review": "I've long been partial to D'Addario strings--I don't have a guitar without them. These phosphor bronze models have found a home on my Epiphone flat-top.  As the package says, they're warm and bright--leaning just a little toward the brassy side.  They project without sounding harsh or tinny.  Playing feel is fairly smooth for round-wound strings and they last for ages.  This is a good intermediate gauge: light enough for lead work, but substantial enough to provide good backing.Guitarists tend to stay loyal to a maker and model of string.  My loyalty is certainly not shaken.  For any guitarist on another string whose loyalty might be wavering, these will reward an audition.", "id": 130}, {"review": "I've picked up a few of these for my various guitars.  I've found it to be steady and stable and it hasn't left a mark on either my large archtop or my Les Paul.  The little locking strap that goes across the neck cradle is a big plus too.  I've seen plenty of lesser stands for more money, so this one is  my first choice these days.", "id": 258}, {"review": "This is a reasonably robust stand that easily carries an 88-key keyboard.  The front-back spread on the legs is a little too narrow for stage applications, but having room underneath for pedals is a huge improvement over the more-common 'X' stand.", "id": 358}, {"review": "My studio has powered monitors which require balanced inputs.  I purchased several of these cables at varying lengths and found them quite acceptable for this application.  I'm not sure I'd put them in my remote recording kit--they're not really heavy duty.  But for speakers or other static applications, they're just fine.", "id": 602}, {"review": "This is not a pick for windmilling guitarists.  This is a pick for the precision player.  It's really small--noticeably smaller than the red Jazz III picks.  With large fingers like mine, it almost disappears.  But the aggressive grip pattern keeps the pick right where you want it.  It's a very stiff pick, with just enough give to keep from sawing your strings off.The picks are first-rate.  Based on my previous experience with Dunlop picks, this 6-pack will last me for years.  I'm inclined to lose a few along the way, just so I can give Dunlop some repeat business.", "id": 686}, {"review": "This is an intriguing idea for a microphone: a nice condenser with built-in monitoring.  A possible simple solution for the musician who really wants to keep a rig minimal.  It seemed to me that I should test it both as a microphone and as a USB IO device.  The very first appearance is impressive.  There's a nicely-compartmentalized carrying case.  Inside, there's a milled aluminum desk stand, a cable, a short manual and the microphone.  No shock mount. The mic looks good, but has almost no mass.  While this may not mean much, I own and have used lots of mics--none of them this lacking in heft.I set up a shootout in my studio. I have an acoustically-treated room with calibrated studio monitors, so I think I can do a fair test.  I kept it simple, using a steel string guitar played in several styles.  For a comparison mic, I used an AKG Perception 420.  This is a multipattern mic that's only a little more expensive; a cardiod-only version is exactly the same price as this MXL.  I used only the cardiod pattern, so I think it's a fair comparison on the basis of price.  To get to the point, the AKG beat the MXL in every way.  It was quieter, with a much better midrange.  A glance at the specs (online at MXL) shows a significant boost in higher frequencies, leading to about a 3dB rise at 8K or so.  The polar pattern is shown only in broadband (not at multiple frequencies) and it shows a dip at the 45-degree position.  These were things I could easily hear.So purely as a microphone, the MXL doesn't match up to other mics in its price range.  But that's not a complete comparison.  The MXL has a little headphone jack on the side so that the performer can listen with zero latency.  That's a plus that comes with a couple of big minuses.  The mic is vulnerable to cable scrapes and vibrations coming down the headphone cable--better make sure you hold still when you use it.  There's also a volume knob that appears to affect both listening and recording level.  This means that it's easy to inadvertently skew recording levels when you're mounting the mic or tweaking your listening level.There's also an optional software control panel (Mac and Windows) that goes with the mic.  It provides a noise gate and compressor as long as some basic controls for recording and monitoring.  I'm unlikely ever to use this dynamics processing; once done, it can't be undone.  I'd apply those after the fact when I've got plenty of time to dial them in.  This leaves the level controls--a place where MXL could have been more careful.  There's a microphone gain which works in conjunction with the thumbwheel on the mic itself.  It takes some doing to figure out which does what.  There's a highpass filter--tremendously useful when rumble is a problem.  But we don't know if this filter is in the analog or digital domain.  I hope it's analog, but there's nothing about it in the documentation.  Then there's the biggest problem.  There's a playback level control which allows your mix to play back through the mic's headphone jack.  But this also means that--depending on your DAW--it's easy to set up a feedback path.  You won't like that.The biggest question in my mind is \"just who is this microphone for\"?  A traditional mic can be connected to any preamp and used at any sample rate.  I have mics (both expensive and inexpensive) that I've had for years and years.  Only the preamp/interface changes.  This MXL is USB-only, 44/48 only.  You can't easily set up multiples of USB mics without clocking issues.  Most USB/FIrewire mic preamps have a zero-latency monitoring mode, so the mic doesn't really offer anything you can't get elsewhere.  In the end, I don't really think this is a good choice for any but the most casual of musicians.  To me, that milled aluminum desk mount holds the answer.  If you're a podcaster or a serious Skyper, then this mic deserves consideration.  It's a decent mic for spoken voice--the HF boost is helpful in bringing out articulation--and the single USB connection keeps your desk uncluttered.  Of course, there are plenty of other choices for that application.  But I think that's the best light to shine on this one.", "id": 712}, {"review": "Any guitarist knows how one of these works.  Clamp it on the head, turn it on, and tune.  I've tried this on several guitars as well as an electric bass.  My only real complaint is that it often takes 3-4 seconds to register the note it's getting.  It occasionally latches onto a harmonic as well.  The low E on my bass will occasionally register as a B (3rd harmonic) for example.  In general, the dullest means of plucking the string (finger instead of pick) will give the quickest and most glitch-free pitch.  All in all, it's a handy little tool to have in the gig bag.", "id": 762}, {"review": "I have to confess to a particular image that comes to mind when I think of capos.  It's the image of an earnest folkie, with mastery of C, G and D, but still struggling with the A. A good player should be comfortable in any key.  But there's still an occasional place for a capo, and that's when you need open strings in a chord.I tested this capo on several guitars, and with one exception it worked well.  Steel-string dreadnought, archtop jazz box, and Les Paul worked nicely.  Not so much on a flat fretboard classical.  The capo has a slight curve that works well on any curved neck.  But on a flat neck there's a little string buzz on the D and G strings.  While the capo's grip is good, it still needs to be fitted right behind the fret.  This means that it can get a little bit in the way for passage work. That's probably a rare problem for the intended user.All in all it's a nice little capo.  Goes on and off with no fuss and fits the majority of necks.", "id": 894}, {"review": "I've been stringing my guitars with D'Addario for several years.  While my jazz box is set up with heavy strings, my Les Paul goes lighter--horses for courses, you might say.  I've been using D'Addario XL strings on this guitar for a while, although it's the EXL140 (slightly larger bottoms).  But why not give these lighter strings a try?  The quality is obviously high.  Tone is good, as is durability.  If you do much complex chording, you're going to miss the heavier string, but for shredders and pure rock players these are very nice.  I'll be going back to the EXL 140s, since I prefer the more positive feel of the larger string.  But fat or skinny, D'Addario makes some of the best strings out there.", "id": 897}, {"review": "I recently picked up aSquier Fretlessbass.  As with any guitar, the factory strings left much to be desired.  With fretted basses, I'd always liked strings with a little brassiness.  But round-wounds just didn't feel (or sound) right on a fretless.  Small vibrato was hard to achieve with the string friction.  And round-wounds just didn't have that acoustic sound.  There were quite a few choices for fretless strings, but I've always liked D'Addarios on my 6-string guitars.  These flat-wounds were a perfect choice.  They've got plenty of bottom, but the midrange is more pronounced than other strings.  The bass sounds more like a 'real' bass.  And the action is now so smooth. I can use a small vibrato when I like--no longer restricted to the wide Jaco-style.There are all sorts of bassists who look for all different sorts of sounds.  But there's something about a fretless that attracts a particular sort of player--the player who wants a bit of that upright bass sound.  As soon as I put these on, I felt like I was home.", "id": 407}, {"review": "I picked up a couple of these straps, one for a Les Paul and one for a bass.  Anyone who's ever played a Les knows that a wide comfortable strap is a must-have.  This one fits the bill.  The end-pieces are thick, with a peg-hole that just fits--not so small you have to cut and not so large you're worried about the guitar slipping out.  The cotton strap itself is pliable and comfortable.  It doesn't scratch like the plastic straps do and it doesn't grab your shirt so badly.  Can't complain.  Good strap at a good price.", "id": 658}]