[{"review": "I tried this but ended up going back to Tortex.  I like the satin finish on the Tortex better and the way it bends.  The Ultex has a little brighter attack though and wears out less quickly.  Ultex sounds more like the Fender celluloid.", "id": 54}, {"review": "This pedal works well, and lets you sculpt a pleasing sound to suit the situation.  A little goes a long way with the sliders, and the gain and level functions are occasionally useful.  Nice accessory for a tube amp or an amp lacking good onboard eq.  It makes it much easier to dial in the exact sound you want, easier than messing with eq knobs that can interact with each other.Ten bands is a little overkill for guitar.  Three of them are outside the range of the instrument, but I bought this one because I like that it blinks if clipping, it has the extra volume and gain sliders, and comes with the AC adaptor.  This adds no noise that I can tell, except if the sliders are up it amplifies noise already there.It's an all around quality product that I imagine I'll still have twenty years from now.", "id": 140}, {"review": "I have a 5 watt combo amp.  I was looking for a smoother sound, and got it in this tube.  It lacks the brutal attack of the Sovtek and the all around bright articulate response of the NOS RCA gray plate I tried for over a year, but I'm really liking this sound for what it is.  I think a tube amp ought to be warm and musical, with nice natural compression, and that's what I'm getting out of this JJ.", "id": 228}, {"review": "This thing works well and is a little easier to see and less jumpy than my old tuner.  The LEDs are a little cheesy compared to the old one though.  But maybe that saves on battery life.  I don't know.  It gets five stars for just doing its job quietly and for a fair price and not breaking.I'm also glad I bought the one specifically for guitar/bass and not the chromatic one.", "id": 331}, {"review": "I am average build and play a strat.  I shouldn't have to feel like this thing just barely fits me.  I wish it had at least one more inch.", "id": 481}, {"review": "The reverb broke in my amp and I tried the Boss FRV-1 to replace it and didn't really like it too much.  Then I read that a darker analog delay can sort of sound reverby.  This is exactly what I wanted.  It fills out the sound and yet doesn't add any artificial high end.  Sounds gorgeous for what I do, which is playing alone in a basement.  For most songs it's always on, and it really excels at vintagy-sounding stuff like Rockabilly and Surf.  The mod button is a nice add-on but I haven't really bonded with it yet.If I had to buy this over again I might consider the Aqua Puss because I don't use the high delay times all that much and the Aqua Puss has an easy access battery door.", "id": 507}, {"review": "Kudos to Fender for making an amp like this available at this price point.  It has 25 watts of power, a 10 inch speaker, a real spring reverb, and it's a traditional analog circuit without a digital processor.  It will make your electric guitar sound pretty much the way it's supposed to.The downside is that when I compare this amp to what Fender was selling fifteen years ago, the Champion 110, it falls a little short.  The particle board cabinet is thinner, the speaker is less hefty, and the whole thing feels and sounds a little less substantial.  It's obvious that the bean counters really pushed to get this thing as inexpensive as it is, and they also moved production to Indonesia from Mexico.  Maybe weight is a factor in shipping it across the ocean.All the same, I can still recommend it because it beats the crap out of digital amps and it gives you substantial power and a 10\" speaker and real Fender tone and looks.  Fender probably figures that players flush with cash will prefer a well-made tube amp or an amp with tons of digital modeling, but I kind of wish they still produced a solid 25 watt analog practice/light gigging amp.", "id": 223}, {"review": "I'm using this in V1 in a 5 watt tube amp.  It's really nice.  I tried the NOS route and I much prefer this tube.  The other good thing is it comes in a box from JJ, unlike some tubes from other places I've ordered where they seem to lose their original boxes along the way and it looks like everyone and their brother has been messing with them.", "id": 459}, {"review": "These cables are made from top quality components and expertly assembled in the USA.  I had one just like this with the Neutrik connectors (gave away as gift) and now have two with the G&H; Show Saver connector option.  This makes them similar to some boutique cables that cost three times the price.These cables are well-balanced with articulate mids and highs and tight bass.  They are well-shielded, look nice, and handle well.You could pay more for gold plating for slightly better corrosion resistance or for woven coverings to make the wire look cute, if you want to.", "id": 512}, {"review": "I tried this at the store.  It looks like it would protect a guitar, but the latches are kind of large and clumsy.  The interior was nothing special either.  I passed.", "id": 557}]