[{"review": "Time will tell if they last longer than strings 1/3rd the price. Visually, they don't appear any different than cheaper Bronze wound strings. I was expecting something different, but as far as sound goes, the strings tuned well and only required some stretching 3 times to get them to stay in tune, even after playing &#34;smear notes&#34; on several songs. My problem with cheaper strings (De'Angelo) was they would tarnish or rust quickly, the winding would come lose and bare the inner string over the fret marks on the guitar. The company claims these are treated to prevent corrosion and should last 3 to 5 times longer. I'll know in a few weeks if that statement is true or not. Since these are literally triple the cost, I'll know if it was worth the extra expense. Hopefully these are made in the USA instead of China like most other things we buy in America. Good or bad, once I see the longevity of this set, I'll add to this review at that time.", "id": 104}, {"review": "In 40+ years of using many Jim Dunlop products Made in America or to his standards of quality, I've never broken or worn out the capo. I use mine on both 6 and 12 string guitars. The spring tension remains strong after several years, which keeps the sound nice without the strings being muted or buzzing. The only problem I have with them, they seem to disappear when I'm not looking. I have used other brands where the rubber leaves marks or sticks to the neck with prolonged use. Other than smudges from getting the capo dirty, it cleans easily.", "id": 116}, {"review": "I've purchased these locally several times over the past three years at a music store. Mainly due to the low cost. They work okay, but are difficult to keep in tune. The guitars have to be re-tuned often when temperature, humidity, or playing more than ten minutes occurs. My biggest complaint is tarnish and corrosion. Add that to the winding separating over the fret bars exposing the inner solid string, then the strings go \"flat\" sounding. These are not quality strings at all, just cheap Chinese Made quality. They are okay for someone that doesn't play often, but if you play daily or as a performer, avoid these strings. Better strings are worth the extra cost. You actually save money by not having to replace them often as you do with these cheap strings. I've had this problem with all the D'Addario brand strings, both for electric or acoustic, 6 or 12 string guitars. The thinner gauge strings will break during tuning or playing. The tarnish and corrosion often ends up contaminating the fret bars and keeping the neck dirty all the time. Cleaning after each playing session only makes the strings corrode faster.", "id": 156}, {"review": "So far still Made in America. I have been using formula 65 guitar polish for over 40 years since a time when my hair was longer as a hippie growing up with heavy metal. I've polished many guitars multiple times. This gets the grime and fingerprints off the body and neck keeping the instrument looking like new. It works great on acoustic and electric, solid or hollow body, acrylic or lacquer finishes without streaking. It even cleans Finger Ease lubricants off the neck and strings. I haven't needed other products separately for the neck or strings since this works great on both.", "id": 234}, {"review": "Others that reviewed this Item I read before purchase, noted it is not &#34;Large&#34; and the picks have to be warmed and shaped to fit your thumb. I also found in original &#34;Large&#34; size, The curve of the pick will cut into your thumb from improper shaping and being too small for the average American man. I am still in the process of shaping all 5, but otherwise they appear sturdy and I haven't broken more than one of similar type in several years. I expect the pick to wear down from use. They appear to be about the same quality as Indigo brand, but not shaped as well for the average player.", "id": 617}]