[{"review": "This pedal is a must have for any pedal board. I love the overdriven sound of this pedal in that it has a distortion element but not so distorted single notes are lost in the fray. Thirty some odd years and counting and still one of the best.", "id": 35}, {"review": "This little guy does all it needs to do. Once plugged into your board you can litterally ballance yourelf in the monitor without worrying about the sound guy.", "id": 380}, {"review": "The locking tuners are a great add to my 09 strat. They went on easily but, I noticed they are staggeered so make sure the the taller tuners begin at the low E. After the install I stringed it up and played for a couple of hours. Cosmetically they do look cool and functionally which of course is the purpose they keep it in tune. I am not a big trem guy but when I use it I do not \"now\" have to worry about its tuning.", "id": 387}, {"review": "I have purchased three of the Fender \"f\" neck plates for three different MIM Strats. They all went on easy, caused no problem and they look really cool.", "id": 475}, {"review": "I purchased this pedal with good expectations. However, my expectations were dashed at the constant popping every time the peadl was engaged. I tried different configurations on my board but the popping remained. Overall the pedal sounded descent for a $30 pedal but I could not handle the frustration. I traded and another joyo for a Ibanez stereo chorus.", "id": 731}, {"review": "I like MXR products however I am always Leary of the metal button on pedals because of the possibility of the pop factor. The dyna comp does still equal out my sound from clean to overdrive. A must for pedal boards.", "id": 137}, {"review": "I have three of these straps more my Strats. Very comfortable and durable. I really like the metal link as opposed to the plastic link which hold the strap itself to the the leather button hole. Great product!", "id": 353}, {"review": "A genuine Fender part that looks great on my '10 MIM Strat. Good price and it arrived quickly as well.", "id": 562}]