[{"review": "It's yellow, its metal, its Boss.  If you want your drive sound to have definition this is the pedal to get.  The best OD I have ever owned.  Makes me want to see if my tone could cut board in half.", "id": 38}, {"review": "Guitar picks make a huge part of your tone.  Especially on acoustic.  These are the best acoustic picks on the market today in my opinion.  They have a long life and do brighten your tone.  Freshening up the picks is easy just by rubbing them on your carpet or  carpet scrap to bring back the original shape.", "id": 54}, {"review": "I bought this pedal as a companion to my Roland AC-33 Acoustic Amp.  The pedal on its face looks like a good piece of equipment and feels quite sturdy.  However you do have to use a 9 volt batter to make it operate.  This is totally unnecessary for a foot-switch.  The worst part is the leads on the battery connector (9 volt) were not properly soldered or had shorted out.  The only way I could get it to function was to let the 9volt battery dangle just right and connection would be made.  For the rather high asking price and the limited function that is needed (i.e. all that has to work are two switches and a battery) you would think that Boss would put out a better product.  I also found that the battery cover was extremely cheap and was difficult to close, leading me to believe that the durability of the cover was in question.  I would HIGHLY recommend that you look to another maker for a switch or consider constructing one yourself with readily available parts that can be purchased on this site.", "id": 412}, {"review": "Got to admit I was a little intimidated by the installation process when I was shopping for this pickup.  But when I got the box I was pleasantly suprised to find excellent instructions (not too long, not too short) along with plenty of supplies to complete the instillation properly.  The jig method is super easy and provided great results.  I was really excited to try out the pickup so I plugged it into my Roland AC-33 and let her rip, it was awsome, very full and very representative of my guitars sound.  K&K you have a convert in me.  I am now thinking about trying this on my Martin!", "id": 416}, {"review": "I also own an Olympus LS-10.  This gives me the same recording ability 96/24 but it is much less expensive.  You do get the ability to record with four channels which I am dying to try once I get my hands on 5.1 encoding software.  Also nice and not included with other brands, A tripod to hold the unit, a handle to use the unit like a microphone, charger, and earbuds.Some have noted the zoom doesn't have speakers built in.  If you truly want to monitor quality those tinny little built in speakers are not going to cut it.  You need monitors or quality headphones.  I find that inner ear monitors work best in noisy environments.As I said in the title there is a tradeoff in terms of material.  Olympus does seem to have more robust casing and controls.  This may be a big issue if you don't treat your equipment carefully.  Time will tell, but I have no doubt that this zoom unit is a solid product especially for the money.I am also looking at the Zoom H1 which will come out in Sept. 2010.  This product may actually be the LS-10 killer.", "id": 463}, {"review": "This delay is really nice, especially for the price.  I am a fan of the FAB line of effects and have several of them.  My favorite is this delay and the Echo.  They have been very durable and I am confident that the plastic body of the pedals will remain durable.  My only complaint is the markings on the level knobs.  They have a very thin pale red line that is hard to see.  This could have been more thoughtfully desingned with a thick bright white line that would contrast against the knob surface.  This can be done yourself with a paint marker or whiteout brush, but it should have been considered ahead of time.", "id": 716}, {"review": "You know the problem with 9v wall warts is that noise in the signal can be a problem.  I am powering my 9 unit pedal board with this adapter and it works great.  I have used it some at lower voltages, but only on my older analog pedals.  I wouldn't reccomend running digital effects at reduced voltage.  The cord is a little wimpy compared to my Boss PSA adapter, but it is acceptable.", "id": 760}, {"review": "Capos are a funny thing, there are some that work great and many that aren't so great.  My capos include, Bird of Paridise, Paige, and Kyser.  This is a very fast and easy capo to use, the tension adjustment is fast and easy. If you need an all around capo for a six string guitar, this is it.", "id": 490}]