[{"review": "Currently my favorite pick, it's thick enough to control and the etching makes it easy to handle. I'd recommend to guitarists for jazz, fusion or the like.", "id": 66}, {"review": "I have one of these in every one of my cases. It's a plastic sponge holder with holes in it; nothing special but it does the job.", "id": 71}, {"review": "The peg winder is what it is, it winds pegs and there's not much to it. The string cutter is too bulky to use in most cases so I still need a set of snips when using this thing.", "id": 94}, {"review": "Works great. I use this thing several times per week in rehearsals and it always does the job. My only critique would be in battery life; maybe a different setup (it uses 3 AAA batteries) would provide longer life. Otherwise it's great-", "id": 388}, {"review": "Solid tuner, more accurate than I anticipated and very easy to use. It will get you extremely close and for the size and functionality it seems to be the best product of it's kind that I've used.", "id": 706}, {"review": "I like these little guys. I'm not a big fan of strap locks and these provide more security than a traditional circular end pin at a great price.", "id": 786}, {"review": "I like this volume pedal because you can beat on it and drop it and kick it and misuse the hell out of it and it still works. Why that's overly important in a volume pedal I'm not sure but this one is built like a tank and can stand the beating of regular gigging. It takes up a huge footprint on a board so I generally run it at the end of the chain and to the side but the large footprint allows for getting your whole shoe/boot on the thing and that is comforting while playing. Overall the pedal has a good throw or travel to it and doesn't suck the tone like other volume pedals. Good buy-", "id": 673}, {"review": "I bought the two pack and I've found them both to be a bit finicky. Sometimes they turn on right away and other times you have to click the button a couple times to get it to light up. When they're on and working they work well and I like the small size and tight profile against the headstock, I just wish they were a little more reliable.", "id": 785}]