[{"review": "I'm sure this isn't the best echo pedal (or even in the top 100), but it serves it's purpose fairly well. Stacking with other cheap danelectro pedals will degrade your tone but it isn't something that most of us can't live with. for 14.99 us it's worth taking the risk IMHOUpdate: The pedal gave up the ghost (died) In a relatively short amount of time. I replaced it with  mini modtone type delay.... I actually like the dano sound better, but the modtone will do for a slapback and it is built way better.", "id": 315}, {"review": "This pedal is remarkable for useful tones. The sound may not be for everyone, but i already have a Boogie for the really metal like distortion. I needed something that was different but still usable, and I feel this pedal fills the bill.  The low price tag didn't hurt my feelings either. This is a win-win buying decision as far as I am concerned.", "id": 355}, {"review": "works well with every pedal i tried so far. Can't ask much more than that from it. It was the easiest one on my wallet here on Amazon. go for it if you need one (or 2)", "id": 521}, {"review": "i felt i needed a white strap for an extra one to have around. This makes a good spare, but I would not use it and trust it on stage. It is thin leather and doesn't seem like it will hold up under any abusive situation. That's just my opinion of it, you may not see it like that and have no fear of it. I would fear it.", "id": 661}, {"review": "outstanding pedal and an outstanding company to deal with (hossen). the pedal is everything i expected from it ..and a little more. Good crunch, nice light distortion when you want it, and it is not at all midrange sounding like a tube screamer. A definite improvement on a classic stompbox. Nice work Joyo and hossen for making me a happier guitarist.", "id": 728}, {"review": "does a good job for a basic delay...good for rockabilly and 50's slap echo. I needed it for nothing else so I'm happy. :)", "id": 791}, {"review": "Just for the thickness of the sound this little jewel makes, it was worth giving this box a try. As someone else previously mentioned, set in a tube breakup setting , this device still is a little fuzzy. The tone, none the less, is very usable and sounds great. I'm a  happy customer and am sure most anyone else will be as well. Thanks for reading this.", "id": 795}, {"review": "I bought this with the idea I was getting a pedal that would give me usable Marshall amp sounds. After trying for a couple of hours, I find that it won't do that. I guess my combination of guitar and amplifier wasn't meant to be used with this pedal. The guy who mentioned in the reviews about the sound getting thinner as you turn up the voice control, he was spot on about that (very annoying effect). Nothing but praise goes to the supplier ( KDM Distributors) . They did a fine job getting the pedal to me across the country. But the pedal itself, not for me.", "id": 796}, {"review": "WOW is all i can really say. It made a good solid state amp (80's Yamaha usa-made combo) sound great and full of nice warm tones. I'm using it into the power amp section via effects loop (bypassing the yamaha preamp) and I couldn't be more happy with the results. This ranks right up there as the best money I ever spent on equipment. A definite upgrade.", "id": 798}, {"review": "nice item...works well...great price, no need to own one of the more expensive ones for the job it does. I have to type more... oops got enough typed :)", "id": 802}, {"review": "This review is on the seller Yorozuya Yokoshima ,not the product. These people posted what seemed like a good price (not ridiculously low) on the Us Dream pedal. It was to be shipped from Japan. They then decided the price was an error and canelled my order. This kind of crap makes me wanna stop shopping on Amazon.com because the item was less than $4.00 under the next best posted price and these 3rd party sellers Yorozuya Yokoshima were afraid they wouldn't make a killing on the item. I am thoroughly disgusted with this sort of behavior. I lost a lot of faith in the whole process of buying online over this incident.", "id": 832}, {"review": "This is my second set of these. I bought the 1st set in the 1980's and I'm still using them on the guitar that they matched. (black hardware). I was impressed with the quality of the 1st set and the 2nd set is just as good. Money well spent.", "id": 278}, {"review": "i bought these because i couldn't see spending $4.50 a dozen at the local music store. I figure 12 dozen will last me for years. Get them for yourself if you use and lose picks like I can easily do.", "id": 332}, {"review": "works very smoothly and doesn't eat batteries like the foot pedal types of tuners. We have a local place that sells the batteries for this in a 5 pack for $1.00 (yep a buck). I'm sold on these and will be getting another as soon as I need one", "id": 820}]