[{"review": "Ok I've owned 2 of these Danelectro amps. For one they are cheap in price, loud in output, and can be used as external speakers when attached to computers via wired or with purchase of a cheap Bluetooth adapter from ebay or amazon. Recently I purchased this item on ebay for $10 - Bluetooth Audio Music Receiver V3.0 Wireless Stereo Adapter For Smart PhonesNow I can connect to my tablets, smartphones, and computers and use this amp as a great external Bluetooth speaker.  Plus the battery life is great. Try to buy a BT speaker on amazon with this wattage that's cordless and works from battery power, and you will spend well over $200.The included battery is worthless and dies in about 5 minutes. I installed a 550mah rechargeable 9v battery (ebay) and it lasts forever.Plus I can still use it as a lower quality jam amp when I want... for this price its hard to beat.", "id": 303}, {"review": "I ordered this pedal based on the previous review, but to me it sounds cheap and faint. I do a have a few Behringer pedals and many are very good for the price, but this one I won't be keeping. To me, it wasn't even close to as good as what you get on Fender amps or on my TC Electronics Delay pedal (which includes chorus/vibrato), and I thought that I would go solo with this pedal, but for me it's a no go...", "id": 431}, {"review": "I ordered this pedal based on the previous 2 reviews, but to me it sounds very tinnie and cheap, plus the control knobs were a bit tight and hard to adjust. I do a have a few Behringer pedals and many are very good for the price, but this one I won't be keeping. To me, it wasn't even close to as good as the Fender amp reverbs...", "id": 545}, {"review": "Well I love da Fender products, always have always will. I recently built me a nice custom strat, and had been testing out a few of the various mini-tube amps out on the market lately, (which is where I would categorize this amp) even though it has better tubes and more watts. These are my comparison testing amps, (I own both of the 2 amps below and have also tried a number of others in the music store down the road):Blackheart Killer Ant (12\" Blackheart cabinet)Vox AC4TV8 4-Watt 8\" Compact All-Tube Practice Amp with Celestion VX10 Speaker (also speakered out to the 12\" Blackheart cabinet)I've also tested all my amps in various ways by re-tubing them with a number of my collected tubes:Groove TubesJJ TubesSovtek TubesSvetlana TubesTung-Sol Tubes (gold)and straight out of the box, this thing beat them all of in sound quality, even with what a lot of people are calling a cheap Fender speaker version. I also plugged \"The Champ\" into my 12\" Blackheart speaker cabinet and it sounded even better using my strat (but I will do more speaker testing later). Fender amps have always leaned to sounding better with fender guitars, where as Gibson, Epiphone, type guitars really sound pretty good on the Vox and Blackheart models.Now when this amp came out, it was way overpriced but as always that price has fallin into a reasonable range. I mean the price of all of these mini-tube amps are minimal in comparison to the nicer ones, but again this thing is loaded with better guts, so maybe that why it screams better.... ya-hoo, me likey! Better guts, better performance, plus Fender has added an extra range of effects and amp sounds. Its small in size, light in weight, loud and easy to carry with you for jam sessions.", "id": 561}, {"review": "Well over the past 4 years I've been running through a bunch of these mini, micro, battery powered, small tubed, and solid state, model budget amplifiers.Lets see, done all the Blackheart small amps, the Vox mini-3 & AC4TV, Roland MICRO-CUBE, plus a few other small amps. I just sold my Fender Super Champ XD and wasn't going to get another amp because playing in my apartment with neighbors, I just cannot jam the way I'd like to...I really liked all the above named amps but they really didn't give me the options of cranking it without disturbing my neighbors. Loved the Fender Super Champ probably the best, but there wasn't a headphone jack. Same with the Blackhearts and the Vox AC4TV and the potential of these amps just couldn't be used by me. So I settled on the Vox Mini-3 (4watt), because it has a headphone jack, is also A/C or battery powered, among a lot of other great features and sounds.. but I did have to give up tube amp option...So as I said I sold my Super Champ like a week ago and as I was mailing it out using the Amazon online mailing appz when I saw a picture and price (in the browser) on this new Fender Mustang I and I figured... what the hell. Lets see what its got to offer for under $100. I mean everyone was giving it a 5-star rating, so whats a $100 bucks, even though I've never had a good sounding solid state amp.Well I must say this thing rocks! There are like 3 phases of model amps, most I didn't like at first but was able to fine tune most of em to sound pretty great. I mean its only a $100 amp so it cannot be compared to the real deals, but it does stand up pretty nice. Plus it has the headphone jack (and a couple other plugins and effects) and this thing will blow your ears out. Most amplifier headphone jacks.. tap out and never got loud enough for me, but this thing screams and blow-out your ears. I've had it now like 3 days and was thinking about sending it back, but for $100, there's nothing in the market that can compare or compete with its, SOUND, low pricing, and options... So I'm now glad that I sold my Fender Super Champ XD and bought this one and put the other $150 back in my pocket... ya!This is the best solid state amp I've ever owned and I still miss the tube option.. But I'm sure something better will appear next year and until, then... well a person just cannot go wrong by buying this Fender AMP!", "id": 718}, {"review": "Luv it, I had version #1 and this amp isnt much different.they both are cheap and sound great plus u can connect to the computer software", "id": 882}, {"review": "I do own a few Behringer pedals and many are very good sounding for their price range, and this pedal will stay in my collection.I've spent $200+ for a few of my pedals, but I order and try many other pedals within the same effects range, because some I believe are just to costly for what you get, and the sound quality usually are not that far apart.I would put this pedal in that category. This is my 1st compressor pedal and while I dint think I really needed this type of pedal, for the price I thought I would give it a try... WOW! The Behringer DC9 Dynamics Compressor Pedal greatly enhances the sounds of every other pedal on my pedal-board, plus I get a volume control knob that allows me to drop my amp output level to below where to amp is set. So I can go quiet on an apartment at late hours, with a 100 watt amp, that's nice.So I would say the majority of people will absolutely love this pedal.", "id": 454}]