[{"review": "The product feels a little on the \"cheap\" side, but definitely does the job the way it should- so that's all I care about. It was cheap, and came fast. I recommend it.", "id": 21}, {"review": "I ordered this product to use for personal recording, and thought...what could possibly go wrong? I ordered it \"New,\" and it definitely shows signs that it not new. First, the package was stapled, that's right- STAPLED together in a way in which you could tell the product had been opened. Then, to make matters worse, there is a hole in one side of the fabric. When I order something new, I expect it to be new. Based on this product alone, I would not recommend buying from this seller.", "id": 46}, {"review": "I love this product. It came fast, included extra shockmount line, shockmount, an adapter, the mic, instructions, and a very durable and protective case of easy transporting. The sound quality is great with the Art Tube Preamp(use mic cables, not 1/4\" cables for Phantom Power), and I couldn't be happier with it. It even looks impressive. Although, I do have to say that online the product looks silver and shiny, when in reality it is this \"off-silver\" color. Almost a gold, but not quite. It's not bad or anything, just different. And frankly, the thing could be purple for all I care- as long as it produces great sound, that's all that matters. Great product, and extremely affordable. No complaints.", "id": 159}, {"review": "Does exactly what you want it to do. It even comes with these little clips for running the cable down the stand. It's easy to set up and easy to take down. If you're looking for a mic stand, buy this one- you really can't go wrong.", "id": 279}, {"review": "I haven't used the cable yet, but it looks new and durable. The cable appears to be structurally sound around end connections and seems to be what I expected. Can't wait for the rest of my gear to get here so I can do a sound test. Based on physical condition, I would recommend this product.", "id": 168}]