[{"review": "Well constructed with quality woods, saddle/nut and bracing. Neck and frets are straight, level and do not snag. This guitar rings like a bell, stays in tune and is light weight. Do not let the low price fool you but do not expect the guitar to come set up to your tastes. Any guitar that you buy will need to be adjusted to your style of play. The strings may be too high or too light or whatever, just be ready to do a tiny bit of work to get it like you want it then it will serve you well. Do not buy a Luna, Davidson, Main Street, or any other 'no name' - get this one.", "id": 53}, {"review": "not worth the price or matched the hype that you hear and read about. GHS strings are much cheaper and much better strings than these. I think they lasted a week on my guitar until I could get some more GHS or Slinky Acoustics on it.", "id": 130}, {"review": "it is not a replacement for a TS 808 or 09 but it has its own tone and overdrive which works good enough.", "id": 145}, {"review": "they connect my pedals and with very little signal kill. good buy for the price and nothing else is required. good quality with sealed connectors.", "id": 578}, {"review": "If you have a trem system on your guitar - these 'bullet' ends really do transfer tone energy through the trem block for sustain. I added a big block and these strings and it has really brought my strat to life. Highly recommended.", "id": 667}, {"review": "everything on a fender should be fender parts - these hold as good as dunlops and are easier to get off with sweaty fingers. these give me more comfort because they are locked on solid and requires a push then pull to come off. I get furious when my guitar comes off the strap so this stopped it and kept the fender mojo going.", "id": 682}, {"review": "I probably got the wrong gauge, these things have no give at all due to the thickness but I like the small size. They are about half the size of a standard pick, so they are very easy to control.", "id": 686}, {"review": "Took it on vacation so I didn't have to leave my axe at home. Fit right in the guitar case with my headphones - got my practice and jamming in everyday with some good tone and effects. Worth the price and no lugging around a small amp just for practice on the go.", "id": 720}, {"review": "This is the best string cleaner I have owned to date and I have owned about all of the rest. The way it is packaged makes it super easy to pop the lid and apply it. The casing is tough enough to be thrown into my gig bag and carried all over without the lid coming off or the case breaking. The 'other' string cleaner that is a bottle with cloth applicator spills out and the cloth wears out too fast - then leaves cloth pieces on the strings. This product does not waste the cleaning agent - it applies evenly and there is NO cloth residue left on the strings to pick off. The cleaning agency works so well - it looks like I have cleaned a BBQ grill when I wipe my strings down. Amazing how dirty the strings get after just a few hours of play - this product will get that gunk off. I am done looking for a better string cleaner because this product has the best cleaner in the best packaging for travel. Well done Fender!", "id": 730}, {"review": "This little thing is just what I needed for my acoustics. My amp has a tuner but my regular acoustics had no true way of being tuned until now. I have one on each acoustic and they tune them right up. The read-out is easy to see since it gives you color guides to tune by. Red is wayyy off, yellow when you start getting close and green when you are in tune. Great for a quick look in between songs. Highly recommended.", "id": 822}, {"review": "These lighter strings are still the best thing for guitar tone since they ran a wire to them. My other review was for the heavier gauge Cobalts but these sound just as good, regardless of P90, strat single coil or humbucker. Great tone, sustain and flexibility. I am sold on any Cobalt gauge - head and shoulders better than any other string on the market and I have tried them all.", "id": 825}, {"review": "I have a cedar topped acoustic and these strings brought it to life without losing the cedar smoothness. No mud, clear mids and highs with clashing. Mounted them with the brass tone pins and this guitar just rings like a bell now. Love it.", "id": 87}, {"review": "I have a Squire tele and replaced the tuners with these. The 'tab' holes didn't match up, they are bigger than the Squire originals but it was no problem to set new holes and tighten them up. The hold tunings and make string changing a breeze. Highly recommended. True Fender product.", "id": 387}, {"review": "Needed some chorus in my tone and this fit my budget. I have owned multiple Behringer products and trust the brand. It is a plastic casing but I don't tour so that won't be a problem - I needed the effect and it gives it. Fully adjustable for depth, tone, warble and volume. Don't spend $200 on a 'boutique' pedal - get this one.", "id": 431}, {"review": "These strings are amazing - they have increased power, tone and flexibility that other strings just do not have. They sound great on single coil and humbucker types of pickups. The tone is seperated throughout the string gauges so that each sting has its own distinctive part of the tone. I cna't say enough about them but get some for yourself - I'd be surprised if you ever went back to regualr strings.", "id": 823}]