[{"review": "I bought a tusq nut and this tusq saddle for an Aria acoustic which can be a nice sounding guitar. The difference is quite noticeable and good. The guitar is a modest model but it is a player with a \"better than a lot more expensive guitars\" sound. I had a bone nut that cracked which is why I tried these replacements. In my estimation the sound is clearer, brighter and louder. The price seemed high for a little chunk of \"plastic\" but the difference in sound leaves me satisfied.", "id": 414}, {"review": "This bag is made well enough. If you are careful it offers good protection. You can't rely on this bag alone if you are going to toss the guitar around and you certainly can't stack anything on it but it will prevent dings and scratches from occasional bumps etc. If your guitar is priceless than you should upscale your gig bag, otherwise it's a good bag, especially at this price.", "id": 442}, {"review": "I have had &#34;swing trees&#34; for many guitars for years. Usually they cost $10-15. This hanger is as good (plastic base not wood like some others) as any of the wood ones. Comes with wall anchors but I usually look for a stud to mount on. Soft cushioning. Weight of guitar keeps the arms (which swivel to allow for proper fit) snug about the neck. The thing came in 2 days and at $4 and free shipping it is a true bargain.", "id": 779}, {"review": "I bought two for 10 bucks each. They work great on my acoustic and electric guitars. Easy to see, and it centers quickly when tuning, without drifting all over the place. The only thing I would do to improve is add an off button. There is an ON button but the tuner will stay on as long as you are plucking/strumming strings. It will turn itself off in one minute if you stop playing, but I usually start right into playing after tuning. The only reason to turn it off would be to conserve battery life. This is a great little tuner and I am glad I bought it.", "id": 799}, {"review": "Five stars because it works on my Digitech GNX guitar processor which requires 9 volts and about 75 Milli-amps. This has an output of 300 Milli-amps. For electronics the voltage has to be correct. But an appliance will only draw as many amps (current) as it needs. So this adapter is coasting when used with the guitar processor and can be used with other devices that draw up to the 300 Mamps. Just be sure your (9v) device doesn't require more than the 300 Ma this can deliver. But it's a power adapter, I cannot be in love with a power adapter.", "id": 521}]