[{"review": "These little patch cables work nicely, there's no change to your tone or sound and they connect one pedal to another just fine..I'm only going to make one small complaint and explain why it got 4 stars instead of 5. The product description says 6 inches, right? If you jump over to these (http://www.amazon.com/gp/product/B001PGXKC8/ref=oh_details_o04_s00_i02?ie=UTF8&psc;=1) planet waves patch cables they're listed at .5 feet (same as 6 inches, right?) The Hosa cables seem more like maybe 4 inches, whereas the planet waves cables gave me plenty of room from one pedal to another. I only used the Hosa cable as an emergency back up.To conclude, would I recommend these? Yes, if you have one or two pedals and need an affordable small and effective patch cable, go for these. But my first recommendation will always be planet waves cables over anything else.", "id": 11}, {"review": "This is basically the Leatherman Multi tool for guitarist. By Leatherman, I really mean Planet Waves - The go to, sure shot company that will provide solid guitar products and accessories (I buy cables, picks, straps from Planet Waves so.. I guess you could say I'm a fan of their company) And by multi-tool, I really mean this Pro Winder String Winder and Cutter. Everything you need to know is in the title! It helps to wind your guitar strings, the grip is comfortable and durable, and once you've tuned your guitar you can clip off the excess guitar string. Awesome! But wait... there's more (I should be on an infomercial) There's also a nifty little pin puller for when you re-string your acoustic instruments. For the price, this does everything and more... I recommend if you need a winder, just buy this. You'll take out 3 birds with one stone, even if you only needed to take out one bird...... if that makes sense? Cheers!", "id": 94}, {"review": "I've used several different kinds of guitar cables, and I've finally settled on planet waves cables. From patch cables to guitar cables, I simply trust this company. In most cases the difference between guitar cables is the same difference between an iPhone and an Android, there really isn't one - it simply comes down to user prefrence. So in that regard, I prefer planet waves cables. I snagged this cable so I had the one right angle for my pedal board and the other end for my guitar. Highly recommended!", "id": 168}, {"review": "Hands down, in my opinion these are by far the best guitar straps you can get. I have a few of planet waves different designs for these, all on my electrics. I have an acoustic-electric Ibanez but the strap wouldn't fit, however the strap wasn't purchased for the acoustic - I was just trying it on all of my different guitars for reviewers sake.If you're considering buying this, just do it.", "id": 208}, {"review": "So I recently purchased the Visual Sound One Spot Combo pack and I must say I am quite pleased. I was checking out some of the higher end products (T-Rex Fuel Tank, Voodoo Lab Pedal Power) and just didn't feel like forking over the money. Maybe one day if I'm going to be playing gigs on the regular and can afford to pay around $200 I'll go for one of the other products, but from what I read on the Visual One power supply I was willing to take a risk (especially for the great price)Currently I'm powering 4 Hardwire pedals, a Dunlop Wah pedal and the Berhinger CS400 (see, I'm cheap sometimes - but effectively so) So I'm already using 6 of the 8 power supply cables. All pedals are powered without issue, without noise, there is no hum or hiss or delay or negative effect WHATSOEVER! I can't say enough how excited I was to see this as a viable option for powering the pedal board I just put together, and when it came through and worked flawlessly, it was all the better. I would highly recommend this product to any beginner guitarist starting to fiddle with effects pedals, or even a moderate or novice player - It's simply a RELIABLE and affordable way to power your pedal board. 2 thumbs up and 5 stars!Rock on", "id": 428}]