[{"review": "This mic is great! I have one I have used from coast to coast to coast to coast. Unbeatable in price and quality. You can't go wrong with a brand name like shure. I have had mine for 14 years and it still sounds like it just came out of the box. You will have no shame in your game with this in in your arsenal. As a veteran bluseman I recommend it. It rocks! As clean as a marsh 'possum.", "id": 75}, {"review": "Other picks usually let me down when I riff and melt faces playing the blues jazz or gospel etc., Fender heavies are made to make the notes sound like l they have been hit for real. I prefer no cheap imitations. Only Fender Heavies. That's what I smoke.", "id": 117}, {"review": "I started out wilth Balls when I first picked up the guitar in 1968 when I was 17. They were worth my part time minimum wage money and gave me what I wanted. A very reliable product that took me through the transition from an amateur to a professional lead guitarist. I highly recommend them. Keep a pack or two in your guitar case or gig bag!", "id": 226}, {"review": "As soon as put it on my guitar, I enjoyed the way it got the job done. My first concern was, Will this damage my guitar? The answer is NO. It is user friendly and guitar friendly. The price is so low, you should own at least one. No problems. Just music. At the most competitive price available.", "id": 603}, {"review": "It was delivered fast. When I hooked it up I didn't expect it to be so loud and clear. So powerful it picked up every breath I took between the lyrics. When I put a wind screen on it, the sound was so nice I couldn't stop singing for another hour. I only meant to test it when I unpacked it. I'm buying more. At that price it's a steal! Get a couple NOW! Before supply and demand kicks in.", "id": 690}, {"review": "When I attached it to my guitar(s), I said, &#34;Wow, this beats it's more expensive competition! Does it hold? Yes. Does it damage your instrument? No. I'm going to get another one before they decide to raise the price!", "id": 802}]