[{"review": "Not your average Giant Clumsy Guitar Stand, but it works. The only drawback is that it is literally not big enough to provide a very stable base of support. If you have toddlers or rambunctious dogs, or even fairly large cats, a larger stand might be a better choice. If your household is quiet, this is very much a good bargain.", "id": 92}, {"review": "Bought a Takamine 40 years ago. It was an exceptional guitar for which I paid $125. Adjusted for inflation, that would be $800 when I bought this Jasmine.I got a superb machine for the money. Simply superb.  It's not my old Takamine, but the negative differences are slight, and there are only two of them three days into my acquaintance with this guitar.The first is that the finish is not as good. The sanding between coats was skimped, which means that the finish on the front has some texture; the sides of the guitar are also a bit rough.The second probably flows from the first.  The tone is a touch wooden; it doesn't sing as the old Taka did.Positives: the intonation is true at the twelfth fret, and it is playable (and enjoyable to play) with a slide. After the first tune-up of the strings, it stayed in tune.For its price, this guitar is a superb introduction to playing.A very young child, or a small woman, will find this guitar a bit large and deep for true playing comfort. For everyone else, it should fit pretty comfortably.The intonation is true at the twelfth fret, and it is playable (and enjoyable to play) with a slide. After the first tune-up of the strings, it stayed in tune.Any beginner, and more than a few cost-sensitive intermediate players, will be pleased with this guitar.", "id": 183}, {"review": "This works with equal ease across all six strings, or only the bottom three.  Haven't run across a need to try it on the top three by themselves yet. But judging by its performance on the bottom three, and its fierce grip, it'll do just fine.", "id": 346}, {"review": "And that's all I've got to say about it. It hasn't stuck, broken, or slipped in any of the string-changes I've used it for. Costs a little extra, but well worth that price. You'll need a new one about every ten years or so.", "id": 347}, {"review": "This product has a quiet metronome; in a playing environment, it won't be easy to hear. The tuner works on a mic, and that too will be easily overwhelmed in a social environment.That said, it's lovely to see the strings \"true in.\" Makes even first tune-up easy. This accuracy will greatly help to tune the student's ear, making \"by-ear\" tuning possible sooner.Pretty nice. Hate the color.  Oh well.", "id": 732}, {"review": "The tuner doesn't require you to hear either it or the guitar or bass to tune it, so it will work pretty well in a noisy/social environment. Overall, works just fine.", "id": 733}, {"review": "Originally I bought another Snark, and liked it well enough. I'd seen this one on YouTube, and thought its little bobble head looked ... kinda silly. But then a friend lent me his for a couple of days, and I really liked the experience of being able to glance over and see if I was in tune. I was hooked. I'll look silly if it lets me stay in tune.The built-in metronome doesn't have a lot of volume, but it's clearly visible.You also get a little baggie containing three picks, the carry bag for the tuner, and a battery. Warranty runs for a year. Altogether, I'm very satisfied with this tuner.", "id": 821}]