[{"review": "You get more than enough screws to install a front pickguard and a tremolo on your Stratocaster, however this lacks the two longer screws near the bridge on the front pickguard. Other than the two missing screws, this hardware is a great replacement for any missing or oxidized hardware on your Stratocaster.", "id": 215}, {"review": "It fits perfect on my MIM Stratocaster, enhancing the visuals of the back. The \"Corona, California\" on the back ads a nice touch when you compare it to the other Fender \"F\" neck plate.", "id": 527}, {"review": "This portable 9volt amp is pretty loud without sacrificing tone. It's way louder than a 9volt Fender mini Twin (which actually does incorporate two speakers), however when you dial in the gain all the way you get a crunch rather than full on distortion. It comes included with a 9volt and is compatible with most negative tip power adapters (make sure its 300mA like the Planetwaves adapter for $9.00). At $20.00 this amp is a deal!", "id": 605}, {"review": "I bought one of those padded Fender leather straps (it says FS1 CANADIAN leather on the back). I thought these Fender strap locks would complement the strap, but because of the padding the thread on the strap-lock wasn't high enough for the nut to reach. I finally got the nut to get a hold of the top of the thread and although it works I don't trust that its enough. If you have a padded leather strap I don't recommend these.", "id": 607}, {"review": "At first I wanted to get these to replace the 3 cheap springs to came in my MIM Stratocaster for it was the last thing I needed to change to have a functional reliable floating tremolo. After installing these tremolo springs (which by the way have a nice flexible tension) I notice that my tone and sustain greatly improved. I did some research and found out there are other websites out there that sell vintage specs tremolo tension springs for like $20-$30 to enhance tone and sustain on Stratocasters! So at $8 this is definitely a WIN!!!", "id": 676}, {"review": "Hands down the best cables for electric guitar. Ive tried other brands that cost almost, if not similar to these and none can match in the quality that prolink presents. These are not only the best in delivering tone but they're durable. I bought mine back in 2004 and they're still working as well as the day I got them today on September of 2012. I bought some planetwaves cables for $40 that didn't even last me 2 years.", "id": 127}, {"review": "This power supply works awesome with pedals and mini amps without giving you that static hiss you get from some other brands.", "id": 521}]