[{"review": "I bought one of these to try on my Asher Junior lap steel guitar to hold two finger picks and a thumb pick. Worked, but it was difficult getting all three picks in one Wedgie so I ordered a second one. Between the two of them, between the 2nd/3rd and 4th/5th strings up next to the nut, works pretty good holding these types of picks (which admittedly, the Wedgie was not actually designed for). Liked it so much I ordered two more for my acoustic and electric guitar and one for my bass (the bass version). Only down side I see is -- they DO seem loose like they could fall out AND I doubt the picks will stay in place when I case my guitar (haven't tried it yet). But otherwise, worth the price and a good doo-dad to have around. Especially if you have a lap steel and need a place to stick your finger picks on the guitar itself (real help to me staying organized!).", "id": 29}, {"review": "I have two of these stands, the electric guitar/bass version and the acoustic version. Back to buy a second electric guitar version as a spare or to keep in my guitar case. Yes -- folded up it WILL fit in my tweed Fender electric guitar case alongside the neck of the guitar (I DO always keep it IN the included stand bag to ensure I don't scratch or bump it against my guitar). Great at this price too, buy several!", "id": 91}, {"review": "Piece of plastic with no bracing. Due to design, will not attach to stands that have a turned lip on the shelf (which is most quality stands). I used double-sided sticky tape -- problem solved. Gives me a place to stow my guitar picks, tuner, capo and pencil and as such, is an invaluable accessory. Worth the 6 bucks, just be aware you may have to improvise when it comes to attaching it to your stand!", "id": 128}, {"review": "I have been playing guitar off/on for about 30 years. I have always used whatever cheap picks I could find laying around or snagged from music shops -- the free ones they give you when you try out a guitar in the shop :) Always Medium gauge, for both acoustic and electric. I decided to try these Dava 1303's because they were cheap and looked cool, wasn't expecting much, I mean, a pick is a pick, right? Wrong. These little guys have a fantastic \"feel\" to them; they seem to get in between the strings so effortlessly for flat picking. It's crazy but that is what I am experiencing. They are maybe a bit on the thin side, but not overly so, I got used to them quick. Plenty stiff enough for enthusiastic strumming or picking. Tone-wise, they produce a nice, crisp, slightly metallic string sound which I rather like. I recorded some with them today and it was perhaps a bit on the loud side with regards to the audible pick attack on the strings on the acoustic (a Breedlove C25). But not bad and I was using a sensitive Rode condenser. Haven't played much with them on my electric yet (customized Fender Stratocaster) but I'm sure they will be fine there as well. I like these picks a LOT and am ordering a dozen more to keep around. Good stuff.", "id": 170}, {"review": "I bought one of these about a year ago and I am going to buy a second one to keep in my gutar case as a back-up. Great tuner, just clip it on the headstock, turn it on and tune -- display changes to bright green when you are exactly in tune so I can even do it without my glasses on. I have used it in noisy environments (other instruments tuning or playing) and it still works, never had a problem with it picking up tuning informatiom clipped to the headstock of either my acoustic guitar or Fender Stratocastor.The ONLY thing that could use improvement is the auto-off function; mine has failed to detect an extended duration of NO audio energy and as such, stayed turned on until it drained the battery. After that, I got in the habit of making SURE I turned it off when not in use. And it uses commonly found 2032 cell batteries so not A big deal to replace (just grab a two-pack of them at the grocery store to keep on hand).Overall, very useful, accurate device and worth a few extra dollars.", "id": 627}, {"review": "I got one of these here on Amazon as a replacement for my other small practice amp, an older Fender 25 watt blackface two-channel that didn't have integrated EFX (that one has been more or less permanantly allocated to my church).Great little amp. Only had it for a couple days, but the sounds you can evoke out of this thing are amazing. Clean tones are pristine. Distortion tones, a bit on the transistory side, but again, I haven't played with the setting enough (or even tried all the emulations). Controls are straightforward and easy to operate without glasses on. It is a bit lacking in low-end, to be expected from a small 8\" speaker. But that is okay for practice and rehearsal. It is loud enough for rehearsal with a drummer (depending on the style of music). I did purchase the single button footswitch as well and it works great at switching between any TWO settings you define.Have not had a chance to mess with the included software, but intend to do that when I have time. I like the fact that I can tweak the amp to my EXACT preferences and it stays in memory; I only really have to do it once. Great feature.Only suggestions to Fender would be to add a recessed area in the back to stow the power cord (standard computer type) and optionally, the included USB cable.Overall, for the price, it is an incredible value. Great alternative to lugging my full rig (Marshall 2X12 cab, racked Rocktron Pirhanna, ADA 100 watt tube head, Alesis Midiverb IV and some other stuff). Get yours while you can at this price.UPDATE -- The Fender software that you can download and use with this amp is freaking amazing. I now have it more or less permanently attached to my computer via USB and am constantly tweaking and refining my tones. The Princeton amp emulation is SWEET. I am going to buy a second one, probably the larger Mustang III, cause I want the larger Celestion speaker. You know, pretty much every Fender product I have ever purchased has been first rate, and this amp is no exception. And I don't care if it is made in Mexico (my guitar is a differnt matter though...)", "id": 718}, {"review": "This product is worth having if, like me, you find yourself needing a place to quickly \"park\" your guitar without putting it back in the guitar stand. I use it on a desk next to my chair and music stand. Works great -- only suggestion I have it to perhaps make a version with a sticky tape underside, or a way of semi-permanently attaching it the spot where you want it so it doesn't move around. I wound up using a very small wood screw to attach it to my desk so it stays fixed. Overall -- I like it.", "id": 746}, {"review": "I just put thePlanet Waves PW-CT-12 NS Mini Headstock Tuneron my Stratocaster last night. It replaces several other tuners I have been using that hung off the headstock and tended to come loose and fall off or had to be constantly re-secured and positioned (and removed/re-attached when I transferred my guitar to/from the case). The mini takes care of all those problems -- I attached it between the low E and A string tuners, inner facing with the display rotated to face me. It is sensitive and accurate. The display is quite readable, even without glasses and features a color change to green when near or in tune. There are fine tuning bars on either side of the note indicator so you know when you are right on. I can leave it attached when I case my guitar which is a huge plus. The battery is top loading so I don't even have to remove it to change the battery, which probably won't be for a while since it has an effective auto-shutoff function (as opposed to other tuners I've used that are supposed to shut-off when no audio energy present but don't and kill the battery). Also the display is smaller and as such, probably requires less power to operate which translates to longer battery life. It can be turned on (or manually turned off) with a simple touch of an easily palpated power button. The frequency is adjustable +/- 10 hz from 440 if you need that for some reason. It uses a clip to attach via friction, which is adjustable and the clip is padded so it won't scratch the finish of the headstock. I am so happy with this tuner I am buying TWO MORE immediately, one for my Breedlove acoustic, another to keep as a spare. Every once in a while I happen across products designed to fill a specific niche that fill their designated need perfectly and this is one of them.", "id": 785}]