[{"review": "This is a super easy to use pedal. You just choose the speed of the chorus effect and the rest of the parameters are preset. Don't worry they sound great for that classic chorus sound. If you really want to be able to tweak everything, then get the MXR Analog chorus instead. It has about six knobs. I like the ease of use on this one, and I omly use chorus sparingly. Another cool feature of MXR pedals is the rubber knob cover that comes with it. It allows you to adjust the chorus rate with your foot.", "id": 672}, {"review": "It works ok if you are used to using  a volume pedal. I had a hard time making small volume changes while singing. I decided to return it. It is well made, so if you like volume pedals, it's probably one of the best. I have also owned the Moreley Lil Alligator volume pedal. It has a mimimum volume knob which allows more subtle changes between rhythm and lead volumes. The Dunlop does not have that feature.", "id": 673}, {"review": "This thing sounds amazing- except for one small problem: At higher gain settings it hisses like a mother. I'm not talking about extreme settings, just gain and &#34;character&#34; (thats what Tech 21calls it- forgot what Joyo calls it) at 3 o'clock. It has a beautiful WARM singing lead tone-better than any pedal that I have owned ( and that's probably 20-30 distortion/overdrive pedals) If only it didn't hiss so much it would be my main lead pedal. If you have a Rocktron Hush or other noise gate pedal, it is worth considering. The Joyo is an EXACT clone of the Tech 21British pedal, which costs $189 (?). I don't know it the tech 21 has the same hissing problem or not.", "id": 796}, {"review": "This thing Rocks! Unlike other cheap Chinese-made ripoffs (ahem... Behringer) These Joyo products are well made, inexpensive and worth every penny.", "id": 852}, {"review": "Behringer pedals are really cheaply made and the feel amazingly light, cheap and unable to take the riggors of gigging. I just didn't want to spend $100 on the Boss version, but you get what you pay for! Another thing that I hate is it's really hard to change the battery, unlike the Boss pedals. save your money and steer clear of this one. I also bought a Behringer power amp for $200 that lasted a few gigs befor it crapped out.", "id": 380}]