[{"review": "I've done a good bit of recording over the years. This microphone has very very low self noise, low distortion and a continuously adjustable variable pattern.I've listened to and recorded with this mic and compared it to many other high priced options. This mic is outstanding, the sound of the mic simply disappears  . . . it records just about anything presented to it very naturally with great detail, but without hype or over brightness.I applaud CAD for keeping the price low which provides a great mic for drum mixing which would not be possible at the price point of this  more expensive functional competition.", "id": 82}, {"review": "As background, I've recorded many jazz performances and listen normally to electrostatic speakers and have a pair of electrostatic headphones as well as dynamic models.These Audio Technica headphones are closed back isolating headphones which greatly reduce background noise. That said they are more difficult to design well as the closed ear cups and back create acoustic interaction with the back of the drivers. These headphones have a very open sound, smooth midrange, excellent detail with out exaggerated treble and very solid, and perhaps a bit emphasized bass.They are extremely comfortable, well made and easy to store. Finally the pricing of these fine headphones are not over inflated as are many high quality products. Highly recommended.", "id": 458}, {"review": "Easy to use, very accurate and great visibility of tuning indicators. This tuner did just fine with the low B on a 5 string bass. Some tuners to not work well with this low of a frequency.", "id": 504}, {"review": "I recently purchased this recorder and have compared it to my older M-Audio Microtrak II. The Tascam is a much newer design and shows good ergonomic improvement. The internal mics are adjustable, the interface is easy to use, the battery life is long and the batteries are common AA and easy to replace on location.I've not tested the external xlr mic preamps but have recorded with the internal mics with absolutely wonder results. The internal preamp is very quiet, the mics on acoustic grand piano are very dynamic, produce excellent detail and have what appears to be a very wide neutral frequency response. The recorder produces a very wide and deep soundstage and does outclass my older recorder in every aspect. To me the price is very reasonable and the build quality is reasonable for the price. Highly recommended.", "id": 800}, {"review": "I've had this pedal for a number of years. It provides a wide range of reverb effects, sounds natural and has a killer stereo output. I've haven't heard a pedal that competes with spring reverb, but this pedal keeps up with any simulated reverb pedal I've heard and does an excellent job with amps that lack a spring unit. The effects can go way beyond what a spring unit can do as well. Recommended.", "id": 185}, {"review": "I picked up one of these little gems on sale and was very surprised. The sound is very authentic as I have a 60's tube Champ in excellent working order for reference, as well as a Deville.This little amp has the classic Fender tube sound, with a broad, punchy tone and the right amount of compression. The included digital effects, (vibraphone, delay, reverb, chorus and tremolo) are all convincing and well executed.The modeling portion of the amp is also well done and includes voicing for a tweed champ, tweed deluxe clean/dirty, baseman, 65 princeton clean/dirty, 65 deluxe clean/dirty, 65 twin and an array of british and metal amps.All and all, a super practice amp or mic-able performance amp. Great job Fender.PS - I don't review products that don't stand out as excellent.", "id": 819}]