[{"review": "I've had this for about 11 years now. Even with some of the newer metal pedals on the market, this pedal still sells well. Not to mention, it's probably also one of the most modded pieces out there. Any number of mods can be found online to change the sound. They're usually on the side of improving the stock tone, which I'm happy with.I've always liked the parametric EQ on this pedal. The variable midrange allows me to get Marshall or Mesa flavors. For most metal/hard rock music, the gain range is enough for me. If I need yet more gain, I punch it up with an overdrive, or a compressor pedal for a cleaner boost. Even without a boost, I can use it for death metal. I think if you play the tighter, more technical styles, it's better not to have too much gain anyhow.", "id": 36}, {"review": "Seriously, this is a great pedal. I can't improve upon what others have said, but I will mention a few points.1. I use this after the preamp or dirt boxes for a lead tone, or to add more crunch to my Fender Frontman 212 when inserted in the effects loop. It's run before time based effects (delay, phaser, etc) for me.2. I sometimes use it before the distortion as a clean booster, while focusing one of the sliders to boost a few frequencies.3. If it gets noisy or \"self oscillates\" after a while, change the battery to a fresh one. Better yet, use an AC adapter.I found out about the last issue after reading a few Harmony Central reviews. Otherwise, it's been on my setup for about seven years. I take care of my stuff.", "id": 84}, {"review": "Whatever the name, this pedal is from the Ibanez Tube Screamer camp. The packaging description says it uses the JRC4558 chip and MA150 diodes, and yes, Behringer got the sound right. I'd say this competes well against any of the modded TS pedals. What I love about this pedal is the TONE knob. For the TS pedals in this price range, it's the most useful. You can set it high, and it isn't too icepicky, yet the entire range is useful. This is great if you use the thing as your main overdrive sound.I prefer this pedal for boosting my gain in a hot amp or pedal, or another overdrive. It works well as a lead boost for rock or blues tones. It could also be used to add a touch of breakup for jazz tones.I bought this pedal to \"semi-retire\" an older Ibanez TS5 soundtank. The switch on that one isn't as good as the Behringer's. The Behringer has a much smoother action to it when turning the pedal on or off. I use mainly solid state Fender amps, and several distortion pedals (including a BOSS Metal Zone). I'd bet this would sound great through any tube amp worth its salt. The only downside is the slight lack of bass. If you routinely run your guitar sound through 12 inch speaker setups (esp. 2x12 and 4x12), or a distorted tone with plenty of bass, this shouldn't be a problem.", "id": 381}, {"review": "What an amazing product. Multi-voltage capability for worldwide use, powering eight pedals, and very cost effective, too. If I bought eight adapters, it would cost me well over $120 USD. Even at the price it's sold at, the build quality is pro level. I'd be happy using this on a well-traveled pedalboard. At this price, you could buy two or three of these packs to power huge boards.I usually run six to seven pedals in a typical session. Not all at once, but it's nice to know that the delivery is smooth, without any drops or spikes in power level. I can crank 'em all if I want to, and go NUTS.", "id": 428}, {"review": "I've never really owned a fuzz pedal before, but have tried a few. Out of most I've tried, I've come across the Big Muff the most. It didn't really strike me as a good flavor of distortion to have until recently. Even my Boss Hyper Metal HM-3 is considered by some to be a fuzz pedal by some folks, but it isn't 100% there, certainly.My budget being what is it right now, I didn't want to spend a lot for a fuzz pedal. There are loads of fuzzes available for $100 or less, but this model is essentially three pedals in one. That's what attracted me to it, along with a few reviews in YouTube. Not to mention the bargain basement price.The three modes can be accessed via a switch on the right side of this pedal. The two fuzz modes (in my view) don't perfectly emulate any one pedal, but are extremely useful nonetheless.FUZZ 1 is a creamy, midrange filled sound. It doesn't get too bright, until the TREBLE knob is pushed past 3 o' clock. This fuzz could make even anemic single coils sound rich and thick. With humbuckers, it's actually quite clean in silences until the gain is past about 2 o' clock. I love the way this fuzz sputters when notes and chords decay. It seems to work best with power chords (root-5th note), and single notes. If you play complex chords, you'll hardly notice them; if you try to play them, use as little gain as possible.FUZZ 2 is more in line with the Big Muff. It has a scooped midrange, which makes things sound dark and sinister. With the increased bass and treble, complex chords work slightly better here. This fuzz also has more sustain than FUZZ 1, so it buzzes longer. This makes it great to use alongside a guitarist that's using a looser sounding high gain tone that isn't necessarily fuzzy. (Head era KoRn comes to mind for me...)The third option is ultimately what made my purchase worthwhile. BOOST. This mode is a clean boost with a flat midrange level. It actually distorts a little, but that's only after cranking the EQ and GAIN knobs all the way up. The resulting buzz does sound a bit like a slightly overdriven non-master volume amp (or a master volume's clean channel fully cranked). Still, throughout most of its gain and volume range, BOOST does a good job of staying clean. This would be great for pushing an amp into overdrive, or extending the gain of a heavily distorted sound. It might also be useful for a tiny volume boost for cleaner guitar tones, or just to maintain a stronger signal for a path full of effects.Overall, I like the tones this pedal spits out. I've only had it a few hours, but I love what I'm hearing so far. The build is similar to the other Behringer pedals I have, a NR100 noise reducer, and a TO800, their overdrive that sounds like a Tube Screamer. With this more recent pedal (built on June of 2010), the knobs seem slightly sturdier than before. I'd still not abuse them too much, though. As always, really abusive stompers might want to look elsewhere (or find a way to put the guts inside a custom built tank).You can't go wrong with the bright blue LED, either! Makes it easy to see on a dark stage, along with the dayglo orange pedal color.", "id": 450}, {"review": "In particular, I favor the Dual Design. Why? If the need arises, it's possible to use a regular strap that doesn't have the button locks installed. I have two of the black ones on a 7 string Ibanez RG7321, and Laguna LE200QBC guitars. I have spare straps for both guitars, and sometimes I lock those spares with the plastic Dunlop discs.I have some older bass guitars with similar Dunlop locks (the standard version), two of which had locks installed in the mid 1990's, and one from 2003 with the gold DD. All three of them have held up with no issues. I didn't need to re-tighten the screws on those guitars until about two years ago. Then again, I don't tour around the world like the metal stalwarts known as ... MetallicA. ;)", "id": 44}]