[{"review": "It's hard not to love a cord that carries electrons all the way to the end. Not sure what, other than complete failure would take stars away.", "id": 10}, {"review": "Wonderful, piano feel, piano action. Will partly sustain if pressed late or let go and reapplied briefly, i didn't even think my keyboard was up to that sort of responsivness (cheapo Yamaha). This is the only pedal you should buy unless you need all three. I am a future M Audio customer from here on.", "id": 251}, {"review": "I paid 10 dollars for this. It must be giving me cancer in the state of california because it's not cheap at all. Folds up for transport, works great on hardwood floors, padded where it needs to be, and has a strap so it doesn't fall forward either. Angle of the feet might be too shallow for carpet, look for something where the legs 'enter' the carpet more straight down.", "id": 258}, {"review": "Needed a 6ft cable for home recording at my desk, all the other long ones would have made a mess under my feet, good thing there was this shorty. Nice cord, sturdy build, good sound. Electrons go through it and don't leak out so it's perfect i guess.", "id": 556}, {"review": "It's very thin, all parts about it are kinda thin and cheap, but it works exactly as it should. Not bad if you just need to round out an order to get free shipping. Not for your favorite guitar though, more of a beginner's or a throw-away, 'gig' strap.", "id": 657}, {"review": "Works well on my amp, not so well on my computer workstation. It's a decent dj/announcer mic or for a PA but i wouldn't record anything like singing or music and expect great sound. Has that great heavy mic feel but is definitely no SHURE mic despite the similarities.", "id": 690}, {"review": "I thought it would protect my desk but the pad is almost like that rubber they put under rugs so they won't slip around. maybe i should get that for cheaper.I accidently bought LARGE, ooh boy is it; like, windshield sun reflector size. Sort of just a personal opinion review i suppose.", "id": 705}, {"review": "Exactly what it says it is, comes fast in an envelope. Hard to mess up a pack of plastic triangles though. Design looks great in the light too.", "id": 744}, {"review": "I used this to tune a coconut thumb piano. If it can tune that, it should handle your guitar or bass FINE. Was really impressed to see it in action. NOT THE SMOOTHEST operation in the world but it's gig-bag small and accurate.", "id": 762}, {"review": "Very nice cable but the white ends (which are nice looking) could be a little shorter.  It works awesomely and it's not a bad price for name brand cables.", "id": 803}, {"review": "I guess 5 stars because it 100% does what it's supposed to and doesn't cost much. The width of the grip gives you more leverage which can make it easier to clamp with someone with weak hands. That being said that person probably isn't playing much guitar.", "id": 808}, {"review": "Despite its iFlavor it works beautifully with my PC. Sounds better than any sound card i've used and of course gives me the ability to play and record on my computer with no noticeable latency. It's a great intro model, not just for ipads. Whole device is powered and runs over one USB cord. I'm so impressed, my main PC audio comes out of the headphone jack of this device. It's an extremely capable machine with good drivers and works great with REAPER.", "id": 854}, {"review": "Sounds just like an amp in your headphones! Gain, Tone and FX switch make for a broad range of sound since you won't be able to use any pedals. This is a great little piece of kit if you have some fun money to spend on it. 1 star off because, while nothing fell out, the plugs on both the bass and headphone side are very loose feeling.", "id": 547}, {"review": "Cheap, Accurate over mic, even better over jack. Slot for your pick or coin is a joke and so far hasn't fit a pick or coin i stuck in it but that's just a dumb gimmick. Great pocket tuner.", "id": 624}]