[{"review": "I'll keep it short: I owned a Boss EQ pedal in the past and didn't have much luck with it. I tried and tried and tried to hone in the sound I was looking for but the Boss just wouldn't do it for me. Fast forward a few years and I purchase this little baby on a whim.  Man, am I glad I did!  The 6 sliders made it very easy to dial in the exact tone I was looking for.  A small boost of the first two sliders gave my amp more bottom-end than it could ever manage on its own, and a small boost of the last two provided more of a balanced, well-rounded sound.  Love it and wouldn't wanna part with it!The pedal itself is built like a rock.  I imagine nothing shy of nuclear war could dent this thing.  The individual sliders, although not quite as Ford-tough as the rest of the pedal (haha), feel nice and slide easy.  Each slider lights up red when engaged, which not only looks cool but makes it very easy to see on a dimly lit stage.If you're on the fence about an EQ or which EQ brand to buy, I recommend you give this little monster a stomp.", "id": 182}, {"review": "In my opinion, this is the best guitar volume pedal available. It is affordable and does exactly what it's supposed to, and does it very, very well I might add. I've tried numerous volume pedals, from Morley to Line 6 to the Dunlop DVP1, and none are as fluid or feel as good as the Ernie Ball Jr.I owned the Dunlop DVP1 for several months, and while it did an okay job of cutting the volume I simply did not like the feel nor the low volume levels. It felt way too bulky under foot and went from about 0 to about 3 when barely applying volume. This is unacceptable when you're trying to clean up your distortion channel or trying to accomplish a slow volume swell. But as soon as I laid the Ernie Ball down and plugged it in I fell in love. Not only does it feel great under your foot and provide precise control, it has a complete volume sweep. Add in some delay and it will give you an organ-type swell. Absolutely perfect!I've heard some people complain about the Ernie Ball Jr being a flimsy pedal but I just don't see this. Of course, it's not a tank like the Dunlop or Morley, but it still feels very solid. It's also lighter than the others mentioned, which is a plus for traveling musicians.I would HIGHLY recommend this pedal. It is one of my favorites on my board and I couldn't imagine playing without it!", "id": 187}, {"review": "I installed the Ragin' Cajun into my Fender Super Champ XD.  I read all of the reviews of people saying this speaker turned their Super Champ into a monster and man they were right!  I immediately noticed a difference in the warmth, articulation, and fullness of my sound!  The cleans are warm and...clean, and the distortion is articulate and fits my needs nicely.  I had been trying to play Tool's \"Jambi\" and the beginning part never sounded right.  I always thought I was doing something wrong because of how muddy it souned.  Tried the same lick with the Ragin Cajun and it sounds perfect!  I would highly recommend this speaker for anyone that owns a Fender Super Camp XD or needs a 10 inch speaker.Two items of note:  1) A few people said this is a bass heavy speaker and I do not agree.  While it is slightly darker than the stock speaker, it has a screaming Mid/Low range.  A quick turn of the Treble knob from 4 to 6 cleaned up the darkness.  2) Don't forget, the first time you install the speaker will be the worst it will sound.  All speakers need to be broken in before they hit their sweet spot.  With that said, this thing sounds amazing directly after install.  Buy, you won't regret!", "id": 287}, {"review": "I love this boost pedal so much!  I owned the MXR Micro Amp for a while, but I found that it colored my tone way too much (too much low end).  The MC401 on the other hand doesn't color your tone at all.  It provides a very precise boost and pushes your tube amp into natural overdrive.  The boost is extremely articulate and produces throbbing palm muting and clear chords. If you're in the market for a boost or a buffer, I'd look no further.  This pedal is affordable, sturdy, and sounds absolutely amazing!", "id": 372}, {"review": "This is hands down the best delay pedal I have ever used. I owned a Boss DD-3 for many years and I have tried various other brands, but this little beauty takes the cake. The delay is pure analog so it produces a smooth and creamy sound. It is very easy on the ears in both clean and distorted settings, and it adds exponentially to your tone. When turned off it is true bypass, which means it does not color your guitar's natural tone in any way. I recognized a notable difference when I unhooked my DD-3 and plugged in the Carbon Copy.The pedal is slightly smaller than most pedals but it is built like a tank. The price point is a little expensive but, in this instance, you get what you pay for. If you're looking for a creamy, true bypass, analog pedal then look no further. The Carbon Copy is the best there is!", "id": 507}, {"review": "When I first installed these strings I wasn't too impressed.  They felt different under my fingers and the sound was much more tinny than I'm used to.  However, after a month and a half of playing, I really do love these strings.  I got used to the feel, the tinny sound mellowed out a little, and man do they stay in tune!Cobalt strings aren't as warm as traditional nickle strings but if you play hard rock or metal I find the gain to be more articulate.  Solo's pierce through the mix without becoming too shrill and muted playing has better voicing, in my opinion.  They're also super fast.  I mentioned earlier that they feel different, and they do.  It's not necessarily a bad different it's just slicker and not as coiled feeling.  Hard to describe, but if you're used to playing nickle you'll notice the difference.Honestly, my favorite thing about these strings is their ability to stay in tune.  I went on vacation for a week, came back, picked up the guitar, expecting to have to tune it, and every single note was dead on.  As they age, you'll have to make a few minor tuning tweaks but its nowhere near as frequent as nickle.These really are a good set of strings.  If you try them just make sure to give them time.  They get better with wear.", "id": 823}]