[{"review": "I love these picks. They arrived well packaged and NOT loose. They feel great in my hand and the Mediums are the perfect thickness for my playing style. Not too thick/not too thin.The abalone looks cool and is easy to spot when I drop them on the carpet. I have tried other brands (Dunlop, totex, etc) and the fender are by far my favorite.You will not be disappointed!", "id": 120}, {"review": "These are my go-to strings. They are perfect for gig use and are inexpensive as well as awesome sounding. What more do you need?", "id": 156}, {"review": "I use it to clean smudges off of my guitars and to keep the fretboards clean after use. It works well without scratching the delicate surfaces.It is extremely well made and I have thrown it in the washer/dryer and it comes out clean and new looking. I keep it in my guitar case and use it often!", "id": 184}, {"review": "I bought pedal power 2 in order to use on my latest board build. This works perfectly and is actually fairly small for a power supply. I would say it is just a bit bigger than a pedal. It was easy enough to connect all my pedals and run the cables. My board looks great, works well, and I love this power supply", "id": 209}, {"review": "I used this on my last stratocaster build. It arrived quickly and was well packaged. It is black and has a kind of white stripe along the edge, so if you are looking for just a solid black pickguard, be aware. The cool thing about this pickguard is that it already has aluminum on the back. I was shielding and star grounding all of my guitars and one of the painful parts was spraying adhesive on the back of pickguards and then putting foil on them and cutting it to fit. These already come with foil, so there is no need to shield them any more than they already are.It fit my body perfectly and I am happy with the purchase.", "id": 217}, {"review": "These knobs fit well on the pots in my strat and they match the color of the black fender pickguard as well. They look nice, work well, were easy to replace, and do the job. What more could you ask of strat knobs?", "id": 221}, {"review": "I have tried several different brands/types of tuners in my 13 years of playing. I have found that this model fits my needs perfectly. It quickly detects the tune, dynamically changes as you turn the tuning pegs, and is extremely accurate. It also has options to tune flat, sharp, guitar, bass, etc.It is also small and portable. I have one in EACH of my 12 guitar cases and it fits into the accessory pockets/pouches perfectly. I cant recommend this tuner enough.As always, please indicate if this review was helpful and keep on rockin'", "id": 331}, {"review": "Dunlop 65 cleans the smudges and fingerprints off, but I dont know how well it actually polished. I like it well enough, just make sure you have a microfiber cloth to keep from scratching the lacquered surfaces.", "id": 351}, {"review": "These tuners look and feel great. I used them on a Warmouth neck that I purchased for my strat build. It was kind of a pain having to drill the 2 holes for the prongs on each tuner, but that is the way it is designed. They would be a suitable replacement for Fender tuners should one ever break.The gold hardware looks awesome on my guitar.", "id": 560}, {"review": "I used this on my recent stratocaster build and the gold looks awesome. It was easy to install and the finish was perfect.", "id": 622}, {"review": "This cuts strings with no problems. It doesn't take a lot of pressure to squeeze the handles and it doesn't damage the cutting blades like some wire cutters.Highly recommended for frequent string changes.", "id": 648}, {"review": "I read a lot of positive reviews on the 9.5s and after some use, I am kind of disappointed.CONSTRUCTION:They are just like any other strings, just lighter gaugePACKAGING:It arrived well packaged and was in perfect conditionPRICE:At $4.99 new with free 2 day shipping, this is a no brainer.CONCLUSION:I initially liked the feel of these strings, but the more I played the more I realized that it didnt have the tone I was looking for. I am used to 10s and 11s and though they are more difficult to bend with, they sound much fuller. I put these on my latest stratocaster build and have since replaced them with 10s.", "id": 196}, {"review": "I use these on my Hofner and Gibson ES-135. They sound amazing and feel fantastic. These will be the only strings to go on my Jazz guitars from now on.", "id": 259}, {"review": "I used this on the fretboards of my electrics and acoustics. It was easy to clean and left the wood feeling soft and polished without that slick feeling that other oils do. Highly recommended", "id": 344}, {"review": "I am extremely pleased with this amp. I purchased it because I was looking for a tube practice amp and this fit the bill. The numerous voicings and setting on this little gem make it worth far more than the asking price. Even though this is a low wattage amp, this sucker can get LOUD. The other reviews detail the exact specs much better than I could, so I will defer to them for that.However, this little amp packs a big punch when it comes to tone. I highly recommend it!", "id": 553}, {"review": "I bought this for my stratocaster build and it works perfectly. The holes lined up, it felt sturdy, and it is a genuine fender part.It isn't completely black though. There is a white stripe running around the outer edge. Not a problem for me, but it may be for some.", "id": 562}, {"review": "I have this tuner attached to my pedal board and it is fantastic. There are tons of settings and the LEDs are nice and bright for dark stages or bright outdoor venues.Highly recommended", "id": 647}]