[{"review": "First off, the shipping was fantastic. It shipped the very next day and came VERY well protected in perfect condition. It is an extremely well made and solid product. I think a few people have given this Les Paul a rep of just being a \"Starter Guitar\". Trust me when I say, I have no problem leaving my Les Paul Standard at home and taking this one to a gig. It plays well and the sound?? INCREDIBLE. It even has a great acoustic sound to it when not plugged into an amp. I can't say enough good things about this guitar it's that good. If you're thinking aout buying this guitar, don't. Just buy it!! BUY IT!!", "id": 31}, {"review": "I realy like the cutter. The only thing, for me, was the peg winder was getting in the way.With just a simple screw it comes right off. I much prefer it without the winder. Build quality is awesome. Sturdy and a bit weighty. Definitley worth a buy.", "id": 94}, {"review": "I swear by these strings. These are the only strings I will use on my Les Paul. Their bright tone sounds great and full, while the color coded ball ends makes restringing a breeze. Don't buy these strings just because I like them, buy them because they suit you. Because you like the tone they provide. Because they feel good against your fingers. Cons?? What cons...?? Try them.", "id": 156}, {"review": "Look no further...You will not be let down by the build quality of these cables nor by the sound quality. I have a Monster M ROCK-12 cable. Put up against these, I fail to distinguish the difference in sound. The only difference? Price. These cables are the ONLY cable I will ever use from now on. Go ahead, buy them. You will love them.", "id": 195}, {"review": "After registering the amp online (or by mail) you have access to 500+ backing tunes,with either drums or drums and bassline. You are able to select from different genres such as Rock, Blues, Country, Alternative and more. Along with this great feature, you can also take free lessons, from beginner to advanced. You can even get custom settings, giving you the sound of such great bands as Green Day, The Beatles, Led Zeppelin and many more. Along with lessons, tabs, and the ability to loop any Jam Track, Spider Online adds more than even I immagined to this awesome amp!! If you're still hesitant about buying this or any other Spider amp, just buy it. I personally guarantee your satisfaction...BUY IT!! (no seriously, are you buying it??)", "id": 619}, {"review": "When I first felt this strap, I smiled...This is so supple to the touch, making playing with it a great experience. Yet it's durable enough even for the roughest of players. It is fully adjustable, allowing for all body types. This is the first strap that I've bought in a long time. I have a Planet Waves strap with studs and I like it very much. I'ts the only strap I've ever used. Untill now. Now I have it put away and I'm using this one. If yore looking for a new strap, I highly recommend this one. Trust me...You will not be disapointed by it. Yeah it looks a little plain, but it doesn't slide around while playing and I love it!! BUY IT ALREADY!! XD", "id": 658}]