[{"review": "This is a nice little tuner. It is small, easy to read and use. It has a non-backlit LCD display of an analog VU style meter, with extra marks at plus and minus 20 cents, and red LEDs that light when a tone is sharp or flat. It has a green LED and large mark for being on target. It has a built-in mic for acoustic instruments, and a mono 1/4 inch phone jack for electric instruments. It has an active tone you can switch on for tuning, but that is only adjustable over the narrow range of 410-480hz. It uses a pair of AAA size batteries that you pop the whole case open to change. If you have any vision problems, the display might be an issue. The LCD is about 1 1/2 inches long and 3/4 of an inch high, and, like all non-backlit LCD displays, has a narrow viewing angle and reflection issues.I wanted this for tuning didgeridus that I was making, and it works adequately for that. The one thing it is lacking that disappointed me is a frequency or octave readout. As it is, it gives you the note and cents sharp or flat, but does not give an octave number or frequency of the sound. So, you know you are tuned to a C, you just don't know exactly which C it is. Probably not much of an issue if you are tuning a regular instrument, but in some cases would be very handy to know. I suppose with more training and experience, I could learn to tell that by ear. (What? Learn a skill! Isn't that asking a bit much?)I suppose for an inexpensive tuner, that is the trade-off, but it does detract from the usefulness of this tuner for my purposes. Other than that, it seems to work well. It is consistent, easy to use, and compact. I consider it about average in value - it does the basics well but is missing what I consider an important function in such a device. I may be expecting too much for the price, as I have not done an exhaustive study of tuners and their specs. Having the octave feature would make it 4 stars for me instead of three.In any case, if you don't need to know the actual octave or frequency but just the accuracy of the notes you are tuning, this works quite well, and is not very expensive.", "id": 305}, {"review": "", "id": 321}, {"review": "I have played, listened to, and used audio amps for over 4 decades, and while I haven't owned every name brand amp on the planet, I do know my way around them well enough to spot a good deal when I see one. This is a nice little practice amp for electrified acoustic guitar, with an input for a mic (XLR - no phantom power) and a CD player or other audio source. It also has a headphone output (1/4 inch). It has three tone controls and separate volume for the guitar and mic inputs.I got this originally for my mother, who used to sing in an Andrews Sisters-type group back in the day. She still loves to sing, and wanted a small amp and mic to practice and do the occasional small jam. She hasn't had the opportunity to do that yet, but I have tested the amp and put it through its paces. I think it will work fine for the kind of thing she has in mind. The lack of reverb or processing for the mic is a bit of a drawback, but considering what I paid for it, I can't complain.Now, this is not a gigging amp, at least not in my opinion (your mileage may vary). It is small, solid state, with an 8 inch speaker, and 15 watts of power (I haven't measured the exact output, so I'm taking Behringer's word on that). I like Behringer, and they can turn out some pretty good gear, within its limits.I like the sound of the amp with my Carvin acoustic guitar with a Fishman preamp. It is an inexpensive practice amp, so I don't expect the same kind of quality I would from a more serious combo amp. The 8 inch speaker is obviously not going to give the kind of sound quality as a good 12 inch, no matter what. The question is, does this amp provide the sonic quality and flexibility needed to allow serious practice work, composition, or just moderate entertainment value? For me, that answer is a clear \"yes.\"However, this is an inexpensive practice amp, and if you approach it with that attitude, I think you will find it a nice little amp. Don't plan on using it for your next tour with Manhattan Transfer, Seal, or Celine Dion.", "id": 398}, {"review": "While I haven't used a lot of capos in my playing, I have used 4 or 5 different types, and this is easily the best of that batch.While all capos require a certain amount of fiddling to get them to hold the strings down just right on each different guitar, this one was pretty easy to \"dial in.\" I had very little trouble getting a position which gave good clear tones from each string without having to mess with tuning.The action of the grip and release mechanism is easy, but it delivers firm pressure to the strings. In fact, the only negative I found was that the height of the capo made it a bit difficult to fret near it on the higher strings on some chords.Overall, this is a very good capo, and I can recommend it without hesitation.", "id": 843}, {"review": "I love Tascam gear, and have used it for nearly 30 years. I was excited to try out this interface and see what it could do. Unfortunately, I was disappointed.While the construction and mechanical function of the device itself were good, the actual function with the computer left much to be desired. Also, the complete lack of a manual with the one I got made it very difficult understand the functions. (Sorry, but with a device this expensive and which includes 2 CDs of software, how hard would it be to include a full manual on the install CD?)There was a very small quick start guide included, which basically just named the various switches, inputs, and outputs, and gave extremely sparse directions about using the software mixer screen. I was forced into trial and error to see if I could get a serious recording in anything remotely resembling a multi-track mode. I could not. I could record and layer multiple tracks (I was using Audacity, didn't want to install Cubase), but I could not get playback from the previous tracks while I also had live input. Now this could have been my computer or Audacity, as it is an older Win XP machine, but it played back multiple tracks without problem.There was nothing in the mini-quickstart guide to address this, or even hint where one should look, other than going to Tascam's web site. I'm sorry, but that is just not good enough with a device this expensive. There should be a complete manual, at least in pdf, included with the product. If I am going to use this to do serious recording, the last thing I want to do is waste huge amounts of time digging information out of a website, or worse, from \"user community\" threads in some blog.Which brings me to another minor complaint - no Linux drivers included. I use mostly Linux, with only one Windows machine for software which I can't get on Linux. I wanted to try the software under Wine on Linux but was under time constraints.Then there are the generic problems with software interfaces replacing hardware. With a hardware mixer, I can access as many controls as my fingers can handle (3 or 4 on some mixers) at the same time. Computerized mixers can only do 1 thing at a time, and one must be constantly moving the cursor from one thing to another to access controls. The controls on  this interface were very fussy, and you have to position the cursor just exactly on a very small portion of a button to get it to react. I found it very tedious, and again, no actual instructions were included to help with that process. With a touch screen, it might be easier, but then why not just use buttons on a real mixer in that case? (Yeah, I know, touch screens are COOL.)Also, software based functions are always limited by your computer and OS, and that means everyone can have a different experience - consistency is much harder to maintain.I am old school, and find hardware mixers far more responsive and useful. I know that lots of people are all excited about having software versions of hardware in their computers, and saving space, etc., etc. I value function over fashion, however, and that is what I have always liked about Tascam gear: it was supremely functional. This software falls far short of what I expect from Tascam, and the lack of a manual for the interface is inexcusable.Good mixers, especially for multi-track recording, can be complex and difficult to learn. The layers of signal interconnection can be hard to understand at first, and takes some time to get comfortable with. Old Tascam manuals actually used to have a certain amount of instruction in multi-track recording, which was helpful to aspiring recording artists. Not so here.I had really hoped to give this 3 or 4 stars, but sadly, it only rates a 2 (2.5 if I could) for me. Come on, Tascam, you can do better than this.", "id": 874}]