[{"review": "I originally purchased these strings because of the 11-52 gauges. I wanted a set of strings that would have slightly lighter tension than a regular set of light gauge which is usually somewhere around 12-54. Upon installing these strings, I can't really see much difference in size from the regular light gauge, but maybe it's too small to notice with the naked eye. I'm not entirely sure that these strings were louder or a marked improvement over the old DAddario strings that they replaced. They might be a little brighter or have more clarity due to being new. The guitar that I'm using them on, is a small body with a nice mellow sound anyway, so everything sounds nice and smooth. Overall, I'm satisfied with the sound and performance of the new strings, but I don't think I'm ready to give up DAddarios yet.", "id": 86}, {"review": "These strings from D'Addario are a personal favorite of mine. I love the EJ16 light gauge for their size and ease of use. I think the light gauge is a nice size that won't hurt your fingers, or put undue stress on your guitar. Not only that, but they sound great. Not too big or not too small! I have plenty of volume and drive for bluegrass. I love how they color code their strings on the \"ball ends\". To me this makes it much easier when changing strings. You don't have to worry about mixing up your strings. I've also had no problem with the fit; unlike some brands. Give these a try. I think you'll be satisfied.", "id": 198}, {"review": "This is my second Fender Polish Cloth. They are basic, but that's all I need for a quick wipe down of my instrument after I'm done playing. The only slight negative is the fact that they tend to unravel around the edges. Even though this has happened to me, it didn't keep me from buying the second one. The fact that they are basic and inexpensive is good enough for me. It gets softer with time and use. Overall I have to say that I'm satisfied with the Fender Polish Cloth.", "id": 219}, {"review": "This is a great capo from shubb. The finish matches most guitar hardware as it is nickel. I like how it works. It adjusts to fit different guitar necks, and just sort of snaps in place. It doesn't require great force or a lot of hand strength to use this capo. The rubber parts are replaceable and with a name like shubb you know you're getting a good product. I recommend this capo to anyone.", "id": 541}, {"review": "I love the Dunlop Formula 65 polish and cleaner. It works really well, and I like the easy to use pump spray mechanism. I've used other brands in the past, and they had poor spray nozzles. This one works almost like a mist. It does a good job of removing smudges and fingerprints. I spray it directly on the surface of the guitar, and then wipe it off with a flannel cloth. After I'm done the shine looks glassy and great!", "id": 351}]