[{"review": "First off I am no expert on these things but I can tell you in the brief period in which I have owned my DS-1 I have enjoyed playing/practicing a lot more with this pedal.  I have a Fender wannabe guitar, and a Fender Sidekick 10 which means my gear isn't the best but the pedal produces a wide variety of distortion and tone changes which keeps me interested.  I am having so much fun that I don't even notice my fingers hurt anymore.  Honestly, this is an essential buy when starting out along with headphones and a cord extension so the police don't come a knockin.(update Sept 2012)It is a year later and I have a much better guitar and amp and a lot more knowledge.  I am glad I got the DS-1 but for other reasons.  Sure it made me enjoy playing and practicing a lot more but I soon found the sound was off considering I like more blue and classic rock.  Again for the money I dont think you can beat it but more importantly when you have a few buck you can send it out for modification from Keeley.  Initially I had wished I went with and overdrive (OCD or Boss OD-3) but with the mod done by Keeley I have a super flexible pedal that cover just about all the sounds I need.  In closing, spend the $40 buck and get this....and then when you start wishing it could do more send it off to be modified and you will thank yourself later.", "id": 35}, {"review": "Will this replace a pro fret job? Nah...That said this works great for use a few times a year to clean the frets an make them shiny and smooth.End results[...]", "id": 317}, {"review": "I figured I would take 2mins out of servicing the line of ladies that formed after receiving this pic to do a review.  The pics shape and thickness is actually perfect (TWSS) for playing and gripping.  Also the paint seems to be holding after quite a few hours of playing.  I would suggest getting two packs since you will need 1 pick and the other 11 can go to the children you fathered due to this pic.", "id": 373}, {"review": "Ever notice how every youtube video has pedals being demoed with either a Strat or a Tele?  We we can debate why that is but one thing for certain is it is tough to get an accurate idea of what an LP will sound like till after you unbox it.  After hours of research I decided on the FD2 since it seemed to have a lot of tuning options and I actually found a review using an LP into a clean amp.[...]Essentially, you get 3 modes which have varing degrees types of OD and a second boost mode to push things even father.  What I liked about this pedal is you can use the comp cut or flat mids with an LP and not increase the bottom end or mids which often Teles or Strats need.  Hence, you can go from slight boost to huge gain without turning into mud like some pedals will do.  The only downside is with so many options you will constantly be playing with the knobs and switches and finding new sounds.  Works fantastically with modeling amps which need varying amounts of clean and dirty OD depending on what you are modeling.", "id": 441}, {"review": "First things first, this is a fuzz pedal (and on the heavy side) which mean it provides thick ground shaking distortion and sustain.  This is very different from normal distortion so noise is to be expected whether you are playing or not.Second, a true bypass switch (like in the Big Muff)is a mechanical switch as opposed to Boss type pedals that have buffers which color your sound even when they are off.  Mechanical switches make noise are are louder the more durable they are.Ok so now to the actual sound which is amazing.  This pedal has a tone of versatility because not only do you have a lot of options on the pedal itself but it reacts dynamically to the knobs on your guitar.  Since I play a Les Paul with 57 classics I will often turn the volume down to 8 when using this otherwise the bass can be overwhelming (but awesome). Strat and Tele players probably wont have the same issue with single coils.  In addition the Wicker and Tone features all for more sounds that just the original Big Muff or you can just turn them off to get the original sound.Great for: Black Keys (they use a big muff), Weezer (think My Name is Jonas), certain Greenday songs, and basically anything where you need thick and deep fuzz with the option to tone it down if need be.", "id": 570}]