[{"review": "I bought these wanting to try the nylon Big Stubby but was sent the lexan /clear purple ones instead. I wanted to mention this because the item description is vague(PLYS PK) and the item pictured is nylon. I'm still happy with the purchase these have the same picking dynamics as the Jazz Stubby but they give you a much larger surface to grip.", "id": 66}, {"review": "This is an affordable copy of the Boss Harmonist pedal. I bought this mainly for the harmonist and polyphonic pitch shift feature. But was surprised by how much fun the trem bar and flutter mode was to play with.Anyway on the third day the tracking on the pedal suddenly started to have about a one second delay. And on fourth day in addition to the tracking problem, hitting certain notes caused a low pitch fluttering noise. Also the pedal just started oscillating a few times. I would have given the Behringer us600 five stars if it kept working, it tracked nice and didn't tone suck too bad.", "id": 505}, {"review": "I like the Dan Electrode but I noticed dropping the voltage on some of my pedals really changes the effect (turned my Heavy Metal into a sick fuzz and my LavaBox  into a primitive distortion), and on others dropping voltage can mean a slight loss of sustain(Onerr Overdrive) or volume(FrenchToast) and thats it. It's still a good 9volt power supply but the voltage drop feature doesn't always 'wow' you.", "id": 760}, {"review": "The Mooer Pitch Box in the harmonist mode blends the dry signal with the altered pitch, and in the pitch shift mode if filters out the dry signal.The pitch knob allows you to raise the note 1, 2, 3, 5, 7, 9, 12, and 24 semitones, or lower the note by 1, 2, 3, 5, 7, 9, 12, and 24 semitones.I found that putting a distortion pedal in front of the Pitch Box made the harmonies more pronounced. Making how well it tracks and handles bends and vibrato more noticeable. And in general it helps it sounds more like a guitar and less like an organ.When I had the pitch box in front of the distortion pedal, it had this constant warble that sounded like an out of tune guitar. The detune mode sounds like a chorus but I almost never use it.", "id": 850}, {"review": "Reputedly the Joyo Us Dream is a copy of the Suhr Riot distortion pedal. After watching a side by side comparison on Youtube, I decided to buy one.I would describe the Us Dream as sounding like a bright Proco Rat with a little less sustain and a much tighter low end. It has an MXR style enclosure (that means you have to remove the back plate to change batteries) and a surprisingly narrow sweet spot. But for $48 dollars I'm  happy with purchase.", "id": 832}]