[{"review": "I usually play my Jazz Bass fingerstyle, but there are songs where I prefer a pick, especially when I need speed and accuracy. Until I found the hard Wedgie rubber pick, I used a heavy Fender pick, but didn't like the sharp pick sound very much.I bought a set of soft, medium and hard Wedgie picks to try out and I'm really happy with the results. I greatly prefer the soft Wedgie on the Uke, I like the medium on my nylon string guitar and the hard Wedgie's really nice for my Jazz Bass. I still use hard plastic picks for my electric and steel string acoustic guitars, but the Wedgie's are fantastic for when I need a more fingerlike sound on the other instruments. I prefer the 3.1mm wedgie picks since the 5mm picks feel a bit too thick for my tastes, but that's entirely subjective.I'd love to see a slightly larger version of the pick someday, but it still works very well for me.", "id": 244}, {"review": "I usually just use my fingers to strum my tenor uke, but there are songs where a pick is more appropriate. I used to have an old felt pick made back in the 1940s, but it disintegrated over time and the newer felt picks I've found just don't feel the same.I bought a set of soft, medium and hard Wedgie picks to try out and I'm really happy with the results. I greatly prefer the soft Wedgie on the Uke, I like the medium on my nylon string guitar and the hard Wedgie's really nice for my Jazz Bass. I still use hard plastic picks for my electric and steel string acoustic guitars, but the Wedgie's are fantastic for when I need a more fingerlike sound on the other instruments.I'd love to see a slightly larger version of the pick someday, but it still works very well for me.", "id": 245}, {"review": "The ability to quickly change the range and sensitivity has made it easy to dial in the exact sound you want to hear. It's built like a tank and has worked flawlessly in the time I've had it. Since I normally power it with a wall wart, I don't have much of an opinion about battery life.Bottom Line: It costs a bit more than the standard Dunlop wah pedals, it's worth it.", "id": 323}, {"review": "I used a felt pick that was made in the 1940s for a long time and it finally disintegrated over time and became unusable. I bought a set of Mahalo Felt Picks and while they seem nice, they're too stiff to get a clean sound when strumming and I get a raspy, harsh tone when picking single strings.I know many people love these felt picks, but I've found a set of soft rubber picks here on Amazon that give me a tone that's much closer to the sound of my dearly departed vintage felt pick.", "id": 775}, {"review": "I've been searching for the 'perfect' capo for years now and this one's come the closest so far.The capo's well made and doesn't show any manufacturing flaws at all. As delivered, the capo fits the neck of my Taylor perfectly with just the right amount of tension. Some other capos are horrible to attach and grip the neck so hard, I'm afraid it'll dent the fretboard. The Planet Waves capo has a nifty tension adjuster in case you have a different neck profile.I like that slips easily on the neck without a lot of mucking around. Nothing's worse than fumbling around or needing two hands doing something so simple.It comes with a clip to hold a pick, but it's kind of hard to slip one in, especially with some picks I use.Overall, I think this capo's a winner. It's easy to put on and take off. There's no buzzing and it stays out of my way when I'm playing. That's all I ask for :)", "id": 843}, {"review": "My daughter is learning how to play and the .11 - .48 string set on my strat are giving her a literal pain.I put a set of the D'Addario NYXY0942 strings on my backup guitar and tuned it up. Usually, I've had issues when bringing some brands of strings up to pitch, but the D'Addario's seemed to do a much better job. I nearly always stress the higher pitch strings a bit before bringing them up to their final pitch and they stabilized quickly. The wound strings also seem quite stable. Frequently, it takes up to a couple of days for some strings to settle in, but I've seen no such issues with the D'Addario's.I usually use thicker strings on my guitars to get a fatter tone, but I was impressed by the sound of these in spite of them being much thinner than I usually like.My daughter is also very happy with them since they're not quite so tough on her fingers.", "id": 897}]