[{"review": "Well, the Epiphone Les Paul came in earlier this morning!Am I impressed? U bet cha!This thing is simply beautiful! It arrived well padded in a double box. Initially, I spent a few minutes going over the whole guitar with a magnifier to see if I could spot any flaws. NONE! Not a finger print on it anywhere! This guitar is extremely well made and put together right. It was in tune out the box and the action is smooth as butter. The neck is slim (which is good for my thick hands) and the jumbo frets have no burrs or other abnormalities. I put a quarter under the 10th. fret and it's right on the &#34;money&#34;!It's considerably heaver than than I thought.  I would imagine it weighs about 10-14lbs. I have a strap ordered and on the way.The maple top is a work of art with a superior finish. All the metal hardware appears top quality as are the Duncan pickups. This Epiphone is a lot easier to play than any thing I ever had.  Your hand floats over the frets!I don't think you could get a better piece for the price point.", "id": 30}, {"review": "This is a good quality strap!  It is wide and has leather ends.  It fits my Les Paul 100 just fine and I am sure it willlast a long time with normal use.Can't go wrong for the price!", "id": 208}, {"review": "Decent strings but the little E string broke while I was stringing the guitar.Other than that, they appear OK.Nothing to rave about.", "id": 227}, {"review": "Very good guitar strap!  Thick nylon webbing material well sewn and the leather ends not only look sharp, they hold really well on your guitar studs.The tan color goes with with my natural finished guitar.I would recommend this strap to all!", "id": 285}, {"review": "One of the best stands in the industry!  Fits any guitar, banjo, or even a cello. Good construction and easy to put together.How can you beat that!", "id": 519}, {"review": "Great picks!  Nice flexibility and easy playing no matter what your style.I would recommend these for any guitar player!", "id": 574}, {"review": "Great hook!  Supports a lot of weight.  Looks good on any wall.I would highly recommend this hook to anyone for any application.", "id": 779}]