[{"review": "The most annoying thing about modern ideas in Ukulele strings, or indeed in Guitar strings, is to wind them with aluminum wire - making at the least a black deposit of aluminum on my hands, or at worst, cognitive damage skin contact with them. These rather inexpensive strings are not aluminum wound, but are silver plate wound - no health problems possible from strings makes them the best.", "id": 203}, {"review": "These items, though well made, and strong, are sized rather differently to National picks - With the National, I need a Large, so I ordered Large in this item - it is, however very tight, smaller in fact than a National Medium thumb pick.Essentially a waste of money.", "id": 343}, {"review": "This hand full of picks saves your fingernails, they are not the best, but easy to fit to the fingertips though the thumb picks that came are not the size I am used to.", "id": 640}, {"review": "If you are a broke performer of harmonica blues and need to get back on track, these will not help much. That being said, these are not junk, nor are they cheap nasty instruments - there are plenty available that are much worse than these. Straight from the case, these don't bend well, but do not despair. Having an experienced player break them in gets one of them behaving well in a couple of days (about eight hours of playing) So far I have persuaded the G A Bb and C to bend enough to satisfy curiosity, but they will not hold up to serious playing. I do not destroy my harps easily, so am not the most aggressive player out there, but I felt like these would certainly be something even I may wear out pretty quickly. For the purpose I intended these to perform they are about perfect - with me breaking them in, I can pass them on to my non harp playing relative for them to learn the basics.  Better use these inexpensive harps to over-blow and squawk through, than the set I will be buying in six months; if the promise of musical ability follows through. The advantage of the plastic comb is that I don't need to pass on any germs with them - they wash very easily, with no damage. For the price, you get seven good harps, that make presentable learner instruments, with just a little prep. Without the experienced blues player to break them in, it will take a bit of patience to learn bending on them - there are many YouTube videos that will teach the method, so try hard, persevere and you will crack it with these harps  - try learning bending on the lower key instruments first; they will be easier.", "id": 693}, {"review": "This little Guitarlele is great - I have tuned to the standard E tuning of a guitar and it manages very well. It gives a gently subdued tone, that is perfect for playing any time, even accompanying music on the TV whilst the family are watching. I have had way more fun with this little guy in the last couple of weeks than I had with my twelve string in the last six months.Added info:Now that the tuning has settled down, it is keeping tune very well, with no need to retune during playing.The strings it came with are not the best though, they are wearing through all ready.", "id": 747}, {"review": "This amazing punch can be used to completely obliterate the numbers, and name on an old card, and give guitar picks at the same time. The edges are a little rough, but it is a punch not a precision cutter. One of those soft nail sticks that the ladies carry around work very well to get the rough edges removed.", "id": 784}, {"review": "I am forever meeting people who rave about this harp, but had not tried one for myself until today. It is a wonderful harp, with perfect tuning, easy bend-ability, does not buzz or squeak, and belies it's reasonable sale price.  I went for the Key of Bb, and love the tone, the playability and the just right feel of the instrument. For anyone not yet having a Special 20, I heartily recommend it - beginner, intermediate or advanced students, or the performer on stage - this harp is simply great. I am not often surprised by anything but this harp surprised me - it is not expensive at all, and sounds as good as others I have that are four times the price. I am a Hohner Marine Band Special Twenty convert  - I will get a couple more to add to my ever growing box of harps.", "id": 828}]