[{"review": "Dont last but a couple weeks..terrible feed back as the ends near the plugs detirorate quickly. Will never buy again even if only 5 bucks", "id": 168}, {"review": "It has a tinney sound to it But for 200 dollars or less I would rate this has a Top of the Line low end guitar..For any beginner this is the guitar I would but in there hands..I still write all my songs on this and play it more then my !000 dollar american strat or 500 dollar ibanez", "id": 360}, {"review": "Solidly built works just as a mic stand should..couldnt be happier..As long as I take care of this Ill never need to buy a new one again.", "id": 501}, {"review": "Does what its suppose to..only giving it 4 stars because they should have a multiple preset switch available rather then only letting you do one", "id": 563}, {"review": "Well 3 hours to put together got tiring and annoying as things tend to fall a part..however as a standalone items it is great with good sounds and groove tracks to practice drumming on..However I am not a drummer nor have any interest in becoming one..I bought this in order to use with software recording for basic beats to fit my own songs..and it is a NIGHTMAREGoing on a week now no support help from either company..HEED MY WARNING IF YOU WANT TO USE THIS WITH NI, EZ DRUMMER OR OTHER PROGRAMS LIKE THAT YOU MUST KNOW HOW TO REROUTE MAPPING OF MIDI IN ORDER TO USE IT. This is not a plug and play item you will spend hours of your time trying to get this to work with software...There is very little helpful info out on the net i've owned this for over a week and still never used it for its purpose yet being that its a stand alone item..there really is no MIDI support..Im am close to giving up the fight and sending it back.Alesis could have made this an amazing item and 1000 times easier if they simply created a midi out port on the module you could run into your daw and software..", "id": 609}, {"review": "People tell you you need to buy a 1000 dollar tube amp to sound good..shuuut up..mic this through a PA and you;re set never need another amp againUse amp modeling software that fender includes and you have a vast array of tones..for 100 bucks..Spend money on a top end guitar if you get this amp its all you need", "id": 718}, {"review": "A cheap guitar at best..no bite to it at all..does not get me excited..learned religoulsy on an acoustic so was excited when i got this cheap from gc for less then 100..low e doesnt stay in tune well pickups suck hard to play being its a jr and just awkward (which is my fault) do love the color and look of it..but thats not what guitars are for right..itll serve its purpose until i can afford a Real American Strat..not great at all..but passable Id return it if i could.", "id": 738}]