[{"review": "Any time a person buys an A/B box their only real expectation is to have it switch quietly, this unit is as quiet as them come.  For the price it can't really be beat.", "id": 375}, {"review": "I purchased a budget passive soundhole pickup for a guitar I bring to a local open mic.To get any volume from it the sound guy had to boost the channel very high and the sound was still a bit thin.  I found the Behringer PB100 and after reviewing various posts about it as well as checking out the YouTube demos of the device I purchased it.  I used it for the past four weeks at the open mic and have been impressed with how it boosts the sound without effort.  I can add a bit of bass which makes the guitar finally sound as it should too.  This pedal makes the budget pickup sound like a much more expensive pickup now.", "id": 382}, {"review": "This Behringer unit has all the necessary features to give you solid performance in a stompbox delay pedal.  I say, why pay more?", "id": 488}, {"review": "I use the US600 for short lead riffs, it works great in a sweetening role. It is easy to change the key manually, in point of fact, much easier than I originally thought.  It's a main-stay on my pedal board now.", "id": 505}, {"review": "This pedal was purchased to replace an OEM pedal for my synthesizer, it works as expected and has proven to be durable.  I don't hesitate to drop it in my gig bag, knowing it will be ready to rock and roll at the next show.", "id": 537}, {"review": "My puppy destroyed my name brand midi cable.  I bought this to fill the gap until I could by another name brand but since it works so reliably I'll saving my money for other things.  If the puppy murders this one I'll order up another one just like this.", "id": 565}, {"review": "This is a hit-or-miss product.  For me it fell short but for others it seems to work very well.  It's not a total loss since I can reuse the endpin jack with the soundhole solution I ended up with.  It was cheap enough that it was worth taking a chance on.", "id": 611}, {"review": "These sell for about $20-25 in the real world.  I paid a bit over $12 and it was an Amazon Prime purchase too.  The display is better than most I've used (dating back 30 years).  The best thing is that I can pass this around to band members quickly when they have a need too.", "id": 707}, {"review": "I purchased this product a few weeks ago after reviewing and \"kicking\" the tires of this one and it's competition.  I will tell you up front my decision to buy the DR-07MKII over the Zoom H1 came down to the inclusion of a guitar tuner and the ability to be a phrase trainer!  I'm a musician and a wanna-be videographer, since the quality of captured sound was the same on each test I read about (DR-07MKII vs Zoom H1) and listened too on YouTube I decided the tuner would keep my gig bag the same size.Most reviews never touched on the phrase trainer feature targeted at musicians.  Tascam makes a line of phrase trainers that typically cost between $150-200 and don't even have high quality microphones, so discovering I could toss an MP3 of the song I was learning and slow it down to figure out the chords and lead guitar parts was an unexpected surprise. This is the better choice for musicians.Other features I appreciate about the DR-07MKII, the adjustable microphones, quick turn on and being armed to record, the file system, the low battery consumption.I should also mention that straight out of the box i attempted to record, after all, everyone said how easy it was to simply open it up, power it up and start recording.  Well, I got a recording without sound!  The unit comes from the factory with the record level at zero.  Once I figure that out all was right again in my universe.  You will want to start with a recording level that is high and adjust lower to suite your recording situation.  I found out the hard way how much of a waste of time it was to start low first, a few of my early attempts at recording our church worship team practice was disappointing.  The more aggressive recording level solved that problem.I purchased a standard microphone windscreen for it, after the first time or two of stretching it on with some difficulty the windscreen loosened up enough to make it a simple process.  I have tried recording outside with this unit and the windscreen with good results. I still don't know how I will solve the  wind noise issue when recording ambient sound (microphone capsules facing out) since the windscreen will only cover the microphones in the XY pattern position.  I'm sure someone makes the smaller windscreen though.For my video work I use inexpensive hd capable camcorders. My new fascination is with the Song Bloggie (swivel camera lense), they are inexpensive now ($50 on Craigslist these days) and with the DR-07MKII all my video pieces have wonderful sound to go along with the surprisingly good picture quality I get from the Bloggie.One last detail, at the point of purchase I discovered Amazon was doing a special on my purchase and discounted the DR-07MKII to the same price point as the Zoom H1... win win!  I got what I expected with my purchase, you will too.", "id": 755}, {"review": "This is exactly what I was looking for the protect my investment.  I tried purchasing a soft case that had the Seagull logo on it and was advertized and fitting my guitar, it didn't.  It was way too short for my Seagull S-12 Coastline.  This is a sturdy case that looks good too.", "id": 859}, {"review": "This pedal has a solid feel under my foot and gives me the 'push-back' I expect when playing live gigs.  Always welcomed is the fact is stays in place where I put it on both wood or carpeted surfaces.", "id": 251}, {"review": "This tablet mount allows me to use my large Toshiba Thrive in live performance situations now.  It makes a solid physical connection to the mic stand, I never worry about it readjusted or slipping during use.", "id": 831}]