[{"review": "the foam ball prevents wind pop and it also doesn't get smelly like some other foam would be. i would highly recommend it.", "id": 178}, {"review": "it's 6 bucks so I didn't expect a lot from it, but it works as advertised.  not sure how long the connectors will last though as they do look to be lower quality.  the cable wire is rubber coated and is easy to roll and store, the wire is very thin.", "id": 465}, {"review": "decent, holds 2 stands and maybe a few extra poles.  the bag's shape from side view is a rectangle -- compare to other stand bags that's more of a square. Zipper seems to be very good quality, the bag is NOT padded at all, and the material used is very thin, there is however a water resistant coating on the interior of the bag.I think I should have spend $10 extra and got the on-stage padded stand bag.  But if you are going for local shows and doesn't need the extra padding for air travel, this is the bag to go.", "id": 552}, {"review": "I first bought the Yamaha MG102c mixer, but it arrived defective so I returned and bought this instead.First impression of ProFX8 is very good.  It's a lot more durable/heavy than the mg102c, and the knobs are constructed much better.For example, all the knobs that have centering dent on MG102c doesn't line up well, some are off by a few degrees.  But on this ProFX8 every dented knob line up beautifully pointing up.  Knob turning pressure is also consistent and firm.Really like the EQ on the Main output.  As well as mute on every channel.  Build-in FX effects are okay, you have to turn fx knob all the way up to feel anything.When using USB to do recording (with Audacity) there is noticeable buzz sound along side any recording, regardless if microphone channel is turned off or not.Microphone preamp is so-so I guess.  I have a AKG d5 and SM58, with both mics I have to turn gain and channel volume to 90% to get a decent output.But it does the function perfectly.  Runs a little bit on the hot side.  Power cable is kinda short, so you may want to look for a longer one.", "id": 652}, {"review": "I bought two microphones, a AKG D5 and SM58.  I like AKG D5 a little better than this because the vocal sounded a lot clearer and crisp on the AKG.The SM sounded muted compared to D5 without any sound modification out of box.  The output is also a little less sensitive than the D5.However I like the look of SM58 and it seems to be extremely durable.", "id": 20}]