[{"review": "I bought this mic after hearing good things about it, but I had never tried it. It has impressed me quite a bit since then. I use it in a small home studio set-up, along with a Presonus Firebox and Logic Pro on a Macbook.For the price, this mic is a very good deal. It sounds much better than an Audio Technica 3035 that I had (and ended up selling shortly after getting this mic). I also got an Oktava MK-319 that is a much more expensive mic, and that was then sent to be mod'ed by Michael Joly (and therefore cost even more) and I'd say the two mics are very similar. I end up using the CAD M179 a lot more because it's less valuable, but sounds just as good.What else? It has low noise and combines the crispness you want from a condenser without being unpleasant. It sounds particularly great for male vocals, in my opinion, although I have used it for as a room drum-mic. I would highly recommend this mic, especially at this price point.", "id": 82}, {"review": "These Danelectro pedals are great quality for the money. I use this pedal behind my dirt pedals for added flexibility and bringing out some more \"brilliance\" to the tone. The case is plastic, not very attractive, and perhaps not very sturdy. Also the button to push down for the effect leaves a bit to be desired -- it doesn't feel very solid. But I intend to use this more for recording than live use, so I'm not worried about that. Anyway, there aren't many EQ's on the market, and for the price, it can't be beat. I would recommend it.", "id": 84}, {"review": "I tried these not knowing what to expect, and have been very pleasantly surprised. I tend to have sweaty hands, and my guitar strings get a lot of crud on them and then eventually rust. Although I have learned now to wipe them down each time I play, they still deteriorate pretty quickly, and it's a pain. When I wipe them down with a cloth, they leave black streaks of crud on the cloth.The Elixirs are not as bright as other strings when you first put them on -- that is true. However, other strings lose their brightness after just a few hours of playing, so I don't see this as a major disadvantage. The advantage is that these strings get very little crud on them. When I wipe them down, there's nothing on the cloth! I've even stopped wiping my strings down as carefully.So for a player like me, these are a godsend. I don't detect any loss of tone. They are a bit slippery, and some people have reported having trouble because of this, but it's fine for me.Definitely they're worth a try. Although they're twice as expensive as regular strings, they'll last longer, so they're worth checking out! Ernie Ball makes titanium coated strings that I'm interested in trying out, and there are some other brands, too.", "id": 105}, {"review": "I really like these strings, because I have sweaty hands that tend to make the strings on my guitars corrode and rust very fast. I can play a guitar once, and leave it there for 2-3 weeks, and the strings will be rusty and nasty when I return to it. I now rub down the strings thoroughly after each session playing them, but this stil happens.Then I happened across these Elixir nanowebs. They are great. I no longer need to rub down my strings so thoroughly, and they stay rust and gunk-free for 2+ weeks (of regular playing). However, I did encounter one strange thing. While playing at a rehearsal, my E-string just popped and broke, hurting my finger a bit. I was surprised, because outwardly the string didn't look that bad.So that is the downside. With regular strings, you can tell the string is near the end of its life b/c it looks really bad. With these, they may still look okay but be close to breaking. Made me a little cautious.I still prefer these 100% over other strings, though.", "id": 106}, {"review": "These are my favorite strings for electric guitar. I've been using them since I started playing about eighteen years ago. I've tried other strings, like Gibson and D'Addario, but I like the sound and feel of Ernie Balls the best -- they feel nice, full, thick, hefty. I play blues, jazz, and bluesy rock. I use these on a Gibson Les Paul Vintage Mahogany and a Yamaha neck-thru-body electric, and they are good for the music I play and for providing a full-bodied sound. There are a whole host of \"big name\" guitarists who use these strings, and for good reason. I buy them in 10 packs to save money -- can't seem to find that option here on Amazon.", "id": 226}, {"review": "I own the Behringer Xenyx 1202FX, which is essentially this model but costs about 20 dollars more for the FX (it comes with 100 set effects). I have been doing home recording with Cubase and Logic, using a Presonus Firebox audio interface, with both MIDI, vocals and instruments, and didn't use a mixing board, but eventually decided to try one out given that (a) they are making them at very reasonable prices and (b) I had more inputs and outputs than the Firebox could easily handle.This mixing board didn't look that impressive to me when I first checked it out, but having set it up and used it, it operates very well and cleanly. The fact that it comes with four mic inputs and preamps is a plus. The fact that it does not have an on/off switch is a minus. But basically it works well, the EQ is useful, and it has a large number of inputs and outputs for such a small mixer. Behringer makes a range of models with less/more inputs to suit one's needs, so this is great. Also, having a dedicated mixer makes it easier for me, as I can leave all my inputs connected and just adjust things on the mixer depending on what I want to record. Another small thing that is mixing is a button that cuts out the line altogether -- you have to turn it down to zero. And, there are no faders (except the main); instead it uses knobs for everything. Well, I would have liked some of these things, but then I would have to pay more, and what I really wanted was functionality at a good price, and that is what the Behringer Xenyx has delivered thus far.By the way, I am running the following through the mixer: an AT3035 audiotechnica condenser mic, an Alesis QS8.1, guitar via line-in (or mic'd), two KRK RP5 studio monitors, Presonus Firebox. Everything's been working and sounding great thus far.The effects on this mixer have not been very useful to me, since I am running Logic, but if I ever use it live, which I may do, I'd imagine they'd come in handy. The effects are just so-so in terms of sounds: usable, but not that great, in my opinion.", "id": 369}, {"review": "I own the Behringer Xenyx 1202FX, which is essentially this model but costs about 20 dollars more for the FX (it comes with 100 set effects). I have been doing home recording with Cubase and Logic, using a Presonus Firebox audio interface, with both MIDI, vocals and instruments, and didn't use a mixing board, but eventually decided to try one out given that (a) they are making them at very reasonable prices and (b) I had more inputs and outputs than the Firebox could easily handle.This mixing board didn't look that impressive to me when I first checked it out, but having set it up and used it, it operates very well and cleanly. The fact that it comes with four mic inputs and preamps is a plus. The fact that it does not have an on/off switch is a minus. But basically it works well, the EQ is useful, and it has a large number of inputs and outputs for such a small mixer. Behringer makes a range of models with less/more inputs to suit one's needs, so this is great. Also, having a dedicated mixer makes it easier for me, as I can leave all my inputs connected and just adjust things on the mixer depending on what I want to record. Another small thing that is mixing is a button that cuts out the line altogether -- you have to turn it down to zero. And, there are no faders (except the main); instead it uses knobs for everything. Well, I would have liked some of these things, but then I would have to pay more, and what I really wanted was functionality at a good price, and that is what the Behringer Xenyx has delivered thus far.By the way, I am running the following through the mixer: an AT3035 audiotechnica condenser mic, an Alesis QS8.1, guitar via line-in (or mic'd), two KRK RP5 studio monitors, Presonus Firebox. Everything's been working and sounding great thus far. Since I'm using Logic, the effects are basically unnecessary, but if I ever want to use the board for live use, which I may do, they could come in handy. I'd say the effects are just so-so.", "id": 370}]