[{"review": "These  work great! It's hard to write a review of strap locks without thinking you are wasting your time. You have a strap. You have a guitar. This locks them together. But, these do work really well. Compared to other brands, I find them easier to use and that is great after a couple of beers. Downside is that the strap is further out from the guitar than is generally considered (by me) to be aesthetically pleasing. But, this is true for most strap lock systems. So, I say go for it!", "id": 523}, {"review": "This guy is great if you want to mount it on your guitar without a big clip-on gizmo that people see easily. Downside is that it is so small it's hard to tell what button you are pushing and it's not terribly easy to turn off and on (Do I push again? Push and hold?). Also, the screen to read if you are in tune is so small that sometimes judging how close you are to being in tune is hard. This being said, it's a nice tuner and stays on. Also, I should point out that while it does clip on, it's not as easy to move from one instrument to the other as some other tuners.", "id": 785}, {"review": "Get this. It was awesome! Blu-Ray surround with the band was just amazing. Great extras too. They were so much tighter on this concert than back in &#34;How the West was Won&#34;", "id": 855}, {"review": "Indeed, this little blue-lighted wonder will make you famous. Not unlike the &#34;Three Wolf Moon&#34; shirt, this little pedal will get you the ladies (or if you're a lady, it will likely get you the guys). Either way, it gets you what you want! On top of that, it does a great job of boosting your signal from your guitar and getting you just a bit of &#34;oomph&#34;. In particular, I find it helpful when I'm running a lower output guitar through a long cable. Did I mention it has a blue light? The only downside is that you have to open up the back (with a screwdriver, so put that on your shopping list if you don't have one) to adjust the little switches that chance the tone.", "id": 643}, {"review": "I haven't read a lot of comments about these guys breaking, so maybe my wife and I are just ham-handed Shrek wannabes, but we have busted two of these little gizmos. They are basically made of a clip that attaches to your instrument, a round frisbee shaped tuner, and an arm that connects the two. The arm has a very fragile socket on each end that it fits into. She and I have each busted one, doing something mundane like putting it into a case or setting down a guitar on a carpeted floor.While the tuner works well otherwise (except the low E string on a bass which can be problematic), and the things don't cost very much, it's a shame we keep busting them. I do really recommend them as a good tuner and very very portable. Just be extra careful handling them.", "id": 707}]