[{"review": "I've got three of these simply because they work and they're easy to carry from place to place...and I insist on a stand for my guitar, none of this &#34;leaning' stuff.", "id": 92}, {"review": "Every once in awhile, while browsing through Amazon, I come across something I don't know how I got along without!! And it really works!", "id": 167}, {"review": "I like simple guitar straps without too much glitz and yet wide enough for the shoulder and attractive, yet simple.", "id": 253}, {"review": "Not much to say...I wanted  Fended tweed guitar strap and this is the exact item in my sights. Thanks, it does what it's meant to do!", "id": 353}, {"review": "Now I can use the clean channel on my amp, with this pedal, for my acoustic guitar and that leaves my channel 2 for my other pedals and my electric guitar.", "id": 380}, {"review": "It's rubber and you can slip it under the strings and into the sound hole...with a little effort. It might even be over &#34;engineered&#34;, it fits so well.", "id": 497}, {"review": "These are a new style of guitar pick to me. Thought I'd give it a try. OK...probably didn't try long enough so I only rate it three stars because of my OPINION. The seller did not fail me in any way.", "id": 580}, {"review": "I should have researched this a little bit more. It was a gift for a child, but a child couldn't tune this thing nor could I! It was a toy, not an instrument.", "id": 589}, {"review": "I think this is my fifth Behringer pedal. Admittedly I haven't had the time to try this one out. But based on my others, I'd say this will do everything the pedals that cost double or more can do!", "id": 615}, {"review": "I sure wish I could afford a Fender Twin Reverb with the old spring reverb...but I don't have the funds, and I don't have the back to lug one of those around anymore. So my Baby Boom does the trick!! It's close enough for my needs!", "id": 699}, {"review": "I wanted a delay pedal but I'm not playing for big money so I had to watch the $$$ I spent. I read the reviews on the lower dollar pedals and decided on the Rogue. I haven't had much time to REALLY play with it, but trying it out has been fun and I expect it will do the job for me!", "id": 725}, {"review": "Fender cords look great and work just as well. By adding the word California to the description I'm sure to sound like the Beach Boys...", "id": 3}, {"review": "To everyone who plays flat-picking guitar, I'm sure you all have your own choice of pick....do you even remember why you picked the style you use!? Somehow, I started out with Fender thins and here I remain!", "id": 120}, {"review": "As I stated about some other guitar strings I purchased here, these D'Addarios for my electric guitar give me the sound, service and price point I need!", "id": 156}, {"review": "I needed a volume pedal of a smaller stature for my pedal case and this one fits the bill...AND...it's heavy duty, accurate and has a real smooth fall off.", "id": 187}, {"review": "I've written here before that it would be nice to find a multi-pedal arrangement for space saving...but I still end up looking at individual pedals for their individual sounds.", "id": 280}, {"review": "I'd rather use a solo-combo pedal to save space, but I find myself shopping separate pedals to satisfy my taste!", "id": 505}, {"review": "Not much to say about a plain leather strap except that it's what I wanted and serves me well with the Fender guitar it's strapped to.", "id": 632}, {"review": "I've heard about the Snark tuners before, and have seen them once in awhile, but while skimming the music side of Amazon I finally picked this up...and it works GREAT!", "id": 706}]