[{"review": "My wife & myself are a Celtic duo and a number of our shows are at renaiessance fairs where no visable pa equipment is allowed. We considered a wireless to use with a battery powered Crate Taxi which could easily be hidden but most wireless receivers need a power outlet & at these events no power is available. When I saw this at the price offered  and that both the mic transmitter and the receiver were battery powered I thought it was worth a try. In the past we had a problem keeping an audiance because at some events where the natural acoustics are less than stellar they just plain couldn't hear the stories in the songs. We use this to give our voices a small, unobvious boost. It kind of has the effect of adding a tweeter to a speaker in that it gives our voices the clairity to be understood. The result has been that audiances now stay for the entire show, laughing at the comedy, crying at the tragedy.  Our tips & cd sales have gone WAY up. Is it high fidelity? Quite simply, no. But in our case it works beautifully. Recommended, just remember the price point and you won't be disappointed.", "id": 267}, {"review": "I'm always looking for the perfect electric guitar strings, as is evidenced by my drawer full of spare string sets that I felt failed me for one reason or another. A set of these came my way & as I had just gotten a 1966 Fender Jaguar I did what I always do when I get a new guitar - I restring it even though the strings were practically new. I could immediatly tell the difference in both feel & sound. The sound was crisper than the super slinkys that were on it & they felt good to my fingers. The only reason I took them off was because the Jag was for surf music & I wanted heavier gauge so I put these on my Tele, which was a match made in heaven. They sounded great but most telling is that after a month or so of heavy usage they still sound great. Reasonable price, great sound & long lasting. To me thats a perfect combo. Highly recommended!!!", "id": 868}, {"review": "I installed these on a Fender Jazz bass with active electronics. After stringing them up & tuning I immediately noticed how really sharp they sounded. I play finger style and they really added a clear definition to each note played. They sounded great all up & down the fret board. Where I really noticed the difference was in recording. Been working on a new batch of songs and a the bass to the songs on the recordings made after these strings is noticeably superior to the ones made before. Except for the songs with acoustic bass I will be going back and re recording the bass parts to the songs made before I installed these strings. I  don't play slap or pick bass so I can't say how well they work for those styles but for my purpose they come very highly recommended.", "id": 896}, {"review": "D'Addario has always been one of the best string manufacturers around. I've used their strings for electric & acoustic bass, electric and acoustic guitar, Irish bazouki, mandolin, Irish tenor banjo, 5 string banjo & even used their octave mandolin strings on my Serbian brach always with stellar results. When they said these were deluxe premium strings I knew it wouldn't be hype. I was right. I strung my guitar with these about 3 weeks ago & have probably played the guitar 25 or so hours at gigs and in the studio. I've never had a set of strings stay in tune over the course of 3- 45 minute sets but these did. And I was sober so it wasn't just an altered consciousness that made me believe they were still in tune. Not only that they were still completely in tune the next morning when I played it. Of course that wouldn't mean a thing if they didn't feel good on the fingers. They do. Like they were custom made for your guitar. They were on my Rickenbacker so I can't honestly tell you if they work good with a vibrato but I strongly suspect they would. Not only do they stay in tune but 3 weeks later they still sound crisp & new. I'm going to be interest to see how long they continue to sound good.  I usually change my strings every other week when I'm playing regularly so I'm already passed my regular limit. I may update this review in a month or so when I know how long they lasted. Most highly recommended!", "id": 897}, {"review": "I have tried coated strings in the past ( including Elixirs) and have never been very fond of them. Whenever I tried them I felt a certain disconnect from my guitar. Somewhat reminiscent of wearing condom. Not that I hated them, just didn't really love them. These are the best ones I've tried so far. I still don't like them as much as regular strings but because of the type of gigs I mostly do these seem to be a reasonable trade off. If you need a longer lasting string for whatever the reason these are really the best out there. After a dozen or so gigs with them, they still sound the same as when I put them on.", "id": 899}, {"review": "Over the years I've tried literally dozens of capos. While some have been better than others I've never had one I was completly happy with -string buzz, hard to place without being out of tune, too firm, not firm enough, etc. So far the Planet Waves NS Tri-Action Capo is the best one I've ever tried,at least in the short term. It's worked equally well on my acoustic & my electric. It works on my octave mandolin and, even though it's designed for 6 strings, on my Rickenbacker 12 string. Hopefully it will give years of faithful service & for the quality is reasonably priced. At this point I give it 2 thumbs up. Recommended", "id": 843}]