[{"review": "Forget all the volume drop comments.  There isn't any and it does not color your tone one bit.  I have tried a couple miniature novelty pedals. They were more like a boost volume and tone pedal with tremolo thrown in.  I wanted something to dress up slow ballads, and of course \"Born On The Bayou\".  This pedal goes from nice subtle background effect to deep depth if you want it.  And no variance in your guitar tone or volume when you click it on. I play a lot of acoustic solo and this really is a nice addition to change up my sound here and there and not over do it.", "id": 39}, {"review": "I needed a nice sounding classical guitar for dinner gigs.  I went to the large Guitar store and tried out several in this price range and couple hundred above and settled on this one because of the sweet sound and workmanship.  For the money I don't think it can be beat.  Mahogany not plywood sides and back and Cedar top make for a really nice mellow tone and a bone nut and saddle thrown in for good measure.  Bone does make a considerable difference I have found.  All the finish is excellent.  Now for some down sides.  Yes the frets were not finished up to par on the ends.  As for leveling it seemed OK.  So I took some time and masked off the fret board and finished the frets flush with the fingerboard and rounded the sides and tops.  Cedar will scratch and nick just looking at it.  You can make your own clear plastic pick guards to any size by going to Wal Mart and in the material sewing department you will find clear plastic in large rolls.  You can buy a half yard long x 54\" and make enough pick guards to last a life time for a couple bucks.  It clings to the gloss finish nicely. (Do not use this on old guitars with Nitro finish it will eat the finish instantly)  Same goes when changing strings.  Put some masking tape at the end of the bridge on the top to prevent the strings from scratching the Cedar top.  Overall like one reviewer said this guitar is hard to put down.  I put a Baggs I-Beam pickup in it also.  Easy installation and nice natural sound.  It is nice as it does not have a big EQ cut into the side of the body.", "id": 566}, {"review": "Do not let the size of this little amp fool you.  I have used Roland and Fender amps and PA's.  I heard a buddy preforming with this with a drummer and bass and went and bought it the next day.  I use it for my small solo gigs.  But it will cover a good size room also.  Great vocal and guitar sounds.  I can't believe what can come out of a six and half inch speaker now a days.  JUST AMAZING.  I have cut the amount of equipment considerably that I need to do a gig anymore. It wont break the bank and it wont break your back.", "id": 703}, {"review": "I dont know what all the hype is over this thing.  The idea is good and its cute.  Its for kids and metal heads that want to play screaming guitar but not blow the windows out.  How many of these types of noise boxes do we need?  Not only for the price you need to have a speaker cabinet to go with it.  Go buy a 20 watt Roland cube at least you can play some clean guitar also.  Or any combo little amp.  It's for bedroom use only.  You have a external power supply to hook up to it then you need a speaker wire.  Being light weight as it is also if you move around with your guitar you will pull it off the speaker cabinet and drag it around the stage with you.  Just get a distortion pedal at least it stays in one spot.", "id": 844}, {"review": "I have had and tried about every compressor out there.  Lastly the old standard Dyna Comp. Only because its cheap but like the rest it sounds like a compressor and clips your tone.  Blah.  This is a very transparent compressor.  I use it on acoustic guitar solo gigs and electric.  Low setting on the switch and compressor set at about 11:00.  It gives wonderful string balance and sustain. At this setting you do not get any of the squashy clipping compression sounds. And it does not wack the bottom out of your tone.  None of the typical compressor hesitation when you pluck a string.  Just balance and sustain.  As close to a rack mount as it gets. The blend knob solves all of the typical compressor issues.  From here you can get any type of compression you want or need.  Mine has a white case.", "id": 866}, {"review": "Like many here the case could be an inch bigger.  For my Ibanez 510  I cut the bottom material along the edge against the side wall enough to take out the bottom foam and then put the material back.  Now mine closes without pressure on the bridge.", "id": 752}]