[{"review": "I bought this strap to use on an acoustic dreadnought guitar. I would have given this item 5 stars but even fully extended it is about 3&#34;-4&#34; too short. As for the quality of the strap, I love the look and feel of the leather. It has a worn and aged texture that looks great and it would be very comfortable to wear while playing if it were longer.My 2 cents in summary- I think for a classical acoustic guitar or for an electric, this strap would work much better. If you have a larger sized guitar, find a longer strap.", "id": 253}, {"review": "Yes, this pedal is made of plastic. Yes it is inexpensive. But don't be fooled- unless you really mash on the switch button like an idiot, or over torque the battery cover screw too hard with a screw driver and strip out the plastic threads- it is pretty tough and durable. The chorus effect has plenty of adjustment, tone, and depth. It may not be a Boss pedal, but for $15.99 you are getting a tremendous value and it sounds very good. I was so impressed with these inexpensive pedals I now own 4 or 5 of them. As a hobbyist guitar player who does not want to invest hundreds of dollars into multiple effects pedals- I am into 4 or 5 of them PLUS associated cables and a power adapter for about the same amount than I could buy ONE Boss or other high quality pedal for.I would also recommend buying the Danelectrode 9V power adapter if you use multiple pedals. You can also buy a 5 gang power cable and daisy chain up to 4 or 5 pedals from the same power supply to make your own pedal board. If you have multiple Danelectro pedals it is a clean way to tie them together. I also bought some short 6 inch instrument cables and daisy chained the pedal inputs/outputs together so I can have mixed effects, or have each one independently.These pedals have been used almost daily for a couple of months now and I have not had one issue with any to date. A few other guitar player friends that have tried mine out are also very impressed by them. Absolutely a 5 star value!", "id": 319}, {"review": "This bench is well constructed and comfortable to sit on for extended periods. My only complaint is that I wish it had  just a little more height adjustment- maybe 1 inch. Overall, it is well suited for most unless you are tall or a small child.", "id": 464}, {"review": "I purchased this stand for my electric guitar and used it for a couple of weeks before the weak weld broke on the neck holder at the top when I placed my guitar in it. Upon close inspection, the weld was very poor and barely attached the neck holder to the upright tube. The tubing is made from very thin round steel tubing that is maybe .025&#34; wall, so don't expect it to take much abuse before it snaps off- even if it is welded better than mine was. Just folding the legs repeatedly back and forth will likely cause it to break or pop out one of light duty aluminum rivets on the legs- it is literally that thin of metal tubing.For $10-11 I did not expect perfection, so to it's credit- it is foam covered where it needs to be and has never scratched my guitars.This stand does have one other good quality- it is CHEAP! Since it was less that $11, I cannot see going through the hassle of returning it. I was able to carefully weld mine back together- but this would probably not be an option for most. The stand might work fine if you don't fold it up regularly and if you leave it set up- but If you need portability and durability- I would definitely purchase a better quality stand.", "id": 519}, {"review": "This tuner is super easy to use and very user friendly. Clamp it on, press the power switch, and then  pluck a string. It will tell you if you are hitting the right note and if it is in tune.I only gave this 3 stars because the battery meter only indicated 1/2 charge out of the box. It still had the plastic barrier that had to be removed to connect the battery.  Shouldn't it have a full battery since it is brand new? Not enough of a hassle to send it back, but worth mentioning.Had the battery not been an issue, I would have rated this 5 stars.", "id": 762}, {"review": "I have a home brew pedal board with 6 pedals on it. This allowed me to clean up the wiring a lot and powers all of them with no problems. The blue LED lights are quite bright and make the pedals visible in dark room conditions. Not a bad price, either!", "id": 852}]