[{"review": "Being from Tampa, I wanted my first guitar to be a Dean. Sure, there are plenty of other options out there, but I just had it in my head thats what I wanted. Well, I must say I am very happy with the purchase. Guitar arrived in its triangular shelf box, inside another Dean shipping box, which was wrapped in bubble sheet packed inside yet another, larger, Amazon box. Was essentially ready to play right out of the box, with a few quick turns of the tuning pegs. One knock on it I have seen online before buying was that the tuners don't hold tight, I have not yet had this problem after a week of playing it, including some drastic bends. Checked with a steel straightedge and a light, the neck was dead flat and straight. The edges of the frets could use some more finishing, they are still a bit edgy. I have seen others mention filing them down a bit, same thing that would be done on a more expensive guitar at the factory. I will probably get some diamond files and do this as well, I keep hanging up my hand on them on the bottom of the neck. I'm no expert on tone, but this has a nice even sound and responds well to pretty much any pedals or effects I've thrown at it. I did restring mine with the DR Neon Multi-Color strings for using with Rocksmith, which required adjusting the intonation. The low E and A strings ended up at the very end of their range, and the A is actually still a tiny bit flat. This could well be a factor of those particular strings though, so I wont knock the guitar for it. As others have noted, the finish can vary drastically. Mine is much darker than the stock photo and the grain is much less noticeable. Overall, looks a nice piece, especially for the cost. I could not ask for better for this price. From what I hear from more experienced players, as I progress I could easily upgrade the tuners and pickups, though I think I will leave this one alone and just get a higher end guitar when its time.OVERALL:Nice looking, feeling guitar for a beginner.PROS:Excellent value.Good quality construction.Feels and looks good right out of the box.Can be upgraded in time if you choose.CONS:Tuners may or may not slip when playing hard.Finish is variable, be willing to accept whatever shade you get.", "id": 111}, {"review": "Easy to mount, solid grip on guitar. Only detractor would be that, with my guitar at least, it hangs kind of far from the wall. This obviously is a factor of what you hang from it though. An acoustic would clear the wall nicely, my solid body electric sits a few inches away from the wall.Silicone coating on forks and retaining bands get a good grip on the guitar, without marring even soft wood.I very much prefer this to having it on one of the 'accident waiting to happen' stands on the floor.", "id": 154}, {"review": "Bought this with my first guitar just to have anything to hang it from. It does the job. Nothing at all fancy about this strap. Two faux leather ends, some nylon web and a triglide. Will do the job until you find the one of your dreams.", "id": 208}, {"review": "Guitar picks. What can I say? I bought these along with my first guitar, so its not like I have a preference. But they come in a pack of 10 so there are plenty of spares when you lose them, and you will. Definitely good enough to start with until you gain enough experience to know the difference between all the many kinds of picks.", "id": 575}, {"review": "Got this to tune my guitar without relying on Rocksmith on my PS3, and to double check against it. I have a pretty crappy ear, so I rely on it to tune correctly. Responds fast, display is INCREDIBLE! I wish my car dash looked like this thing. Fits easily on the headstock of the guitar, in front or behind. Tunes by sensing the vibration of the instrument, not using a microphone, so you can tune even if it is noisy. And any pedals, effects, amps, etc in the setup do not affect the tone, you are tuning the actual resonance of the string. Even picks up well enough for me to adjust intonation as well. Forced a friend who just bought a bass to get one too. For the price, I would recommend anyone who plays a stringed instrument get one.", "id": 762}, {"review": "casual, part time guitar player here. I use it on the back of the headstock to always have picks with the guitar when I pick it up. The one I received was all black, not brown on the sides as in the photo. No matter. It is a bit larger than you might expect from the photo. I dont know if that is to accommodate a larger size of pick, or what. It is big enough that 'normal' electric guitar picks can almost turn sideways in it. It also likes to give you more than one pick at a time. Both of which I would say make it not  a contender for fast pick replacement, like in the middle of a song. But it is good for keeping them all in one place, either on the guitar or a desk, toolbox, etc.Nice little item for $2", "id": 233}]