[{"review": "I am learning to play the guitar. I needed a place to place my lesson book that was a little more ergonomically sound. I debated between this one and the other popular/slightly more expensive one. I cannot speak to that one's assembly process, but I found this one to be reasonably simple.I also like how you can just pull or push the stand in order to raise/lower it. The same goes for tilting. It is a superb stand with ample table space for book, iPad, capo, some picks and if you are creative, headphones. I love it and I am using it almost every single day. Very solid construction and the stand with the most height I could find.Go ahead and compare specs of each of the stands offered. As of today, this is the one that wins in the height, shelf and space categories.", "id": 339}, {"review": "Really wanted to like this one, because I loved the price. There is no way this is true bypass. The one I got was defective out of the box, and so when I checked, I saw the circuitry did not support pass through.  Maybe it is because I received a defective one, but I still wouldn't try this brand name. I am now stuck saving up for a Full Tone or something.", "id": 728}, {"review": "It seems like such simple concept, but so many companies cannot get it right. It's just a spring and a handle, but other companies either use cheap springs that lose tension or charge you an arm and a leg for their name brand.This one worked very well for me and at this price, I am able to have a couple extra lying around.", "id": 808}, {"review": "I bought this amp to use for practicing the electric guitar. There is so much debate out there about amps vs solid state (this is a solid state). People will make ridiculous claims if you choose not to purchase a $400 tube amp to practice through. (&#34;You're not getting the right tone, man....&#34; The problem with that is, there are several companies out there Marshall, Fender, Vox, Orange, etc....and they all have a variety of tube amps to choose from and they all begin in price around this one. So, I figured, before I committed to a company, maybe I could just use this Fender to emulate some of those sounds I want.That worked out beautifully. Though I am very much a beginner, I have a greater appreciation for the nuances an amp's eq can have on your guitar's tone. I thought I needed pedals to have some of these effects, instead I can just change the channel to a preset and there is all the flanger/reverb/modulation I need. I have got to the point where I understand about how just adjusting my volume/switching pickups and using the built in guitar knobs can alter my tone enough to stand out when I want to.I would not have been able to do that without this amp. This amp helped me develop as a beginner so I wouldn't waste money buying other things, beginners think they should get. Excellent amp and I recommend getting this over the Mustang II. Save the difference for your real amp that will come when you actually know a little more.", "id": 882}, {"review": "I bought this to replace a cord I was using to practice my guitar. My first cheap cord wasn't actually broken, but I didn't want any down time, so I had this just sitting there as a replacement. Fast forward some time, and I just wanted to try it out. Even though my cheap cord was still working fine, I really wanted to just try out the new cord.I really wish I had done that in the first 30 days. This cord did not work right at all. It seems like there is a short in it somewhere. I had to unplug/plug/ maneuver into place. Of course since it is for guitar, it falls almost immediately out of place again. So, I am back to the cheap cord that hasn't failed, unlike this brand new bad cable.", "id": 195}, {"review": "I used this tuner as I transitioned from playing Rocksmith to playing in the real world. My amp had a built in tuner, but it seemed to give inconsistent readings. With this tuner, it doesn't matter if it is electric or acoustic, it gives a very very accurate reading. My luthier tunes by ear and when we tested against it, they were only off by 2 units in any given direction. Very happy and pleased with this one.", "id": 762}]