[{"review": "I have a Korg tuner but found that I needed this so it would not pick up sounds in the room and interfere while I was tuning my Dulcimer. Now I just plug this into the tuner and thenclip it onto the headstock of my Dulcimer. Now I can tune my instrument anywhere without picking up background noise.", "id": 474}, {"review": "I bought these picks because the description said they were for the ukulele. I am having a hard time using the picks on my uke. I guess, I don't like the way the uke sounds when using them. It sounds too harsh because the picks are so stiff.But I am sure other people may disagree. As far as the quality and vendor delivery, I am happy and I have no complaints.I use the picks occasionally. Yes, I would recommend them to other uke players. I would like to let people know they are very stiff. I guess I thought being felt they wouldn't be so stiff. But I am new to playing an instrument, and I guess I just don't have much knowledge about picks.", "id": 695}, {"review": "I have a cheap soprano ukulele and it came with plastic strings?  I put Aquila strings on it and now it sounds so good. It is amazing what difference the strings can make. I have 3 ukuleles in different sizes and they all have Aquila strings. Highly recommended.", "id": 698}, {"review": "I love this tuner. I feel its more accurate that the old one I have that was given to me. I will always buy Snark tuners. They are very sensitive so I feel that my instrument is in truer tune.", "id": 763}, {"review": "Best strings for my ukulele. These are great quality. I only use Aquila strings on my instruments. Highly recommended. My ukulele has a better tone with these strings.", "id": 830}, {"review": "I love the Hola! small instrument stand. It is sturdy and folds up nicely for me to take with me when I go to the Ukulele Club. It has a nice rubber padding so I trust putting my instrument on it. I have a Tenor Ukulele and it fits just fine on this stand. It is very lightweight which is also a plus. I use the stand at home too. I stand my ukulele on it because sometimes I play and then I want to go to YouTube to listen to a particular song. It is very convenient.  I have recommended this stand to others also.Features I like: lightweight, sturdy and folds up easily.", "id": 881}]