[{"review": "Hey, it gets the job done and that's all I can ask for.  I tried several \"cheapo\" pedals, and this one was my favorite of them all.  While some had better casings (metal instead of plastic), at the end of the day I'm looking for a good sound, not a pretty pedal board.  The pedal seems solid enough, it doesn't take up much space, it sounds great, and it has a versatile range of sounds as far as tremolo pedals come.AND, if you are like the typical musician, you are looking for something that's not going to break the bank.", "id": 24}, {"review": "I'm very happy with this pedal.  It seems to be a knock off of the MXR phase pedal, being that it provides a nice classic, subtle phase effect.  You can flip the switch to \"swirl\" for a more pronounced effect, but I love just keeping it mild.The metal switch/button to engage the pedal doesn't have the \"click\" that many pedals do.  I actually prefer this.  The \"click\" effects wear out sooner.  Some of my high end pedals also use this smooth, click-less way of engaging a pedal.  You'll know it's on by the tone change and the bright led light.  IMHO, you don't need a click switch.The sounds are clean and smooth, clear and bright, and all the other adjectives you could use to describe a great phase effect.Quality and Value, all the way.", "id": 498}, {"review": "I'm on my second US600 pedal, after the first one broke.  I plugged in a cheap cord into the input, and when I went to pull it out, it was stuck.  So...I applied a lot of force to pull the cord out.  When I did that, I heard something break inside the pedal, and when I went to use it again, it didn't work.I pulled the pedal apart and inspected it to see about repairs, but ended up opting to buy a new one instead.  Even though the pedal has cheap housing (which worries me a little bit), the Boss equivalent of this pedal is 3 times as much.  So since this isn't a \"staple\" effect in my pedal board, I'm happy to go with something cheaper for now.Pros:Cheap price- sounds greatCons:Cheap housing - may break if used a lot", "id": 505}, {"review": "Background:I'm a gear-head, with an affection for pedals and always looking for amps that take them well.  Before my current set-up, I played a Fender Strat run through my effects into a Vox AC15.  The Vox sounded great but I had two problems: 1 - The all tube amp made me worry that my amp could crap out in the middle of a gig. 2 - At 15 watts, even though it was loud, I'd often have to crank my amp to keep up with the rest of the band, and as the tube amp increased, so did it's natural gain.  That would normally be sweet, but it would color my effects with a different tone, and often times leave me having feedback issues.Enter the Fender Frontman 212R!This thing has TONS of clean headroom, and it seems like it was built for pedals.  I can crank the amp or keep it quiet, and there is no tone changes done to my effects.  This is a benefit of a solid state amp with high wattage and lots of clean headroom.  It makes it easy to dial in your sound every time, no matter what volume you play at.Secondly, it's Fender reliable (with a 5 year warranty).  No tubes means no tube issues.  Yes, it doesn't sound as good as the Vox by itself, but that's why I have pedals.Other things worth mentioning:It's not as heavy as my Vox (all tube) amp.  I can carry this in with one hand and my guitar case with another.It's got 2x12inch speakers.  They push some serious sound, and they have some low punch too.  My Vox had a better speaker, but the 12 inch by itself would often get stressed at high volumes.  This amp puts out a wall of clean sounds that can put you down!My Vox may be a better recording amp, but this is a better gigging amp every day of the year.", "id": 559}, {"review": "These cords seem to be a hair longer than the conventional pedal-to-pedal cords, which is nice.  They also seem to be quality without bulky.  Some \"quality\" cords I've purchased in the past were stiff and bulky, when I needed more flexibility.  These cords strike that balance perfectly.Quality and value, so you can't go wrong.UPDATE:I've lowered my 4 star rating down to 3.  Over time, about half of these cords have developed a problem of coming unplugged from the pedal they plugged into, and this seems to be a unique problem with just these cords.  About half have worked great, the other half have this odd little issue.", "id": 578}]