[{"review": "This is my third circuit breaker cable. I play in church and no one wants to here the \"POP\" if I have to leave the sanctuary. Why three: 10foot, 15foot, and 20foot depending on the setup for the group - I hate cable jump rope. I really like the right angle connector makes it fit no matter what guitar stand I use.", "id": 32}, {"review": "I keep a capo in each instrument nothing wore than showing up without one. I am using this on my Martin 12-string. The spring holds tight but can easily be adjusted with one hand.", "id": 42}, {"review": "I bought this to have at home or when I travel; my full size stand stays at church. I have a new Martin 12-string that I did not want lying on the floor. This folds flat (maybe 2&#8221; thick) has a wide secure base and fits in the bag I carry my other gear in quite well.", "id": 417}, {"review": "I play guitar and stand behind the vocalists. If this does not bring their voices back to me I can&#8217;t hear especially on some of the female solo pieces. It is big help &#8211; be better if we could eliminate the  buzz it causes in the church&#8217;s sound system.", "id": 654}, {"review": "This is shown on an electric guitar and it would probably be great there. I play acoustic guitars and the headstocks all angle back it has to attach at the top then it is hard to see the screen. It worked but I don't use it anymore.", "id": 785}, {"review": "I bought this to tune my 12-string without using the end jack. The headstock is angled back the adjustments that this screen makes have made it easier to see and it is sensitive enough &#8220;feel&#8221; the tone of each string with only minor plucking.  I use it on Chromatic but it includes: Bass, Uke and Guitar too.", "id": 799}, {"review": "I guess I have tried about every type of pick around. Thick ridged things with thin strumming edges, great big triangles oh do you remember cork circles on one side? Look this is just easy, the star hole means I grip it and it doesn't move until I let go. Never had one break and the gauge being marked is so much nicer than digging through the \"pick pen\" on the counter of the local music store trying to find 3 that feel right. Yup 3 'cause they were three for $1.00", "id": 549}, {"review": "This a great instrument cable. If all you have ever used have been rubber covered try this one. The fabric cover eliminates the knots and twists of &#34;regular&#34; cables.", "id": 587}]