[{"review": "I use these light guage strings because I have arthritis.  Makes a big difference in how easy it is to play the guitar again.  And if you buy them in a 10 pack, you save a bunch of money!", "id": 156}, {"review": "I do all my own guitar maintenance, which means that my guitars have to lie on the bench with the neck elevated for me to change strings, etc.  I had been using a roll of paper towels for that purpose, but the cardboard tube inside would flatten and cause the headstock to hit the bench.  So, looking around on Amazon, I found this handy little device.  It's small, works well, and fairly inexpensive.  My only quibble is that it could be a little bit more robust.  Perhaps if it were made of metal covered in soft plastic instead of the all-plastic construction.  But don't get me wrong, it's still pretty strong... just don't put too much weight on it while using it.", "id": 163}, {"review": "First off, I'm a big fan of D'Addario strings and their Planet Waves division.  So when I needed a quality cable with a right angle plug, I got one of theirs.  I don't really know if it's better than other brands or not.  But it does the job and it's well made.", "id": 195}, {"review": "Seems to get a bit of dust up off the surface of the record, but frankly, the old Discwasher type with the fluid does a much better job.  Better yet is to clean your records well with warm water and dish soap (and a new paint brush), then rinse them well and dry with a clean micro fiber cloth.  Just try not to get the labels wet.", "id": 260}, {"review": "Got this based on other reviews, especially one who took the time to really expound on it.  I used it for recording a cassette to computer, but I really bought it to use to interface my mixing board with my computer.  Should work just fine.  The seller was fast, getting it to me over 2 weeks ahead of the projected arrival date.If you've used other Behringer equipment, you may or may not be impressed with their quality.  Just remember, that although they may be engineered in Germany, they are made in China.  Enuf said.  This particular unit seems to be built pretty well, but time will tell.", "id": 384}, {"review": "This is a good product which I've seen many people use... however, it's not for all acoustic guitars.  That little bit of info was missing from the info, although I should have known.  In my case, my guitar's sound hole is too small for this unit to be installed, even though it's supposedly &#34;tapered&#34; to fit a lot of different sound hole dimensions.  Didn't look tapered to me, and I can't use it.  But then again, it was pretty cheap, and I may have a use for it some day.  Check your guitar's sound hole diameter before ordering.", "id": 497}, {"review": "What can I say?  They look great and were cheap.  My kind of product.  Bought them to replace the old &#34;vintage&#34; style knobs on my LP clone.  Much nicer looking!", "id": 853}, {"review": "Bought this as a replacement for a vintage guitar I am re-doing.  I've learned the hard way that there are some things you don't skimp on.  And this is one.  Switchcraft is what we used in the Air Force 40 years ago, and are still some of the best-made electronic components out there!", "id": 884}, {"review": "I love these strings.  I bought a set awhile back for my Ovation, but never used them.  Then I came into possession of an old Yamaha acoustic guitar which was pretty beat up and needed new strings.  I put these suckers on there and wow was I impressed.  Even that old beater guitar sounded great and played easily with these strings.  So... I bought another set for the Ovation this time!", "id": 28}, {"review": "Best tuners you can buy.  Can't say much else.  Bought these to replace some gold ones on a Les Paul clone.", "id": 270}, {"review": "I was looking for a nearly indestructable heavy (or thick) guitar pick.  I saw this and had to try it.  They are very solid, don't bend, and make a particularly pleasing sound on an acoustic guitar.  Haven't tried them yet on an electric, but they should be great there, too.  You need to know that they make a metalic sound to the picking action (not a surprise!).  But the angle of attack on the strings can either increase that or lessen it somewhat.  Anyway, these are great guitar picks if you're looking for something solid and long-lasting.", "id": 804}]