[{"review": "It's a lot smaller than the picture makes it look, but that's a good thing. It serves it purpose and fits snugly between the strings on the headstock.", "id": 29}, {"review": "An affordable guitar case that fits my guitar perfectly. That's all there really is to say, if you need a sturdy guitar case  for a Les Paul styled guitar and don't want to spend a butt-load of money, look no further.", "id": 50}, {"review": "For those of you going for the folk singer look, or if you're afraid of drilling holes in your guitar, this is definitely the thing to buy to strap your guitar.", "id": 122}, {"review": "What can I say? Fits perfectly for a pickguard on a Fender style guitar. You could probably find them at a  cheap hardware store, but I was too lazy to go looking.", "id": 215}, {"review": "It's a simple strap button, don't know what else to say, I can't imagine a strap button not serving it's purpose. I hate minimum word review requirements.", "id": 478}, {"review": "Works for a cheap bridge on my cheap Stratocaster knock-off. Needed one that was better than the bridge that came with it, and this was a cheap, but not cheaply built option.", "id": 678}, {"review": "You really have to play around with all the knobs to find the perfect tone, I was able to sort of dial in a nice Marshall '80s alt-rock sound, but when you're not playing it can have a noisy wind-like feedback coming from your amp; but it can vary from amp to amp. You can fiddle with the Voice and Drive knobs to clear it up, but that usually results in a drop in your overdrive or distorted sound. But to be perfectly honest, it's pretty impressive the sound you get out of this for less than $40.", "id": 796}, {"review": "Felt kind of too stiff and rigid to put on a guitar at first, but the more you use it, the more it will wear in (pretty redundant sounding, I know.) The color advertised was not the one I received.", "id": 839}, {"review": "I needed an EQ pedal since my current amp has no way of adjusting it's EQ. Most distortion pedals I plugged into it ended up sounding way to &#34;bassy&#34;, and so I bought this in hopes that it would help clear that up a little. I really didn't expect much since this pedal was so cheap; and for a brand new one at that; I was completely surprised that this worked and also helped improve the overall sound by fiddling with each band adding a nice richness to the overall mids. If you're looking for a cheap way to dial in your tone for your guitar, I'd recommend this.", "id": 84}, {"review": "Yeah, the strings that it came with were terrible, but it's an amazing guitar. I'll admit I bought it because it was cheap so I could practice playing on it and not have to worry about it becoming damaged, but it sounds great and plays really well. I like how the wood finish isn't all slick, has a nice natural feel to it.", "id": 148}, {"review": "Worked perfectly for my needs. I don't have a ton of pedals and just needed a few patch cables to connect them all. When it comes to quality of cables, I'm really not to picky about it. I know there's a bunch of gear snobs that turn their noses at anything they consider &#34;inferior&#34; in quality, which usually, from my observation, has to do with cheap affordable prices equaling bad quality and higher end merchandise is always super expensive. If you need some patch cables for your rig, these will do just fine.", "id": 578}, {"review": "This obviously is trying to copy the Kyser brand capo, and it does it pretty well. Feels a bit cheaper, which it actually is both monetary and quality wise. The cardboard insert in the package even has the &#34;lifetime guarantee&#34; but no info on where to mail it; and that's pretty hilarious that they tried to replicate that aspect, but other than that, it's a good cheap capo.", "id": 809}]