[{"review": "I have had one for two years and no complaints, needed another for my travel guitar.  The lever arm is coated with a soft plastic sleeve which protects the neck, the spring is firm and in 2 years has not given up any tension. Finally on the string compression side the material is firm yet supple.  I take particular caution to make sure that I don't leave it on anything that would indent that material permanently...", "id": 25}, {"review": "I have used this winder now 4 times.  It does what it is supposed to do and adds to speed and efficiency of the task.", "id": 94}, {"review": "Play very mello. easy on my fingers too.  Can't come close to understanding the differences of all the different style strings but these work great on My Taylor acoustic", "id": 130}, {"review": "This gets the job done but because it is lighter you do a bit of &#34;chasing&#34; the guitar around.. All in all gets the job", "id": 163}, {"review": "Got the 3 pack and oh what a great difference on me, my guitar, and my sound.I'm a 62 YO newby to guitar!! This proves that easy helps. I have a big baby Taylor and when i needed new strings I went to the wrong place, got Martins installed -- wow did they make a (bad)diference to me.  Sounded like a 1950s monoral record and were really very uncomfortable to play. My friend said that he uses D'Addario and that they make ALL the difference in the world!! Tried them and he was right.  I changed my own (on the big Baby) and the color coding made it really simple to put the right string in the right position (instead of switching the E and B string like the dealer did!) MY Taylor recommends Elixr, but the D'Addarios seem to play with a nicer tone on the Taylor and just as important are easier on the fingers!!", "id": 198}, {"review": "Works great for what it is designed for", "id": 666}, {"review": "these come in multiple thickness and are great because of the thickness and the grip that is on the pick. makes it much easier to hold the pick as your hands get sweaty", "id": 680}, {"review": "It is a little light if you bump it anything that you store in the top goes everywhere when the rest falls on the floor.  As long as the guitar is on it works great.", "id": 746}, {"review": "This tuner works great! I am not able to vouch for accuracy, who but the best tone person can?", "id": 811}, {"review": "I seem to have problem with getting it to &#34;hear&#34; low E (of all strings) but it is very compact and convenient to use.", "id": 893}, {"review": "With the grips these are comfortable and not as prone to falling out of your and when your hand gets moist from sweat", "id": 686}]