[{"review": "I was a little reluctant to try the EVO XM as I have a Vendetta and the tuners are junk.  Fortunately this guitar does not inherit this issue.It's a beautiful looking guitar with very nice setup.  Action is incredible.  Almost too low for those that do a lot of stretching but great for those that are into fast riffs.  The difference in tone between the neck and bridge pickups is great and the pickups are very responsive.Hardware is slightly better than expected for this price point.", "id": 111}, {"review": "This thing is amazing. Like many I cannot afford a tube amp. This transforms my solid state amps into something very comparable to the tube amps I played years ago. Sustain and harmonics are insane. Preamp is very precise and allows for a nice variety of tones.The unit is very heavy and rugged. The only component I would be concerned with over time is the battery adapter but this is replaceable at low cost.", "id": 472}, {"review": "Ok for the price.  Tuners old style not sealed.  PUP plate mal-adjusted and off quite a bit.  I'd suggest adding locking tuners or at least modern day versions.On the positive, action and intonation good.  Better than expected.  Much better than most Chinese guitars at the same price level.  However, I've purchased others that have higher quality hardware for the same or less.  That said, you'll probably do OK.Epiphone setup and overall quality better than the Squier.", "id": 555}, {"review": "Does as described and really enhances your tone. Good breadth of tonal variations available. Only negative, and it's not huge, is that it can get a little noisy when the presence is increased beyond half. I was using a bass with two single coils which makes noise more of a challenge to begin with.", "id": 378}, {"review": "Big disappointment. I've been so impressed by Epiphone's but this one didn't do it. Quality of manufacture and assembly great. Pickups far less than inspiring. Yes, it's a great platform but was so expecting those P90 sound. I may have received the one in a hundred lemons as so many have commented positively on it. Just didn't have the tone and bite I was expecting.I could certainly invest in some PUP's but I have too many great P90 guitars to bother. Roll of the dice I guess.", "id": 816}]