[{"review": "I was looking for a sound hole pickup and this came as one of the best and found it to be all I expected. I use it for practice and recording myself. I really like it but for the price I wish it had just a bit more otherwise its perfect. I have it on my 1994 Martin D-18  which has a big bottom end and no matter what it always sounds fine. I have had the pickup installed for four months and it is good.", "id": 56}, {"review": "One this is a Long Island Company located in Farmingdale New York. They are the leader in new technology of strings...", "id": 156}, {"review": "I have a audio interface that has all the inputs on the back  this was difficult so for the longest time when I had my studio setup I had a mixing board going into the interface. It is always nice to have a channel strip on the line that your capturing because it make the final adjustments fine. This board is great, no sliders which I had to clean. The board has all the same features that were on my 8 channel DOD board that I used for years and it only needs a small space on my desk. The only thing that I am not keen upon is that there is no on/off switch so the unit is unplugged most of the time. It makes the stuff I do in Logic easy. This is a home use unit  great for the price as well as for its quality.", "id": 368}, {"review": "Seems great need more time to explore what it can do...", "id": 443}, {"review": "They are a wonderful product! The lighter the strings on your acoustic the less taxing to the neck of your guitar, with these you can't go wrong.", "id": 579}, {"review": "This pedal solved my problem with my amp. After 13 years of messing about with my Mesa Boogie  realizing the the California sound is not what I truly like and kicked myself in the ass for not buy a Marshall or VOX this pedal  has given me the ability to make my amp sound like a Marshall or VOX.  One can say all kinds of things about quality but for $31.00 it made me even more versatile. It needs to be in front of a tube amp...", "id": 796}, {"review": "Germany Company, manufacturing is in China... I have always found this to make the product hit or miss but the last two Behringer products that are in my hands are very good.", "id": 498}]