[{"review": "This is good cable. Excellent 1/4&#34; plugs. The lugs and solder joints are covered with heat shrink material, which will hold everything in place for years. Grade A+ cable at a very affordable price. Definitely  going back for more. The 25 ft. cable was only a couple dollars more than 10 ft.", "id": 6}, {"review": "This is my second 4 way switch and it won't be the last. The four way gives you an added combination of neck and bridge in series, which gives a fatter tone than position 2 and more output than positions 1,2,or 3. I am very pleased with the &#34;new sound&#34; of my tele. The wiring diagram is very easy to understand and the install is pretty easy if you have a soldering gun. (don't forget to lay down some newspaper to protect your guitar finish from solder).", "id": 113}, {"review": "These Fender string guides are replacing the old style string guide(tree). Installed on a Tele I built. Much less surface of the string touching. Very smooth action when using the vibrato. Took no more than 10 minutes to install.. Reasonably priced, super upgrade. I recommend this product to anyone with string guides on their guitar. These look like rollers, but are not rollers. They do work well. and I will purchase more for other Tele's and StratsPros: Well made  Cons; None I can think ofSleek, well designedQuick installImproved soundInexpensive upgrade", "id": 115}, {"review": "Works like a charm. Powers up to five 9V effects, using one power supply. I am using four plugs and it has worked flawlessly. No more dead 9V batteries. Some effects eat 9V batteries like a 6 year old with a cone of cotton candy.", "id": 192}, {"review": "very comfortable, lightweight, strong. Good stitching, leather ends and adjustable for short or tall. Affordable and comes in many colors.", "id": 208}, {"review": "I like this so much, I bought 4 and going back for more. Spring loaded pick holder holds about 20 to 25 picks. There is a peel and stick on the back to attach it to a guitar strap or behind the headstock.  I Keep one in each guitar case. I am ordering more for stocking stuffers for my musician friends. Fill them up with your favorite picks and no more searching for a pick.", "id": 233}, {"review": "I have purchased two sets of the Mini Locking Rotomatics.  No more winding string wraps around the tuning post. Fastest string change ever. Insert string, wind about a half turn, and the string is locked in the tuner. No more slipping out of tune. Rotomatics will go on every guitar build I do.", "id": 275}, {"review": "This puppy sounds fantastic. The controls allow the effect to be adjusted from very faint to over the top Chorus with deep and intense sound. The controls are on the front, as are the in/out plugs, so it is a little tight when adjusting the knobs. Very reasonable pricing. Uses a 9V battery or 9V adaptor. It has a retro look and an old school sound, perfect.", "id": 319}, {"review": "I have a large hand and this slide is very loose on my finger. I will order a smaller size. I am trying to learn a few slide riffs. This thick glass sounds fantastic on the strings, My bad for ordering one too large.", "id": 457}, {"review": "I don't have a lot of experience with effects stomp boxes, but enough to know when I have a winner. Behringer's TM300 is made from tough plastic. The 3 other Beheringers I have had about a year don't look warn and scarred, and sound as good as the day I got them. The tube mode pedal has an incredible flavor of tones. Fender clean, bright, British crunch and distortion, a hot  Gain and sweet smooth California sound.  I am playing out of a Peavey, but I hear a tweed. Amazing clarity, and worth the $28 and change. You won't be disappointed.", "id": 471}, {"review": "It is a Fender product, so it is well made. Reasonably priced. It will make any Strat or Tele build shine.", "id": 475}, {"review": "An old school delay that works very well. Simple to use. Adjustments for intensity and length. Uses 9V batt or power adaptor. Reasonably priced.", "id": 506}, {"review": "I bought this pedal to enhance the reverb sound of my amp. It work very well. There are different settings for intensity and reverb sounds. Nice addition for the price. Uses a 9V battery or power supply.", "id": 508}, {"review": "Fender original parts can't be beat. The Philips head is an improvement over the &#34;vintage&#34; straight slot screw that a screwdriver can slip out of and scratch the finish. These look like the have a nickel plating and I believe are 8-18, or 6-18 size screw and are much cheaper at a hardware store, but I chose Fender original parts for the Tele I recently finished and for the one I am currently working on.", "id": 599}, {"review": "I have at least 5 of these. I like the small footprint, plus it collapses for flat storage or transport. Holds acoustic or electric. Good quality, stable, economical. I have read that the foam padding can react with nitrocellulose lacquer and mar the instruments finish. I haven't seen that on my older stands, but to error on the side of caution, I have glued thin leather to the back and lower support of the stands. It is working fine. I bought the first about 10 years ago. It is still like new.", "id": 625}, {"review": "This tuner has a bright backlight , a padded clip,it rotates, pivots, does flats, and  calibration from 440Hz to 438Hz. Simple to use. Runs on one CR 2032 pancake battery(included). What's not to like. 5 stars all the way. I have 4 others in different cases and one on my work bench. They have been very dependable and easy on batteries. This one goes in a case for a tele copy, that I just finished.Additional Edit. 03/20/2013-This particular unit does not respond a quickly as other identical tuners that I have. I is accurate, just doesn't respond to the string a fast. I still give it 5 stars", "id": 635}, {"review": "I bought this USA Fender product to replace an imported piece of junk. Imports often have threads other than 1/4 inch SAE. It fit perfectly on the jack socket threads. Quick install, works like a dream.", "id": 674}, {"review": "This is the best thing I have done to my Telecaster. I had some noise, even at moderate volumes. After shielding, it is absolutely quiet. This peel and stick tape has conductive glue, so you don't have to solder the overlap joints. I overlapped about 1/4&#34; and had a 3 1/2&#34; X 8&#34; piece left over after shielding two humbucking pickups and the control cavity. The tape is petty easy to use, sticks well inside the cavities and is strong( I didn't break or tear any pieces). I will definitely be using this product on my next guitar build. There is probably enough tape to do two telecasters with single coil pickups.", "id": 694}, {"review": "Good deal on this package of patch cords. They work just as well as the more expensive ones I have used. I like the length too. It is long enough to make a loop in, which make everything easier to work with.", "id": 805}, {"review": "I have purchased about 5 of these in the past 4 years. I have found no major issues with any of them. Expect to do a small amount of fretwork, such as filing and finishing some of the fret ends, checking the frets for crowns, filing those down and polishing the frets. As with any neck, even the high dollar ones, the truss rod will likely need minor adjustment after it is strung and set up. They come unfinished but well sanded. I sand a bit extra, but one could spray it out of the box. I like to use 3 coats of amber and 6 to 9 coats of clear lacquer, satin or semi gloss. None of these are select quarter sawn wood, but they are an excellent bargain for anyone wanting to build a guitar or replace a broken neck on an instrument.", "id": 838}, {"review": "2&#34; wide, Nylon strap is well made, comfortable and should last many years. The ends are leather, sewn onto the strap. It has room for adjusting to fit almost anyone, short or tall. Comes in several colors.", "id": 776}, {"review": "Installs with two screws. I don't trust the sheet rock anchors that come with the screws. I drilled into wooden studs. It is firm, secure and would probably hold a 200 pound gorilla. These seem very well made. The prongs are adjustable to hold almost any stringed or bowed instrument. Some of the foam padding used in hangers and stands may cause a reaction with nitro cellulose finishes, so I will keep my eye on it for a while. Over all, it is a good way to display your instruments, it allows easy access and unclutters the floor in my very small music room. I bought 4 and going back for more.", "id": 779}, {"review": "I have bought several small tuners through the years, but this one has become a favorite. It is Tiny, but the screen is well lit and quite legible. It fits the headstock by pressing the ratcheted clip and releases by a small button on the front. There is a metronome function, which I haven't used. Simply strike a string. If it is out of tune you get a red light with flat or sharp bars. When the key is in tune, you will see a green indicator light and 1 bar on each side. I don't know how dependable and how long it will last since I have only had the two for about a month.", "id": 785}, {"review": "I bought two of these. Small but well lighted screen. Very quick reaction to string. I liked it from the very first tuning. It is quicker and more responsive than other tuners I have that cost twice the price. It is small and doesn't look like a huge lump on the headstock.  Operates with one 3V 2032 Battery, included. I plan on buying a few more for other guitar cases and as gifts for my musician friends around birthdays and X-mas.", "id": 799}]