[{"review": "I did a little research to find the best strings and other reviews aimed me at these.  I just got done stringing them and they sound great. I think these will be what I play from now on.", "id": 284}, {"review": "I think this is a good deal. It's not colorful and flashy but secures theguitar nicely and as a previous reviewer has said, it is a little difficult toget on but it shouldn't fall off.", "id": 285}, {"review": "Got them today and put them on a Wasburn X series.  Nice sound. I would recommend these to anyone. An inexpensive but nice set.", "id": 335}, {"review": "Bought these to replace the ones that I had previously ordered from another vendor.  These have good shielding not like the others.", "id": 419}, {"review": "I'm happy enough with this, it looks okay and fits properly so what more could you ask for. Good deal.", "id": 657}, {"review": "I thought that this may be just a joke but it turns out that it's a nice little portable amp.Of course you can't drive it very hard or the distortion gets to be too much, but if you keepit low it works very nicely and the price makes it very attractive.", "id": 721}, {"review": "This is not top of the line but for the price is a good deal.  I don't think it lastforever but it works great for my Peavey Patriot Guitar. I would recommend this toanyone looking for an inexpensive way to transport a guitar.", "id": 751}, {"review": "If you need a cord and don't want to pay a lot, this is a good one.  I was surprised howsturdy it appears. The only part that is not so good is that it is a straight connector nota right angle but it works fine.", "id": 803}, {"review": "I have the Snark 2 but read that this was the best so far.  I got and agreethis works better.  I would recommend it to anyone.", "id": 820}, {"review": "I like this a lot better than others that i have.  Easy on and off and stays put. It's worth the money.", "id": 839}, {"review": "I've been using this for a month or so and it works as described.  Some people rate this above the Snark devices, but I cannot.If I were to choose, I'd go for the Snark but this is still an acceptable tuner.", "id": 885}, {"review": "I just got it and tried it out. It's not great but should work as a quiet practice amp.  You have to diddle with the gain and volume controls to get an almost realistic sound.  I would recommend this to anyone.", "id": 491}]