[{"review": "This item is well built and I like the terminal ends and how they have the spring built in. These aren't going to be the most durable road cables but for home and light road use they will work well.", "id": 6}, {"review": "These just don't have the right feel and the sound isn't that great compared to other materials.The quality control is so so. The picks aren't cleanly cut out they are injection molded and as a result they are left with a thin trim all around them.I'll stick with Dunlop Gator Grip .96mm or PRS 1.0 picks. For more flexibility or acoustic, I prefer Fender Medium Celluloid picks.", "id": 62}, {"review": "This pick is great for strumming. Some people are complaining about the grip but they are better than celluloid picks in that regard. If you are looking for the best grip you need to find a pick that has a textured grip.", "id": 65}, {"review": "This mic stand will work great for mic'ing full stacks and guitar amps.Some people have mentioned the counterweight could be heavier but they need to pay attention to how they are orienting the feet in relation to the microphone. You should make sure one of the feet is pointing in the exact same direction as the microphone arm so that way the downward force is applied directly onto the support leg.", "id": 77}, {"review": "These just sound flat in comparison to Elixir Nanowebs and they don't feel as good either.I guess I just prefer coated acoustic strings.", "id": 90}, {"review": "This item does the job. I don't have any real marks against it but I've seen better stands out there.", "id": 92}, {"review": "This works great for mic'ing guitar amps. The stand has a low profile but also extends up tall enough to handle just about any size amp or combo amp.", "id": 224}, {"review": "I've found these strap locks to be much better than the alternatives by Schaller and Dunlop. These look the best out of all strap locks and have a great feel to them when locking and unlocking your strap.I use them on a PRS SE 245 and I did not need to do any additional drilling. The screws that came with the product went in perfectly and were secure.Highly Recommended.", "id": 523}]