[{"review": "Holy guacamole, you guys- this amp...I was terrified at first because I plugged in and turned on and had NO SOUND.Took the batteries out and fumed over my foolish purchase, then decided to try once more.Fired it up with my electric kazoo plugged in and WE HAVE LIFT OFF!So rocking.I actually got this for my acoustic-electric ukulele and it sounds beautiful through it. I keep the volume low and the door open about 1&#34; to get a clean-ish tone. Haven't cranked it up yet for that dirty blues sound but I'm sure it'll sound awesome too.", "id": 76}, {"review": "This does a fine job of cutting even a thick E bass string. Very pleased. Also works to cut ukulele strings! Hooray hooray hooray.", "id": 94}, {"review": "it tunes my ukuleles! it tunes my guitar! i can even see how close my voice is to being on pitch! hooray for this tuner.", "id": 627}, {"review": "Too thick, no flexibility. Sounds really harsh and like it is ruining my ukulele strings. Tried on bass too, again with less than satisactory results.", "id": 695}, {"review": "I guess the tension on these is more than my uke was used to and when I put them on the neck became severely bowed after a day or two. Sounded lovely for the first hour, that's why two stars. Granted my uke is one of the cheaper lanikais, if you have a better built uke it might be able to take these but I simply can't recommend personally.", "id": 698}, {"review": "Upon arrival, I was astonished. With a box as monstrous as the one this little number arrived in, I was expecting a ukulele made for Andre the Giant.It's not quite as big as the packaging leads one to believe but the sound sure is!The unplugged tone is warm and sweet, like the most delightful brownie you could ever imagine. Plugged in it really shines. I paired mine with a Pignose 7-100 for street performing and, while it is a bit too chilly to play for nickels at the moment, I have no doubt this will pay for itself in the long run.I was slightly surprised at how slim the body is (similar in scale to an actual Les Paul), as I was expecting a fuller body but it doesn't hurt the playability a bit.The finish is gorgeous and the little stick-on pickguard is just too adorable for words.If you're hemming and hawing over getting one, just do it. You'll be oh so pleasantly surprised.", "id": 814}, {"review": "I put these on an Epiphone Les Paul acoustic-electric and it sounds so great. They are very smooth and warm and magical, like a mythical unicorn.", "id": 830}]