[{"review": "These  picks  R awsome!  I have tremmors  in my  hands  and have a hard thime with pick control.....They Have a Gell  center,  Whitch  tingles,  It feels like muscles are activating in Your Hand  GREAT THERAPUTIC PICKI seem to do better with controll picks rather then ordinary picks.These  picks have a indentation so U know where put UR thumb and index fingerThey really Do what they say....If U have hand problems,  try these.....they really work.", "id": 66}, {"review": "A bit more expensive then other strings,  But theire worth it,  the tone is outstanding,  They last a long time,  they never rally come out of tune..... and they do last 3x5times longer then any other string I've tryed.  The sustain is great they give a nice soth blusey thone, Not to dark not to bright Just perfect.These string's are worth it!", "id": 102}, {"review": "I have played on D'addario Before,  actually the first string I started out on.Super light's are ok,  but can wear out real fast,  So, It's importent not to put to much stess on  them.....espescially if You do alot of tricks, pinched hormonic's vibrato's, extreme bend's,  etc  they will break.  Any skilled guitarist know's  to use  extream  caution when tuning....any strings,I did try extra light (while they do soud nice,and have a nice feel to them)  I would not recamend these for beginer's,  cause beginer's tend to press hard, when they first stat out.Personally,  I don't like D'addario's at all,  I find the tone to bright.", "id": 156}, {"review": "good,  but it not fit properly,  Defenley better then bone thogh  I did have  to sand it to try to make it fit good, and I did Put it on my epiphone LP,  It does give a nice blues tone,  Beause it's not bone.  But I had to take it off case it just did not fit right", "id": 691}, {"review": "These are good picks,  I've tried all the other gel pick's and plastic pick's,  The gel pick's  come close,But these are great, Because I have Dexterity Problem's, and the plastic/rubber grip Is perfect............I do still have a little Trouble with controlled the pick and droping the pick  but they definitely do help.I def Do recommend these to anyone who was deceased/bad dexterity.", "id": 170}, {"review": "I have tryed a number of pick's and the textured ones seem to work for me.  I have dexdarity problems, Regular pick's without grips come out of my hands cause I am unable to control them,  So I needed something with a little more weight to it  allthough my fingures want to move around a little bit  I love these picks  now I can move my thumb and index fingers back to the bottom of the pick,  and it feels comfortable,  I used to do that with other (non textured)  pick's, And I kept droping them.These pick's are a must have,  allso, sinse theire heavier then other pick's,  these and the Ice pick's really build up Your hand's And finger's.I love these  pick's,  Im  defintley getting some more.", "id": 503}]