[{"review": "Simple to use, works well on the Squier Strat. I'm not much of a guitarist so this is my first capo and I don't have anything to compare with but the quality is way up there.", "id": 116}, {"review": "I would think it would be reasonable to assume that this would fit a Squier Bullet Strat, but the holes didn't line up, it didn't fit between the neck and the bridge, in fact, it was completely wrong. Nice quality though.", "id": 217}, {"review": "I thought my fingers were medium according to the sizing guide, but no, my fat fingers are not medium.", "id": 456}, {"review": "Liked the sound, the adjustability, just wish I could read the numbers on the dials as my ears are still ringing from turning the dial the wrong way! I find the unit surprisingly sturdy and it feels solid. I don't care about disturbing the neighbours, but it is handy to have a portable solution when traveling, the Rumble 75 is a bit big to take everywhere. I made sure to match it with good bass headphones which other reviewers have said is a must.", "id": 547}, {"review": "I ordered TM50BK unit but after a couple of delays with my local delivery agent, decided to buy a unit locally which turned out to be the Korg Beat Boy.The Beat Boy is everything that this unit is and then some. In addition to the metronome and tuner, it has a record function and drum tracks, in all 100 different patterns. The units have an almost identical front panel with the metronome patterns in with the drum options, the extra buttons for the record and an external mic for acoustic instruments.Had I seen the Beat Boy first, I would have ordered it instead as I was looking for a drum machine anyway. The functions which are shared between the 2 units work really well, the tuner is accurate and fast, and can't fault the metronome.I will probably keep the TM50BK as a spare, but I'm also glad my local shippers have prolonged the wait. If you just want a metronome and tuner, this is a fine unit, but if you're considering a drum machine too, look at the Beat Boy before making any decisions.", "id": 851}, {"review": "Not much you can say about these, they're knobs! They fit perfectly and are of high quality finish. They finish off my bass nicely as I like to have the numerals there for reference.", "id": 853}, {"review": "so I never had the luxury of the Grolsch brand strap locks.I tried to raid the water bottles at the local cafe, but alas, I was too slow.It's a bit hard to forge a strap lock out of a Carlsberg bottle cap.So the Fender ones will do just fine, plus they come in 2 colors and say Fender.Time to open another Carlsberg, cheers Fender.", "id": 871}, {"review": "Stripped down one of my basses at the weekend, found this very useful, made stripping and replacing strings really easy. Large enough to fit the fender tuners. Have 2 new sets of strings on order so fitting them won't be as daunting a task as without this item.", "id": 94}, {"review": "The C has the same numbered base plate top and bottom, so the numbers are totally opposite on each side. I see what people mean about the taste, but that's hardly a problem as I knew what I was purchasing. Overall, reasonably satisfied, will give them a good try later.", "id": 293}, {"review": "Mr Miyagi couldn't have said it any better.Robust, compact unit which I use with a Fender Rumble 75. Plenty of lead so I can position it where I need it, and thank heavens for duct tape.", "id": 563}]