[{"review": "Seems sturdy enough, and no noise issues, so I'm pretty much satified with it; it doesn't leave the house so I'm not asking it to handle a lot, but with reasonable care it should last a while.", "id": 6}, {"review": "They work as well as any Dunlop pick; they don't crack, which is a big plus if you use the general Fender variety.  I go a little thicker than I would for regular plastic picks, because they get flimsy after a while.  Take note of the price of the picks and the shipping cost - it might be cheaper for you just to go to your nearest music store.", "id": 61}, {"review": "The winder works well for me, and the cutter is good to have connected to the tool (so I don't have to search out a pair of snips), but a spring loaded cutter would be less awkward.  Also, the bridge pin puller is kinda flimsy, and doesn't work well for reluctant pins.  I actually like my Dunlop winder better; this tool is longer so it comes off of the pegs a little more, but I guess that's the compromise of having a working cutter, so I won't be throwing away my other winder any time soon.", "id": 94}, {"review": "They work as expected; my problem is they blend in with my rug and if I drop them, it's a major effort to find them again!  Next time, I'll go for a vibrant color.", "id": 120}, {"review": "This is an OK solution to keeping your picks handy and organized; at least you can have one place where you can find a pick, as opposed to having them scattered all over the house and in every case, but a small baggie will work just as well. Maybe you have to get to one in a hurry on stage? Sometimes (depending on the amount and size of the pick) it's hard to get the pick out of the holder, and if you use something other than the standard shape, forget it.  It has an adhesive backing, so I guess you can stick it on your amp/guitar/wall/small animal, but I'd rather not.", "id": 167}, {"review": "It has what you want in a cable, and not what you don't.  Not insanely priced from having pixie gold dust sprinkled over it, but quiet and supple and uses good quality plugs on both ends.  So there it is; nothing magical, just a guitar cable.", "id": 168}, {"review": "This was one of those \"might as well get one of these too, while I'm at it\" purchases when I was ordering guitar polish. It's a good cloth for polishing, no more to say about it.", "id": 184}, {"review": "I replaced the nasty, crooked, chipping plastic pins for these, and they work very well in keeping the strings where they should be.  I'm not convinced that they change the sound of my D-28 very much for better or worse.  I replaced one pin at a time and compared strings and really couldn't tell much of a difference, still they are better to handle and remove than the nasty plastic ones, so I consider them an upgrade.", "id": 263}, {"review": "As I mentioned in my review about guitar polish (already forgot what kind), I'm not really a guitar polish connoisseur, but this makes my fingerboards feel real good.  It got rid of that scratchy feeling when I bent strings, dissolved the crud, and makes the fretboard look just lovely.  It probably works as a fine hand conditioner too, but who can say.  Again, because I'm rather slack on the guitar maintenance thing, this bottle will also last me years.", "id": 344}, {"review": "I like this for getting rid of all those extra adaptors you have to have a special power strip for, and it works well for most of my Ibanez, MXR and Boss pedals that have an outside adaptor socket.  It doesn't seem to work so well with my Vox wah, my old MXR Distortion Plus and my Fulltone pedals. I'm using the 9v battery adaptor for the wah and my Dist+, and I get a really weird random squealy noise from the wah (not the same one you get when the wah is not playing well with another pedal in your chain) and intermittant operating problems with the Dist+.  I get a slightly louder hum from the Fulltone pedals when they're on, but my newer Boss/Ibanez/MXR pedals have no issues at all.  The One Spot is not a regulated power supply (if it was, they'd say so), so maybe that's the culprit; not sure.", "id": 428}, {"review": "I usually don't buy many guitar straps, and when I do, I like to get a thick, leather-type one, because I've found any other strap seems to bite into my shoulder after a while, and I don't like having metal pieces on the strap that can scratch up my instruments.  I bought the black version; I think my days of jumping around and sweating while playing are over, so I probably won't worry about running colors (but I will keep an eye out for such a thing).  It's very adjustable (just not quickly adjustable), worked perfectly with my Straplocks, and keeps my 45 pound (it seems like it, anyway) Les Paul from digging into my shoulder.  The 2.5 inch width is fine for me, but if you're spending long hours strapped to a heavy monster, I'd go up to the 3 inch model, especially if you're going to be bouncing around for the greater part of 5 hours.", "id": 481}, {"review": "These work fine; no cracking, they come in a nice assortment of colors, and they're easy to see when they get dropped.", "id": 574}, {"review": "I'm using these cables to string effects pedals together; I've had no issues with them so far.  They seem sturdy enough for rough handling, and I'm not noticing any extra noise.", "id": 578}, {"review": "I bought this tuner mainly for my acoustic guitar; I have a Sabine tuner with a mini-mike but unplugging the tuner from my amp, having the room completely quiet and the tuner in a good position is a couple of extra steps I'd rather not go through.  This tuner is compact and works well; I clip it onto whatever guitar I pick up for a quick tune (acoustic OR electric), push the power button, and off I go.  I haven't fooled with the other features (Metronome? Detuning?), so I can't comment about them.  An added comment: I broke off one of the flimsy little tabs that holds onto the ball joint from it being overextended.  My fault, but it shouldn't have broken so easily.  I'm sure they could make the plastic tabs just a wee bit stronger/thicker, or make it so it pops out of the joint when overextended instead of breaking completely.", "id": 707}, {"review": "I've found no issues with noise or build quality so far; the 1 foot length lets you stagger or make those connections for large pedals or one which put their input/outputs in weird places.", "id": 805}, {"review": "I tried this model a few years ago, and I never had a problem with them (once I got it installed), but I went back to the Schallers I had on my other instruments.  I thought (and this has been mentioned by others) that it makes the strap stick too far out from the instrument, which I thought looked goofy.  I also didn't particularly care for the push button release, and getting the locking part on the end of my thick strap was a challenge; these have a C clamp, not a nut, so there's no allowance for differing thickness. I also felt safer with the Schallers, which hook onto the end of the guitar strap button and didn't depend on a spring loaded button to keep the parts together.  As I said, I had no real problems with them, so if they look like they'd work for you, great.  As with all replacement strap locks/buttons, you have to make sure the screws are secure in the button holes before you start jumping off of drum risers, dropped out of airplane, or what have you.", "id": 44}, {"review": "I've used these straplocks for many years on all my electric instruments; they're fairly inexpensive, and I've never had a problem with them, never broke one nor had to replace them because of wear/abuse, and I've NEVER had a guitar/bass hit the floor.  A couple of warnings here, which have nothing to do with the quality of the straplocks: 1.) you need to make sure the screw is snug in the hole; some people put a matchstick, toothpick, piece of paper or SOMETHING inside the hole to tighten it up if the hole's too big or has been stripped out; I use a touch of Elmer's Glue, screw in the straplock, and let it sit for a day.  2.) You have to make sure the ends that fasten to your strap are securing enough of the strap so that it doesn't work itself off the end; use a socket to get the nut really tight.  New straps seem to be easier to secure.", "id": 278}, {"review": "I can't say I'm a polish connoisseur, but this stuff seems to work very well.  It shined up all my instruments and got rid of all those nasty fingerprints and smudge marks.  I'm not very diligent in my guitar maintenance, so this bottle should last me for years.", "id": 351}]