[{"review": "I'm not much for brand names on my guitar cases. I figure it tells would-be thieves what they're getting!  I sprayed a little matte-black paint over the Epiphone logo. The case itself is quite sturdy and the inside is very plush. It fits my Line 6 JTV Variax in a very cozy way. Great case for small cash!", "id": 50}, {"review": "I've bought a half dozen of these to keep in all my cases or gig bags. Sturdy, stable and reliable. Not a big fan of Fender accessories, but they got this one right.", "id": 91}, {"review": "Handy dandy little gadget. So much better than using pliers to remove bridge pins, nail clippers to cut strings and much easier to wind strings with this thing. I've got 10 guitars and 3 basses so i change a lot of strings and this definitely makes it less of a chore. Love Planet Waves stuff!", "id": 94}, {"review": "The lil suckers are all about tuning  stability. Those other style string guides just aren't the same because the string binds too much. Gave them 4 stars because I don 't like the little nibs in the underside. I filed them off.", "id": 115}, {"review": "I play guitar and it's necessary to have the mic angled toward me to sing. Long boom mics make small stages a bit hazardous to negotiate. This little boom gives me a way to get close to my mic without having a long boom cluttering up the stage. Great product!", "id": 142}, {"review": "I use this to position my iPad a way so that it's out of the sight-line of the audience, but it's also great for mic-ing drums. Sturdy, flexible and well designed. Lots of metal where there needs to be metal. Buy a few, you'll be glad you did.", "id": 143}, {"review": "Great deal on great strings. They sound clear and bright and they last a good while. Quality strings DO sound different, and nearly as importantly, they feel good too.", "id": 156}, {"review": "Always high quality for a reasonable price. More durable than the cheap cables you find online and less expensive than the 'boutique' cables.. Great working-man's gear. Not so cheap that you can't rely on them, not so expensive that you can't buy a number of extras.", "id": 168}, {"review": "Don't let the term &#34;nylon&#34; fool you. This is a really nice, thick strap. Nothing like those $5 cheap straps. A great value and it matches my guitar that has a cool retro 50's pinstripe flame paintjob.", "id": 172}, {"review": "It does what it says it will, but it's still not a great pedalboard solution. The distance between the plugs is sometimes too short. Also, if you're not using ALL  the plugs, you've got a dangling end you've got to try and stash or tie off. Again it's a good item for what it does but it has inherent problems if you're pedalboard has varying distances between pedals.", "id": 428}, {"review": "The plastic knob that you use to tighten the ball and socket doesn't grip very well and even the lightest camera will slip and sag. it's a great idea but not well executed.", "id": 548}, {"review": "I'm an enthusiastic amateur, which means I care about my gear, but it's not my living. I buy the best gear i can afford, but I can't go all Mogami for every cable I need. Planet Waves is dependable durable stuff at prices the weekend warrior  can pay.  These sound good (by that I mean they don't have any sound at all!), and are made well. The design is such that they will wear well. I'm very pleased with these.", "id": 578}, {"review": "A great little tuner. Very accurate, easy to use and the batteries last the better part of a year. I bought 3 or 4 of these and I put in my gig bags or cases. At these prices you can afford to clip the on to all your instruments.", "id": 706}, {"review": "Works great. It's lightweight but VERY stable, even with a heavy bass drum mic.A great bargain for a very sturdy, useful product.", "id": 708}, {"review": "The issue isn't whether it sounds exactly like a &#34;Tube Screamer&#34;, the issue (for me at least) is, does it sound good? Is it musical? Does it sound like an overdriven amp?I say it does. It sounds great for blues and rock. I've only had it for a couple weeks and I hope that it continues to work well for a long time. I've heard that these can be fragile, but I'm pretty gentle with my gear. If it breaks, I'll post about it.", "id": 728}, {"review": "I was really looking forward to receiving this amp. I read the positive reviews and the Ampeg name carries some weight. Unfortunately, from the moment I plugged it in there was this phaser-like effect to the sound. I tried different basses with it. I tried different cables with it. I tried using it in different places, away from computers and fluorescent lights. I tried all different combinations of all of those things and still the spacey phase-shifter sound came out. I tried all different knob and EQ settings as well. Nothing helped. So, I'm returning it and hoping I just got a bad egg and that the next one will be better. I used to work for an amp manufacturer so I know these things happen and I don't think less of Ampeg, (at least not yet).I really hope it's a better amp because the amp itself looks wonderful. For $99 it's packed with cool features like an effects send, a CD in, a Line out for hooking up to a PA and a headphone out for quiet practice. It also just looks cool and very pro. My intention is to use this for a monthly \"bistro\" gig where the volume is low and the area is pretty small, so this seems absolutely perfect if I get one that performs like all the other reviews I see here.I have to say, buying from Amazon is the ONLY way to buy these things online. They immediately started the process of shipping me a new one as soon as I filled out the return UPS label. If there is a choice between Amazon.com and other vendors, and even if Amazon is a couple bucks more, I recommend using Amazon. The customer service is so easy and immediate it's worth the piece of mind.I'll update this review when I get the new amp later this week.I upgraded my review based on the replacement I received...see below...", "id": 736}, {"review": "Just got this today and I'm experiencing serious install issues. Please note that I'm not a newbie to this stuff. I'm an IT guy. I have a new Acer computer that's less than 3 months old with a new install of Windows 7. The mic is recognized, but not as a sound input device, just as an \"Other USB Device\". I tried installing it on another laptop and it installed quickly and easily, so it's not that the mic itself doesn't work.My purpose in posting this is to let people considering this mic know that you can't just assume that the install is a no-brain'r (at least not on a PC). The Samson tech support was friendly enough, but not very helpful. They had no idea what to do next or any suggestions for further support. The support guy said, \"well, that's really all there is to it\", which I can understand...but I still have a $70 mic that won't work with my computer. I tried contacting Microsoft tech support and they tried to help me too, but we could never get the mic to be seen as an input device. We tried it a number of ways and nothing worked.I ordered this for use with my iPad as well, and I ordered the \"camera kit\" to do so. Despite what I'd seen in the reviews and videos online, the mic I received would work not with that either. The Mic needs to be powered by the iPad and it seemed mine was not getting enough power from the iPad because the little indicator light was still Amber when plugged in (indicating it's not getting enough power) instead of Blue.I tried this on my wife's iPad and my daughter's too so it would not appear to be the iPad that is the problem (though it could be the camera connector, I suppose.)So...I ended up returning the whole shooting match. Disappointing too...I really like the design of the mic and so many people say that it sounds so good.", "id": 743}, {"review": "I just can't trust it! I thought it'd be a good idea if I needed to prop my guitar up against the amp for a minute....but I just can't get myself to do it. I always end up using a little Fender portable stand. It does make a nice coaster for placing a beer on my amp.", "id": 746}, {"review": "Let me start by saying... I used to work for Line 6, so I know modeling pedals!I have nearly every modeling pedal Line 6 makes,but I was looking to minimize the rig that I take with me to the bistro-size gigs that I play most of the time. In general, all I really want is the Vox AC30 tone and maybe a delay pedal or some other single effect. I use a very small ZT Lunchbox amp for this sort of thing and it's solid state, so you basically get a nice loud straight ahead tone, which is nice, but makes our cover tunes a little less 'authentic' sounding. I heard some sound samples online comparing this pedal to the Tech21 Liverpool pedal and to my ear...there wasn't a $150 difference. Very convincing and just $40! I pair this up with a Line 6 M9 and I can get most any tone I need for Beatles, Tom Petty and all of the 60's 70's tones I need. Love this pedal!", "id": 798}, {"review": "These are by no means touring cases. They're inexpensively made, which is a good thing because I hate to pay for a case that cost half of what the guitar cost and I don't tour. That said, they do a great job at protecting guitars that aren't out on a stand. I've got about a dozen guitars and when they're not gonna be played anytime soon I want to put them away in something more substantial than a gig bag. These do very nicely for that purpose. They are certainly more than capable of taking an instrument to a gig, but I wouldn't put a pricey guitar into this case if I new baggage handlers or shipping gorillas were going to be handling it. So, I recommend them, but be aware of its limitations.", "id": 149}, {"review": "It does everything it's supposed to do. I got these for about $12 here on Amazon. The Dunlop or Schaller versions of strap locks are usually twice that with no perceivable benefit that I can see.They lock securely, don't require any alterations to your strap or guitar to use them and they have different finishes to match your guitar's hardware.I have both Dunlop and Hennessy straplocks and I don't see any reason to pay more for the Dunlops.", "id": 513}]