[{"review": "This switch does work, but you should look before you leap. The switch travel is greater than it is for a standard 3-way switch, and if you use the common Fender replacement control plate (or one that was only intended for a 3-way switch, it may not fit. You could fairly easily alter the plate, but if you want the cleanest look possible you may want to investigate a new control plate.", "id": 113}, {"review": "As an acoustic guitar player, I think this is a great product.I had previously been using the Korg GA-1, which is a fine basic tuner. The GA-1 works like many basic guitar tuners, where you designate the string and it shows you the note in standard tuning (or with one, two, or three flats). But the TM-40 works by just showing the pitch you're currently playing among any of the 12 reference pitches - making alternate tunings and open tunings much simpler.Now I use the TM-40 at home as my main tuner, and the GA-1 rides around in my case. Both great products.", "id": 298}, {"review": "I have a VOX AC4TV. It uses (stock) a 12AX7, but I thought I would try the 12AT7 just to see what happened. I had read that this type of tube could give you more clean headroom.After a little test run, my first impression was that the amp was noticeably quieter with this tube installed. It might have reduced the volume by a third or more - but this came with the benefit of the amp being noticeably less noisy. That was a nice benefit.I didn't notice much of a change tonally. I think this tube basically brought the volume down. I wouldn't say this is better or worse than the 12AX7, just quieter, and with significantly less output.I ended up switching back to the 12AX7.", "id": 459}, {"review": "My issue with the Pedaltrain 2 is the accommodation of a power supply. I have a Voodoo Lab Pedal Power 2 Plus.The documentation that comes with this pedalboard specifically states that this power supply mounts under the board, and it even includes mounting brackets that fit this power supply. However, if you actually try to mount it to the underside of the board as suggested, you're in for an unpleasant surprise.First of all, regarding the two circular holes on the front of the board. The fitment to the power supply is there... sort of. There's no way to align them perfectly because the holes on the pedaltrain 2 are slightly too close together. I wasn't worried about this, since I doubt I'll ever chain them and only have access to 1 outlet.The second issue is, the allegedly self-tapping screws that come with the mounting kit strip as though they were made of butter. Once you've got them in (or attempted to do so), they're never coming out. You'll probably have to break them. It's a shame to have cut corners on something so inexpensive.The main issue I have with this board relating to my Voodoo Lab power supply is this. Once you get the power supply mounted properly on the underside of the board (it can only go one place), you begin to plug in your pedals and you discover that the cables supplied with the power supply don't fit the mounting location on this board. You can't plug them in because there's not enough clearance between the frame of the pedalboard and the sockets the cables plug in to.I really only bought this pedalboard because of the supposed perfect compatibility with the Voodoo Lab power supply I own, but given that it doesn't fit like it's supposed to, I wish I could return this board - except I can't, because it now has holes drilled in it. (You have to drill the board to mount the power supply underneath it.)Basically, I paid $100 for a plain flat sheet metal metal rectangle and a couple rolls of velcro. Needless to say, I'm not very pleased.", "id": 544}, {"review": "I bought these for my new Strat. They look great, they're easy to install, and they work very well.I like the release, it's performed by squeezing with your thumb over the \"F\" and with your finger on the the metal ring on the inside of the guitar strap. Hard to explain, but I prefer this to some of the pull-style strap locks I've seen in the past.The only down side is that they aren't as easy to install or uninstall from the strap as the locks that attach with a Hex-type nut. Make sure you have the strap set up at the correct length (for vintage-style leather straps) before you install the locks to avoid having to rework later.", "id": 682}]