[{"review": "Originally I purchased a Behringer EQ700 equalizer pedal for my rig. It was cheap at around $20+ some change but like the other reviewers noted, it's noisy with hiss. So I took the advice of another reviewer & bought the Fish & Chips model by Danaelectro and it's terrific.I plugged it directly in line on my SKB pedal board, turned them both on, turned on the amp, put it on clean then distortion channels while cranking up the volume to max & no discernible hiss nor hum. Mind you this is not a boutique pedal so there is a tiny bit of noise at full volume but not to the point it is noticeable.This pedal has a cool 1950's style & appearance. It has a great punch when you raise up the Level and the tone selections are great to help model various guitar & amp sounds. For a modifying pedal, you cannot go wrong for the $30 price tag. If you're in the market for a great 7 band EQ pedal, then you'll be hard pressed to find one for the price of this one.This product rates 5 out of 5 possible stars.", "id": 84}, {"review": "I'm rather disappointed with this item as I put only FOUR (4) picks into it when it snapped apart. I use the Dunlop Tortex 1.0 mm picks and perhaps that's where I was at fault - I maybe should left it at three picks.However, my bench vise and some superglue have remedied the situation nicely. Thus beware of how many picks and their gauge BEFORE you push them into this holder.I give it 3 out of 5 stars for reasons stated.", "id": 167}, {"review": "I collect picks (or plectrums if you're a purist) and I do so for a good reason: I don't use the same pick for the same sort of playing style. I tend to use some picks for jazz; some for blues; some for metal and so on. Not all picks are made the same & some are far better than others.The Dava Master Control Pick (DMCP) is a very nice & useful pick. I've been enjoying it for heavy strumming (or as the metalheads call it, \"chuggin'\"). I like its thin center and the way it is overall contoured which makes holding it a delight to my forefinger & thumb.Another thing I really like about it is the metal tip which some folks may not enjoy as it does give a bit of a metallic tone when it touches the strings. This is especially true when you've just replaced your old guitar's strings for new ones. Depends on how you like it or not whether you like that metallic ting - I do for certain passages.The pick's construction seems to be fairly rigid & yet it has potential to do more than merely chug again on the low E & A strings. DMCP is definitely a plectrum that I will be using a lot of in the future and not just for hard core metal but also for subtle tones in jazz passages with the distortion off.Overall I give the DMCP 5 out of 5 stars for being what it claimed it was and for being something that I will find great utility for in years to come.", "id": 171}, {"review": "I got this in the mail today and plugged it into my pedal board just prior to the amp. Like the other reviewers on here, I'm sad to report that it's quite 'hissy'. I had hoped that it would not be a hissing type of pedal but it is. I'm using a Line 6 Uber Metal, Boss Metal Zone, Ibanez LA Metal & Boss Compressor/Sustainer with my SKB pedal board. The board itself is not noisy at all with any of the other pedal cranked up BUT when I put the EQ700 in with the others, there's a noticeable hiss though not so much at low volume but when you crank the amp (I'm using a Peavey Special 212 Transtube combo) above 4, you can definitely hear the hiss. Not sure if a noise gate pedal would reduce this but I'm going to give the Danaelectro Fish & Chips (as recommended by another reviewer) a try.I'm waiting on the Behringer Orchestra Chorus pedal to arrive and HOPING it isn't hissy like the EQ700 is.I will say though I do like the tone influence this pedal has. It does a nice job of altering the tone & gives my rig a greater flexibility for sounds.Overall I give this pedal a 3 out of 5 stars.", "id": 380}, {"review": "Bought this in early March this year & have it in-line with my other effects pedals on my pedal board. No problems with it at all. It works as advertised. I've found it to be better quality than the on board tuner that comes in my Fender G-Dec amp so what does that tell you?Not sure what the other low ratings for this pedal are all about because I love mine. For the money you can't get one that touches it. So what if it's not $100+? That means you have more green stuff to buy other things.Since buying this one & having it work so well, I now own a couple of other Behringer pedals.", "id": 443}, {"review": "Unfortunately I wasn't aware that slides come in all sizes and got a medium when I need the large. The medium fits over my pinky finger and while that's okay I prefered it fit over my index finger where I'd have more control.I cannot fault the slide for my foolish choice so I'll pass this onto my son or someone who can use it and get myself the larger Dunlop 212 Slide.", "id": 456}, {"review": "Most of the other reviews have pretty much covered just about everything I would say however I still want to say I love this tool. Not being someone who has had a lot of theory under my belt, it's been useful to help me learn the letters of keys. Slowly I am making progress at memorizing key signatures so that I know where I am on the fretboard & where I can go from there. I use it by putting it on my music stand, dialing in the key I want, turn on the drum machine & simply play the chords in that key to the beat. Then when I want to practice the relevant scales of the key, I simply look at the letters and count the fingering for the corresponding note. It's that easy.I will say that I do agree that the instructions are a wee bit too thin for my taste but music notation & theory is not a subject that the average player is adept with. Most folks are self taught like moi where theory is concerned. To really grasp it, one simply has to plod along actually performing the exercises repeatedly. But with rote repetition, eventually comes that \"Eureka!\" moment from time to time & more falls into place.Unlike some others, I'm not one to lug something this around in my gig bag. Who really is going to set & study material like this prior to a gig? That's what you do at home and it's called 'Practice' for a reason.I give this 5 out of 5 stars because it really is a fantastic learning tool & is relatively simple to use as long as you have some inkling of music theory. If not, you may want to take some lessons & then use this as a study guide along with your regular lessons.", "id": 531}, {"review": "I collect picks (or plectrums if you're a purist) and that's because I'm trying to see how & where I can use a new pick. My first pick was a shark fin and I loved all of the ways you could hit the strings with those picks. Now we have the BEEHOLD picks.What I like about this pick is the 'stinger' or the longer point to hit the strings with. Sure the octagon hole in the center makes it less of a challenge to hold on to but that's not been much of a hindrance to me. Rather this pick's design makes it easier for my holding hand to hit the strings without my palm's fleshy part accidentally touching the strings.I found running leads & scales with this pick to be a delight! I like heavier picks so I chose the 1.00 mm as that was the size I started off with from my first guitar teacher who recommended heavy picks. I've found this pick to be great for strumming & rhythm patterns equally as well as for serious lead playing.Another thing is that with the design, I've found that I need not squeeze this pick as hard as I have to like I do with a Tortex pick and that makes playing so much more fun.Overall I give this pick 5 out of 5 stars & will be using these for many years to come.", "id": 792}]