[{"review": "First, let me start by saying this pedal has been part of my setup for nearly 7 years now and still looks/sounds as great as the day it came out of the box.Its a Boss product, which means you are going to pay for what you get.  You get the best bang for your buck with Boss products.  Solid, rugged construction that is built to last (no chance of breaking one of these things) and an outstanding analog stomp box with a genuine sound.  Good customer support as well and if you ever feel you need to sale your Boss pedal, resale prices are always good.While this pedal is capable of hundreds of tones and sounds (chorus is one of the most useful and versatile effects in my opinion)  Here are some of the best uses I have found.1. Tweak the pedal just to thicken your sound and give that 2 guitar effect.  Perfect if you want to fatten up that really heavy chorus in a song and make it sound really full.2. Dime out the speed and depth for those crazy out of this world Korn type effects.  This is a really handy pedal for imitating tones of other bands because it can do so much.  There are a lot of bands tones I can come close to exactly matching, tones that took them 2 or 3 pedals to achieve.3.  Liquify your sound and give a beautiful tone to cleans and leads.  This pedal will help simple parts that would normally go unoticed stand out.  If you play any kind of Christian music you will soon learn it doesn't matter what you do as long as you put chorus on it.  Walking in on Sunday morning and turn out some Slayer while using a chorus pedal and they will go nuts.  Chorus is just one of those effects no matter what type of music you are playing, you will always find a use for it, so there is no excuse for not adding this pedal to your rig.In addition you have some great features, easy access battery compartment, accepts a 9v power supply, works well with both guitar and bass, 2 out puts so you can run to 2 sources if desired, and all the controls you need to really be in complete control.  You HAVE to get this pedal!", "id": 33}, {"review": "First of all I want to say I love a tube amp distortion.  Overdriven tubes are just how its meant to be.  I run a Randall G3 hybrid amp and it destroys any solid state I've used or heard.  For recording I use a Peavey 5150 and its so sweet.  Tubes are how guitar was meant to be heard.Recently I started playing with a band that required a dirty tone that I felt like could only be achieved through a pedal.  There is absolutely nothing wrong with using distortion pedals, I used the DOD death metal for years when I first started playing.  However, there is a downside.  Go cheap and you get a piece of crap that makes your rig sound like an old AM radio, if you want something that sounds pro quality your going to shell out at least $250.  Quality dist. pedals are not budget friendly.I chose the MT-2 because I know Boss makes a quality product and it was the pedal the other guitarist was using.  It gives a variety of sounds.  It can be set up for an overdriven light distortion sound or full blown high gain metal tones.  The controls make it very tweakable and I have gotten a load of very nice sounds out of it.  Read the included book, look up some MP3s over videos online and check out other guitarists' settings.  It will help you tame this pedal into what you want.  Perfect pedal for those not wanting to spend a whole lot.  There are also mods you can buy and install in the pedal or buy preinstalled from certain dealers that open it up to even more shaping and make it more useful.I've seen a lot of complaints about the pedal sounding like nothing but fuzz.  I must say learn how to shape sound, spend time dialing it in to your rig.  Within 10 minutes I was pleased with the MT-2.  I used it on my overdrive channel to push it harder and got a really thick, heavy distortion with a good response.I say the MT-2 is worth an investment if you're looking for a big distortion sound from a little pedal.  Surely something guitarists should consider adding to their board.", "id": 36}, {"review": "I love these straps.  I have them installed on all of my guitars.  After a Dunlop lock failure, I decided to change over.  Our band's drummer and guitarist both used and recommened these straps so I gave them a chance.  They are amazing, much more comfortable then one of those bulky, heavy leather straps and just as strong.  I was worried that the plastic clips wouldn't hold up, but they do.  I feel 100% secure that my guitar will not fall.  They look good as well and they are easily adjustable.  My transmitter pack slid on with ease and I was ready to go.  A lot of bands I have seen on the road use these straps.I didn't rate these straps 5 stars however, because of a few reasons:1- I play heavy guitars, I was concerned about the screws that came with the straps.  For a standard, lightweight guitar they may be fine, but for say a Gibson, or my Agile Intrepid Pro, I wanted more security.  I took a slighty wider and longer screw than provided, covered it and filled the install hole with epoxy, and drilled it in.  It holds incredible, its NOT coming out now for sure.2- I use the black, white, and blue colors.  They discolor very easily.  Through sweat, dirt, and cigarette smoke, they eventually start to look nasty.  I would suggest going with the black for this reason.3- I put my confidence in these straps 100%, but I wouldn't start doing guitar swings with them.  Its just a plastic clip, and anything can fail.  I've seen guys electrical/duct tape the clips for extra support and they've all been able to get away with swinging their guitars around, but personally I choose to play it safe (as I lost my best guitar to a failed straplock during a spin).All DiMarzio products are incredible. If you want something light and comfy that looks sleek and will keep your guitar protected, I highly suggest these straps.", "id": 193}, {"review": "\"Oh its a crybaby\", \"I have a crybaby wah\", \"You suck because you don't own a crybaby\"...I'm tired of hearing these statements from guitarists that are so fresh they couldn't even tell you how many strings their instrument has!  This wah pedal just doesn't cut it.  Maybe at one time, but not today, it hasn't been up to par in a LONG time.  As a young player I insisted on having a wah pedal.  My mom bought me this one.  I thought it was awesome until I learned better.  It took me about a week to learn how to turn it on and when I finally did I thought I broke it!The eq on this pedal isn't good, there is no smooth transition from heel to toe.  There is a big drop in the freq. that kills the effect.  You have to pump your foot really fast to avoid having that drop.  You have to pretty much push it toe foward and then literally stomp on it to turn it on and then follow the same steps to turn it off.  Very inconvenient for someone who is trying to rapidly move between effects on a board.  I can't say its just a complete piece of junk, it does give you a wah effect, it is a classic pedal but THERE IS BETTER out now so why are we still stuck in the stone age with this thing?  I even had someone mod mine and while it gave it a little more headroom and fixed the dropping issue, I still had to slam on it to turn it on/off and it still sounded like a cheap wah.My suggestion?  The Mark Tremonti wah is great!  Kicks this things end when it comes to range and simplicity to use!  It may cost more, but you will probably end up hating the crybaby and getting one anyway, so just go with the Tremonti Power Wah to begin with.  What I use for wah is the Digitech RP250 processor.  You may say that this is a cheap processor, and it is, but I've been using it for years and I haven't seen anyone that can tell the price of it based on the sound quality and thats what matters.  Why I suggest it for wah is you can control the sensitivity, how hard you have to press your toe down to turn it on (I have mine set fairly light) and you can totally shape your tone right there on the board very easily.  You even have presets (crybaby being one of them)  You can get an entire processor full of effects AND an awesome wah for a little bit more.If you want a cheap child's gimic-type toy, this is for you.  Want to get serious about a wah?  Spit on every crybaby you see and go elsewhere.", "id": 41}, {"review": "A little story to back these lock's integrity.  I installed them on a Korean made Washburn WG-587v.  Incredible guitar after tweaking.  I did a guitar spin at a show and the guitar went flying.  The strap lock was still on the strap and locked into the holder.  The screw had ripped out of the horn of the guitar!  The screw tore through about a half inch of solid wood (and I epoxy all my screws in) before the strap lock broke.  Amazing.Nice, tough hardware.  The only complaint I have is that you must use screws with small heads if you choose not to use the stock screws provided.  Easy to install, just unscrew your stock strap holder and screw in the lock holder.  Attach the lock to your strap and BAM quick release system.  Fast to take on and off of your guitar.I would suggest getting a tough, thick leather strap with a nice reinforced eye to install the quick release button in, cheap lightweight straps will eventually start to tear.  Also, the button can be a slight pain to get on certain straps.I have now switched over to DiMarzio clip lock straps instead of the leather straps with Dunlop locks for many reasons and I am very happy, but this product is GRADE A! I always felt 100% secure with these straplocks.  Our bass player uses some expensive (and heavy) Fender basses and he loves these strap locks.", "id": 44}, {"review": "First of all as a former touring guitarist and a guitar tech junkie, I have a tool box with every tool you can imagine.  I have to say this string cleaner is a must have!  I say this because in the long run, it will save you money on strings, save you time with changes, and will keep your strings sounding alive.Most guitarists don't realize just what they are doing to their strings when they play.  You are leaving behind a world of sweat, dead skin, and all kinds of nasty elements.  The oils/fluids you leave behind can be very acidic and contain plenty of things that will build up and corrode your strings.  I've seen people who change strings every week because the strings keep going dead.  I've seen mold and and all kinds of garbage build up on strings so bad I thought a sloth may be living on it.  This little tool will prevent that.I have a routine with mine. Before I play, I run the cleaner over the strings a few times.  Whenever I'm done playing I make sure to spray a string cleaner fluid onto the pad and run it over the strings again until I feel they are completely clean.  You will not believe the extension of your string life or the quality of sound you will get following these cleaning practices.Someone has mentioned in their review the fret damage that the string cleaner caused and I too thought about that the first time I used it.  I suggest pulling up a little bit so that the cleaner does not touch the frets.  Toward the nut where it is hard to get the cleaner in, I just wipe down with a rag.  This is a great, cheap, handy little product that all guitarists should keep in their pockets.", "id": 543}]