[{"review": "I've had this pedal for over a year now and I've been getting more and more into tube amps and I've learned to appreciate how the intricacies of how all of this gear works together (amps, guitars and pedals).When I first reviewed this pedal, I had just gotten a new solid state amp and I was very let down. After I jumped to tube amps, I grew to appreciate it a little bit more, but I was using it wrong; I'd just match the output of my amp and goose the distortion level to use it as a 2nd channel/gain stage. I thought it lent a good distorted tone to my playing, but I dismissed it as just an \"OK\" box.Flash forward: This thing kills! It belongs in front of a tube amp; period. I've found, as all before me, that dirt boxes are virtually useless on solid state amps.The D III works very well as a clean boost: Max the volume, set tone to taste and the roll the distortion all the way back. This will blast your clean amp into overdrive, without much coloration on your tone. This is my preferred setting as I can use it to push my single channel tube amps into dirty territory like I would before, using it as a second channel, but with that natural tube sound. Any pedal that gives you some more \"umph\" without altering the original sound of your amp is a beautiful thing.Dial the output down some, and crank the volume on the amp a bit more, the distortion knob really adds some nice saturated gain that increases sustain and can creep up on getting a significantly dirtier tone. I found that this is reminiscent of a classic tube screamer; while not tonally identical, this can really help push a hotter amp into overdrive to get some heavy, heavy tones, while retaining the sound of the amp's natural distortion.In between, you can dial in some classic crunch tones suitable for rock and blues or just a smooth overdrive. After playing around with the knobs, I found that this is a very versatile and well voiced pedal. I actually prefer it to tube screamers and its clones as that's been done to death; the D III is conceptually the same, but it just sounds \"different\" that the TS and it doesn't let go of the low end.For the price, this is a fantastic buy. It delivers enough output to be used as a fantastic clean boost, and there's enough gain on tap to dial in just about any rock tone you'd want, save for modern high gain metal.", "id": 460}, {"review": "This is my first tube amp and after doing a TON of research, I found that the VOX AC15C1 was just about perfect for me.It came down to the AC15, Fender Blues Jr. and the Ibanez TS15. The Blues Jr. has a somewhat small enclosure for a 1x12 and I felt it had a bit of a \"boxy\" tone, otherwise, it's a great amp. The Ibanez has a classic Tube Screamer circuit built in and a switch which cuts the wattage in half for playing at lower volumes, but it lacked a reverb circuit, which was a deal breaker (silly reasoning, I know). The AC15 has a larger enclosure than the Blues Jr., and it has a reverb AND tremolo circuit, so it had the features I was looking for and most importantly, it produces some killer tone.If you've ever seen or read a review of this amp, chances are, you've heard about the classic VOX \"chime\", which this amp has, but I fell in love with the natural tube saturation on the top boost channel right away. The normal channel will break up nicely too, but I would suggest an A/B switch and run the normal channel fairly clean and the top boost pretty dirty.I was worried at first that 15 watts wouldn't be enough, but fear not, this amp is LOUD... maybe too loud as I'm just a hobbyist that plays in the bedroom, but that's not a bad thing. It totally blows away my 100 watt Marshall solid state and I haven't put the volume much past 8 O'clock for fear that my wife may beat me to death if I do.While there is no effects loop, it takes pedals well, but for distorted tones, I've found myself just plugging straight in just to get the unadulterated tube crunch, which I've come to love so much. As stated above, the lack of a foot switch to change between clean and dirty tones will have to be solved by either running a dirt box in front of the amp, or as previously stated, running one channel clean and one channel dirty and us an A/B switch to go between them. As far as other effects, I really like what it does to my TC Electronic Flashback Delay and Corona Chorus. Note that there is a foot switch jack in the back panel, but it controls the on/off for the built in tremolo and reverb, but it's sadly not included with the amp.For my first tube amp, I don't think I could have done much better; I love the tone that I can get, the tube warmth is just sooo much more soulful than the sterile sound from a solid state amp, it's feature rich, and takes pedals well. The other two amps that I was considering were a little less expensive, and while I really feel that the VOX is just a better all around amp, I don't think you can go wrong with any one of the three.The weight (about 50 lbs), and the lack of an included foot switch are really the only two cons that I can think of. While I would have picked up all three of the amps that I was looking at if I had the means, I would not hesitate to recommend this amp to anyone looking for their first or next tube amp.", "id": 665}, {"review": "I was hell bent of getting an analog delay and the local shop didn't have the one that I was looking for (MXR Carbon Copy), so they recommended that I try out the TC Flashback Digital Delay instead. This is priced comparably to the Carbon Copy, but it has so many more features (I guess that's expected of a digital delay) that I couldn't pass it up.Similar to the other TC product that I purchased (Corona Chorus), this sounds great, it's feature rich, and easy to use.The analog and tape delay modes do a very nice job of emulating the sound I wanted to get from the analog Carbon Copy, but it also has tons of other settings to pull out a digital sound; think exact repeats and a delay of up to 6 seconds. Shorter delays can be had by switching to the slap back mode, which puts this pedal into instant Rock-A-Billy mode.This is tone print enabled, (a feature that I have yet to try, but it seems like a cool concept), has a tap tempo setting and a 40 second looper all in one small delay box.This is the first delay that I've owned and I'm not looking back.", "id": 742}, {"review": "Picked up a cable to test on my new pedalboard, and I couldn't be happier. Doesn't suck tone, cables are sturdy, and they sound great. This replaced a normal straight 1/4 inch cable and saves so much space on my board.", "id": 11}, {"review": "I purchased this amp locally and initially, I thought it was pretty cool as it was my first modeling amp; lots of potential for a limitless variety of sounds. This was my first Fender amp as well.The presets were neat and all, but when I played around with some of the \"standard\" models (just the amp model, no effects) just to see how it's clean sound was, the amp just hissed as if I had the volume cranked with a distortion pedal engaged at max. The master volume was at 2 and no effects were turned on... I've never heard a clean channel with so much noise behind it, even when there was no guitar plugged in... All I could hear while playing was the underlying hiss coming through the notes; very distracting and it drove me nuts! This isn't a ground loop issue (my other amps sound just fine at bedroom volumes and beyond), it's clearly a defect with this product. Dirty pre-sets with lots of gain and extra volume sound even worse, again, even when nothing is plugged in and at low master volume. You'd think I was running a few super high gain stomp boxes with a red hot single coil, but NOTHING was plugged in and all I get is staticy-hiss at LOW LEVELS. WTF?The next issue is the weird \"fizz\" sound, that was especially noticeable on the low e. After striking a string, instead of a clean note, there's a weird fizzy digital artifact like sound that \"surrounds\" the note, and fades as the string stops moving. It almost sounds like cymbals crashing on a poorly authored MP3 file at a low bit rate and frequency. Whole chords break down and decay in this fizzy envelope and really makes this thing unplayable.The weird thing is, neither one of these problems arose with head phones plugged in, or when this was connected to my computed via either USB or the line in... but I'm not going to be stuck playing a 100 watt amp through my PC or cans. I got the III instead of the II because of the power behind it and the touted 12\" Celestion speaker.Read the many reviews online or forum posts on many of the guitar/amp related websites (there's a 65 page forum post on the Fender support site that is quite interesting) and you'll find that these amps are having issues. Apparently, the Mustang I and II don't have these issues, and the firmware update did NOTHING to correct my amp. Is this a hardware issue, software issue, speaker issue? There is speculation that the LCD screen (which is not present on the I or II) may be causing problems, but no one seems to know for sure and Fender doesn't seem to care...Definitely try this before you buy it. You may get an amp that doesn't have these problems, you may not notice the sounds or you may not even care; let your ears tell you what sounds good.This amp has a lot of potential for great sounds, and it would have been nice to have faithful modeling of some great vintage amps, but in my opinion, technical issues have made this amp sound like complete garbage. I am disappointed that Fender hasn't yet correct what ever is wrong (some folks claim that Fender reps say that know what is wrong, but I'm not taking that as a fact...), but they have acknowledged that there is \"something\" wrong.Whatever... I took this back after a few days of playing with it, trying to eliminate the junk sounds without success( the built-in noise gate helps a little, but sucks tone) and I picked up a 100 watt Marshall instead. Guess what? The clean channel has ZERO hum or buzz, even when cranked. How about that? Even when I engage a dirt box on one of the dirty channels, there is minimal noise.I'll knock Fender for NOT correcting this issue regardless of what it is and what caused it, but they do have some other nice amps that I'd like to try. But before I buy another Fender amp, I'll take it for a test drive and I suggest you do the same before picking up one of these turds.", "id": 737}]