[{"review": "It's hard to beat the quality of Monster Cables!There is absolutely No discernible loss of tone through this cable - I Love It!", "id": 125}, {"review": "These cables give you a pure sound unhindered and uncut. I have several other \"good\" cables but when compared to this they cut highs and even the level. I have grown as a musician to the point that I Know it's worth it to pay a little more for these quality cables. Yes you can get many cables way cheaper (and I'm all for getting things at a good price - publishers clearing house has Not visited me yet!) but this is a case of you get what you pay for!", "id": 127}, {"review": "I was a little skeptical having used other strap lock systems. But I took a chance & this works well on my LP! The strap lock was well thought out and seems to have no weak spots. I really like it!", "id": 208}, {"review": "If you play Rock or Classic Rock & have a Tube amp with a 10 Inch speaker that needs a little more life... Pop one of these in. My little  VHT Special 6 Came Alive with this speaker. Love It!", "id": 287}, {"review": "I am a tech as well as a guitar player. I also have spent time in the past Teaching soldering. But these cables seem to be well made with good solderless connections. Most of us know by now that there's a lot of hype but it really comes down to Good Quality Cable (This Seems to be) Good Stable Connectors (These seem to be) & the connections between the two that last (Time will tell). All I know is I have Hand Soldered Special plugs with Good Cable to only have them break with use and I expect the same with these especially in a high use situation where they are plugged & unplugged often.- I do know these are signal clean & do Not bleed f highs & that is critical in my book.- They are Very Easy to use & can be done on Stage between or before sets very quickly and with NO Soldering & I Love that!I will definitely use these again unless I find a longevity problem.LM", "id": 312}, {"review": "hands down my absolute favorite pick. I have tried many brands, materials & various thicknesses but I always come home to the Dunlop Tortext Red .50mm!", "id": 455}, {"review": "I found this to be very inaccurate but only on a few strings, so adjustment is not possible. I bought this because of the newer features & I like the strum & see which strings were out function but what good are nice features if the main function of the tuner is inaccurate! It's not a bad tuner, seems well built but unless you play so poorly or loud that tuning precision doesn't matter I'd go with the Korg Pitch Black (which is what I was using in my home studio - well back to what worked!)", "id": 650}, {"review": "I have a hard time paying for a patch cable that costs almost as much as a 20' cable. These are not cheap but they are priced much better than others. And they Work Great! No loss of Tone through these cables. If anything I had to do some EQ adjusting because after using these I had a far greater signal (volume and frequency response) when I replaced my other patch cables with these!I Love Them!!!", "id": 578}]