[{"review": "I play my I-pod through a small guitar Amp.  Great way to wake up the kids.  Works perfectly for the purpose.  Keep in mind small end for I-Pod is stereo and large end that goes into amp in mono.  If needing a stereo jack at both ends get something else.", "id": 10}, {"review": "If looking for that oriental sound, this is it.  Nicely made.  Some folks expect something different, I suspect.  It is not a cymbal that you use like a crash or ride, it is more like a splash and at that it is for use for a particular sound.  Highly recommend,  And when I bought it was very well priced - like half what I could find used  (and this was NEW!).", "id": 144}, {"review": "I think I have 3 or 4 of these.  Work very well and looks neater than the shoe string many people use.  Highly recommend.  Get a few just in case, but I am still on my first.  I do switch straps so I guess I have 2 in use - makes it very easy to put guitar on and/or change out straps.", "id": 174}, {"review": "I think someone else wrote that this is like the music stand they used in high school band class.  Yup, it is.  I would buy again.  My use is to hold my books while I try to teach myself how to play guitar.  This stand could easily hold a phone book as the lip is about 2+&#34; high.  Very happy with it.Just a warning to those that are picky.  Because of the way the tube locks together, the part that holds the music can shimmy a little if you knock or brush it.  Not an issue for me, but also did not want someone to think this is like a brick and won't move.It would be hard to tip over because the quality and thickness make this puppy heavy.  Buy it, you'll like it.  It will survive a nuclear blast.", "id": 339}, {"review": "At the time I bought, was $16.  Mine arrived broken, so it had gone back.  Reality is that it is not that good regardless of mine being broken.  Not upset about that - stuff happens.  It is just not a good stand.  Light construcion, unstable (topples easily) and a likely candidate to be broken if dropped.  The 'protective' materails on the stand to keep product from scratching your instrument are the soft, shiny runner like materail and it 'sticks' to my instrument's neck.  So I pick up uke and I get a stand until the stickiness is seprated by gravity.  Happened every time.  Yes, I tried out the stand even though broken, and it proved to be a bad choice.  Back it has gone.  5 stars to Amazon's return policy, thouh!", "id": 702}, {"review": "It works very well, installs easily, stays in place once installed but can be removed easily.  Does not scratch guitar's finish (just be careful, and no issues).  It will not produce the sound of a unit that is built into a guitar, but it comes very close.  A great and inexpensive way to make an acoustic also be electric.", "id": 789}, {"review": "These are a little larger than a traditionally sized, what you normally see used picks.  Thus, just a heads-up.  Having said that, they are top quality and are excellent picks.  I use all types and all brands and Fender's are always predictably great quality.", "id": 119}]