[{"review": "Yes this product is simple and expensive enough to raise some eyebrows. But this tool is very well designed. It keeps the guitar from sliding and positions it at a nice angle for maintenance. In storage mode, the mat rolls up into the clear plastic tube and takes up very little space. The bottom cover doubles as a storage compartment for your hex wrenches, string winder, and feeler guages.But the real reason I give this product five stars is because it allows me to work on my guitars while keeping them in perfect condition. That increases their resale value, so the tool pays for itself. And it gives me a lot of pleasure to have the right tools for the job. With the right tools, I enjoy working on my guitars almost as much as playing them. While I hear what those complaining of the high cost are saying, I am used to paying higher prices for good tools and I think this qualifies as a good tool. I used it to put new pickups in and setup my Squier Stratocaster last night without damaging my guitar. Without this tool, I don't think I would have been so lucky.", "id": 571}, {"review": "I just got done installing these. My three guitars and mandolin take up virtually no room in my small house anymore, my guitars are decorating the wall at the same time, and my guitars won't tip over either. Not only was this the least expensive solution out there, but also the most space efficient (to keep my wife happy).I used the screws that came with the mounts and made sure that they went into a stud. You can usually find a stud by looking for a screw or nail that the drywallers didn't get covered with drywall mud. Once you've found one screw, then your studs are either 16 or 24 inches apart. With the mounts screwed into wood studs, I don't see any way these are coming down. The mounts fit everything from my 12 string acoustic, to my heavy electric Strat, to my mandolin beautifully.Gotta love Amazon. With so many options to choose from, you can come up with something great and inexpensive too. And the reviews give you an idea of what real consumers are experiencing with the product.BTW, this seller really got these to me fast. This was a great buying experience. Thanks DisplayGiftSCOM.", "id": 779}, {"review": "These are solid stands for holding your guitars. I use them with my six string acoustic and my six string electric guitars and they work great. They are an excellent value.The reason they are so important to have is that, by having your guitars out and available to play, you will get more practice. They help me pick up my guitars much more often. Instead of dragging out the case and getting a single 20 minute session, I might get 4 or 5 10 minute sessions a night -- more on the weekends.Stands of this quality were about three times the cost at my local music store. I highly recommend these for around the house use.", "id": 813}, {"review": "This is a fantastic product that is well made. The plastic is heavy duty and comes with a plastic cover that must be removed before use. This ensures that the wheel you get is in perfect condition.The tool is extremely useful. I have just started playing with a band, and it is very common for band members to call out a song and the key that it is in. With the wheel, I immediately know what chords to choose from. I also know what notes are in each chord. In addition, it has a note by note image of the entire fretboard so that you can see where the roots are for the scale you are playing.The wheel is also invaluable for switching keys. For example, say you're playing the I, IV, and V chords in the key of C., but your lead singer is having trouble and would rather sing it in Bb. All you need to do is dial the wheel to Bb, find out the new I, IV, and V chords, and start playing. The wheel makes chord transposition a breeze.I feel that the negative reviews you are seeing are unfair. This is a very useful product at a fair price.No, I am not affiliated with the company at all. I'm just a band member newbie who appreciates this tool.In my opinion, this is a five star product.", "id": 531}, {"review": "This is a very high quality strap. The supple leather is excellent as is the workmanship.However, I don't like the plastic end pieces. They are large and -- well -- plastic. So I'm sending it back.I'm going to go with an inexpensive nylon strapProtec Guitar Strap with Leather Ends and Pick Pocket, Blackand straplocksSchaller Security Locks - Nickelfor about the same price.This is mainly a matter of personal preference. If you don't mind the plastic end pieces, this is a beautiful strap.", "id": 666}]