[{"review": "I was looking for something that was able to bend a bit but not fall out of shape or stay bent after much use and these are great.  They have good tension but still sound nice with my acoustic and the grip is great.  It's almost like a microscopic layer of felt is on these.  It sucks when your hands are cold and the pick keeps slipping out of your fingers...you don't want to keep licking your fingers or breather warm air on them and these are easy to hold onto no matter the condition.", "id": 61}, {"review": "Especially for the price, this is a great buy.  The strings on my acoustic were starting to get a bit loud when I would slide up and down the fretboard, and I was noticing quite a bit of lag when sliding too.  The only downside is that it would be much easier to apply this directly to the frets without the strings on, but the appeal is to bring life back to strings that aren't shining like they use to.  I just had to take a little extra time and care to get as much oil onto the fretboard and then make sure I wiped it in/off as thoroughly as possible, which required folding the provided rag and inserting it between the strings and fretboard and taking my time as I went from fret to fret.  Not a big deal though because the result was very pleasing.  The ease of sliding was tremendously improved and the strings sound and feel better than ever!  Take 10-15 minutes and do you and your guitar a favor...", "id": 72}, {"review": "I have too many guitars and don't play them all so instead of buying an extra case or stand I figured I could use some wall decoration.  This works perfectly and is easily installed with two screws.  Definitely recommend.", "id": 166}, {"review": "**So after reading a couple comments on this review it's obvious that my original review was somewhat irrelevant being that I was using the strap for the wrong application.  According to the first comment and verified from their companies website(which I should have done before buying) the strap is meant for a bass guitar.  Please don't purchase this thinking it will work for a standard acoustic or probably even an acoustic bass.  Amazon should have clarified in their item description.  Thanks for the comments educating me and sorry for the misleading review.**I'm not a very tall person and this strap is just incredibly short.  I currently own two other leather straps and they have the potential to be lengthened so that my acoustic would hang down by my waist or so, even though I usually play it about midway on my torso.  I don't NEED my straps to be super long but this thing makes it hard to even put the guitar on.  It just feels a little tight and crammed when I wear it.  I'll probably end up adding a string at one end just to give myself an extra 4 inches or so.  The leather itself isn't a bad quality, but it's not the finest.  I'd suggest dropping an extra $20 or so and getting a very high quality strap.**I just wanted to clarify that I was reviewing this product in regards to my acoustic guitar.  I have read some other reviews and it seems that those using it for an electric guitar have no complaints, but being that my acoustic is a good 2-3 times as thick as an electric, it does not serve my needs.", "id": 480}, {"review": "I use this to record vocals and acoustic guitar on my iMac.  The simplicity of this mic is very nice.  The sound quality is also very decent.  I haven't ever used one of those 'professional' quality ones but this has not disappointed me so far.  The only complaint I have is that there is no 'On/Off' switch.  The only way to turn it off is to unplug it.  Other than that I totally recommend this Microphone!", "id": 525}, {"review": "I've used the classic Kyser capos for years with my acoustic guitars.  They definitely look great, but they tend to lose their tension and allow for string buzz after a year or so.  That's my experience at least.  These trigger capos may look and feel awkward to a lot of people, but they are wonderful.  I get a perfect barr at every fret and it feels like this will never wear out.  I've had one for a couple years now and the only problem I find with them is that your friends tend to take them for themselves and it's easiest just to buy a new one.  Highly recommended for acoustic guitar players!", "id": 116}, {"review": "For the money, this is one of the best products I've reviewed.  I went ahead and ordered two and before I even had a chance to buy them, the price dropped by a dollar or so.  They easily fit on your mic stand and save you the hassle of trying to bend over and find your pick once you drop it.  Definitely a smart buy.  Don't play another show without these!", "id": 210}]