[{"review": "This pedal has been on the market for a very long time and it was a smoking deal for a Boss pedal at $40. The pedal works great with almost any guitar pickup set but sings with my EMG powered Schecter and tube amp.Different distortion levels can be dialed in and to my surprise, it works good with a bass although bass players know they will lose some bottom end.The guitar universe always raves about Boss and the distortion pedals and how any guitar player should have one of the distortion pedals. Buy it and experiment with the gain and settings and find your favorite tone.I may buy another one and mod it to use with my bass.", "id": 35}, {"review": "This is a great pedal I picked up used, they can be had cheaply on the used market. I actually use it with both an acoustic electric guitar to get a little distortion and the bass guitar for some grit. The 2 EQ pots on the front panel make it very versatile, enough to use with a cigar box guitar also.The pedal can preserve bass signal and still be EQ'd for saturated distortion. The other reviews speak for this pedal both here and on other sites and one can see why it is so popular. I also other Boss Distortion pedals. Like most people, I own a DS-1 and an MD-2 which are both cheap and effective. I own a HM-2 Heavy Metal 2 which caters more to the traditional metal sound and I actually think this pedal is more versatile IMO with different guitars where you may not want a strictly metal tone.I also own an older 80's HM-2 Heavy Metal which will run circles around the metal zone for classic thrash and speed metal tones and almost any other heavy distortion pedal that I could never part with, overall i like this pedal, but it cannot top the older legendary Boss pedals.", "id": 36}, {"review": "I bought this pedal used and have used it with both a Fender tube amp and a Marshall solid state using clean channels. I can get a variety of tones from it with different guitars, and reccomend it as a first overdrive or to add to a collection.While I have several overdrive pedals, this one is good at giving some basic overdrive tones while keeping the amps low end. I can get decent tones from a Telecaster and Les Psul by keeping the level and tone knobs below 12 o'clock and adjusting the drive to taste.The OD sounds great through Fender clean tubes and I also tried it with a bass guitar. With some adjustment of the tone and drive knob, the bass has an overdriven tone with a good drive.The other reviews here prove this pedal is typical and iconic Boss in build quality. I find the Boss pedals good for their purpose and have mostly modded the ones I've owned after some time, but I may keep this one as is and use it as a boost. These pedals last forever and I only paid $20 for mine.", "id": 38}, {"review": "I bought this EQ pedal to use with a 70's amp project. I replaced the speaker and needed some mids so I bought this pedal to use for a clean channel. The EQ and boost works great for being a plastic box. I have seen the F&C; be called 'pure gold in a plastic box' on a Telecaster forum and read reviews all over the net saying the same thing.The EQ works wonders for tone and is priced less than it's MXR and Boss counterparts. I am not going to rehash all the other reviews, but I use it with a bass/guitar amp and it works surprisingly well with the old amp and a passive bass. The boost combined with the 2 low bass EQ's works wonders for low end.I use a Boss GE-7 EQ pedal with a different amp, and the F&C; works as well as the Boss as long as you don't mind the cheap construction from Danelectro. I do not gig with the pedal so the plastic doesn't matter to me. I am wondering how long the switch will last though, but at this price, who can be critical.Some Danelectro pedals can be sorted into the novelty realm, but this one is actually very functional and can open up all new sounds. I also tried the EQ with a Telecaster and the pedal gave me alot more bass and low end. I hope this lasts as long as my old all plastic FAB distortion that I bought used for $5.", "id": 84}, {"review": "My review is on par with all the others concerning the quality of the cable compared to cheaper ones. I bought this locally and have been happy using it with a few bass guitars. The cable is solid and definately seems to hold up after a few weeks of heavy usage.One complaint I have is that the right angle does not lock into the jack on my Spector bass securely, but works with the others flawlessly. I use it with a jazz bass all the time and there are no issues.I also use Spectraflex fatso flex cables and Mogami and think that this one is worth it's price. To me, the warranty is worth it because of the price. I reead all over the web about the opinions of monster's patents and marketing techniques written by musicians and can see their points about the price and build quality, but there are more expensive cables out there made by Mogami and countless others which are not any better than this one in my opinion.", "id": 127}, {"review": "I bought this pedal at a local shop and use it with both guitar and Bass. I usually put it before a distortion pedal and my original Phase 90, or use it as a standalone with an old amplifier to even out the signal. I do notice it is more effective with the guitar than bass, but that is typical. I usually do not turn the compression knob past 12 o'clock, but when using a chain of pedals, the compressor helps even out the lows and highs. The pedal seems to interact with a wah in good ways also. For the price, it seems like the best economical choice for compressor pedal out there and the MXR pedals are built like tanks. I have had this one and the Bass model for years and they hold up great while showing their age well.", "id": 137}, {"review": "I bought these strings at a local shop for a Fender Telecaster on reccomendation from the guitar tech. These work well with the Telecaster tone and string through design. I like the tones I get from these and the price is very good. I do know that Ibanez uses XL's with all of their new guitars and I have used these srtrings with an older strat and they last a long time and stay in tune without issue mostly due to their basic fundamental design.I am not loyal to any string company, but I find that different companies work well on different guitars. I am a big DR string user with my other guitars which require thicker strings, so using 9 guage is new to me.Originally, I went to the shop for some EB super Slinky's after snapping the high E string which were sold out and went with these and could not be happier. I may buy the same strings next time, but I see Telecaster players using GHS Boomers in 9's, so that is also an option for the future.", "id": 156}, {"review": "I bought these strings after they were suggested by a customer at a local shop. I play a cigar box guitar and stay with uncoated strings to get a traditional sound from the piezo pickup. This is my first set and I am impressed. These are not the most flexible strings as another reviewer mentioned, but seem to work well for three string chords and sound good through both a tube and acoustic amp.I would purchase these again for my needs. Previously I have used Ernie Ball Earthwoods which were  more flexible in light form, but great also. It would be a toss up for me between the two, but I do know these sound alot better than the basic Matin SP strings I tried previously.", "id": 160}, {"review": "I bought 3 of these to store in various bass cases. I use them after a session or practice along with some guitar cleaner.. Sadly, I could not find any untreated cloths locally so I had these shipped through prime. These cloths are gentle and prevent scratching the finish unlike some of the microfiber types I see here and in stores that tend to leave streaks and in some cases scratches on the guitar.", "id": 184}, {"review": "I read good reviews about these strings on mylespaul.com and around the web and bought a set locally for the same price. I usually use DR Tite Fits, but these made me change for good They have a lot of mids and bass and make for a great chunky blues and classic rock sound with P90's. I also used a set on a single coil stray cigar box guitar I built and they give a lot of resonance and life to the old box and cheapo pickup. I will buy another set, DR strings never disappoint.", "id": 205}, {"review": "These strings sound great on an acoustic when properly tuned, I bought these at a local shop after looking at a different brand. The owner of the shop reccomended them as part of a setup. I like the lighter sounds out of them, and using a capo makes them sound great also. These seem significantly brighter and more dynamic than my previous set of Ernie Ball strings and I am planning on trying them out on another guitar soon.They seem to stay in tune more than other strings and also take to bending well. I use them on an electric acoustic and I am happy with the sound when i play through an amp.", "id": 225}, {"review": "I bought these through Amazon about a year ago and have installed them on all of my guitars. I have both the nickel and black on heavy basses and they have never let me down. I have since installed them on an electric and acoustic guitar out of convenience and purpose. The locks work great and give you an added sense of security.The reviews of the locks speak for themselves and no matter what style of guitar, whether it's a Les Paul, strat or active bass, I would strongly suggest them. I have never used the Dunlop locks, but have heard that some Epiphone and Gibson Les Pauls have mounting holes more suited for Dunlops.One thing to note is that all of these come with their own longer screws to use if needed. I never had to use them, but they are a nice touch and ended up in the parts bin.", "id": 278}, {"review": "Herco is a Jim Dunlop company and this little humidifier was suggested to me through someone who has used them for awhile. Dunlop is a trusted brand in guitar maintenance for the most part. I wanted to stay away from the typical humidifiers due to their tendencies to leak and stain the guitar wood. I have used this for a few weeks now and it still remians moist. The product came fast and the instructions are straight forward. I may order another if this one performs well.", "id": 314}, {"review": "These FAB pedals are cheap and mostly mediocre, but I bought this on a whim to use with a Fender tube amp and it works well. As other reviewers have stated, the pedal does not have very good build quality but it seems to hold up okay as long as it's not abused. I use the echo with both a telecaster and a cigar box guitar for vintage effects.I have found that the delay works well around 50 percent and the mix can be modulated to make a good mix of reverb and delay. I don't know if I would gig with this pedal or any othe FAB pedal because of my tendency to step hard on a pedal in live environments, but it serves it's purpose well and is cheaper than alot of other delay and echo pedals if you just need a basic effect. I have seen info about modding the pedal to control the delay and may do this in the future.I have alot of other pedals and I tried this pedal with a jazz bass, with some EQ tinkering, I found a good mix of echo. I originally saw a youtube video of a bass player using a D-4 and thought it would be a good idea. Again, Danelectro makes a higher end echo pedal which probably does a better job with delay, but this is a good deal and was $100 dollars cheaper than my Electro Harmonix Memory Boy pedal and sounds cool as a vintage vibe with an old amp.", "id": 315}, {"review": "I bought this wax and compared it to Meguiars I've been using for years and it surpasses Meguiars by miles. I have a few guitars and they really shine with this wax, you can really see the depth of the paint with this wax and it works great on headstocks also. I like the applicator and the fact that this is a paste wax which is effortless to apply.Along with a few high end guitars, I also have a few beaters. I used this wax on an old Squier that is thoroughly used and it looks fantastic. fine scratches and blems are gone and the guitar looks great.I use old t shirts to buff the wax off the guitars and found that it comes off chrome easilly, I overdid it with an older Les Paul guitar and was surprised to see the wax come off with ease. I will buy this stuff again and again, my local guitar shop sells this for the same price.", "id": 336}, {"review": "I bought this stand primarily to hold my Epiphone Les Paul. I have owned the other cheaper stands which are not built as well as the Hercules. The stand holds the guitar in place by the neck and the bottom of the guitar rests on the padding of the stand legs. There is no room for movement of the guitar like you fins with other stands. I can also move the guitar in the stand from room to room without issues. I plan on buying another one to hold a rather large acoustic guitar. I like how the stand is completely adjustable and locks into place.I strongly suggest this stand for heavier guitars rather than the cheaper stands out there, the extra cost is well worth the investment. I bought this at my local guitar shop for $40 after looking into it, the manager of the guitar shop recommended it to a few people while I was there.UPDATE 11/5/12- A few weeks ago, I bought myself a second one seeing the amazon price was lower than the local retailers. I usually buy locally, but the deal here was great. The stand is worth the price and more.", "id": 337}, {"review": "I bought this to use on an older acoustic guitar neck which was a bit faded and after 2 uses, the wood looks great again. I used the honey twice in 2 days and brought back the maple wood to like new condition.This honey works fast and well and will make playing the fingerboard alot easier. I saw this in my local shop for the same price minus shipping after I bought this, but I do not use it much so it should last a long time.", "id": 344}, {"review": "I originally bought this pedal to boost an old amplifier signal and it works suprisingly well. I wanted a boost which didn't color tone and this has worked well for my needs. The price is good, I bought it locally for the same price here.Since I have bought this pedal, I have upgraded the speaker in the old amp and still use this to boost the speaker to use with pedals. The tone is transparent and boosting pedal output is great. I use it with distortion and overdrive with good results.I have found new uses for my pedals which suffer from volume drop by putting this in front of them. All in all, besides for a good EQ pedal, this boost is effective and worth every penny.", "id": 365}, {"review": "This cable works for me in the tuner out jack of my amp. I noticed how thin the cable is, but the length is good for my needs. I  have played through the cable once and found it sub par compared to my other cables, which are professional grade and cost a lot more, but this is a cheap cable and sounds like any other cable of this caliber. I use the right angle to hook up to my jazz  bass during rehearsal where long cables at times bunch up and become cumbersome in a studio setting.", "id": 419}, {"review": "I found the price on Amazon cheaper than my local guitar shop and quickly bought it. The slide works smoother than a brass slide on an acoustic/electric guitar and also sounds great with a Cigar Box Guitar with piezo pickup. The slide is thick and the large size fits well on the middle, ring and pinky finger.I found the tone of both guitars brighter and more defined using this slide compared to a brass slide which suits an electric guitar better IMO. I have not tried a ceramic slide with any guitar, but a Dunlop ceramic slide is most likely a future purchase.Jim Dunlop products are solid and last long for the most part, their slides seem to be the most popular brand aside for boutique bottle slides and I think this one will last a long time.", "id": 457}, {"review": "This is my thrid Levy's strap and it is as good as the rest of them that I have had for a few years. I have this strap in black also and hope this one holds up to the rigors of the others. I have seen on different sites that the dye is thin but I don't see a problem with it so far and I use it regularly. I have it adjusted to the largest size and wished they were a bit longer, but it is a standard size.I prefer this strap over other cheap leather straps because of the build quality and the fact that they are made in Canada and not china or somewhere oversees with cheaper materials. For the price, the strap works well and I would buy more Levy's straps if needed.", "id": 481}, {"review": "I bought this using Prime and am happy with the power supply. I have many different makes of power supplies. In the end, they are all the same. Proof of this lies in the Boss unit I have owned for 20 years.Amazon had the Planet Waves 9v supply for the lowest price, lower than local retailers and if you do not use or need a &#34;1 Spot&#34; this will not let you down. I may order more to use with some of my older pedals not on my board.", "id": 521}, {"review": "I bought this pedal after looking at the Boss TU-3 and Korg Pitch Black for bass. This pedal won over the mini version because of the bass mode. Strumming all 4 or 5 strings works well for a quick tune, but I still use the chromatic function to get an exact tune. The accuracy is impressive and this pedal even worked well with the low B.I read all over bass forums and reviews of the tuner and thought to try it out. TC electronics seems to spend alot of time advertising its products in bass mags and online and some of their products are greatly overhyped IMO, but this pedal and the reviews speak for themselves.I was able to tune an electric acoustic guitar in seconds using the sweep option and even tried a cigar box guitar reading just the AD&G; strings and it worked okay.The pedal is easy to use and switching between tuning modes is a breeze. I chose to keep the clear film over the display for now to preserve the display as long as I can. I tested this sweep option on an old Ibanez artcore guitar which hasn't been played for years and even with old strings, I got a reasonable tune out of it.Strumming all strings at once seems to work better with a guitar more than a bass, but many reviews in bass mags and online also point this out although it works for a quick tune.I am happy with the pedal and hope it lasts as long as my old Boss TU-2. I feel it has changed my tuning needs into a breeze.", "id": 650}, {"review": "I bought this pedal wanting classic distortion and find it more useful as an overdrive pedal. The distortion range does not get as hot as a RAT or MXR classic distortion but it sounds great with a telecaster and tube amp. I use it with a cigar box guitar also for fun and the tone ranges from 60's and 70's distortion to 80's metal. I get a more extreme distortion from my old hissing Boss Mega Distion as an example.I like that the pedal has a wide array of uses. The build quality seems questionable from MXR. As others have posted, the box is very light and the knobs seem thinner than other MXR's, espeacially the older ones, but this pedal seems solid and makes no noise.The price and demo videos were the primary reason I bought this pedal and I am happy with it. I have many distortion pedals and each one is useful in their own way. I would steer clear of this if you are looking for a pedal for metal and definately buy it if you are into classic rock, twang, and blues.", "id": 757}, {"review": "This is a cool looking cheap cable which works well. I bent one of the connectors pretty badly but that was my fault. One thing to consider with the cable is to tighten the connectors once in awhile. You'll be able to hear them rattle. It seems that the 'retro' look is screw on connectors over some black rubber, but other than that, the cable looks cool and works well.I also have the shorter red cable which goes with one of my guitars perfectly. I bought theses to use while practicing with others who use black cables. It's easier to plug into different amps without cutting someone out by accident. The green cable is good for that.", "id": 3}, {"review": "I used this on a bass guitar with older strings and it made the strings brighter and more lively. I will try it on all of my guitars as it will prolong the life of most strings. I like the packaging and the small cloth it comes with. I use sections of t shirts to clean my strings and put them inside the packaging along with the cloth. This is a must for any fingerpicking guitar or bass player.", "id": 72}, {"review": "I built a CBG recently and decided to go with these strings as suggested on several websites. The sound I get from the AD&G strings sound great wit the piezo pickup and a tube amp. The strings seem to hold up well. I cannot comment on how well they hold a tune because anyone who knows cigar box guitars knows that keeping them in tone with parts like round head bolts for a nut and an eye bolt for a bridge can be an uphill battle. These strings sound great, I was thinking of stringing my electric acoustic guitar with them also to compare the two styles of playing.", "id": 90}, {"review": "I ordered this after I saw one on a squier bass at a local shop. The plate looks great on my MIM fender Telecaster and it is thicker and nicer than the Fender 'F' plate I see on other guitars. I used the screws and it was an easy install. Other reviewers have posted about the finish and thickness of the plate. The plate has five screw holes, but doesn't look bad using 4.This is just a visual mod for me mainly to get rid of the crappy cheap plate which is used on my MIM Telecaster.", "id": 527}, {"review": "Planet Waves has built its company making affordably priced accessories and these patch cables are no exception. I bought these at a local Guitar Center for about the same price. The thickness and connectors seems to hold up well although I may look for a slimmer alternative soon as some other reviewers have stated also that the connector ends are a bit large and could become difficult to work with in smaller or crowded pedalboards.", "id": 578}]