[{"review": "i've used pick when i play most of time and i used white color thinnest one. i like to use thin ones because i play strumming most of time and this one works perfect. very easy to grip and last long. one thing to point out is that print on pick fades away very quickly but i do not mind. highly recommand this for anyone needs pick!", "id": 61}, {"review": "i'm a beginner on play guitar and most time i play strumming in church praise team. when i play faster songs, thick gauge picks are very easy to lose. so i like to play with thin gauge picks. i have used the 0.46mm (white)one and i want to make the guitar sound more brighter. i pick this gray one and i played last friday and sunday worship, it made sound that i desired and it wouldn't fly away from my hand while i was plying fast praise songs.", "id": 64}, {"review": "i've used many brand for my guitars for years. this one is very good, long lasting guitar strings. balanced tone as it says on the box and special coating system makes strings last longer than non-coated ones from lusting. easy to install and use, and very reasonable price. thanks amazon for this product sale.", "id": 130}, {"review": "it's tri pack with great quality strings on good deal! i purchased 2 of this set and it works great. it sounds balanced (warm and bright). i prefer change strings often so i can't afford to do that with expensive set of strings. this one is affordable and make my guitar sound good! anyone needs string go for it!", "id": 198}, {"review": "i've used d'addario strings for bass, electric, acoustic, and classic. even though this string was my first time use and it haven't failed me yet!! it's very stable and in tune all time while playing. highly recommand to other ppl", "id": 201}, {"review": "i recently bought this one for myself but i gave it to my praise team leader. when he do turning his accoustic guitar while other players make sound, he always pull cable to connect the guitar and tunner. so i gave this to him to save some time. first he doubt that it would work just like other tunner, after he tried he was very pleased with the accuracy and convinience that he can tune his accoustic guitar while other players are playing. now it's time to treat myself with this gift, so i don't have to do what my leader did during band practice. i also want to mention that this product was made in korea not china~~! it's very rare thing to see now a days.", "id": 635}, {"review": "I use this pick for first time and it feels great and MAX GRIP for sure. Now I do not have to worry loosing pick and my mind while I'm leading and playing in worship. It feels little bit stiffer than regular .66mm nylon pick (I used to use this one) and I love feeling and sound when I play guitar!", "id": 680}, {"review": "About 4 years ago,  one of my friend dropped his bass and its body broke in half. that bass had regualr strap button, ever since then he use this dunlop straplok system. i recently built a bass myself and i install this one. it's very easy to install, very straight forward to use it. it holds my jazz bass without any problem. i would buy this from now on for all my electic guitars.", "id": 44}]