[{"review": "This is actually the first capo I have ever owned, as I am pretty new to playing the guitar. That being said, I paid close to $14 with free shipping for this capo, and I feel it is a good value. It feels well constructed, like it won't break if I drop it. The capo fits nice and tight on all six strings. Ample padding mitigates any marring of the guitar's neck. The spring mechanism is plenty tight, but not too tight to easily move or remove the capo single handed, even while playing. The capo is sleek looking, and a bit smaller than I was expecting at 3&#34; x 3&#34;, but I have no frame of reference for comparison.Item was shipped on time, and packaged in the original Dunlop packaging. Part number: 83CB, Made in USA! No counterfeit here. If you have any questions, feel free to ask and I will answer as best I can. Thanks for reading.SPO", "id": 116}, {"review": "I purchased a 3 pack of the soft rubber wedgie's as an add-on to a larger order. As such, I found them to be a reasonable value. However, I'm not sure how long these will last on my steel string acoustic. I think these picks would be fantastic for classical or any other nylon string guitar or \"uke\". They are very grippy and have a slight concavity to them on one side for additional comfort.I love the very soft warm sound they provide. I use them mostly late at night when I can't sleep and want to play, but the rest of the family is still sleeping. Not quite as effective on the E, A, and D steel strings but certainly playable. Not so great for strumming, but fun to pick individual chords. Thanks.SPO", "id": 245}, {"review": "This AC adapter, in my opinion, should not even qualify to be reviewed since we all know it should be included with the product it is powering. That being said, it functions as it was intended to, which is to power a Yamaha PSRE333 61-key portable keyboard. It fits perfectly and stays put, all while transmitting electrical current from my home's 110v outlet into the aforementioned Yamaha keyboard. Thanks for reading.SPO", "id": 476}, {"review": "In the interest of full disclosure, this is the first guitar strap I have ever owned. That being said, the strap is fairly soft and pliable, with that almost broken in feel. I was expecting it to be a little stiffer, but I'm glad it isn't. It fit my Ibanez acoustic just fine. My guitar is nothing fancy, so I would presume the \"strap locks\" are pretty standard. The fit is really tight at first, so that should be a good thing. I suppose I could have unscrewed my strap locks to facilitate mounting the strap, but I didn't.The range of fit seems pretty good to me. I am 6' tall and wear my acoustic up a little high, kind of \"folk style\" I guess. If I want to, I can adjust it so that it rides lower around my pelvis area. One end is suede on both sides and has the tanned leather-logo patch on it, while the other end is black suede on one side and tan suede on the backside. I can't see it marring the guitar at all. It is comfortable around my neck and shoulder. Made in Canada, seems well built and durable. Once again my left shoe is happy to have its lace back, and Keith gets to keep his head fashionable. If you have any questions, feel free to ask and I will answer as best I can. Thanks for reading.SPO", "id": 479}, {"review": "I am but a mere novice when it comes to playing the guitar, but I purchased this SN-1 to replace the piece of junk first tuner I had. I'm very happy with the size of the SN-1. It's small, much smaller than I expected which was a big bonus. It takes up very little room on the headstock, and does not interfere when I make tuning adjustments. The &#34;chip-clip&#34; style clamp does a surprisingly good job of staying in place on my Ibanez acoustic and I *think* my guitar sounds better than it did while using my previous tuner.The user interface is very simple, and the display is easy to read and understand in both higher and lower lighting conditions. The instruction manual is adequate, but the SN-1 seemed very intuitive for me to use. The product arrived on time, as shown, well packaged, for what I believe to be a fair price at about eight dollars and change. I've had this SN-1 for a couple months now, and will update this review down the road. Thanks for reading, and if you have any questions, feel free to ask and I will do the best I can to answer.SPO", "id": 706}, {"review": "I received all twelve picks, which came in a small ziploc bag with an attached Fender tag. The color is great. I needed a thin pick for some softer picking on acoustic. These work great, though do not offer as warm a sound as rubber or felt picks. I find them to be the perfect compromise between heavy and rubber. The picks were reasonably priced and shipped via \"prime\", so I found them to be a great value as someone who only plays casually. Thanks.SPO", "id": 120}, {"review": "Ordered these large picks and like others mentioned, they are not large at all. I have average size hands and thumbs and the pick initially numbed my thumb in about twenty seconds it was so tight. I solved the problem by simply holding a Bic lighter flame about a half inch away from the heel of the pick for just about three seconds. I could feel the celluloid loosen up quickly. It was just a matter of pulling the pick open just a bit. It's actually easy to completely customize the size and shape of the picks with just a few seconds of heat. The picks fit fine now, and I didn't even need to place &#34;foreign&#34; objects into the microwave to do it.Any questions just feel free to ask and I will answer best I can. Thanks.SPO", "id": 617}]