[{"review": "I've used this on a variety of 6 strings and a few 12 strings and it really does give a good sound for the price. And if you've got a variety of acoustics and don't want to get pickups installed in ALL if them this is a great solution. It tends to work slightly better for finger picking than strumming because occasionally your hand will hit the chord coming out if you're not careful.Remember that it must be used with a preamp and hopefully something (most likely a tuner) with stomp on/off bypass so that you can turn it off more easily.", "id": 129}, {"review": "I use a late 70's yamaha steel string with this going into an LR Baggs Para DI and it works amazingly well. The sound is impeccable. But you can't expect to just plug it in and go. You'll need a feedback buster and a good preamp. But it really does the job, good tone.", "id": 416}, {"review": "Great stand for the price. Threaded fine and it's heavy enough for any mic you've got. there are better out there but it's a good value.", "id": 515}, {"review": "I frequently restring mandolins and 12 strings so obviously it's a huge convenience. Even if it doesn't save a WHOLE lot of time it's very ergonomic. Wish it had more speed variance but it's great for the price!", "id": 522}, {"review": "It works well 95% of the time but sometimes has a problem with the G string for me. I use it in tandem with a snark tuner and together they're fail safe. (the snark tuner will also get buggy once in a while but together it's so statistically unlikely that I don't worry about it)The stomp tuner also has the benefit of being able to hault the signal, hence why I wouldn't just use a snark tuner.", "id": 647}, {"review": "I personally use this in conjunction with my TU-3 on the ground but honestly it just gets a read faster than the TU sometimes and it's a fraction of the cost. Really efficient way to go in my opinion. I am a pit orchestra musician and I've lent it to people who play LOTS of different instruments and it really tends to work well with all of them.", "id": 811}, {"review": "It sounds good but it adds soooo much noise to my pedal board. If that's not a problem, definitely worth the price.", "id": 41}]