[{"review": "If you can't find a container and add your own sponge, then buy this.Keeping a valuable guitar humidified is essential.I think this item should cost three bucks at most, and $1.50 would still yield a healthy profit!I made some more from stuff from the dollar which I think are better.I use this one for my baritone uke, and the bigger ones I made I use in my dreadnaughts.If you make your own, just make sure to not let the sponge drip, ie, wring it out, and make sure it does not actually touch any bare wood.", "id": 71}, {"review": "I already had the nickel finished version (which I paid a few dollars more for),and wanted a spare. I like the Dunlop design and price. It should last a lifetime.Glad I got it.  This one is finished nicer than the nickel finish one I have which is rough looking in comparison.The black Dunlop has a nice smooth finish.", "id": 116}, {"review": "I've tried a lot of strings and these are my favorites, although I use the heavier MLT 2036 strings sometimes.These ones bend easier. The heavier ones have a better low end and buzz less.Both last as well as the more expensive Ball and Gore (elixir), coated strings I have used.And I like the sound better.", "id": 204}, {"review": "I have had a Korg CA-30 tuner for a few years which I really like.I wanted to get a metronome and liked the idea of having a combined unit.Initially I bought a Boss TU-80 for more money, but returned it because the response time and volume was not as good as the Korg TM-40,and the batteries rattled around in their compartment.Also I like having the middle green LED for tuning.The price here can't be beat and it's a well built item that works great.I was concerned about the power buttons sticking out too much, but they take more pressure that it would seem, and there is a delay until it turns on or off, so that turned out not to be an issue.I am not real hot for the color, but it's nicely made and works well, so I will live with it.I especially like the little folding stand in the back, rather than having to find an old credit card.", "id": 298}, {"review": "This is a pretty good deal if you look at the price of other capos, and you get free shipping.Yeah, it's not as quick to use as the spring loaded ones, but still not bad; better than an elastic strap type.It is also great for creating your own short cut and drop D capos.  With a sharp razor you could do all sorts of crazy stuff.Do not overtighten the screw because the bottom arm is thin. You can add a pad of some sort, or just take care to not to over-tighten it.I'm the type of person that would glue in a small piece of material if it broke through.  So, far it doesn't look like it will though.", "id": 346}, {"review": "I bought this to try out on my baritone uke.It works great and is very easy to use.I use it with my Fender Mustang.I had no problem with the suction cup except on the rougher face of my Martin DX1.I was able to attach it to the smoother HPL back and sides using the suction cup.I wet it before attaching.You could also use a small clamp, blue painters tape, etc., for trouble mounting.It could be used on just about any instrument.  Some may need a clamp.It picks up anything it is attached to.It will feed back depending on how close and the angle to the amp.Pretty cool.Nice price.", "id": 611}, {"review": "I bought this just to see what everyone was raving about.It's all true.This tuner works great!It is better than my Intelli 600, which I also like.The colors and lighting make it very easy to read.It has no problem with the low E string. Obviously more sensitive.The Intelli works, but sometimes you have to move it around to find a sweet spot for the low E.As with the Intelli, it is not affected by ambient noise.The only thing I find worse than the Intelli is the gooseneck. While it is very adjustable, the Intell folds flat which I really like.The Snark is well worth it's small price!", "id": 706}, {"review": "These work great.For the price I bought a couple intending to use them on a diddley bow I built.I have not used them for that purpose yet, but tried them on my guitars, a dulcimer and stick I built, and was impressed with the sound quality for the price.", "id": 759}, {"review": "I thought I could take the smell. I couldn't.Otherwise it would be a decent deal and not bad sounding.The case is nice too, but everything smells like the Chinese rubber smell at Harbor Freight Tools. (sulfur?)I tried airing it out for a week with no success.If you have no sense of smell, get one.", "id": 252}]