[{"review": "Yes, you can make your own pop filter at home, but you don't want to.  Why else would you be reading this?  Besides, it won't look this good.I've purchased three pop filters thus far in the last four months.  The most recent one I purchased was NOT this one.  I wish it was.  I thought I'd try something different, just to see the differences.  Well, I can tell you that there are significant differences between this, and some of the others featured here.The bottom clamp on this one features a rubber piece that grips the metal pole that you attach to.  The competitors that I've tried do not.  If you do not have this rubber piece, any clamp will tend to slip down the pole and not grip properly.  This is a huge mistake as this makes using a pop filter on a boom stand impossible.  Fortunately, Nady placed this rubber piece on it's clamp so this has never been an issue.The only complaint I have is the screen has actually popped out of the plastic ring a couple times.  A single dot of superglue fixed that.Compared to the other pop filters I've seen and used, this one is perfectly suited for any microphone and at a reasonable price you can't beat it.And yes, pop filters ARE A MUST with condenser microphones.  Just buy one now, save yourself the trouble.", "id": 46}, {"review": "I've used three pop filters in my experiences with home recording and podcasting.  This one is the worst.  The plastic screw (yes, plastic) that is meant to grip the pole that you attach the pop filter to, is completely incapable of supporting it's own weight at nearly any angle.  Bad...just bad.Secondly, there is a metal piece that secures the flex arm to the clamp.  It seemed loose after I got it out of the packaging and the flex arm would wobble and rotate in that spot causing a major problem when it came to proper placement.  After twisting on it twice I stripped it out.  Now the thing is worthless.  I'm returning it ASAP.I would rather go to a lady's bag flea market sale with a crazy woman for a day than continue to put up with this thing.  Do yourself a huge favor and buy the Nady 6\" pop filter.  If you don't, you'll wish you did.", "id": 134}, {"review": "I don't think I can say enough good things about the Samson SP01 Shockmount.  Long story short I was trying to get a podcast going from scratch about three months ago.  I did some research and discovered that a shockmount is necessary to keep any noise from anything securing the mic from being picked up by the mic while recording.  A shockmount is an absolute must, especially when looking at using a tabletop mic stand where the table will also be used as a work surface.The build quality is fantastic.  I just recently purchased my THIRD shockmount for an additional mic to be used on the podcast.What I've grown to appreciate so much is that it seems to fit just about any condenser microphone I can get my hands on.  If you are considering buying this for your own condenser mic, make absolutely sure that your mic has threads on the bottom to be screwed into some type of stand or shockmount.  Nearly all do, but some companies like Blue (Snowball, snowflake, etc.) are designed not to be used in conjunction with shock mounts. I have used the MXL 007.USB with this shockmount as well as the AT2020 USB and XLR version.  The MXL fit like a glove, perfect.  The AT2020, once threaded in, seemed just a bit loose, so I added a couple foam bumpers around the base to act as a washer.  It made a tight fit and further insulated it from any sound interference from any movement.In short, I haven't found a better shockmount for condenser mics.  The attachment screws onto any desktop tripod and traditional mic stand.  Fantastic.  Buy two of these!!  :)  Thanks Samson, now just make better mics!", "id": 393}, {"review": "I purchased this desktop stand with the hopes that it would fully support the front weight of a condenser microphone and a shockmount together.  It does, and it does it well.  Very solid build, never felt cheap in any way.  Perfect for its intended use.  I purchased a second one after using the first for one month.  Would buy again should the need arise.", "id": 224}, {"review": "This is the best USB Condenser mic I've ever used.  I needed to buy a condenser mic recently that had to be XLR.  I bought the AT2020 XLR version, simply due to the fantastic results I've achieved with this one.I only use this microphone for podcasting.  I do not record music with it, but I haven't tried yet.  If you're curious as to the sound quality, listen to my podcast \"Rock Crushes Paper\" on iTunes and Zune Marketplace.Just to give you an idea of what I'm using:Windows 74 GB ramPentium 4 Dual core 2.2 ghzAdobe Auditon 3The build quality is fantastic, built like a tank really.  The only knock I have on this is the little tripod stand.  Yes, it's a tripod stand, but I can't imagine actually being in a spot where I'd rather use that then the On-Stage desktop mic stand.Anyways, great mic.  Can't recommend it enough.  It's made me check out other Audio-Technica products.", "id": 525}]