[{"review": "No complaints about this hardware.  Easy to install with patience, easy to use.  The click on/off system securely holds your strap, and prevents the strap binding from slipping off the post.These work like a light switch...on/off, so I'm not sure how you can rate them as poor.  There aren't really any directions, so it takes a little mechanical knowledge (just a little...it's not rocket science) to make them work.Quality metal, secure function, and easily replaces posts on instruments already equipped with standard strap posts.I've installed these on a 3/4 Hoener, Full Sized Squire Acoustic, and 2 Fender Strat's.", "id": 44}, {"review": "Absolutely no complaints about these cables.  We use them to power two Fender Squier Strats, and were very happy with the sound quality for our use.  The plugs are sturdy with injection molded guides/covers and provide good strain relief.  For the price there's no worry about solder quality, since any repair would cost you more in time than a new cable.We also use the more expensive metal cover Hosa Cables and see no appreciable difference in sound quality.Great for short connections for mixers or straight to the amp.Specs - 10', 1/4\" mono (tip)", "id": 168}, {"review": "My experience with these straps has been great.  The polyester material is sturdy and comfortable, the leather post binding is sturdy and easy to use.  The straps have PET/ABS buckles and are easily adjusted.  I've not experienced any issues with the buckles breaking.Note: It is possible that this material can become brittle if stored in high heat (a car trunk or in sunlight within a hot car), but that problem isn't a manufacturing defect so much as a material deficit.For the price, the functionality is excellent.  If you are looking for a product for an everyday use guitar, with little investment or maintenance, this is it.", "id": 208}, {"review": "Excellent replacement upgrade for the inexpensive but fantastic Squire Strat series.  This Bridge has more strength and solidness than the original.  Replace the Tremelo Arm with the one offered on Amazon as well.Key:  This bridge is slightly thicker/higher than the one it replaces on the Squire, so the back plate won't fit back on...something to mod if you need a backplate, but the difference in the quality make it worth the loss.", "id": 678}, {"review": "This amp is a quality item for the dollar range (I paid $49.99).  There is some question about sound quality and variation in quality.  We purchased two of these, and one arrived with some minor issues, constant humming regardless of volume or EQ settings.  Amazon did a wonderfully quick swap and the new one arrived without the problem.This is not a 6000W stage amp, nor is it so quiet enough to practice without disturbing the neighbors...it has a full punch output at full gain/volume, and can easily light up a back yard.Specs-Input: 1/4\" Mono (not a tip and ring jack)Controls: Volume/Gain and selectable Volume 3-EQ range knobs.  There are two volume controls, once for each side of the push button selector.Outputs: 1/4\" Mono (for monitor or mixer), 1/4\" Dual Mono Headphone jack (tip and ring supplied from the same mono channel).Power:  Lighted front panel rocker switchThe box is very slim and small, about a foot by a foot and 8\" deep, the rear is partially open, speaker exposed, and allows for cord storage.Pros--Portability, easy of use and set up.-Quality finish (leatherette with steel corners) and good construction, 6\" heavy duty lead guitar speaker-Excellent sound and electronics for ANY amp under $100.  There are other manufacturers that have small wattage amps and smaller speakers that are $30-$50 more.  Go with this one.Cons--Units run hot and cold as to quality, but if it works out of the box, it's good, if not, you'll know it as soon as you power it up. Buy with confidence at Amazon from Amazon and you shouldn't have any worries.These amps power two Squier(tm) by Fender electric guitarsSquier by Fender Bullet Strat with Tremolo Bundle with Strings, Pick Card, and Polishing Cloth - Black, Rosewood Fretboardand do a great job.Other accessories for the beginner electric to consider:Cords -Hosa GTR210 Guitar Cable 10 Ft,Planet Waves Classic Series Instrument Cable, 10 feetStrap -Planet Waves Polypropylene Guitar Strap, BlackStraplocks -Dunlop Dual Design Straplok System, NickelHanger -String Swing Hardwood Home & Studio Guitar Hanger (Shades May Vary)", "id": 734}, {"review": "Many reviews cover the pro's of this item, so I'll be short only to add that they are very sturdy (when install properly...suggestion:  find a wall stud and use 3\" screws for heavier instruments).Used in our house to hang 2 acoustic guitars and 2 Strat's.  Haven't had an issue with any in the 4-5 months we've had them up.  On the electrics, we use the section of the bracket between the wall and the hook to hang the coiled guitar cable.The hooks are bendable and can adjust or adapt to virtually any style head and are grippy enough to keep slick finishes from slipping.Wonderful simple product that makes displaying or storing your instruments stress free.", "id": 166}, {"review": "Say it all, but the replacement is milled finer and has better threads than the original piece.  A great upgrade when adding new parts to the inexpensive but fantastic Squire.", "id": 558}]