[{"review": "If you're buying this and new to effects pedals (like I was), you'll be concerned whether it'll work with the inexpensive pedals you're likely to also be buying, especially since there is a large kit with a number of converters that might scare you into thinking you'll need them. The two most common types of inexpensive pedals are Danelectro and Behringer, and if you're like me they're ll you'll buy for quite a while. The good news is, you do NOT need to buy converters for them. This little beauty will run all your Behringer and Danelectro pedals, off from any of the standard 9V power supplies available (you don't NEED to buy a 1SPOT, I use it with a Behringer but you could certainly put it together with the less-expensive Planet Wave if you're working on an even tighter budget. In short, buy this product, it will save you its cost in 9V batteries within the first two months if you're on low-price pedals.", "id": 192}, {"review": "These strings are beyond amazing. Switching to Ernie Ball strings should be a matter of course when purchasing a new electric guitar, and if you do any blues playing at all, Extra Slinkies are for you. They bend and bend and bend, are easy on the fingers during lengthy solos, and give a great sound whether you're playing gritty or bright. I also play country and punk, and these strings let me get enough twang and beef, respectively, to play those styles as well. The best $5 you will ever spend on a guitar improvement is to put Ernie Ball strings on your guitar.", "id": 396}, {"review": "This is not a gigging pedal. You do not have time to tune with this pedal at a gig, so if you're planning on gigging in the next month or so spend the $50 on a Korg. However if you're an at-home player who just wants to not have to mess around with regular electric tuners, this is worth the price. It sits right on the pedal board, the signal flies through it when it's off so there's no monkeying with your cables everytime you want to switch between standard and Drop D, and it's as accurate as the Korg is. It's just also slow. It takes a good 2-3 seconds to register a change, which is fine when you're just practicing or even for recording at home where a few seconds aren't crucial. I just recommend something a little faster if you need to tune quickly between songs.", "id": 443}, {"review": "If the hiss from your distortion and compression pedals irritates you, this is worth the money. Contrary to the name, it is a noise gate rather than a noise reducer. It does not filter out noise, but rather stops the signal to the amp entirely when the sound from the instrument reaches a predetermined minimum. If you are playing with humbuckers, your only problem will be pedal hiss and you will never hear it again. If you are playing on single coils, the hum while you play is so minimally noticeable that this is still worthwhile. Whether you're gigging and don't want to sound like an amateur or you're practicing in headphones at 4am, this will make your playing sound a little better, and you can't complain about that.", "id": 615}, {"review": "There's not much to be said about this pedal: it just works. It's my fourth cheapy Behringer pedal and I have been pleased with every one of them. This pedal is great for tweaking your sound to get it juuuust right. I play punk, blues, and country, and this pedal helps me obtain the entire range of sounds necessary for my various styles. Even on a cheap amp (upgrading to a Marshall next month), this gets the job done. People who complain about the plastic casing are just looking to whine, imo. It's a good solid plastic that holds up well, and if it drops the price to $20 instead of $50, that just makes Behringer effects more accessible than that other brand.", "id": 645}]