[{"review": "I use these in standard tuning on my prs mccarty. The sound is unbelievable. Thick and creamy sound. Lasts slmost 3 weeks before the tone dies. Good price. Good strings.", "id": 97}, {"review": "I compared this cable to the monster studio pro 1000 cable i also own. I prefer this more as i play live and it does a good job in handling noise snd also has a no questions asked lifetime warranty. Just take your broken cable to your local guitar center and they will replace it. I got 4 replacememts over 3 years. Worth the higher price because of the warranty. The 100 dollar studio pro doesnt do well live compared to this rock cable as the studio pro sucks up tone snd only sounds good for recording. note, this cable has high mid range so if thats what you like go for it", "id": 125}, {"review": "doesn't last as long or sound as bright as Elixirs but these are half the price. Good bargain though for $6.99.sounds all right to me, bright and well balanced sound.My little brother can't tell the difference since he's new, but it works well on his guitar.", "id": 130}, {"review": "Works better than straplocks as it doesnt fail like regular straplocks. I'd use it for lightweight guitars. Using this on a les paul will kill your shoulder. I always suggest this strap to \"kids\" who spin their guitars while on stage. This strap is the industry standard that will save your guitar from damage", "id": 193}, {"review": "I placed these on my usa made ovation baladeer. Stays in tune well and does a better job than the stock Ping tuners. This is the industry standard and you wont be disqppointed. To those who say it doesnt stay in tune should have their guitar's bridge checked as flaws in the bridge can cause problems in tuning.", "id": 270}, {"review": "Nice picks, much brighter sounding than the jazz 3 nylon picks. I prefer the jazz 3s since thr jazz 3s are warmer sounding and wear resistant. but these pitch blacks are not bad. They do wear down quickly but a dozen should last a good amount of time.  This pick does what jazz picks are suppose to do and in my university's jazz ensemble the three tips are useful and makes playing difficult jazz chord  easy. It will feel awkward at first if you never used jazz picks but once you get the hang of it you'll never go back to standard picks.", "id": 341}]