[{"review": "The first thing I do when I get a new instrument, is put a straplok on it before gigging with it.They're easy to install, I haven't had one fail on me yet.I have straploks on nine instruments right now, and I just ordered another for my new bass...I can't recommend them highly enough!", "id": 44}, {"review": "Give these picks three days and you'llNever go back to another style.Almost impossible to slip out of your fingers, great tone, amazing clarity, effortless harmonics, durable and fast.This pick literally makes you play better!", "id": 67}, {"review": "these heavy gauge are the main strings I use. Detune great, good harmonics, great presence, I use them across a whole range of genres, from Death metal to Blues to  Funk and beyond!", "id": 97}, {"review": "Fulfils it's intended purpose...Holds several picks.non-marring adhesive on back won't damage guitar finishes.Easy to withdraw and replace picks.", "id": 233}, {"review": "I'll start this by saying I prefer metal slides to glass (tone snob that I am)So I wasn't too excited about playing with this, until I played with it!The tone is amazing!!Great highs, amazing lows, smooth midrange and unbelievable harmonics!I now only use metal slides... And my dunlop bottleneck ;-)", "id": 281}, {"review": "Gives a nice warped slightly detuned effect to your first at the right settings.(Think Alice in chains, or REALLY distorted live nirvana solo) admittedly not everyone's into the whole grunge tone. But it was what I was looking for.Has some nice shimmers and thickening on other settings too.And hey, you can pretty much get it for pocket change.", "id": 319}, {"review": "I have several different slides (glass, brass, steel, short, long, etc.)And this has become my go to for every slide guitar session I play on!I wear it on my ring finger, It fits great, the tone is amazing on acoustic, electric and banjo!Works great for blues, rock, a little stoner country, and even some metal! (the main genres I play in)Harmonics and sustain to spare!I keep it in my pocket at all times now, it goes with me everywhere, And has never failed to lay down some mojo when I bring it out!", "id": 340}, {"review": "This is a good neck rack for gigging...It DOES  take a little tweaking and customizing to get it arranged right around your neck.But that goes for all neck racks really...Once it's fit to you though, It works beautifully! I use mine  daily and it hasn't failed me yet!Also, it will (with a little ingenuity)Hold a Kazoo, slide whistle and or humanaphone, I.E. \"nose flute\"  (I do a \"one man band\" act sometimes...)", "id": 354}, {"review": "I bought this mostly for the case and to have a few backup harps kicking around if I need them.Some of the harps are out of tune slightly, not a big deal, especially considering what all you get here...This is an alright set for a beginner, and a good cheap backup set for a more advanced harp blower.I'll use the case for my higher end Hohners as needed.", "id": 693}, {"review": "I've owned two of these pedals and they both  had the same quirk. The delay is amazing, the repeats trail and decay beautifully,The controls give you a wide range of tones...But, They've both randomly gone into a feedback loop on me!  One constant high pitched screeching tone!My signal chain was low gain, And its done it when it was the only pedal In the chain, so It's not  another pedals Influence... I love the sound, but, I won't use it live in case of feedback...That being said its still a very good pedal.", "id": 716}, {"review": "This is the pick I learned to play with.Great feel, doesn't slip in sweaty fingers.Good tone, you can get plenty of use from one pick, as they hold up very well!", "id": 61}]