[{"review": "It is a good pedal, but it just doesn't have the sound I was looking for. It is great for playing funk music, but for us metal heads, the wah is just too weak. For metal artists, I would recommend looking elsewhere. I am going to look into getting an Ibanez Weeping Demon, or a Morley, or whatever it is Behringer is limping to the barn with these days.", "id": 41}, {"review": "When I first got them, I thought that they were going to be cheap, as they felt extremely light and came in the cheap packaging, but it was ok, I wasn't expecting much from them. The picks were actually made from extremely sturdy material. They did not bend at all when I tried to (and believe, me I tried). Pick wearing is virtually non-existent, and I utilize Alt-Picking a lot in my practices. I actually learned my first sweep shred (D major) with these picks within a day of getting them.I highly recommend for the shred guitarist.My only complaint, is that pinch harmonics are kind of hard to do (becuase of the grip) but i got used to it rather quickly.IMPORTANT!!!You can get these in 24 packs at [...] for only $10!!! Free shipping as well!Sorry, Amazon, but that is just to good a deal to pass on...", "id": 66}, {"review": "I play Progressive and Thrash metal, and these strings hold out nicely. Tuned them down to A sharp (b flat?) and they sounded sweet. Back up to E (standard) and they provide nice full sounding tone.", "id": 97}, {"review": "Nice, holds picks better then my old one, and best of all... It comes with one free disintegrating pick! It is really awesome, all you have to do is alt-pick in 16th, and watch it dissapear before your very eyes! Lol, great product though.", "id": 167}, {"review": "This product works as advertised, but you should beware. These are RIGHT ANGLED, and they WILL NOT fit in a lot of pedals including the CRYBABY WAH.You have been warned!!!", "id": 192}, {"review": "It is OK, but it does not compare to the ergo holder.Which you may find here:Dunlop Ergo Pickholder.The main problem with this pickholder is that it is very difficult to get your pick out, and it is extremely fragile.", "id": 233}, {"review": "There are better tuners out there. Far better. This could be good, but it seems to me that all Korg products seem to think of Standard tuning as the only tuning out there, and they don't even tune it well to Standard (especially when tuning the G string)! I personally play exclusively in Standard for my electric playing, but sometimes I want to fiddle around with open-tunings on an acoustic. This piece-of-junk makes it incredibly difficult to tune to any tuning using \"F\" or \"C\" notes. I have no clue as to why that is, pretty stupid if you ask me, especially once you consider that majority of this generations guitarists are metal heads playing in drop c tuning or acoustic d-bags (I say that with love) that play in open tunings. Trust me, your money is best spent elsewhere.", "id": 331}, {"review": "I wanted to dismiss the critics and try it out for myself. I wanted to like it, but unfortunately, it just isn't my thing. I played it all but 2 weeks until I got bored and stopped. It now sits on my amp collecting dust. I pick it up occasionally, but I always end up putting it back down shortly after. I am sorry, I just can't dig it... :(Edit: So apparently, a lot of people dislike my review and are insulting me in the comments section of this post. Normally, I'd just laugh at these no-lifers, but I am sick of getting constant e-mails from internet tough guys, so I'd like to formally state  that this is not a bad product. It can be fun, but the effects it gives are not worth $100, and its build quality is not worth $100. Like I said in the original post, I became bored of this item roughly two weeks after purchase and this has not changed. The last time I picked it up was to harvest the battery for the blackout  active pickups on my schecter. Its not that I \"didn't know how to use it\" like one of the morons in the comments section stated, this product requires very little skill to use. Read the manual if you are having trouble, it explains in great detail the techniques you can utilize with this device.Would I recommend it? If you have a hundred bucks to drop, go for it. If not, your money is best spent elsewhere.", "id": 401}]