[{"review": "This product is a must.  Why?..... because it makes strap install and removal so simple and reliable,...and when the strap is clipped into place it is secure.  I've owned numerous Straplok systems on the various bass guitars I've owned, and would not ever own an instrument without installing this system.", "id": 44}, {"review": "Up until a few years ago I had been using the same old brand I'd been buying for 20 years.  Then, I tried this recipe... Dunlop 65.  It is wonderful.  It does everything the product description tells you about.  Excellent cleaner on both wood (painted and natural) and metal.  I use it to clean not only the body, but the tuning heads and bridge on my bass guitar.  No nasty residue build up over time.  It cleans and polishes just like it was designed to do, without streaking and so on.  You'll like this stuff better than anything you've used to date....or at least I think so.  I sure do.", "id": 351}, {"review": "My bass-playing has gone on for 50 years,...and during the time I've tried lots of strings on my many bass guitars.  I know from that experience how the quality and construction of strings has improved over the decades.This set of D'Addario chromes is remarkable.  It's a flat wound string with all the smoothness and quiet character found in that string type.  In this set, I especially like the 4th string at .100&#34; dia. This set, by its design, gives a very strong and powerful signal to the amp,...and therefore makes even my Schecter Diamond Series 4-string sound largely like the early P-bass with bottom to spare.  There's a 'however'.... and this is it,....this string is NOT muddy sounding like many flat wounds.  Clean, bold, and full of smooth overtones that work well.  I really like them.  The price is fair, and we'll see what kind of life they exhibit, as I don't want to be spending lots of hard-to-find cash on new strings at a frequency that is aggravating.Don P.", "id": 407}, {"review": "Nothing makes a customer more mad than to buy something that just doesn't work.  Well,....that's not the case here.  This power supply is well made (durable) and performs to the specs supplied.  I guess a person can take the risk of buying a variable output adaptor with the proper power pin configuration,...but why go to all that trouble?  This product lives up to it's calling.  Besides, who wants to keep changing batteries in the Stobe Tuner (Planet Waves) when this power adaptor is easy to plug in and forget.  I gave it a 5-star rating because the price is fair, the product is well made and works, and it was shipped well within the promised time.  By today's standards, that's as good as it gets.DP", "id": 521}, {"review": "Here's what you'll need to know about this product if you're interested in getting one.....1.  The 'head' accommodates multiple tuning peg sizes due to the slot config.  That's a good thing.2.  The trigger is a rocker switch..... so you can wind and unwind,....quickly.  That's a good thing, for the most part.3.  It is not variable speed.  One speed.  FAST RPM!  It takes some practice and patience.  Nothing special, just the will to get used to it.  Initially, and until you get used to it, you'll have the head jumping off the peg.  Don't 'fret' (bad pun)... a few minutes of rehearsal with it and you'll get to like it.  I've opted to pull the trigger in short bursts so as to refrain from having a string change remind you of a NASCAR tire change in the pit.... and especially because when you get close to the desired tension you need to go slowly so as not to over-run it.I would have much preferred a device that has a two-position switch.... 'slow' and 'fast' position on the trigger for more control.  I've rated it 4-stars, not 5, not because there is anything 'wrong' with it or that it doesn't work.  It does all that the advertisements say it will.  It's the aspect of the device I had to find out the hard way that keeps me from giving it a 'perfect' score.All in all, be patient and all will be well.  Realistically, I don't need to change a set of strings in just a couple of minutes.... I've got hours if I chose to.  I suspect most folks are in the same position.  If you're a 'roadie' for a big group, I could see the need,...the need for speed. But, alas, I'm not.  So, like some of the other things I've purchased along the way, I now have a new toy.  I works.  I'm satisfied...... for now.DP", "id": 522}, {"review": "In my house, I don't have to play quietly when rehearsing.... but when I really want to play along with a song and put some 'volume' to it, I can do it now without even a concern for our dogs, the neighbors, or my wife.  This device, as the product description tells you, allows you to plug it into your bass, plug your earbuds or headphones into it, set the volume and gain controls to suit, and play away in complete quiet to the rest of the world.  In addition, and this is the best part, there's a 1/8&#34; jack on this device that allows you to plug an mp3 player into it so you can play along with music of your choice.  I rehearse often with this thing.  You might think negatively about this device considering the fact that you can't control all the tone parameters like you can when rehearsing through your bass amp.  That's true.  But, the big thing is being able to use it for what it was designed for and all the ways it makes rehearsing simpler (less equipment-complicated) and quiet when necessary (lots of households have that need for quiet that don't always blend well with your rehearsal schedule, etc).  I paid $50 for it, and it works great,...worth the money for certain.", "id": 547}, {"review": "The cable is great material, the 90's with boots are just right and have a lot of strength for durability.  Price is right for sure.", "id": 578}, {"review": "I'm not on tour with any group.  I play for church, and every couple of weeks for a local nursing home (with other musicians willing to give their time) plus an occasional 'gig' for a town celebration or some such activity.  I've got a few sound effects pedals and processors I like using, but not enough to warrant buying your typical pedal board that holds 6 or more such devices and takes up a lot of trunk space in the car.  This 'mini' PedalTrain easily holds four of my favorite devices, it is built for extreme durability without being too heavy, etc.  The case is awesome, too.... heavy duty,...good stuff.  The board came with velcro, tie wraps, power head, etc to mount and use your devices.  I had it up and running in a few minutes,...and it makes my travel-and-play experiences easy, without looking for a 'roadie' to get help.  The angle of the mounting surface of the board relative to floor surface is perfect.  Clearances for passing the wiring through from device to device is also perfect.  Since I first got it, I've 'rearranged' once already.  Talk about easy.  You'll be glad to have your sound effects mounted, wired, and movable as a unit so as to reduce setup time and the wear/tear on wires from just handling.", "id": 588}, {"review": "As a musician for over four decades I've owned a number of tuners as the technology progressed.  My primary instrument is electric bass.  This is the finest piece of equipment I've ever purchased and used, and it has helped me solve a 'mysterious' tuning phenomenon all players apparently face without knowing it.  I'll explain.  But first, some details about the tuner....:  it's construction is extremely solid, and it's heft gives it stability.  When you place it on a surface (top of your amp, floor, your knee.... it stays there!).  Secondly, the large backlit display is very easy to read in all lighting conditions,...no guessing.  And thirdly, it is extremely sensitive and accurate, which brings me to my explanation of the 'mysterious tuning phenomenon.  At issue is the inability of inexpensive tuners to properly identify frequencies/tones when setting string intonation at the octave fret.  I've been using $25 to $40 tuners (Boss, Korg, etc) over the past few years that would indicate a string is in tune, both for open string and octave.  But, when simultaneously plucking an 'F' note on the 'A' string, and an 'F' note high up on the 'G' string my ear would percieve that they just weren't in tune....the cycles weren't matching.  So, that meant my inexpensive tuner wasn't nearly discriminating enough.  Once I began using this strobe tuner, it clearly showed me (with proper accuracy) graphically what my ear was trying to tell me.  After setting intonation according to the strobe tuner my bass now 'performs' as it should through the range of notes/frets over the length of the neck.  I guess another way of explaining it would be to say that it's like having a GPS that is accurate enough to get you to the right neighborhood, versus one that can get you to the right house.  For the money, I feel I've done myself a good turn by purchasing this strobe tuner.  I'm satisfied.  I still keep one of my inexpensive tuners in my guitar case as it has a built in microphone and can be used by an accoustic guitar player if I'm jamming with somebody.  This strobe tuner is 'cable input' only....no mic, runs on a 9v battery with connectors for a power supply (sold separately).  My only 'complaint' with this device is the battery connector.  It's the typical type that 'plugs' in to the top of your 9v battery with two wires leading to the internals.  I hate them as a rule.  I would prefer solid contact points and a compartment where you would simply insert the battery, just like inserting any other battery type (AA, AAA, C, etc).", "id": 651}, {"review": "I play bass,...and have for 40 years.  One thing I've come to like a lot about playing music on my instrument is the development of various kinds of sound effects, effects pedals, etc.  Laying down a 'track' or musical run of notes, then building another one over the top of that, and then another, and another once was only able to be done in a studio.  Now, with my Boss RC-3, I can do it any time I want.  In rehearsal it is absolutely wonderful... I can get a couple of rhythm lines going, then have the ability to begin developing a bass lead line to suit,...or play along to develop my 'chops',...whatever is warranted.  This pedal, like other Boss pedals I've purchased, is made to last longer than you (kind of kidding), the electronics have been engineered with nothing but precision and control, and the pedal will do all the manual says it will.  Best bet, watch a few YouTube videos showing its use by a number of musicians.  That helps you understand a lot,...then like me you can buy one and it will bring you playing pleasure for certain.", "id": 739}, {"review": "Finally, a winder that has features and durability designed into it.  The pocket of the winder head appears to be large enough to handle any tuning peg head size and the molded plastic body appears to be thick enough to stand up to a lot of use.  The pivot point doesn't bind when using the winder as has a couple other cheaper models I've purchased (and thrown away) over the years.  The string cutter is a great feature and appreciated, works well regardless of string composition type,...stainless, chromes, core-types, etc.  The price seems fair enough.  I've seen a couple of battery powered models for not much more money, but if you're in that big a hurry to change strings you're living life too fast...... get a 'roadie' to do it for you.... why have to remember to carry spare batteries.", "id": 94}, {"review": "I bought a pedal board and needed power and wires.  Bought this kit.  It is just super.  The 'One Spot' provides the power needed, the wiring is just right for the pedals I've installed.  This is a great set,....all you'll need to get your pedal train wired and running.", "id": 428}]