[{"review": "While the case is made of plastic, the construction is solid and seems very durable. My disappointment is with the sound. I never could dial in a sound that made me feel like it enhanced the sound of my bass. It was just different. I've switched to using the built-in compressor in my Digitech BP90 instead.", "id": 645}, {"review": "First of all, this is a $40 7-guitar stand. It's not a high-end $200 pro stand. That being said, the materials are decent. It seems strong and stable. I would not recommend it if you plan on using it to move from gig to gig. I bought it to have a convenient place to keep our 5 guitars and basses handy. Rather than having 5 individual stands, this stand is perfect for keeping our living room neat.The metal is decent, but if you tighten the screws too much, the metal does flex/warp.So far so good.", "id": 769}, {"review": "VERY VERY loud electric guitar amp! As a bass player, I was shocked that 40W could be that loud for guitar. I can't raise the volume above 1 in my house. When you switch it to acoustic or bass mode, the volume decreases dramatically, but it is a great amp for guitar players who also play bass occasionally.Excellent top quality features. Beautiful sound for each of the different modes. The acoustic setting really made my cheap electric guitar SOUND like it was an actual acoustic. The amp simulation is top notch.Awesome value for the price!Edit: I've played through it more as a bass amp and after turning some dials and trying out the different settings....I'm even MORE impressed. One of the reasons the volume for bass was so much lower was that the default gain is at zero. I brought the pre and post gain up to a reasonable level and BOOM....huge sound. I play with a 18 piece dance band and usually bring my Hartke kickback for that group. After experimenting more, I would not hesitate to use the Peavey for rehearsals and performances with that band.I still can't get over the fact that it is a 40W amp. The sound is enormous and clean for that much wattage.", "id": 872}, {"review": "Very nice quality. I've removed 1 star because of the 1/4 casing. The sheath likes to twist off a little too easily. I used plumbers thread tape and tightened it right up. Other than that. I've been using this cable regularly for a while and it works great.", "id": 876}, {"review": "This the second set of strap locks that I've owned. They are a little difficult to attach to the strap if the thickness of the strap is a bit on the thicker side. The quick release and secure connection are great.", "id": 44}, {"review": "I've owned several inexpensive Korg lcd tuners over the years. Like all of the others, this one is excellent, reliable and durable. I keep this one on my bass guitar gig bag to tune up before and during gigs.", "id": 330}]