[{"review": "I replaced the Schaller strap locks on my Strat with these. The Schaller ones ground on the connecting hardware to the point where I had to oil them a few times a month or I'd end up with an audible creak.Hands-down I like the Dunlop ones more. They installed in just a few minutes and the guitar feels very secure. No problems whatsoever. I just ordered my third set a few minutes ago.I'm a total convert - every new guitar I get is going to get a set of these put on it.", "id": 44}, {"review": "I bought these and used them for a week before giving my review.If Amazon used half-stars, I would have given them 3.5/5. I just couldn't bring myself to give them a 4/5 so I went with 3/5, here's why:I've used standard medium picks for over 20 years. Switching to these was not a problem at all. Sure, they are smaller but not small enough to cause me any problems. By far the biggest change was the &#34;pointy-ness&#34; of the picks. The distinct point on the pick drastically changes the sound of your playing, especially when playing chords. Everything is much more pronounced, which isn't necessarily a good thing in my opinion. It's especially bad when playing clean electric (picking notes or strumming).If someone was to ask me if these are good picks, my answer would be &#34;it depends.&#34; It really does, in my opinion, it depends on what you're playing. From a rhythm standpoint, I don't like these at all - they take the warmth out of the chords because the point of the pick makes strummed chords sound too sterile to me. For lead work they are OK because you can really dig into each note and have it come through.Could I play faster with them? No. Could I pull off amazing licks that I couldn't do with my normal picks? No.I tried them, but didn't like them. Maybe if you typically play a TON of lead work, constantly, these would be the way to go. I don't, and they aren't for me. I'm glad I tried them, though, because I'll never wonder again if they were for me.", "id": 68}, {"review": "To me, the stock 12\" speaker that came with my Fender Blues Deluxe Reissue sounded too brittle. Even if I messed with the presence and EQ knobs it just always accentuated the highs too much for me. I had read reviews on this speaker and decided to pull the trigger and get one. I haven't regretted the purchase.I was hoping the improvement would be the same as when I put a 10\" Ragin Cagin in my Fender Super Champ XD. Wasn't the case. It DID, however, fix the problem I purchased the speaker for. My Blues Deluxe now sounds warmer to me and doesn't have that accentuated high-end that it did before. All in all it was a good upgrade and I'd do it again.~Slick", "id": 276}, {"review": "Simply put, this speaker turned my Super Champ XD into a killer 15watt amp. Gave the amp more low-end and made everything much clearer. I would, and do, recommend this speaker to anyone wanting to upgrade their Super Champ sound. And, like other people have said, the speaker is much louder on the same volume setting. I had to turn the amp down two notches (two number) to have the same volume level out of the amp.If my Super Champ was stolen, I'd buy a new one and put this speaker in it. Wouldn't even think twice about it.", "id": 287}, {"review": "The low-E tuner on my 1985 LP Standard broke about a week ago - the back came off and the tuning handle popped out. I never liked the ones that were on it but I didn't want to drop the $$$ unless I needed to. I came across these Grovers. They had good reviews and the price was right.Took me about 30 minutes to replace all the tuners and re-string the guitar. The tuners fit perfectly with no modification whatsoever. They also feel more sturdy than the ones I just replaced. It's hard to say if they keep a tune better at this point as I haven't had them on for long enough - they *seem* better, though, as the B string with the old tuners used to always go flat quickly.I decided to use the old screws instead of the new ones that shipped with these Grovers - they fit better (i.e. tighter). Nothing wrong with the new screws, I just like my stuff to be snug. :)I like them and glad I purchased them - so far.", "id": 420}, {"review": "I have purchased six of these over the last couple years. Why? Because they work. They mount securely into the drywall and lock the guitar into place. I don't think I'd ever buy any other device to hang a guitar on my wall. They feel rock-solid too.I highly recommend and will be buying more in the future.I gave it 4/5 stars because I haven't used any other devices like these before - maybe there is something better, but I haven't seen it yet.~Slick", "id": 289}, {"review": "The software itself (sound/interface): 4.5 starsThe installation and activation: 2 starsPROS:1) The drums included in EZ Drummer are the most realistic \"computer drums\" I have ever heard. I'm using them on my latest song and have gotten nothing but compliments on how they sound.2) All sounds are MIDI, which means you can manipulate how you see fit. I use EZ Drummer with MixCraft and have modified pretty much every beat I have used so far with the built-in MIDI editing capabilities.3) The interface is clean an easy to use. You just drag a beat from the EZ Drummer window into your DAW.CONS:When I was reading reviews I just thought the people complaining about the install/activation were being wusses. I mean seriously, how hard can it be? Well, they were right, it sucks. It took me two hours to get it all working.My advice: Don't even install the app from the included disc. Instead, just go create yourself an account at toontrack.com and download the most up-to-date version and ALL the patches for the modules that come with it.My experience:1) Try to install from disc. Fails with a 1308.2) Google'd the problem. Found out I needed to get a toontrack.com account and download the installer from there.3) Downloaded the ~650 MB ZIPPED installer. Then, I had to unzip the 18,000 files, which took about 20 minutes on my PC.4) I was finally able to install it and then had to download three other updates to the modules within the install.5) Then I had to jump through one final hoop to active it (take this key copy it here, then copy this here, stand on your head, etc..).Great software, horrible install.~Slick", "id": 385}]