[{"review": "The listing for this item can be confusing if you are not sure what stereo XLR is.  Stereo XLR is meant to be similar to your stereo headphones, where left and right are separate unbalanced wires.  This cable is configured to be a stereo unbalanced XLR to a stereo unbalanced TRS cable.  This item is not a mono balanced XLR to a stereo unbalanced mic cable.A little bit a soldering can fix this connector by moving the red wire from ping #3 to pin #2 with the white wire.  Pin #3 then ties to pin #1 with the ground wire.", "id": 8}, {"review": "This mixer has four mic inputs. It has some fun effects. This mixer comes with a 80Hz filter and a 3-band equalizer on the mic channels. It has a FX-send that can be used as a mono output if you only need mono. I do not hear any external noise. It has a durable metalic case.  This mixer has great audio.", "id": 370}, {"review": "These microphones are great for recording vocals.  They pick up local sounds better than they pick up distance sounds.  They do not have any detectable noise or issues.  Depending on your situation, you may need to have a external pop-filter or windscreen, however, these microphones contain an internal windscreen.", "id": 405}, {"review": "These cables are great in microphone or DI-box applications.  They are clean of any electrical noise.  Having color coded cables are also good too.", "id": 424}, {"review": "This cable is great for XLR microphones or DI-boxes.  They are clean of any electrical noise and appear to be good quality.", "id": 465}, {"review": "This product has a mono-microphone input and a stereo headphone output.  It is meant for connecting a headset to a USB port.  Since the headset has a mono-microphone, this adapter works great.  The drivers automatically install on microsoft operating systems.  This product is great for using a soft-phone or other communications program.  The windows systems remembers volume settings each time it is connected.  I imagine that you could use something other than a headset with this, but it was mainly built for a headset.  Works seemless and great with a headset.", "id": 569}, {"review": "This device is a converter that works with RCA inputs and outputs.  The Input seems to be geared for the -10DB range for consumer level audio range.  This box also has the ability to monitor the input directly with headphones.", "id": 597}, {"review": "This passive DI-box is a great little tool that provides attenuation to interface a line or instrument output with a balanced microphone input.  Some notes on this box are that the 0db attenuation still has some attenuation.  The -20db attenuation sounded funny, but that is probably because I used the same equipment for all attenuation settings.  With each attenuation setting, I had to adjust the input volume accordingly.  This device also a some ground lift switch that can prevent ground loops.  All the devices that I tried this with did not have their own internal grounding, so I needed to have the ground come from the mixer.  I did get some hum when I would touch the case, just like I did with other DI-boxes.  This product worked very well for my needs.", "id": 606}, {"review": "These cables are good XLR noise-free cables.  With these cables, I am able to get good sound out of the behringer XM1800S microphones.", "id": 426}, {"review": "This microphone stand it a fairly good buy.  Because it is a light and portable stand, it is not built to be fully extended with microphones, such as the Behringer XM1800S.  Adding a counter weight maybe needed if you have a heavier condenser microphone.  I found that I needed to line up one of the legs directly under the boom when it was fully extended.  As it stands, I would suggest this as a fairly good deal.", "id": 815}]