[{"review": "I think Tortex / Delrin picks are the standard that others are judged by.Durable, good to gripping surface, easy to identify thicknesses by color.The only way I can think of to improve these would be to replace the black ink logo and script with some sort of raised embossing.Then your fingers will not smudge and the grip would be even better.Take a look at \"Cactus Picks\" to get an idea of what I mean.", "id": 61}, {"review": "Some say \"daw-dare-e-o\", \"de-ah-dare-e-o\", \"dad-ar-ee-oh\", or \"dee-ah-dare-e-o\"Others shorten it to \"D-adds\" or even \"Daddy-O's\".  Took me a while to figure that last one out.I was trying to find out info about \"Daddy-O strings\" and why people thought they were so great.  Duh.While people may disagree on how to say the name, few debate the idea that these are great strings.* Less expensive that most string sets out there, especially if you buy multi-packs* Color-coded to make string changes easy* Easy to find from most any vendor or music store* Made in the USA* You can collect \"players points\" for SWAG* They are sealed in a special \"environmentally friendly\" package to keep them fresh and corrosion-free* They have one of the widest range of string-size combinations availableIf you are just starting out and do not know what to put on your new guitar then the phrase \"set it up with EXL-120s\" or \"put on some Da-Dairy-O\" nines\" is a good choice, at least for a strat or tele-like guitar.I personally like them better than Ernie Ball Super Slinkys aka \"EB Pinks\", but I cannot quite put my finger on \"why\".You can pay more for coated strings, cryogenic frozen strings, boutique strings, and all that but if you do not know what any of those are then you probably haven't been playing long enough to find value in them.Almost every guitarist has a set of strings they \"swear by\" because they work wonders that no other string can - they make them play smoother or faster, their last set of strings lasted for 6 years, or whatever.I just appreciate a great value, and D'Addario strings are just that.BTW, for the record the official pronunciation is \"Da-Dairy-O\":>> \"We receive letters each week regarding the correct pronunciation of the D'Addario name. Some years back, we even ran an ad that illustrated an easy way to pronounce the D'Addario name. The name is pronounced phonetically as follows: Da-Dairy-O. A simple way to pronounce the most difficult name in musical accessories!\"", "id": 156}, {"review": "I just had a guitar setup with DR Pure Blues 9's and they sound pretty good but they are a bit stiff.I've also noticed a bit of what I must presume is the nickel coating seems to come off on my fingertips after practicing for an hour or so.It almost looks like graphite on my fingers but it is nowhere near as \"black\" as the oxidation I've seen from low-quality strings.They also seem to have more \"string squeak\" when changing chords than other brands - even after generously spritzing them withFingerease Guitar String LubricantI am not qualified to say if they truly give you that \"vintage tone\" but they do sound decent.However, for $6 I would rather getDean Markley Blue Steel LT 2552 Electric Guitar Strings (.009-.042)or save some money and go withD'Addario EXL120 Electric Guitar Strings, Super Light, 9-42.EvenErnie Ball Super Slinky String Set (9 - 42)seem to feel better to me, but I am a Da-Dairy-O man, for now.", "id": 205}, {"review": "My Seagull Entourage Rustic fits very snug (I think that is a good thing, not certain) in the case which has a nice faux fur lining and seems well made.I was considering theSeagull Dreadnought Casebut there were no useful pictures or details on the item. I decided to try the Guardian and save a few bucks.Seems like I made a good choice.", "id": 320}, {"review": "Black Tortex picks with silver lettering.The Jazz picks are about 25% smaller than standard Tortex picks and have a more pronounced point.", "id": 341}, {"review": "I've tried pretty much every harp out there, after having played the regional blues & jazz circuit for about 10 years.  Lee Oskar harps are the best value.On top of it, Lee Oskar actually called me once just because I left a question on his website!I've met Rick Epping (of Hohner harmonicas) at NAMM -great guy- but he never called me at 3:30 in the afternoon just because I could not identify a song I thought he was playing on!I carry around between 10 or 12 harps to a gig, so that is at least $290 for a set of Lee Oksar harps.10 Suzuki Manji harps, while nice and the phosphor bronze reeds are great, would cost nearly $480 - presuming you could find them.I will not say I've never blown a reed on a LO, but I will say that $22 for a new set of LO reed plates beats $48 for a new Manji, at least in my book.On top of it, all they really did with the Manji is discontinue the \"Bushman Delta Frost\" harmonicas and rename them so they could double the price.Lee Oskar harmonicas are inexpensive, they are simple and cheap to repair, easy to play, have great tone, and are even easy to identify since the 1st & 2nd position keys are printed right on the comb.  That feature is great for beginners who might not be able to keep them straight yet.Give them a shot.", "id": 421}, {"review": "I bought this intending to use it on my Seagull acoustic but tonight I put it on my Squier Fat Strat instead. after getting tired of how raw the existing polypropylene strap -which was about the same price just because it had \"Fender\" embroidered on it- was making my neck.When I put this on the electric the difference was immediately noticable even though my neck was still sore from the cheap strap.  So I decided to sign in and write this review.This strap is softer and better made than the poly ones.It even comes with a string tie for your acoustic, which you might need.Consider taking my advice: Treat yourself.$15 for a strap -when guitars cost hundreds (if not thousands) of dollars- is not much.Besides, the cotton and suede will not scratch your axe...The only downside is that the strap ends are pretty thick and is very snug on my pegs.I use c-type snap-on strap locks but they will no longer fit.Maybe I'll see if the venerable Grolsch strap locks will work.You can spend more to get wider straps with more padding if you want but do not bother getting something cheaper unless a strap of at least this quality is on sale.Update: Too snug for Grolsch strap locks on the Squier also...", "id": 479}, {"review": "The description says it all but I was still wondering if I made the right choice because I was comparing the \"Fender Accessories 099-0502-000 Guitar Tools\" -what the heck kind of name is that anyway?!- with NO reviews to theJim Dunlop NC65  Formula 65 Neck Cradle Maintenance Stationthat had some pretty good reviews.Well, I cannot speak for the Dunlop but I can say that this kit is light weight, self-contained, has storage space in it, and it works if the guitar is face-up or face down.It also has pad to keep your guitar from sliding - and the pad keeps the neck rest in place so it does not topple over!  I do not see anything like that mentioned in the Dunlop NC65.On top of it, I think the neck rest & pad inGuitar Setup & Maintenance - Instructional Guitar DVD With Denny Rauenis this one turned over so the \"Fender\" logo is not showing...", "id": 571}, {"review": "Nicely made and a good value but it seems to be a bit stiff right now.It is a single strip of leather with no padding.Maybe it just needs to be broken in.Compliments the color on my Lake Placid blue strat well.For the record, this strap is actually quite long - even in the second strap hole.I am about 5'9\" and a trim 155 lbs.At the shortest setting I can manage, the strap is too long to keep the heastock up effectively when I am sitting.Update 2011-Jul-31: The strap is still rather stiff.I will probably pick up a white cotton strap.Those fit well and can be resized a lot more efficiently, in my opinion.", "id": 661}, {"review": "For about $8 you get a string winder, string cutter and an acoustic peg remover all-in-one.What more can you ask for?Mine shows no sign of wear or defects after about a year of use.I have nice wire cutters, etc (I'm an EE) but it is much easier to grab one tool instead of two or three.As for quality, it has an unconditional guarantee, see above.Planet Waves -aka D'Addario- is a well-known name in guitar accessories.To the reviewers complaining about the tool breaking, try using your warranty instead of whining.No manufacturer has a perfect run forever, but at least in this case you have not wasted your money.For the record, I do not work for D'Addario / Planet Waves - but I would not dismiss a job off-hand if they offered it  ;-)", "id": 94}]