[{"review": "I have used these strings since they first came out. D'Addario make the best strings out there. I am sure there are others who do a good job, but you can actually hear the difference. It doesn't really matter which you buy - they all sound different - as in better!!", "id": 156}, {"review": "isn't it sad when somebody produces a great product but screws up on the description? The product is great value for money and worth while buying, if for no other reason than save money on overpriced DC power units from the manufacturers of the pedal units. Trouble is that they do not say whether or not the cables come with the unit. They don't!! Dumb of them, as all they needed to say  was you needed to buy them separately, which I later did. Seems like nit picking? Well, it's not as live abroad and these things take a long while to come down to me. Sloppy isn't it?", "id": 191}, {"review": "I guess the term toppy describes the sampling range, which picks up the higher notes. If you want to get the right effect, this is a good choice. For those of us, who find acoustic guitars difficult to play, this is solution. Personally I have a lazy blues style and my attempts to play acoustic guitars, too often feels like I am using a manual typewriter. This product does what it says on the box, but sounds better using hum bucker pickups, or if you play a strat, it sounds very good on the middle or neck pickup. Don't use the bridge pickup, as it doesn't sound too good.", "id": 411}, {"review": "This is the cheapest and most effective way of saving a lot of money in wasted 9v batteries that will always run out on a gig, rather than when it doesn't matter. Linked to the power supply - which is still cheaper than any of the 9v ones supplied by the manufacturer.", "id": 486}, {"review": "Been ;'golding up' an 88 Strat Plus that has seen better days. Wiith the gold pick guard, tuning pegs, and jack plate - it looks like a custom shop job. This finished my hard work and I am delighted with the appearance. The goods are up to scratch and fit properly. Good service, product, packing and delivery time. Recommend them.", "id": 622}, {"review": "Never used this seller or site for this purpose before. Sat and went through everything and chose these strap locks. They fit perfectly  and I have used them on Strat, and a Levinson Blade, not forgeting my Ibenez. Easy, on time delivery, no hassle with either the quality or service. This seller is worth supporting. Thanks!!", "id": 682}, {"review": "The last amplifier I purchased was a Fender Twin valve some years ago. It is difficult to use in a small apartment - too loud!! So, after giving up trying to use this with the volume at '1', I searched for a smaller thing. This amp looked suspiciously cheap and, although the reviews were great, still was concerned whether it would be good enough. It arrived and I got into realizing it went on the web for downloading presets and all kinds of features, including recording. This was really a mind blowing thing. The built in sounds and effects are better than many of my effect pedals, and I no longer use my Zoom. Setting it emulate a twin reverb, with the effects used lightly, I am amazed at both the quality of this 'practise amp' and recommend this to anybody who wants a huge bang for their buck!!!", "id": 718}, {"review": "You may have experienced the problems of musicians. The drummer is drunk and the rhythm guitar is late. But you need to rehearse. This gets the job done, you can lay down rhythm lines and drum lines and get the sound you want. The thing to remember is that whatever effect you are using for the lead, will kick in on any recording playback as they use the same input jack. Otherwise, easy and a great product. The best is, that if you are playing really poor lead work, nobody can hear but you! lol.", "id": 739}]