[{"review": "Be careful about using capos like this, because if you're using a fine guitar, it may damage the finish.  Try it, and double check regularly, and I wouldn't leave it clamped on the guitar, overnight or for weeks on the guitar stand.", "id": 116}, {"review": "See my previous evaluation on a similar product.  It is all a matter of how large you want to chord chart to be.", "id": 361}, {"review": "Plugged it in and it powered my Rode NT2 condenser mic.  I was delighted.", "id": 485}, {"review": "I reshape my own pics on my grinder, and use nothing but heavy picks,  There are just guitar picks.  They are what you order.  I fix mine up by adding stair tread floor stuff, so they don't slip out of my hand.", "id": 574}, {"review": "I thought I was getting something that would boost/amplify the signal from my bass to the amp.  It didn't, but at it's cheap price it wasn't bad and I found other uses for it.  They make ones that will boost the signal, so if that's what you're looking for, be a careful consumer.", "id": 606}, {"review": "I initially had a black colored one, because I thought that would be more &#34;cool.&#34;  But I lost it.  So now I get brighter colored ones.  Gripe: a rubber thingy on the bottom of the clip came off while performing, and I have not been able to find it.  It still works, but that's a design flaw.  Also, don't leave it attached to any fine guitar, because it, like capos, can permanently damage the finish of  a really fine guitar.  but it works well, and the batteries seem to last.", "id": 706}, {"review": "As a musician I'm in search of many perfect things including the perfect tuner.  I got the package of two.  Unfortunately, the first one died a quick and sudden death.  A new battery didn't resurrect it.  I couldn't find the other one, because they're small and black.  I finally did find it, and have used it several weeks on my Guild Acoustic, and it works nicely so far. In fact, it works really nice.  If you are concerned about stage appearance, this is virtually invisible to anyone watching or videotaping the gig, a plus because it's pretty small but big enough to read.  At the cheap price, it wasn't worth my time to try returning the first one.  I just decided to eat the loss.  I'm crossing my  fingers hoping this one will last.  If you are playing a really nice, (collectible) guitar, be cautious because these tuners, (and capos too,) can damage the finish permanently. I use a tuner on my Gibson Johnny Smith while I play but always take it off when I'm done playing.", "id": 785}, {"review": "Good price.  I'm a little concerned because when I first set it up, the screen drooped down. The flex-shaft arm did not seem strong enough to support the screen in any position.  I was able to move it around, and it's working at the moment, so I'll still rate it okay, but I have concerns over the long run.", "id": 842}, {"review": "My musician friends notice, and wish they had one. As a flute player, I whet my whistle so to speak a few times during a performance, and this keeps my water bottle near by.  The cup is flexible enough to handle different diameters of cups.  I imagine it would hold beer too.", "id": 530}]