[{"review": "Works smoothly, built like a tank and looks good as well. I've tried other passive volume pedals that didn't work...this one works. Worth every penny.", "id": 187}, {"review": "I actually wasn't aware of this gauge of string until I purchased a guitar from the great George Lynch. The strings felt different than the 9s I use on my Fenders and the 10s I use on my Gibsons. So the next time I saw George, I asked him what strings he put on that guitar and he told me D'Addario 9.5s. I love them on my Mr Scary Guitars Burnt Tiger and that is the only brand/gauge of string that I will ever put on that guitar! I definitely recommend trying out a set.", "id": 196}, {"review": "I recently purchased a used American Fender Strat that came with the old tweed case...nice case, but doesn't provide the protection that I need for my guitars. The Fender/SKB case is built like a tank and provides great protection and it has TSA locks for when you travel. A no-brainer for Fender guitars.", "id": 557}, {"review": "Easy to hold onto. I'm a big fan of the Dunlop picks and these are great for playing live because you simply won't drop them.", "id": 680}, {"review": "My newest amp (the Marshall JVM410 Joe Satriani) replaced the reverb with noise gates...a function I absolutely love. But then I needed a reverb pedal. Honestly, there are more expensive pedals out there, but this will do exactly what they do for a lot less money. Give it a try. I've been using it for a few weeks and I'm extremely happy with it.", "id": 699}, {"review": "Was a little hesitant to get a stomp pedal, especially a delay, for this price. But I figured, how can you go wrong...if it's not good, at least you're not out a lot of money. I've been thoroughly impressed with this pedal. Much more sturdy than it appears in photos. I actually like that the input and output jacks are at the front of it. Works great so far and don't regret purchasing...worth every dime...where else can you get a great-functioning delay pedal for this price?", "id": 716}, {"review": "Although it does exactly what it says...it will hold your items together (pedals to pedalboard)...it is significantly thicker than I expected which makes it difficult to use properly without covering the entire board. I purchased one strip and I will use it on my backup board, but I don't plan to purchase any more.", "id": 765}, {"review": "This system does not fail. Install it and you never have to worry about it again. Although it's a good idea to lube up bearings every once in a while. I put these on all of my guitars!", "id": 342}, {"review": "These locking tuners are perfect for any Strat or Tele. I have an American Strat and an American Tele that both came with fairly decent non-locking tuners. I also have a Carvin and two Paul Reed Smith guitars that came with locking tuners...they are certainly worth having. Fenders (at least American-made ones) are very easy to swap out tuners for these...the holes are already there, there's no need to drill holes for screws, everything is so easy you have to do it yourself. I've swapped out the tuners and have never looked back...the only question is what to do with the non-locking Fender tuners I have now!", "id": 387}]