[{"review": "Good length but very slippery.  I had my wife sew nice cotton fabric to the backside using white thread and it look better and doesn't slide around.  I took sandpaper to the lightning bolt for the more faded rugged look and it is actually a very rad strap that I have been commented on a few times now.  For the price, why not?  Be creative and make it original and it can be a very nice addition to a nice acoustic or electric.  As far as the base product, it has gone through a lot of use and is not showing any signs of wear.", "id": 79}, {"review": "I like to display my guitars while also keeping them safe.  I bought 2 of these and have had them for a year now and they have yet to let me down.  My daughter still gets to them and tries to pull them off but she has yet to succeed.  Very solid constriction. I like that they pivot so if my daughter pulls them to the left or the right, the piece moves with it and returns it back to balance once she is finished.  Excellent design.", "id": 166}, {"review": "Works perfectly with iphone and ipad.  The app that comes with it seems to be very sound and well designed.  My only complaint is that the product itself seems incredibly empty and fragile since there is no weight to it.  But it hasn't broke yet and it might never break.  Works perfectly with ear buds with mic/controller.  Great idea!", "id": 710}, {"review": "I have had this for quite some time now and the original battery is still going strong.  I use it maybe once a week and it tune easily and accurately on both my acoustic and electric.  Great design.  I cant see how they could improve this at all.", "id": 811}, {"review": "Dont be cheap.  take it to a guitar shop and ask for a full tuning for new guitars.  The low e buzzed pretty bad until i did that.  If you are doing more than just finger-picking, you might want to add pick-shield.  My wife used it for some naked newborn pics and the guitar got most of the compliments which I had very mixed feelings about.  If you play mostly standing, this is the guitar for you.  If you sit down, it slides out from your lap alot due to the curve of the back.  But it is loud and sounds very rich considering the price of the guitar.  Good structural integrity thus far.  My newborn is now 15 months and its is holding up nicely considering how many times she has gotten a hold of it.  I really should get a case.", "id": 296}]