[{"review": "I've been playing guitar for more than 20 years. I've played 6 strings, 12 strings, bass acoustics and electrics. When it comes to acoustic sound, these strings produce the brightest, clearest sound of any string I've ever used. Some strings have a \"bright\" sound and some have a clear, distinct tone - not muted or dull. Still, other strings have a rich, full resonance that carries through a room. This is the only string I've ever used that has all of those qualities. In fact, the first time I put these on my acoustic and went to lead worship at my church, several of the church members commented that my guitar sounded \"better than usual\" or \"really good\" that day. I've tried some other brands since I found these and always end up coming back to them.", "id": 130}, {"review": "I have been a faithful user of D'Addario strings since a well meaning obsession-starter recommended them to me at a local music store.  Compared to other brands of nickel strings that I've used, these ones just feel \"cleaner\" than the others. They have a clearer sound, and seem to hold their tune better than most.If you're looking for acoustic strings, you can't beat the phosphorus bronze for warmth and clarity.  But if you're looking for electrics that are reasonably priced and sound clean, look no further.", "id": 156}, {"review": "There's not a whole lot one can say about a guitar strap, but I'll try. This one is sturdy and adjusts more easily than some I've tried. It's fairy thick and the material doesn't slip around on your shoulder easily. Aesthetically, the woven print is abslutely beautiful. The photo cannot do it justice. The colors and rich and vibrant and the weave is tight, not chintzy or frayed. I'm very pleased with the product and the price.", "id": 286}, {"review": "After years of having a large, awkward tuner I was thrilled to learn about this modest little clip on. So much more discreet to do a little last minute tune up when you're already on the stage.I love that the lights are bright and easy to see, unlike one previous tuner I had that was very hard to read. Dark grey letters on a light grey screen. Even better is that the light colors are different for flat, sharp and on-tune which makes it even easier. May not seem like a big deal when you're tuning alone at your house, but when you're on a stage with other people doing a lot of last minute adjustments and your attention is all over the place, those little details really help.The only real drawback I see in the design is that there is no place on the head of my 6 string acoustic where I can conveniently clip this without it being somewhat in the way of the tuning knobs. Not impossible, but not terribly convenient, either. It was seemingly designed with an electric style in mind where the knobs are more often in one straight line than on either side of the guitar head.The $80 tuner I bought 20 years ago is a Sabine, and quite frankly, 20 years later it still works as well as it did when I bought it. In fact, the price has come down and I bought another one to keep in a different guitar case. Now that I have this one I still use the Sabine more at home, but like this one better on stage because it's low profile. Looks more professional and I like that.", "id": 785}, {"review": "I have tried so many brands of guitar strings in the past 20 years. I just keep coming back to these. The sound isn't quite as bright as the phosphorus bronze, but it is more of a acoustic guitar sound, anyway. These are clear, high quality and come sealed in tight plastic so the strings aren't exposed to air until you open them. Because of that little \"difference\" they do stay clean much longer than the brands simply wrapped in paper. I just can't think of a single complaint.", "id": 868}]