[{"review": "I'm an amateur sound tech. We've been using SM58 in our church for years now and our singers/song leaders liked it very much than the other mics that we've had before. Our singers are growing and we needed addtional mic so we thought of this Beta58A because of the good reviews. When I received it I cannot wait to test it myself and whoaaah.. For me, it sounded better than SM58. My songleaders have tested it and guess what... they dont want to use the SM58 anymore :)", "id": 23}, {"review": "I've tried different kinds of headphones in the past and so far the Bose AE2 fits my taste. I've been using it for years when my son borrowed it a month ago and I'm pretty sure he has no intention of giving it back :) (Its the 5th headphone he borrowed) so I planned to buy another one but I said to myself why not try something different. After reading all the reviews on this product I finally decided to go for it. And WOW...i was blown away. I'm glad I tried something else. No regrets. This one really fits my taste. The clarity is superb and the bass is awesome.", "id": 458}, {"review": "I bought this unit for my son's edrums and because of the inputs (RCA, Mic & Instruments). I plugged my guitar in channel 1, mic in 2 & his edrums on RCA and we're good to go. Not as loud as the 10\" or 12\" speakers of course but for small room this will do. Playing music on RCA channel is also nice but you will need to adjust the EQ to get a good highs and lows. Light weight and very portable.", "id": 654}, {"review": "I've been using GLS cable for years now and I never had a problem with it. They're good quality cable and will go a long way if you will take care of it.", "id": 701}, {"review": "I ordered this hard case for my Fender T bucket. It fits exactly like an original fender hard case. Looks like made of good materials. Very well built. With interior pocket to put your accesories like capo, string winder, etc. I Love it. For its PRIce and Quality,I giving it a 5 star :O)..", "id": 540}]