[{"review": "A very nice pick, both in feel and texture (the design is a bit boring, though). Only complaint is that it's fairly small - about the size of a Canadian or US five cent piece, where most of your typical guitar pick are bigger - about the size of a 25 cent piece. But that's okay. I got this the same time as I got a set of Dava Jazz Grip 9024 red picks and the Dunlop Max Grip Jazz III Carbon Fiber Guitar Picks, and I think I like the Dava picks the best. All three are &#34;tight grip&#34; picks, and all the same size - they're all good, though - I'd rate this one next-best, and the Jazz III Carbon Fiber next after that).", "id": 413}, {"review": "These picks are pretty cool, fairly stiff despite their thinness. They are also a bit pointier than regular picks, and the eye holes give it an interesting tactile quality. Nice to try something new, although they are a bit slippery.", "id": 477}, {"review": "A very nice pick, both in feel, texture and design. I picked it up and started strumming and immediately felt something different - something smoother and more comfortable, more natural. I'm very satisfied with this pick! There's a cheeky little message on the label, &#34;Warning: may improve your playing&#34; and that's no joke! Only complaint is that it's fairly small - about the size of a Canadian or US five cent piece, where most of your typical guitar pick are bigger - about the size of a 25 cent piece. But that's okay. I got this the same time as I got a set of Jim Dunlop 427P3 Dun Ultex Jazz III, the yellowish ones, and the Dunlop Max Grip Jazz III Carbon Fiber Guitar Picks, and I think I like this one the best. All three are &#34;tight grip&#34; picks, and all the same size, but I'd say that I like this one the best of the three (they're all good, though - I'd rate the 427P3 next-best, and the Jazz III Carbon Fiber next after that).One complaint - they sent mine in a bloody great big oversized padded envelope suitable for CDs. Kind of overkill, if you ask me, for only six picks, but I shouldn't complain - they arrived in great condition!!!", "id": 580}, {"review": "A very nice pick, both in feel and texture. Only complaint is that it's fairly small - about the size of a Canadian or US five cent piece, where most of your typical guitar pick are bigger - about the size of a 25 cent piece. But that's okay. I got this the same time as I got a set of Jim Dunlop 427P3 Dun Ultex Jazz III, the yellowish ones, and Dava Jazz Grip 9024 red picks, and I think I like the Dava picks the best. All three are &#34;tight grip&#34; picks, and all the same size, but they're all good. These picks have a great grip, though, and feel dry and gritty even when they're clean as a bone. Nice!", "id": 686}, {"review": "I should have read the reviews carefully - it's definitely something different, but not sturdy at all, rubber bits come off as you strum, and there are complaints of skid marks on strings and fingers. Ouch! I'm much happier with my Friday the 13th glow-in-the-dark picks - that is an experiment that worked!And who cares about hard pick sounds anyway? If you want something that sounds like your fingers strumming, why don't you use&#8230; your fingers?", "id": 244}]