[{"review": "This set of strings is fantastic. I've been playing for over ten years now, and have tried everything from Elixirs, to D'Addario, to Martin, to John Pearse (you see where I'm going with this?)and many more.I have to say that for the money, these strings are in a class of their own.  When I first started playing I loved the coated strings.  I wouldn't buy anything but Elixirs for years!  Then I got married and money became tight, and for $15 a pop, a set Elixirs wasn't looking as good as they used to.So I tried every other set of strings under the sun for about three years.I finally landed on these Earthwoods by Ernie Ball.  Amazing!They are not coated, but after a while I got used to that, and now actually prefer non-coated strings.These really do bring out the \"earthy\" tones of my dreadnought.  And the Medium Light set is just perfect!  Nice size high E string so I don't feel like I'm going to snap it when I do a pull off, and good bass response.All in all a fantastic set of strings that you can't afford not to try.And at $5, why wouldn't you give them a shot?", "id": 90}, {"review": "This is a fantastic little capo.  I say little because it is not as big as the spring loaded type, of the Shubb capos I've used.It has a low profile, and I can reach right up to it and still play well.It seems to be sturdy and well constructed, and I love that I can easily adjust how much tension to put on the strings.  Just enough so they don't buzz and then the strings will stay in tune when the capo is off.Much cheaper than the G7th, and does the job just as well in my opinion.For everyone saying that you can't fit it on the neck, make sure you get the right capo!  If you have a classical guitar, get a classical capo!  If you have a guitar with a really thin neck get the lite model capo.  If you are like most people who have regular size guitar necks, get the normal one.Don't write bad reviews of the product because you bought the wrong kind.", "id": 304}, {"review": "So based on the reviews from Amazon, and a friend who swears by these pickups, I decided to put one into my 310 Taylor.I am extremely pleased!  This was my brother's guitar, and he had a Mcyntire soundboard transducer installed by his local guitar shop.  It sounded terrible.  I tried messing with placement to get it to sound better, but it just didn't sound good, had tons of feedback, and just didn't have a good feel.I installed this pickup myself.  I have installed a few pickups in a few different guitars, and this one was pretty painless.I didn't have to drill out the endpin hole, so it only took me about 20 minutes to install this bad boy.When I tested it out I was blown away.  It sounded beautiful!  Just like my Taylor, only louder!The true test was an actual live performance.  I brought my Baggs Para Acoustic D.I. and I was glad I did.I was able to adjust the EQ just a tad, cut some of the mid-range a bit, and it sounded even better!I could not believe it.  It literally gave me chills.If you're on the fence about this pickup, go for it!  The reviews don't lie, this sounds fantastic, especially if you can EQ it a bit.I did plug in without the PADI, just to test it and it still sounded good.  If I forgot my PADI I would have no qualms about playing this straight into a system.  It might be labeled as passive, but it's got the volume of an active system for sure!It's a great buy in my opinion.", "id": 416}, {"review": "This thing is awesome!  I hate refilling humidifiers, and this thing is just leave it and forget it.It has a pack that hangs over the strings and in to the soundhole of the guitar, and one that restsin the case up by the headstock.I've been playing for about 15 years, and have always used a humidifier.  This works just as good as anything else.Keeps my case at a nice 60-70% humidity.I would recommend a nice Hygrometer to keep in the case too.  Just to make sure you have the proper humidity level.UPDATE 7/17/2013So being the lazy guy that I am, I never changed the packs out during the end of winter when they were getting a little hard.Well I noticed over the past couple of weeks that they were absorbing water!These really are a humidity system, rather than just a humidifier!They are almost completely back to their normal state, being very gel-like feeling.So, I am convinced that they work now.", "id": 406}, {"review": "I am finally feedback free!  I use this on my 310 Taylor with a K&K; Pure pickup system.I play mostly in a church worship team, and am usually right in front of a monitor.This blocks the tones entering my guitar via the soundhole.I don't get a huge loss of tone, but a little bit.I will take that over having to worry about moving around and getting feedback like crazy!Highly recommend.", "id": 497}]