[{"review": "For those Martins and Sigmas, as well as, other guitars without a neck brace button, this is the secure way to connect your strap. Forget the leather shoe-string clipping that comes with some straps, this is secure and won't ever end up with loose ends on the first fret. Nothing to tie or untie, a quick button connection is all that's needed. Just make sure your choice of strap is long enough since the distance to the neck is greater than the guitar body. Doesn't improve functionality but, the matching logo is a nice touch for Martin and Sigma guitars.", "id": 568}, {"review": "I love the Snark tuners but don't know that I'd call it super tight or faster than the older SN-2. I feel the display is an improvement - easy on the eyes. Hopefully, more reliable than SN-2. I've had pixels dropping out on one SN-2 that is less than a year old but have another one that is doing fine. Too soon to tell if the SN-8 will hang in there.I don't see it as a faster device than the older model and have had coupling problems with it clamped to an SG. Don't know why as it works fine with acoustics and Strat. Response time on the SG is longer than the older SN-2 model but, I haven't yet tried to understand what's going on with it. Have't tried it on bass yet but, I know that the SN-2 didn't play well with the E string open. No big deal, I just tune it at 12th fret. Could choose any note since it's chromatic. Speaking of which, playing along with a song that was pitch shifted is easier with the Snark. Tune any string to match the song and then, tune the other strings with the same displayed error.Bottom line is that it's a great tuner and it's not likely that I'll get much use out of the old Korg tuner that once balanced on my knee.", "id": 811}, {"review": "After years of soldering connectors to custom wire lengths, I love the ease of buying a few packs of inexpensive patch cords and just plugging in. Some of my older pedals are still connected using soldered 90 degree plugs that invite crackle and hum over time - may be due to vibration when packing / setting up or, maybe it's just contaminates in the air condensing on the contact surface. No matter, I won't be getting out the screwdriver and soldering iron again.One advantage of these molded plugs is smaller size - especially when connecting stereo devices. Much narrower than the 90 degree metal shells with screws. A couple of concerns I had were increased noise without the metal connector shell and the restrictions of fixed length. As it turns out, they don't contribute to higher noise levels and, they are just the right length for all my pedal connections. Everything is connected using this single length patch.Love the color coding, too. Especially on the stereo pedals connected in series where you can link the mono and B channels and are looking for that mono output in less than bright light.And what to do if one does fail? Toss it and grab another from the bag of patch cords that cost less than a couple of soldered connectors and is replaced faster than a soldering iron can get up to temperature. I'll always have a bag of these around for spares and reconfiguring my board. It's a lot more fun playing than fixing stuff - love these patch cables!", "id": 847}, {"review": "I was hoping the Lemon oil would be what I needed to get that crud off some of my guitar fingerboards but, it's not very good at that. I suggest cleaning with a detergent first and then let it dry. Once clean, the lemon oil does a good job of sealing the wood - even where years of playing have taken their toll. It's a good finish but, not the place to start. The product is not meant to be used on maple. Don't know why but, not an issue since most of my instruments are rosewood or other dark, exotic woods. So far, so good.", "id": 234}, {"review": "I lost my trusty slide and really miss it. The Dunlop 220 feels heavier and looser on my little finger than my old timer but, it does sound sweet. If it was just a bit smaller diameter, that would do the trick. My old timer had enough corrosion inside to keep it secure so, a brand-new, sleek fit isn't a plus in my case. The Dunlop is well made, as expected. It's just not the Antiques Roadshow model I had in mind. Hmmm, might be a new product idea - rough up the inner surface and come up with a catchy name.", "id": 340}, {"review": "Not much to say about a guitar strap... except I had planned to use it on a Simga acoustic without a pin at the neck. I ended up using the strap on my Strat for the acoustic and this one is on the Strat. This one doesn't come with a wrap or tie for the nut so, it is for use with a guitar with a pin at both sides of the body. If you need to secure one end at the headstock, this is not an option. It is comfortable though.", "id": 479}]