[{"review": "It hums, crackles, and I think I'm having problems with my equipment.  As soon as I use any of my other cords then the problem is gone.  Hosa makes some other products that have good value.  But based on my experience I don't recommend this one.", "id": 6}, {"review": "I was getting errors that my printer cartridge wasn't recognized and I sprayed some on the contacts and wiped off the excess with a paper towel.  Now it's working!", "id": 14}, {"review": "Pay a couple bucks more and you get one from a brand like Audio Technica and you know it's going to withstand the test of time.  Mine is working fairly well but the attachments are loosening so who knows what's next.", "id": 21}, {"review": "no complaints.  attaches firmly and does the job.  Can't beat it for the price.  Order this with eyes closed.  Great deal.", "id": 46}, {"review": "Might work well for recording too when you take the output jack.  Speaker is acceptable quality but can't be compared with a Fender amp as this one has 5 watts and a small speaker and the other has 10-20 watts.  I'm opting for the convenience of the size.  I got this after getting a couple smaller amps and headphone monitor plugs since it has both and was better sound with good effects.  I like the 'brit' setting.  I sound like a rock star with it.  Good product for practice or recording.  You could get away with microphone to amplify it for a gig.  But for around the same price you could get a Fender amp.  This product works for me and the quality is pretty good.  Other mini amps and similar accessories are toys compared to this.", "id": 48}, {"review": "Tone control didn't work so it was returned.  But it was pretty nice even though I felt the fret-board quality is higher on my 900 Gibson Les Paul but what can you expect.  If I had to order it again I would pay 140 more and get the SG 400 which has the quality pickups.  The sound is let's say... average.  Good beginner guitar, or a guitar that can be upgraded with new pickups.  The bolt-in neck didn't bother me but the SG 400 doesn't have that which is another reason I would step up next time.  Shape is ok.  Purely subjective.  I like the solid Les Paul shape now a little better since it's more conservative.  But the size is good and almost more comfortable than the Les Paul style.  Can't believe they can make a good guitar like this for only 160 bucks.  Also, even though I was tempted with the faded finish, the glossy finish is really nice.  This guitar will make a player proud.", "id": 49}, {"review": "I sent it back, probably due to my ignorance.  Has multiple patterns to collect sound.  Was a clear mike but I didn't detect any body to the sound.  Maybe a preamp would have helped.  I checked out many mikes and ended up with a Rode NT-1A which is probably similar in character.  My goal was to record my voice without color and this came close.  I wonder how this could have a zillion ratings of five stars?  Suspicious ratings to me.  Now that I have more experience I would be curious to check it out.  But since I found a good solution I don't think it's worth the effort.", "id": 82}, {"review": "Works great.  I didn't use the monster size wall board screw and it holds fine with the small furnished screws.  Next time I'm buying the all metal one and daisy chaining them to a board so I don't have to make tons of holes in the wall for my half dozen guitars.  For now I'm hanging one on the wall with this and it's fine.  Wood is nice quality.  I notice the price is almost 2x as much if you walk in the guitar center.", "id": 166}, {"review": "I think these are the same as the pricey monster cables and half the price.  I will buy Planet Waves from now on.", "id": 168}, {"review": "Bought this for my guitar pedals and it works great and doesn't cost much.  I just attached it to an existing adapter and voila.", "id": 192}, {"review": "Great for the desktop and vocals.  I have also used it successfully on the guitar cabinet.  It's an important component in my studio.", "id": 224}, {"review": "But the quality of the sound is not much more than a transistor radio.  There's a slight hiss too.  But I enjoyed listening to it while playing.  And when you attach the headphones it works great.  Amazine that it works off a 9v battery.  Yes, you have to lug around a guitar cord, but what do you expect.  I went all out and got a Roland Cube which should deliver a higher quality sound and has many sound effects.  But that costs 2x or more as much.  I am in the process of returning it.  Look at the picture of it next to a Coke can.  That's what it looks like.  Some people complained that the handle doesn't work.  Who cares.  The tweed on the speaker looks like a toy too.  But that's sort of what you're getting.", "id": 235}, {"review": "There's another brand out there that is almost identical in construction and quality and costs less.  Don't buy the high rated chrome capped one's, I had problems with those.  This one is good just that I regret paying so much for it.", "id": 241}, {"review": "Good quality and doesn't cost very much.  The price is great too.  Glad I bought it.  Folds up well.  Has a black finish on it.", "id": 257}, {"review": "Best sounding vocal mike for the bucks.  I tried many MXL mikes (under 200) and this was the only one that came close.  Unfortunately, the top end isn't as defined as a AT2035 or NT1-A.  So I ended up forking out 2x as much and going with the latter.", "id": 268}, {"review": "I'm using it for my Alesis Q49 MIDI keyboard.  Folds up easy so I can tuck it away.  It may not work with a keyboard smaller than 49 keys.  As you lower it the support spreads out wide.  Good quality.  Adjustable height and for the dept of the keyboard.", "id": 272}, {"review": "Works great and doesn't cost an arm and a leg.  Quality is good and holds a microphone with confidence.  Great price too.", "id": 279}, {"review": "Good quality but not as nice as some pricier ones.  If I want better I would shop around and pay more.  Does the job for now.", "id": 285}, {"review": "Much better than the more economical one's sold.  I should have gotten the 15 foot, but you live and learn.  My studio is small but it needs to wrap around my desk and go into my sound-proof closet.  It matches my awesome AT2035 microphone.", "id": 288}, {"review": "Was using a box and this is a great help.  My stomach doesn't feel wrenched anymore.  I use it on my right leg with the guitar on the right leg.  Maybe not as conventional as the classic position but it works for me.", "id": 321}, {"review": "Don't like that it's difficult to change the tube.  Sound quality was not what I expected, maybe because I wasn't familiar with the settings.  No power cord was included in mine or manual.  Manual should have been include not sure about the cord.  Dials are very small.  My MIC200 and MIC800 are much better than this.  I can't say it's bad.  Just that there are better choices in my opinion.", "id": 326}, {"review": "Seems to work well.  Like the other reviewers said, you could probably pay 150 more and get the same thing.  solid construction.  getting used to the attachment.  It will never stand in the position like in the photo.  There's no resistance on that joint so it flops down.  Just place it upside down.  Record using a headset or you'll get too much feedback.  Just ordered a shorter stand.  Hope that it works with that joint that makes it stand head down.", "id": 327}, {"review": "Have a couple guitars and a bass hooked in at the same time.  Attaches to my audio interface.  No cable switching.  Didn't need the sophistication of other mixers costing 5x as much.  Fast convenient way to switch guitars while recording.", "id": 374}, {"review": "No problems with this. Fits my Behringer 60 dollar condenser mike just fine.  Like it was made from the same company but it's not.  They must have standard fittings on mikes.", "id": 393}, {"review": "It's not as nice as my Audio Technica one but this does the job and I'm happy.  A little flimsier than the AT but at the price it's good.", "id": 444}, {"review": "But is no match for someone who wants to use it to record with.  Use a plugin instead.  I like some of Behringer products even though they are snobbed.  This particular unit is not one of their finest products but I give them credit for the price point and effort.  Someone will appreciate it but not me.  It sits in my drawer and will end up being sold online as it's not defective but just not up to what I want.  Cheap, so no big loss.", "id": 506}, {"review": "Use them all the time.  Has velcro too.  Goes from my DI or preamp to my audio interface.  Good quality.", "id": 554}, {"review": "I compared this to a C1 which is pretty good for half the price.  I also tried two MXLs.  One V63.  This is much better hands down even if it costs 2x as much.  I noticed the difference on guitar.  On vocal it picks up a fair amount of noice around you.  But I realized that it's normal and the other mike just didn't pick stuff up which is worse.  The MXL v67g sounded warm on vocals and not too bad on guitar but if you got too close it gave you this fake low voice and that's just like taking the AT2035 signal and modifying it after you've recorded it.  Besides the bright green and gold was a little too much for me.  I tried the CAD M179.  That did better on the treble side but seemed to miss the mids.  I heard the AT2020 wasn't as good as the AT2035 so I went for it.  And it's more than the switches difference which I don't use anyway.  I didn't like the switches on the CAD M179 either.  It's confusing and I do gain or filter in my DAW.  I considered the NT-1 but at 80 bucks more than the 2035 it seemed like they were very similar.  At the end I'm satisfied with the 2035.  It's a work horse and costs a fraction of the more popular studio amps that have only a subtle difference to me.  I have been staying away from AT products because I didn't like the headphones compared to Sony's.  But this time I caved in because I don't see anything that competes at my price range.  For me this works like an sm57 microphone and costs about the same.  I can record my acoustic or electric guitar out of the cab or sing in it.  My challenge is to not get it to record echo in my room.  I've removed the door on my closet, put a shower curtain with a down comforter on it and record in there.  Ridiculous setup but I've save hundreds in insulation costs and hours of doing that.  For most vocals recording I don't use the closet.  Just use refir and some recording tricks to remove any unwanted noise.  So if things don't change this is my choice for best vocal and instrument microphone in the 100-250 price range.  Nice solid construction and vibration mount included.  It's rugged and I like it.", "id": 642}, {"review": "I almost gave it 4 stars since you have to be smart to assemble it.  Directions don't include the proper details.  I would write them but that's their job.  I spend 20 minutes instead of 5 or so it they explained the process better.  The stand with my guitars looks awesome.  It's perfect for 2-3 acoustics and 1-2 electric guitars.  I wouldn't load it with 7 since they would inevitably bump while putting them in or taking them out.  Nice addition to my studio.", "id": 769}, {"review": "I've used this to connect several devices and the colors help. I would recommend this and the quality is good.", "id": 805}, {"review": "Strap is pretty crappy but picks are nice to have around.  Fairly good quality bag and the pockets are nice.  Good price.", "id": 865}, {"review": "Leather type material and corrosive free button type attachment for the strap.  I would prefer it not so wide but you have to include the button.  The button is not a snap, I just lack the word to describe it.  Previously I used to use a shoe lace and I would be thinking about it falling while playing.  Now I have more confidence with this strap.  It's not Gucci but doesn't feel like plastic either.", "id": 877}, {"review": "This is not a toy.  It's a well crafted instrument.  Material is wood.  Decent quality.  Plain wood but with a nice tone colors to it.  Good refinements.  Rings around the hole and stripe on the back.  Strings had some oxidation.  Understandable as it was made and shipped from Indonesia.  Metal strings.  So that's a consideration if you're a beginner.  Sounds good too.  I prefer the sound of a metal guitar anyway.  So if you're a beginner or an intermediate player who just needs a nice instrument hanging around home for an occasional strum this is it.  It is a pleasant addition to my home guitars.  It's for my wife who is learning guitar.  She loves it.  And it costs 10% of what mine costs, and I don't mind playing it at all.  The only plastic is the plate on the front that protects during strumming.  I don't even have that.  It's a feel good guitar.  Highly recommended for the occasional strummer.", "id": 148}, {"review": "Works great.  I have the same effect on my 49 Alesis midi keyboard as I do with my more expensive Yamaha keyboard which has a sustain pedal.  Chrome is great quality and it has good weight so it's not tinny.", "id": 251}, {"review": "Works well.  It can detect tones from the electric input or acoustically.  I find myself using it a lot.  Even as I learn the notes on the guitar fret-board.  If I guess incorrectly it reminds me of the note.  I also use it to intonate my guitar.  It has some other advanced features, but I haven't need them.  Display is nice and large even though I still need my reading glasses to see the note.", "id": 330}, {"review": "30 bucks is better than 179 for the tube screamer from Ibanez and the sound is very similar based on youtube.  I use this on the clean channel of my Bugera V22 tube amp and it makes my guitars sound like they should.  Awesome with my LTD VC-401 with 59 and JB pickups.", "id": 728}, {"review": "And sounds crisp.  I had alesis io2 express which did a similar job.  But after hearing a subtle difference in a youtube video I finally broke down.  I heard more definition with the guitar.  Now that I have it I take the quality for granted.  It has higher quality and the dials feel solid.  The little limiter lamp is awesome.  I'm very happy with it even if my old alesis was doing the job.  My old Alesis had midi pass through which didn't work anyway so feature for feature this is a better pick even if it's around 40 bucks more.", "id": 801}, {"review": "It was suggested that I start with this product since I'm learning and adding it to my repertoire of instruments.  Comes in a nice box and the quality is outstanding.", "id": 826}]