[{"review": "I know many people love the design, but I find it much too frustrating. You have to be very careful putting it on the fret correctly, then snap it in, then turn and turn the screw, oops don't let it snap off again and fall off while trying to turn the screw. Then you have to go through the whole routine again to take it off and move it to another fret and put it on again. What a farce. This is the worst capo I've owned, and I've tried nearly every brand and type. Yeah, I've had people show me how to do it right, and I know to do it right. It's just wrong to have to spend so much time slipping it on, snapping it, screwing it in, screwing it off, having it fall off, forget it, it's garbage to me. Also, while I'm getting my callouses worked out playing for two hours every day, the last thing I want is to pinch my fingers against metal trying to turn a screw. It's actually slightly painful to the fingers (momentarily, but why have to deal with that??) to work with. This design seems like it was a non guitar player who came up with it. The only good thing I can say about it is looks durable.No thanks.", "id": 121}, {"review": "Most of the time I am able to use the G7 capo with one hand when moving it, adjusting it, and clamping it in place. However, sometimes I have to use both hands to squeeze it in place so the strings don't buzz. That may seem like not such a big deal, but I prefer to have an easier one to work with. I have small hands, and an old carpal injury, so I prefer to have as little strain as possible to place the capo. This one is better than the any of the clasping kinds (Keysers, etc) in that respect. After a couple of playing sessions, I figured out how best to use this capo with just one hand most of the time. Now that I've learned how best to use it, I'll keep it. When I first got it I was upset that I had to use 2 hands and forcible squeezing to put in place, but now I've learned how to work it better so that I can do most of it with one hand without too much strain.A capo should: be easy to remove and put on, stay in tune, not hurt the hands (no 2 handed squeezing), not interfere with playing when inserted, and it shouldn't break too soon (have at least several months to a year before breaking if at all).On the plus side, this unit seems pretty well made, so it should last a long time. I think it meets all the criteria except for having to squeeze it tight periodically.I've tried so many capos now, and the only ones I liked were the Planet Waves screw tops, they are easy to use, easy to move from fret to fret, light on the hands, stay in tune and out of the way, but they break in damp California weather (I've had 4 of them break on me, within a couple months. They snap and go airborn, which is dangerous). Next I'll try the Dunlop Victor capos, they are screw tops similar in style to the Planet Waves (Dunlop also makes the Planet Waves capos), but they are made with more durable bronze, so they should last longer, and I hope those will be the best for me. I also ordered an aluminum version of the Planet Waves in hopes it won't break like their thermoplastic ones do.If you have small hands like me, and don't want to strain the hands while playing, like me, then that rules out the Kysers and any of the squeezing type of capos. The Shubs fall off and are a hassle all around to take off and on and adjust, and the springtop ones are suspect as well. That's why I like the screwtops that don't get in the way and are easy to adjust. Ok, I hope the Dunlop Victor will do the job for me now, I'll try it next.", "id": 266}, {"review": "I'm giving this one 5 stars, with the caveat that you MUST GET THE SILVER ALUMINUM one, otherwise the black thermoplastic ones do break. The thermoplastic ones broke on me within 2-3 months of use, 3 different ones, until I got the silver one which has not had that problem. Every music store I go to locally has the black thermoplastic ones, and they look in disbelief at me when I say they break. But they did --if I leave it on the guitar on a fret for 5 or 10 minutes and go into the kitchen to make tea, the thing literally snaps and breaks into 2 or 3 pieces and goes airborne at high speed in 2 pieces, and could poke someone's eye out in a public performance, freaky. There's something about the rainy days higher humidity cool damp air pressure and/or temperature fluctuation that does it.I live in northern california, so I don't know if a dry climate like the southwest would not have that problem.The SILVER ALUMINUM ONE by contrast, hasn't broken in now nearly a year of use, and shows no hints of doing that. It feels different in the hand from the thermoplastic-- no hint of plastic, but it is very light and not heavy like the G7 ones are. I made sure to order the silver aluminum one through Amazon, since the description on the black ones say some are aluminum and some thermoplastic, and I only want to make sure I get the aluminum one.The silver aluminum Planet Waves capo really is the best capo I've ever had, super easy to use, very easy to put on and switch from one fret to another while you're going from playing one song to another (you don't have move your body or the guitar like you do with all other capos to put it on or move it, which is a spectacular design), it keeps the strings in tune better than most other capos, and it's out of the way of your hands, doesn't interfere when you play any chord. The screw adjustment is in the perfect place for the least strain and doesn't hurt the fingers when turning it. It's the least obtrusive and best capo ever. I'll also add that I have an old carpal injury so I want the least strain, and small hands, so I want the least awkward and most light capo, and this does that. I absolutely love it, and I'm glad that the aluminum ones are durable.", "id": 304}, {"review": "I love this capo. Let me tell you about my capo journey where I've used every brand while searching for this one. First, I always owned the old Dunlop Toggle Action capo which is just old tech, you know, where it's just a bundle of synthetic cotton fiber, the kind one used to use before 1980. I had to go back to that when my first Planet Waves black THERMOPLASTIC capo broke. Don't buy those if you live in a damp climate like CA. Each one I bought broke, one broke within a week, during the winter rainy days. So I loved those capos, they were perfect, but I was done with the breaking, so I figured I'd try others instead despite my love for the Planet Waves design (I didn't know about the silver aluminum one yet). Well, I hated each other one I tried. Kyser, if you have had carpal and/or are small handed, you know what I mean, you don't want a capo that involves squeezing really hard so that your hands are in pain and then you don't want to play the guitar. I really hate the Kysers (I know some folks love to squeeze and use them, that's fine, different strokes right). Then I tried the Schub, you have to be kidding me. OMG that thing is so ridiculous, it pops off, it wiggles about, it is tricky, I hate it. Now, I know many folks are Schub fans who give me a drive by downrate, I'm not saying it isn't great for those who love it. If you love the Schub, you love it unconditionally, and I respect that, all I'm saying is that design is not for me and many other folks like me. There are other models that fail similarly to these 2, they make you squeeze so hard it does hurt for those like myself with sensitive hands, like the G7, I did fall in love with it until maybe the 5th squeezing and then you have to hurt your hand by unsqueezing it apart to put it back on. Awk~ward and painful. Sorry to be such a softie and a crybaby, but if you have carpal, you know what I mean, you want to go easy on the hands and arms, and not brutalize them. The other thing I've always hated about the Kysers (and again it may be that my smaller physique is involved) is how it gets in the way so chording with a capo is a lot harder. That's just dumb. Kyser lovers either accept that as a challenge or don't mind it or claim it doesn't do that, but you know what I'm talking about. Ok, so then because of all the broken Planet Waves thermoplastic capos, I turned next to Dunlop's turnscrew models. I liked them, they are very similar to the PW design, but the screw location is more awkward to use, and turning their screws is a lot harder on the fingers (got the ripped and pained fingertips to show for it). So, I turned back in search for a better Planet Waves model. This is it, right here. The silver one is excellent, and it's made of aluminum, not thermoplastic. I bought one and it has lasted me almost 3 years now without a single problem. By now, in contrast, I would have run through 3 or 4 thermoplastic ones. I want to say that if you are performing in a public venue, never use the thermoplastic ones, because my thermoplastic ones dramatically burst and flew across the room, and could easily \"poke someone's eyes out\". Not kidding, don't use those in public situations. Back to the excellent aluminum silver PWaves capo. I love it, because it doesn't break, not at all, and has all of the great thermoplastic model features that make it the best capo ever (especially for us sensitive folks with carpal or small handed people etc). The great features are:1. Ease of use and easy fitting are perfect, the best of all capos. This capo fits so easily. Simply put it on the fretboard and the location of the screw is perfect-- you never have to move the guitar or your hand more than a couple inches, unlike the other screwtops or all other capos, there's no need for any moving around, adjusting the guitar, falling down due to balance issues and then chasing a falling guitar, sheesh none of that nonsense. You put it on and they've engineered it brilliantly so you can easily get it on, move it from fret to fret, put it where you want, and screw it in with great ease! Wow, best ever in this category. Ease of use is tops, ever!2. It will never hurt you, it only helps. It weighs nothing, is easy to carry, you can slip it onto the peg area, it just is so light. I still can't believe how light it feels.3. It does what it's supposed to, that other capos don't do. No issues with being in tune, just screw it in to the level of tightness you desire, no wrestling around like some capos do. The screw is in the most easy location, and the screw itself is nicely made so it doesn't hurt your fingers at all when you screw and unscrew, it's a breeze. No problems with the size, it's so small, it doesn't get in your way on the fretboard. You won't have to do hand yoga in order to play capo'd songs, it is FLAT (I know, what a concept!). A capo should always be flat and out of your way so you can play chords, not pretzeled twister instead of chords. Now, I play capo'd songs all the time because of this capo, and it is so much fun musically, a whole new magical experience. The truth I've found is that good equipment matters in music making (I never played acoustic guitar as well or as much until I got my first Applause guitar with great action. I have a Yamaha I love now (since the Applause necks break), but both guitars taught me that you have to have good equipment that's easy to use (in the case of guitars, great action is imperative. In the case of capos, ease of use and no pain produced is imperative, and it opens up the world of capo use, the magic of the mathematics of music theory.)If you love the other brands, don't diss me, I know it's perfect for you, and I'm happy for you that it works perfectly for you, because when you have the best one for you, you will shine with your music and I will enjoy listening to you play. But those of you who have sensitive or small hands or have carpal know what I'm talking about, you won't settle for the torture of Kysers and Schubs, gotta be kidding me. I bought every capo imaginable (need to have a garage sale to get rid of the pile) but ended up that I was using the old toggle type again instead until I found the aluminum Silver Planet Waves Capo. Planet Waves has made the perfect capo now, no more issues, just easy fun playing capo'd songs. Again, only buy the Silver model, because when/if you get silver, you are guaranteed to get aluminum, not thermoplastic.", "id": 490}, {"review": "I'd been shopping for a music stand at local music stores, all of them at the cheapest price for this type with a solid backside are $45 plus tax. This item including shipping cost me only about $23 here from Amazon, and the seller Musician's Friend sent it promptly, got it within 10 business days without any problems. I had no trouble putting the stand together without any instructions. The bolts aren't as easy to adjust compared perhaps to a more expensive stand, but I don't care about that. It's not hard to adjust, and most of the time I have it at a certain height, so no need to fiddle with it, but during a group performance, it did need to be adjusted for different people and that was ok but could be smoother. If you're someone who needs to fiddle with the stand height constantly you might want to get a higher priced one that makes that easier, but if you are only occasionally going to adjust the height, it's no big deal. Other than that, it is a solid and handy stand that meets expectations and does what it should, for 1/2 price off retail. Excellent. I'm completely satisfied with this.", "id": 696}]