[{"review": "Playing an acoustic ukulele with all nylon strings, I've preferred just to strum using my fingers because \"traditional\" plastic picks are just too harsh and loud.  Even felt picks are too harsh (not to mention the dust/shedding they do).The Wedgie is EXACTLY what I've been looking for. Harder than my thumb, softer than plastic or felt, the 3.1mm Hard Rubber Wedgie is the Goldilocks pick; right in the butter zone.I tried the \"Soft\" and \"Medium\" Wedgies, but both were just too soft.  The Soft Wedgie over-grabs the strings and winds up dragging and producing a dull tone.  The Medium is better, but is still too dull and the action is a bit too soft.But the Hard Wedgie is the clear winner.  I get great volume and tone without the harsh twang of plastic on nylon strings.The only negatives I've found are:1. They can leave skid marks on your pick guard.  No big deal, as it wipes right off.2. They break down faster than I'd like.  Of course, that could just be my expectations.Still, if you're looking a softer-than-plastic pick, this is the one to get. No pick noise, just strings. I couldn't be happier.", "id": 244}, {"review": "Sadly, I can't review the mic itself nor the cable that comes with the mic as they were both non-responsive.  I tried the mic with other cables I have lying around that I know work, and I got nothing; it was like the mic wasn't plugged in at all.  And the cable included in this pack, well, the plastic (not metal) connector to the mic was cracked.  I still tried it with a difference mic... static.I can't blame Amazon for the broken bits as the whole thing was packed well and the box did not appear damaged.The stand that comes with this set up seems really good for the price of the whole package.  I was impressed at how much of is *isn't* plastic.Still... I can't recommend this product.", "id": 422}, {"review": "Disclaimers:1. Obtained free as part of Amazon's Vine program2. Tested on 4 ukuleles and one guitarSo, ukulele players: Yes, this tuner is for you.I tested this diminutive tuner on:- Sopranino (Ohana)- Soprano (Pono)- Concert (Kala)- 8-string Tenor (Pono)It's TINY so you can clip it to your favorite uke and leave it there.  It's a bit problematic on the Sopranino, as the tuner geta in the way if you try to clip it to the side, so it need to clip to the top.Tuning is easy.  Just pluck the string and the note letter appears on the screen. If it's red, you're off; if it's green, you're in tune.When you're off, little bars will display by the note letter: left if you're low, right if you're high. Tune in the direction needed until there's one bar on each side of the note and the note's name turns green. Quick and easy.I've compared this little guy to three other chromatic tuners and it's dead accurate.As others have noted, the only concern is around the little plastic latch that holds the tuner to the headstock.  But, it's held together fine so far and I've had it for weeks.", "id": 785}, {"review": "I'll start off by saying that I'm a proud owner of:- Gibson ES125 Acoustic/Electric- Pono MSD-E- Blackheart BH5H- Blackheart BH110- A Weber Vintage Series 10A125 (10 inch, 8 ohm, 30 watts) in an open back, solid pine cabinet- A Jensen Mod 10-50 (10 inch, 4ohm, 50 watts)- All tube Fender Tweed ChampNow that you know the gear I have, what I can play through an amp, and what I can plug an amp head into, I'll sum up my review with this:What you get out of this amp is completely dependent on your speaker cab, the cables you use, and how clean your power is. Got good gear?  This little amp will sound great.The DetailsThe amp itself is tiny.  I have an Electro-Harmonix pedal that's bigger than this amp! Still, it packs a punch.  With the gain at about 1/3 up and the volume at half, I get great clean tone and enough volume for a small venue.  Crank the gain up more and it gets louder and more distorted as you go.  Yes, this little amp will go from Jazz & Country to Rock & Metal with a twist of a dial.The line in and headphones jacks are a nice touch that none of my other amps have.  If you want to quietly play along with some tunes, you can.  Practice time just got better for your neighbors.The one lone tube in the Micro Terror is the pre-amp tube.  Mine came stock with a JJ Tubes 12AX7.  I understand that's standard.  A JJ is nice, but it will *not* warm up this little hybrid enough for you to get even a whiff of tube tone.  Dig out an old Phillips, RCA, Sylvania, or GE to get this guy to sound a bit like its big brother.  I had an old GE made in Great Britain lying around and popped it in my Micro Terror: warmed it right up; cleaned up a bunch of high-end tinniness.Still, compared to my two-tube BH5H or my all tube Champ, this guy does sound more solid state than anything.  BUT, compared to a buddy's Roland and solid state Ampeg, it's downright mellow.No effects loop means that your time-based effects (reverb, echo, chorus) can get noisy. So, if you like pedals, stock up on 9 volt batteries to avoid power adapter noise add in.Speaking of power adapters: a previous reviewer is right.  The external power brick for this guy seems fragile.  I'm not a fan of the thin line from the brick to the amp. It's holding up, but one round with my cat and I'll be looking for a new power supply.The RubAnnoyance #1:  One cheap cable anywhere in the mix will result in annoying HISS even at low volumes.  I found that out quickly.  So, get a proper speaker cable and a high end instrument cable or you will hate this amp.  I'm running it with a GLS 12 gauge speaker cable and a Planet Waves American Stage instrument cable - both available here at Amazon or any good guitar shop.Annoyance #2:  This is a 20 watt amp, right?  WELL... if you don't run a 4ohm speaker, you won't get all 20 watts.  The Micro Terror self-adjusts to the power needed to drive your speaker by stepping down output. (Yes yes... don't quote physics to me.)  At 8ohms, I still get good volume.  But at 16ohms (like my BH110) it sounds like a 5 or 7 watt amp.  That said, I'm actually a fan of the tone I get with my 8ohm Weber in its pine cab. The 8 inch Jensen speaker in my Champ, while nice, can't put out the low notes like I'd prefer and the Jensen Mod 10-50 is TOO clean.  But the Weber 10A125 sounds fantastic to my ears; even with the loss in volume.Annoyance #3: The Micro Terror is so small and so light, it'll tumble right to the floor if anyone kicks your chord.  Unlike a nice 20 pound amp, the chord won't pull out.  So: BE CAREFUL.Mitigation for Annoyance #3: The all steel chassis can handle a tumble from three feet up onto hardwood floors... though, it will gouge your floor.And then there's the standard annoyance that comes with owning any guitar amplifier: if the power is noisy or ungrounded, you will wind up with hiss no matter what.  I always carry a Monster HTS 350 and run my amp through it; that REALLY helps in cleaning up signal noise.  (If you don't have one, get one.  The 300 & 350 are cheap and they work.)The SummaryAfter all that, I can still say:  I love this little amp!  I've gigged with it and it sings well.  Plus, the added gag of tiny ukulele + tiny amp always draws a laugh... until I crank the dial over and shred some faces.For the price, you can likely afford to pick up $40 worth of guitar/speaker chords and wind up with a healthy rig.  And, for the price, this is a solid 4 star amp.  I know I'm happy.", "id": 844}, {"review": "I've tried these out in head-to-head (excuse the pun) runs versus Steelseries, Plantronics, Panasonic, and Sony headphones that all cost more... and the Tascam TH02 keeps up!I'm really surprised at how well they perform.  Lows are good, mids are clean, and highs are crisp.  Yes, the lows could be a bit beefier, but out of the headphones I compared it to, only the Plantronics excelled in that area.For fit: I have a large noggin; like, size 7 5/8 hat.  And these headphones fit well!  Not too tight, snug, but not confining. The padding is good and soft.Seriously, I'd rather buy three of these and burn through them if they break (which they haven't, and I've taken them everywhere) than spend $100 on another set.", "id": 870}, {"review": "I completely agree with &#34;JPfromOH&#34;.This Planet Waves D'Addario Artist Capo tries to be too many things and winds up doing none of them perfectly.The micro-adjusting knob for tweaking tension/pressure is nice, but I've wound up having to mess about with it repeatedly with every guitar/ukulele that I have.  (A standard tension spring might be a bit too firm, but at least it's consistent.)I also thought I'd like the curved cradle for the neck, but it winds up pushing the capo to odd positions on one of my guitars and makes it very uncomfortable to play with on my tenor ukulele. I know, I know, this isn't designed for ukuleles, but I have no such troubles with my Kyser capos.I don't understand the clip for a tuner on this thing.  I have several clip-on tuners that clip directly to the headstock. (And most are Planet Waves already!)  Why would I want to purchase a separate tuner that can only be used when I'm using the capo?  I suppose that if you have money to burn, this is a useful addition.And the pick holder is a nice touch, but... I use my fingernails so that feature is needless for me.As others have noted, there are other, better capos out there.", "id": 894}, {"review": "So, first up:  I've been using Macs to record music since the G4 Cube... yeah, go look that up.  Anyway, I know my way around audio recording on Apple devices.And then: yeah, this thing looks kind of cheesy or flimsy...BUT: I haven't encountered anything so Plug & Play simple as the Apogee JAM 96k since Gefen introduced the iMic.  Just plug in the USB or Lightning cable, plug in your instrument and GO.Also, it's not flimsy.  It is made of plastic, but the thing has a bit of heft to it and survived a tumble to the floor from my desk.It pulls power from your machine, so no worries about some adapter introducing hum to your recordings. This also helps those of us using electric guitars that don't have extra-wound humbuckers.I tested the Apogee JAM on a new (2014) MacBook Air, an iPhone 5, and a 2013 iPad Mini.  Garageband instantly knew what was going on, but ProTools did need a bit of coaching.A small device that doesn't color input sound and doesn't get in the way... just what I needed!", "id": 895}, {"review": "Oh, quick note: this capo is meant for instruments with radiused, NOT flat, necks.  That said, it works fine on a non-radiused ukulele.I've been using only Kyser capos for many years now.  They don't fall off, they don't usually pull strings sharp, but they do grip TIGHT and can damage some finishes.This capo is easy on & easy off with the pistol grip, has a correct supportive shape for the back of the neck so it won't damage finishes, and has adjustable tension.  I backed off the tension as much as possible, set it on the neck, made one adjustment and it was perfect.  Since I can adjust the tension, I have no worries about it pulling strings sharp.I only wish it was a bit shorter for Ukulele neck widths! ;-)", "id": 843}]