[{"review": "I love these strings, and use them for all of my acoustic playing. Best of all, I can find them here for $3.49 per set, so I'm not dumping a bunch of money on strings all the time. Easy to play, and they sound great.long lasting if you take care of them by wiping them down every time.", "id": 27}, {"review": "I ordered these because I bought a variety pack of picks from Musician's Friend and there was one lonesome very thin celluloid pick in the pack. I loved how it quieted the strumming on my acoustic dreadnought, so I went on the hunt for very thin picks. The celluloid one fell apart quickly, so I wanted a better material.These white nylon picks should last a lot longer. The non-pointed end is all grippy (textured), so it doesn't work great if you like to use the more rounded corners of a pick, but it does the job and I like it. The pointed end is very thin and slides off the strings nicely, but you can still pick with it if you're combining picking and strumming.I'll keep using thicker picks for picking-only songs and for louder strumming, but for more mellow strumming and to keep from bothering other folks in the house, these are great.UPDATE: I've been using them for more than a year now, and they are pretty flimsy for picking notes in a mostly-strumming song... but you can do it. This is still my favorite pick for strumming. Hope this helps.", "id": 62}, {"review": "We all know it's just a container with a sponge in it, no biggie. I bought it to get Super Saver shipping on something else and because I plan to keep an all-solid acoustic guitar at a weekend place where it will sit unused for long periods of time. Jamming it between the guitar strings and getting it hooked onto them feels a bit rough on the strings. But it should do the job.", "id": 71}, {"review": "I already owned a stainless version of this capo with a roller instead of the plastic tip on the adjuster screw. I like that one more and overall quality seems better on it, even though pricing was similar when I bought the first one. And the rivets on this one allow the parts to move sideways so they don't line up just right. But when I put it on a guitar it seems to line up okay, and that's the important part.", "id": 121}, {"review": "It claims to stop &#34;string talk,&#34; when you rub fingers on wound strings. It doesn't. But it does reduce it somewhat, and it also helps me keep playing even when my fingers get sore from playing too long, or playing a new song over and over.I gather my fretting fingers together and spray a little bit of this stuff right onto my fingertips. Seems to help my callouses without messing them up, and reduces the tenderness under the callouses that comes after a lot of playing.", "id": 173}, {"review": "I requested this for Christmas in 2011 and was pleased to get it. I've used it on at least 7 guitars and it works great. First I used it to treat clean fingerboards that were in good shape and it worked well. It can even make a big improvement to the dry, porous surface of a cheap fretboard, and good rosewood fingerboards love the stuff.Later on I got some used guitars and used cleaned the gunky fingerboards with Guitar Honey (apply it, scrub with toothbrush, wipe with paper towel, repeat) and it did a lot better than I expected at removing the yucky buildup next to the frets.I like to apply it fairly heavily and lay the guitar down with the fingerboard level and facing up, and give it time to soak in. You will notice that some areas soak it more than others. I move it around on the fretboard so it soaks in evenly. Then wipe off the excess with a paper towel and you're ready to go.When I wipe down the strings after playing the first time or two after treating with Guitar Honey, the rag shows dark lines where the Guitar Honey cleaned the strings. I like making my strings last longer!Get some. I don't think you'll regret it.", "id": 344}, {"review": "I requested and received one of these as a Christmas gift, then bought another so I could keep the first one at a weekend place where I keep a guitar. It works quickly and easily to swipe on the strings, and keeps strings clean and rust-free (important here in humid Florida) and strings last longer than they did before I started using this even though I've always wiped the strings with a soft cloth after each use.I keep my Slick string cleaner in a quart size ziploc-type bag because it's not airtight when you snap it together and I don't want it to dry out. I hope when it does dry out that I can just add some juice to rejuvenate it. I just don't know what kind of liquid to use. I don't want to drop $8 or so for a new one every time it dries out. Any ideas are welcome, please add a comment to this review if you can help me out.Bottom line, it extends the life of my strings and that's always good.", "id": 730}]