[{"review": "I am using it with a Musician's Gear music stand.  The shelf fits, but moves easily when moving stuff on the shelf of the stand.  It is made out of plastic which flexes fairly easily and doesn't feel as sturdy as the metal shelf of the stand.  There aren't any other options though unless you know some one who can do metal fabrication. It is a good thing it does not cost a lot.", "id": 128}, {"review": "This pick-up sounds good and does actually sound like the guitar acoustically.  It does pick up percussive noise which you don't get with under saddle pickups.  It is prone to feedback in very loud situations if you don't use a sound hole cover.  Over all I'm please because I was able to install myself and it was simple.  You do need to use an external pre-amp, but even with piezo pick-ups that is usually the norm.  The directions that comes with the pickup are very thorough and the company is helpful if you have questions.  The only change I had to make to my guitar was making the end pin jack bigger and that was easy too.", "id": 416}, {"review": "I bought this because I had a gig in a dark bar.  I used this on my music stand on the lowest setting and it worked perfectly.  For some songs I have three sheet of paper (which overlapped about an inch) and the light covered all three pages easily with no dark spots.  I can't imagine in what situation I would ever need to use the brighter setting. I was thinking of getting the cheaper/smaller version, but didn't want to risk it not covering three pages. The gig bag is a square and softly padded. There is a lot of dead space in the bag and no support in those empty areas or the corners so I don't expect much protection for the light or adapter.  Treat the light like it has no bag and you'll be fine.  They include 3 batteries (I didn't see them until I pulled out the adapter for this review) to get you started using the light, but the adapter works well and has a very long cord so if you are using the adapter at a gig you shouldn't have to worry about it making it to your power supply.", "id": 681}, {"review": "Perfect replacement.  Did have to take off a little on either side, but other than that it fits.  I used it on a First Act ME501.", "id": 691}, {"review": "I like this capo because you can adjust the pressure, but I've had it pop of easily twice already. Have others I trust more.", "id": 761}, {"review": "Very versatile power supply and much cheaper than others.  This is not true isolated outputs, but it is quiet and that is what counts.  I have the Fuel Tank Chameleon and I end up using this because it fits the needs of the pedals on my board the best, mainly because of the 500ma output. Here is a comparison of the JP-02, Chameleon, and the OneSpot.  I have all three.T-REX FUEL TANK CHAMELEON (1350ma)Outputs 1-3: 9v/12v 300maOutput 4: 9v/18V 150maOutput 5: 9v/12v 300ma| ---- Use 5 OR 6 only, not bothOutput 6: 12v AC 300maJOYO SP-02 (1000ma)Outputs 1-7: 9v 100maOutput 8: DC 9V Maximum output of 500mAOutput 9: DC12V 100maOutput 10: DC18V 100maVISUAL SOUND ONESPOT (1700ma 9v only)Daisy Chain Power into 8 pedals not exceeding 1700ma", "id": 852}, {"review": "This is far more pedal than I need but what a fun pedal to have.  Just going through the presets was fun, but downloading and trying the stuff they have available online was even funner :)  The bad part about this pedal is that it is HUGE and will take up a lot of space on your board.  You have to be committed to dealy.  You'll have 3 different presets available at one time from the footswitches.  I can't comment on the looper as I never used it.", "id": 856}, {"review": "Perfect looper that is small enough to fit on anyone's pedal board.  Many complain about not being able to use it during a live performance because of the single foot switch and they are right.  Having to do everything with a single footswitch is a bit distracting.  The ditto is great for practice, though.", "id": 869}, {"review": "I realized I didn't have any distortion pedals, only a bunch of overdrive pedals, so I set out to find a distortion pedal.  After scouring the forums I find out the pedals that are supposed to be very good are also very pricey.  Since I don't want to spend a bunch of money I get this one and it is great, albeit quite bright.  The only thing I don't like about this pedal is the brightness, which can be tamed with the tone knob, otherwise it is easy to use, sounds really good and is transparent. Transparent in that it doesn't add a lot of color to your amp just distortion.  I use this pedal with vintage Fender Silverface amps, which are already bright, so I turn the tone more to the bass side and also shape my tone with the Spark Booster that I have in front of the US Dream. I have to use the Spark Booster to hit the US Dream hard because most of the guitars I use don't have hot enough pickups.The price was right, I'm happy with it.", "id": 832}, {"review": "Tone is subjective and 3 stars means it just OK to me.  It does need a hot signal going in to sound good, so use a boost in front of it or hot pickups.  The distortion is fuzzy, but not fuzz, almost like a fuzzy static.  The EQ switch that removes the tone circuit causes the pedal to become really dark so I always have the tone in the circuit. I used it with a vintage Vibrolux Reverb. This is not my go to pedal or my go to second pedal.  I am still trying to figure out how to use it so it sounds good to me.  It is made well. For the money I am not mad I tried it.", "id": 890}]