[{"review": "Sturdy cord and plugs, inexpensive, good value. I don't require professional-level equipment, so this cord serves my purposes well. Satisfied with purchase.", "id": 5}, {"review": "For the money, this karaoke mic does a decent job for any vocal use. Good to keep as a spare in the gig box.", "id": 15}, {"review": "This is an good stand for situations where there aren't too many threats to your guitar (running dogs on the porch, reeling drunks at a bar). Get a heavier stand or a wall hanger if you have a fabulous vintage Martin or a handmade Henderson. Overall, well worth the price.", "id": 92}, {"review": "Even though the title says \"Acoustic Guitar Case\", it's obvious that this is a case for A-style mandolins. I chose it because the lining looked a little deeper in the photo, and the reviews were good. Sure enough, the lining is soft and well-padded. The hardware works as it should, and the build quality is almost perfect. However, when closing the case, a small amount of jiggling is required to make the top seat on the bottom properly. Just a slight push-pull motion will allow the top to snap in place, then everything is as it should be. The case fits my A-type mandolin perfectly, and provides the protection needed to safely transport it in a car trunk or other place where it will be bumped around. The slight mis-fit of the top and bottom is not a big enough concern to warrant returning the case. It serves its purpose well, at a reasonable price.", "id": 118}, {"review": "This shape give the strumming hand a better grip on the pick. I sand a bit from one of the points to give it a shape more like the classic heart-shaped Fender pick. The stock rounded point dulls the attack on the string. Good for strumming rhythm, not so hot for lead.", "id": 119}, {"review": "My Strat has bigger frets than any guitar I have ever owned, and I have a tendency to sharp notes played on thinner gauges, particularly on the 3rd string. This 11 to 49 set feels more like my acoustic guitars and minimizes the problem of sharp notes from too much finger pressure, while still feeling \"faster\" than an acoustic guitar. They sound great, last a long time, stay in tune and are a good compromise between very light gauges and the really heavy sets.", "id": 156}, {"review": "Elderly pickers like me fumble conventional picks onto the floor, particularly when the skin is dry during winter. The grip material molded onto these picks goes a long way toward preventing that. The material used for the core gives a slightly softer tone than the Fender mediums I have used for 50 years. I like the graduated feel these picks have, with a slight give in the center, allowing the player to vary the pick attack between strumming and picking single notes.", "id": 170}, {"review": "A classic mic clip -- simple, inexpensive and durable enough. Keep several spares in your kit; even the expensive ones break.", "id": 179}, {"review": "I have played the guitar for nearly 50 years now, and wanted an inexpensive small-body steel-string guitar to keep out for informal practice and noodling. This one fills the bill pretty well. Build quality is quite good (made in Indonesia, not China as I had expected), and the intonation is perfect. The finish has a hard matte surface that will probably wear well. A pick guard is present, but when I removed the plastic shipping protector, the entire guard came up with it. The adhesive residue comes right off, so I will play the guitar without a pickguard. Bracing is light -- the entire guitar is light. The body is a bit larger in the lower bout than I expected, but it sits on the lap more comfortably than a dreadnought.I take issue with some reviewers' suggestions that this would be a good beginner guitar right out of the box. The string spacing at the nut is narrower than it should be for the width of the neck, cramping the fingers. The nut should be replaced with one that spaces the strings across the fingerboard just a little more. The action may be lowered by shaving the bridge saddle very carefully, and just a little at a time. This work will cost as much as the guitar cost if you take it to a luthier, but if you can do it yourself, will improve the playability of the instrument.The strings supplied on the guitar were tinny and cheap, so I replaced them with a set of D'Addario EJ-16 Light Phosphor-Bronze. The improvement in tone was immediate -- this little guitar sounds pretty darn good. All in all, with some careful modification, this is a good guitar for the beginner or casual player, and a very acceptable one for the experienced guitarist who can do a little modification him/herself.", "id": 183}, {"review": "The strap is adjustable on both ends, and the front adjustment slider sat right on my shoulder. I cut it off and glued the material back together with Shoe-Goo, and now it's great. Padding and wide material make standing with a heavy bass a whole lot less tiring.", "id": 188}, {"review": "My go-to string brand for any stringed instrument. Punchy round-wound tone, but very responsive to the tone controls for a more muted sound where required.", "id": 197}, {"review": "This gauge is perfect for my 1970 Gibson J-50. The phospher-bronze alloy wrap brings out hidden tonal \"snap\" in this old, rather heavily-braced guitar. The may be too bright for a lighter instrument, but they really shine on my old guitar.", "id": 198}, {"review": "80/20 strings \"blend\" really well on my cheap Jasmine guitar. They improve the bass and do not emphasize the tinny sound that inexpensive plywood guitars often exhibit. Phosphor Bronze were way too bright on the Jasmine. 80/20 is good choice for a guitar that needs smoothing out. They did nothing to help my over-braced 1970 Gibson J-50, though. Phosphor Bronze strings are required to give that old box some snap.", "id": 199}, {"review": "Fender guitars are made for tinkering -- they are basically just lumber assembled with wood screws. At any given time I have a Fender guitar taken apart, and these little finishing screws replace the pickguard screws I inevitably lose. Don't get me wrong -- I am a die-hard Fenderista, but you gotta admit they are manufactured objects, not fine examples of the luthier's art. That's what makes them so much fun to play and modify.", "id": 215}, {"review": "This string set offers typical D'Addario quality and value. I use D'Addario strings on all my guitars, mandos and my ancient old fiddle.", "id": 242}, {"review": "Fabulous clean tone, and great distortion sound running off a solid-state amp and pedals. The characteristic Strat sound of my guitar is very apparent. Weighs a ton, cool logo, made in USA. What more could you ask?", "id": 287}, {"review": "D'Addario strings have become the favorite for all my guitars, and now my two mandolins. Consistent quality and good tone and volume have made me loyal to the brand.", "id": 338}, {"review": "The standard for mild, non-oily instrument cleaners. Leaves no residue, easy on old guitars' finishes. I have used it for years.", "id": 351}, {"review": "Seagull guitars have intrigued me for years in photos and on their website, but there is no dealer anywhere near me, so I bought one sight-unseen from Amazon, based on the good reviews. I'm glad to say I can add my voice to the chorus of praise for this innovative design.A traditionalist will need some time to become accustomed to the unusual appearance and construction.  The narrow, reverse-taper headstock and wide fingerboard give this guitar a bottom-heavy look when viewed vertically. Back and sides are cherry with only a light stain, and the binding is dark. The top is natural cedar.As dreadnoughts go, this one is very comfortable to play sitting down. It appears to be based on the Martin outline, but with a slightly rounder lower bout and a narrower upper bout. Weight is pleasantly light, and the semi-gloss finish is comfortable to the touch. Players with broad fingers will appreciate the wide fingerboard, but those with small hands should consider the \"\"Slim\" version, with a neck 0.08\" narrower at the nut.Sound is what really counts, however, and this Canadian dreadnought has nothing to be ashamed of there. The maker has the good sense to ship the instrument with high-quality, fresh strings, allowing the new owner to appreciate the notable bass and clear midrange as soon as it is tuned up. Overall, it falls within the classic dreadnought tone category, with good volume.Buying a guitar online saves money but leaves setup to the buyer. Both the nut and saddle on my guitar needed lowering, and the truss rod required adjustment (a long-reach hex wrench is included). If you are not experienced in these tasks, a local luthier should do it for no more than $30 or so.Based on sound, playability once adjusted, and construction quality, this guitar should definitely be included when comparing instruments in this price range. It is a real standout in value.Update 8 DEC 2012: The more I play this guitar, the more I love it. It delivers balanced sound with good dreadnought \"snap\", and once the action was dialed in, the broad fingerboard relieves finger crowding I didn't fully realize hindered my playing. I am considerng replacing my Takamine mini-jumbo with a Seagull equivalent.", "id": 432}, {"review": "This neck plate rides on the body of a Mexico-made Jazz Bass which I acquired second-hand, replacing the blank factory plate. It could be thicker -- it deformed somewhat when the screws were snugged up. Still, the guitar now sports the old Sixties Fender &#34;F&#34; logo.", "id": 475}, {"review": "This shoulder rest is sturdy and remarkably easy to install on the fiddle. No adjustment is required once it is set for the instrument's size (3/4 or 4/4 -- arrived set for 4/4). It simply snaps on to the outer rim of the back, and the rubber feet keep it in place. Good value for the price.", "id": 637}, {"review": "These are a little \"flubby\", thick and soft, for my taste in guitar picks, but they mellow out the tinny sound of my mandolin beautifully. The textured grip surface is great.", "id": 680}, {"review": "What can you say about a pick? These picks sound good and have lasted well. I have also found that felt uke picks produce a good sound on bass guitar.", "id": 775}, {"review": "This miniature tuner can be left attached discretely to a guitar headstock while playing. Just remember to turn it off, or the display will prove distracting. During winter when a guitar or mandolin &#34;moves&#34; with changes in humidity, staying in tune is an issue, even for expensive instruments. This little device helps the player deal with the problem without constant recourse to a larger tuner.", "id": 785}, {"review": "I love this light both for the music stand and for my laptop. It has two brightness settings. Illuminates an entire music stand if adjusted properly.", "id": 827}, {"review": "TUSQ saddles and nuts are the best synthetic out there. All my stringed instruments have been fitted with TUSQ parts.", "id": 415}, {"review": "Unless you have a taste for really thin picks, this material and thickness will suffice for all uses, both single-line leads and strumming. This pick finally got me away from my old favorite Fender tortoise mediums, though I do still keep them around.", "id": 577}]