[{"review": "This thing is like a magic Spray! Hah!Seriously... I used this on noisy hinges, car doors, etc.I really bought it to clean the POTs (volume controls and knobs) on my Guitars, pedals and equipment. It really does work and gets rid of the static noise you get when you turn your volume control on your radio or guitar for example.", "id": 14}, {"review": "I been playing guitar for 12+ years now. I play lead and rhythm. I needed a good EQ to sometimes scoop the sound a bit since I have a variety of guitars and they all sound different (some too much on the low and the others too much on the high). I don't like interfering with my mixer and amp settings and decided to get a pedal EQ instead. A boss EQ is solid and all yes but cost ALOT more. This EQ achieves almost the same results and I paid less! It has it's own level BTW.", "id": 84}, {"review": "These aren't my first set, I can't count the amount of Monster 1/4 cables I bought and own. None has ever failed me so far. Highly recommend these! I love how they sound and they are built well.", "id": 124}, {"review": "These aren't my first set, I can't count the amount of Monster 1/4 cables I bought and own. None has ever failed me so far. Highly recommend these!", "id": 125}, {"review": "These cables are sturdy and sound clean. Using cheaply made cables could affect your sound - you can loose top end. I use Monster on all my mics (XLR) and all my instrument cables (1/4) with no issues. Great product... Highly recommended.", "id": 127}, {"review": "I love these strings. They are bright and feel really good on my hands.I have a Gretsch and use 11's D'addario on it, best strings I've found so far. I also bought a pack of half wound 11's to TRY. I'll decide which to use (round or half wound) after my experiment.", "id": 156}, {"review": "These fit snug on my Shure SM58 Beta A mics. Nice texture and it doesn't affect the sound of my mics.I recommend em!", "id": 178}, {"review": "Great device and good price...My Wife made me try this for a Gig we had... It worked great! I love the foggy effect on stage, with a touch of lighting it really comes to life.The fog juice this thing comes with has a funky scent though. Perhaps it might be wise to get some scent thingie to toss in the tank with the juice. I don't know if the other brands of fog juice smells weird also but I have another can of juice I bought to use later. I will report on that...I gave it 5 stars although the fog juice is funky because it's not the fog juice that matters, it's how the machine works... It does what it should do.", "id": 256}, {"review": "I'm never playing another guitar without these locks!After my Custom Telecaster fell. The neck went out of wack, I had to readjust the truss rod and spend hours to setup the guitar again! That's every musician's nightmare!I immediately started doing research for a proper locking mechanism for my straps. Schaller kept coming up. I looked at the design and was confident it was safe to use.One issue you may run into is the nut running loose. That's not a problem with the scaller locks, it happens to anything that uses these type of nuts (it has happened on my guitars where the input jack is). A drop of glue around the threading can fix that issue easily.", "id": 277}, {"review": "Cheap crappy strap. It's too stiff, not comfortable at all. I regret purchasing this... Save your money, go hunt for a Coach strap or something similar. They are expensive but worth it.", "id": 285}, {"review": "Great little mixing console for home use and practice.I use it at home and sometimes take it on the road for small gigs where I need to connect my guitar, a pair of cordless mics and a portable electronic drum kit.This thing has phantom power just in case you didn't read that already!Overall I can say without hesitation that this unit is sturdy and packs all the necessary features you'd need and even has a british EQ to help shape your sound a bit.Cons? Not many... One gripe about this unit is that it has no power button! I mean what kinda electronic device comes without a power button these days huh? You have to disconnect the power adapter either from the power source or from the back of the mixer in order to take the device off. Apart from that the LED is wayyy too bright, so bright that you can't look at the device for very long and obviously can't make out the writing and control labels on the device. I notice all Behringer pedals come with this bright led. What I usually do is take a piece of tape and cover the led.I recommend getting this unit and only gave it 4 stars because of the few cons listed above.", "id": 368}, {"review": "I love these picks, they are my favorite! I bought a pack of 72 after trying the pack of 12 last year. These picks are sturdy and wont break that easily. I use them for rhythm runs and even lead. They are perfect for rhythm, flexible. My only wish is if they had some grip (raised end where you hold). For lead these sound dull. I much prefer a brighter, more chimey sound.Overall great product! Get it...", "id": 455}, {"review": "Every Guitarist needs a good tuner! and everyone knows Boss makes some of the best products. The fact is tho I really cant afford to spend 90-100usd for a tuner! When I received this unit I decided first thing I was going to do was to compare it to my other hand held chromatic tuners. They all work the same. Using this pedal I am able to obtain the same results, that's good enough for me. Activating the tuner takes a little over 2-3 seconds, but that's fine since I usually tune within breaks and you hardly need to tune especially when you have a good guitar/tuning pegs.", "id": 443}]