[{"review": "If you want your guitar to sound like Eddie Van Halen, Joe Satriani and other guitarists studio album guitar sound, then get a BOSS GT-10 (guitar multi effects processor) and install BOSS GT-10 Patches by James Limborg. Search Google for BOSS GT-10 Patches by James Limborg.", "id": 41}, {"review": "I haven't really used this guitar stand because I have been keeping my acoustic guitar in the case so I can keep the humidity nice adding water to a sponge I cut and placed into a plastic bag that I poked tiny holes in with a small nail.  The stand works as advertised.", "id": 92}, {"review": "These Elixir Nanoweb acoustic guitar strings are amazing because they sound like new strings for a long time (months) unlike other guitar strings.  Great product.  These Extra Light strings are not light enough for my playing enjoyment, so instead I buy Elixir Nanoweb strings in singles so I can select the gauges that I like even better.  A great product no matter what gauge string you choose.", "id": 108}, {"review": "I have been using these for about 2 years now; I am very happy with these strap locks.  Great product.", "id": 277}, {"review": "I like the Jim Dunlop .60mm pitch black guitar picks best.  If you want your electric guitar to sound like Eddie Van Halen, Joe Satriani and other guitarists studio album guitar sound, then get a BOSS GT-10 (guitar multi effects processor) and install BOSS GT-10 Patches by James Limborg.  Search Google for BOSS GT-10 Patches by James Limborg.", "id": 574}, {"review": "The Boss ME-70 is not as nice as the BOSS GT-10 and will not let you install BOSS GT-10 Patches by James Limborg.  I recommend getting a BOSS GT-10 and then install BOSS GT-10 Patches by James Limborg.  Now your guitar can sound like Eddie Van Halen, Joe Satriani and other guitarists studio album guitar sound with BOSS GT-10 Patches by James Limborg.  Search Google for BOSS GT-10 Patches by James Limborg.", "id": 582}, {"review": "The Line 6 POD HD500 has too-much compression even with the compression effect turned off.  If you want your guitar to sound like Eddie Van Halen, Joe Satriani and other guitarists studio album guitar sound, then I recommend getting the BOSS GT-10 and installing BOSS GT-10 Patches by James Limborg.  Search Google for BOSS GT-10 Patches by James Limborg.", "id": 700}, {"review": "The Elixir brand acoustic guitar strings keep their brand-new 'sound' a lot longer than any other brand.  I am very happy with the Elixir brand strings.", "id": 103}, {"review": "These are excellent guitar picks.  They don't slip in my fingers like the Eddie Van Halen guitar picks I purchased a while back.", "id": 350}]