[{"review": "This converts an xlr signal (for me, a Shure SM57 mic) into a 1/4 male (I run it into a guitar pedalboard and then an amp).  Have no issues with performance but the converter is a little bulky especially once you clip a mic onto that.  Could be tight fitting into certain places on a pedalboard but works great overall.", "id": 12}, {"review": "I have a real problem with these patch cables.  I got them as a christmas gift but they don't stay in my pedals' input jacks without causing problems and having to push them in on occasion.  Most problematic is the connection between my EHX memory boy and digital memory man... never had problems with any other cables here, but these refuse to stay put without having to constantly adjust.", "id": 578}, {"review": "I got a few of these as a Christmas gift and they're just bad.  I put them on my pedalboard where I previously had longer cables and these just didn't stay in the jack.  I have no other problems with these jacks with any other cable but these.  If I play loudly and my room vibrates a bit, the cable even works its way out of the jack a little bit and cuts my signal.  Awful.", "id": 662}, {"review": "I have a pretty weird pedalboard set-up involving an EHX digital Memory Man looped back into itself and another split earlier in the pedal chain.  This does a great job of summing three outputs back into one signal before I go into a reverb pedal and then out to my amp.  Takes a little while to dial in exactly where the knobs should be, and they get very loud at the top end, but I have noticed no issues with sound with each knob at around 4.5/10.  I tested to see if I could tell any difference in noise due to this pedal but found none.", "id": 374}, {"review": "I was hesitant to pick up an overdrive or delay from Joyo but took a chance on the EQ.  I really like this pedal and it does exactly what it should.  I use it mostly as a boost with a slight shaping of the EQ but it can be used to get a scooped sound, mids boost, hi/lowpass or whatever you need.  It's a quiet pedal and claims to have true bypass.  When the pedal is engaged the 6 lights for each band come on and they seem sturdy enough.I would just subtract a star because it seems a little strangely designed.  Not the performance side of the pedal as far as I can tell, but for example, the \"N\" on the \"IN\" label on the right is backwards, and it comes in a weird box with plenty of Engrish so I'm skeptical as to how it will hold up to being stomped on.  Time will tell, but for now it seems like a great box for the money.", "id": 835}]