[{"review": "So perhaps I don't know what shade burgandy really is. Or the picture is a bit misleading. It is as stated, although the picture shows a criss cross pattern this is just woven. As too \"DEE\"s reveiw... the buckle doesn't seem to bother me. I am not calling him or her out or anything. My best guess, it's playing style. I myself play bass, when I first started I played on the 3\" inch straps and found they bothered me, went to the 2\" straps proplem solved. I am sure that at certain lengths it does become a bother. But for me and the way I play... No complaints.", "id": 74}, {"review": "It works well for guitars and basses, so long as they are the clover style. Other then that it works just like it says it will.", "id": 94}, {"review": "So these are heavy strings that work well. I did have an issue with the strings messing with my bridge on my guitar but with some more springs it worked well enough.", "id": 97}, {"review": "I read some of the reviews and that people almost had to guess what strings were what. However on the bag that it comes with, to prevent corrosion, and on the box itself have a color coded guide saying what string is what color on the nut. The strings themselves are the normal color for strings.", "id": 156}, {"review": "It does what I need to get my bass and guitar to the amp. Probablly not much use being only five feet in length for a gig or show but since I am only rocking out in my house it's no big deal.", "id": 168}, {"review": "So these are  pretty great strings. Not much to say. The price is really good. About ten dollars a set which is really good.", "id": 197}, {"review": "So while I got this for my soprano ukulele... they fit fine. Not much to say really other then they are good strings and work.", "id": 203}, {"review": "Works well for my guitar. It holds where I left it over a year ago. I don't use it all that often though...", "id": 208}, {"review": "I bought this under the impression that it was a soprano gig bag. I know it says tenor (now that I look at it) but since I put soprano gig bag into the amazon search I figured I would be getting only soprano bags... Anyway it doesn't seem much more then a normal gig bag. Yes it has the pocket for your extra strings and what not. Not sure how well it holds a tenor since I don't have one. Mine is black not the almost purple the image shows...", "id": 510}, {"review": "I bought this since I am a new guitar player...It does hit the frets but doesn't seem to do any damage...Pretty easy to use.The only oddity I have is that the box was kind of open already when I bougt it new.Does the job.", "id": 543}, {"review": "I do question the leather part but since it doesn't say what kind of leather I suppose thats fine, its still a good strap either way.", "id": 661}, {"review": "A nice little amp to rock out with... So it may not be what professionals use or anything like that but it gets the job done which is all I asked.", "id": 721}, {"review": "I recently won an Epiphone les paul specail and was in the market for a bag. This fits nicely and even offers a bit of protection. While I wouldn't say to drop it off the roof or run over it with your car... It does seem to do a nice job of protecting it from bumps on the road and such.", "id": 863}, {"review": "Holds my guitars just fine. It is a bit odd to think that something off balance (one of the legs is shorter then the others) will be fine but it works.", "id": 258}, {"review": "This tuner works fine for the flute and clarinet however for things that use the input jack it doesn't really work. As soon as I insert any cord into the jack it automaticly goes to a very low B flat and stays there... Even if the guitar and bass are not on the other end. At first I thought it was my cord however after four cords doing this, I also tried other tuners with the same cords and they worked fine. So again works good on the sound input but poorly with cord input.", "id": 330}, {"review": "I don't know if 39\" (from the top of the headstock to the bottom of the body {I know guitars are based on the size of the frets but no idea how to do that} ) is the normal size for an adult...However for $50 (its on sale at the time) even if its not I can still learn to play since thats why I bought it is to learn...The pick guard had some sort of plastic cover that was rough but doesn't really affect anything, since it seems like something was put on it to help shipping once removed the pick guard is fine.All togther whether its a full size adult or just one for kids its still pretty good.I am happy with it.Good clean sound, at least with my headphone amp (only amp I have).Comes with Whammy bar(thats what I know it as), one volume, two tone, the pickup sector switch, the cord that connects your guitar to your amp.**EDIT**So now that Amazon has grouped the guitar with many others (mostly the color differences) and that I have a little bit more knowlage of the guitar, not saying much really but a little bit, I have found that mine has two dead spots on the volume... Not much of an issue, for me at least but worth mentioning.", "id": 754}, {"review": "I recently purchased a Epiphone EB-3 bass and it didn't come with a case/bag. So when I found this one and decided for the price it was worth the try. It is VERY thinly padded not much more then a dust cover really. Not to mention that it has issues fitting a side by side into the bag but inlines seem to fit just fine. All in all it's an okay bag but only if you have an inline and don't want much padding.", "id": 781}]