[{"review": "Seriously?  The Shure SM57 sets the standard, which by all other instrument microphones are judged.No kidding.  They work great with guitar (for a REAL acoustic guitar sound, drums, congas, tablas... You name it..  if it's an instrument the SM57 delivers.I hear it's good for vocals as well.  When the President gives a speech, the SM57 is there.In my experience a vocalist better have above average pipes to use the SM57.  The SM58 is better suited to those who lack vocal projection (most wannabe's).For instrument sound reinforcement...  bar-none... the best.", "id": 19}, {"review": "If you thought a pick is a pick (like I once did long ago) you would probably come to realize that it would be a mistake to assume that position as your playing and playing strength increases in attack and/or complexity.I use the Dunlop Tortex 1.14mm Purples.Early on in my playing I was using thin to medium picks but read in a guitar magazine along with hearing from several friends that a heavy pick is better. Why? After messing about I found that the player is able to fully control the pick and not let the pick interfere with input and attack.  The interference with a thin or medium pick is that it has give, or slackens when attacking hard. With a heavy gauge pick that lack of rigidity or slack is only introduced by the player and not through the picks flexibility.I tried it and liked it and have been using heavy gauge picks since the mid '80's.I like the Dunlops feel, grip, and durability. They hold up for a very long time. How long? I have had some last a few years. They are an incredible bargain given the long lasting durability.My students use them too, I don't demand it, but I do stress the control aspects with picks of different gauges.Highly recommended. You won't be disappointed.", "id": 61}, {"review": "I like Dunlop products I used the purple tortex 1.14mm almost exclusively until I met up with this Jazz III.  And now my personal debate continues...  I like a thick pick and this Jazz III is.  I like tortex and this isn't but...I really like the orange color which makes it easy to locate if you drop it.  I rarely and I do mean rarely drop a tortex pick but this nylon might get a bit slick at times.They make 3 or 4 picks in this line with varying degrees of tip pointiness.  I like the pointy model the others have round and rounder tips.This is the new and improved jazz style pick and I am still trying to figure out if I like this or the trad Fender jazz pick.  Or perhaps having a few slightly different picks laying around isn't such a bad idea after all.", "id": 68}, {"review": "Okay,  Color coding is a GREAT idea.Divas will not use the red ball windscreen.Why?Because, from a distance it looks like they have a clown nose.No kidding!  I have had several tell this to me and my sound tech.  So save your dough, buy any color but RED.Diva's!!!!  What can I say?", "id": 178}, {"review": "Flatwound? Ribbon wound?  It's all the same, no squeak, slick, jazzer mellow in tone.  It's a sound that many would like to acheive.  But why not round wounds?  Round wounds give a bit of grip, round wounds also have more surface area and are louder.  Okay, but I have a pickup, want the mellower tone, sans finger noise.  It's important for my playing to not have finger noise.I have the Les Paul for harder edged music, but the archtop jazzbox pleads for a mellower tone, hence the flats.I have a couple of friends who are really great Jazz guitar stylists, they both use D'Addario Chromes - over nickel, so I thought I would try them out.  Nice, buttery smooth and I couldn't really recognized the difference over nickel flats, except the price, and the wear seemed a bit better.Wear and tear is not really a factor for me, as I change out strings every 3 to 6 weeks depending on how much I'm playing.Not ready to take the plunge?  It is a different feel, if not, try half rounds.  They're a hybrid of both, less finger noise, a bit more surface area, hence output.  Output is not a problem if you are amplified.Check them out.  I use the medium gauge, with a 13 high E, the G is wound also.  Finger style or with a heavy Dunlap tortex pick, the attack noise is also reduced with the flats.  I like them alot.", "id": 259}, {"review": "Old tech bungee type of capo.  Inexpensive and works well.  You have to remember that banjos don't have a lot of tension on the neck to they really don't require a vice to get the job done.  Works well on Mandolin's too.", "id": 356}, {"review": "These strings are nickel which greatly reduces fret and saddle wear and they sound good.  If you are using stainless steel strings you are wearing those two critical guitar components down and they will eventually have to be replaced.  Saddles are easy to replace fret wire can be costly as that type of work is best left to the experts which with it comes an added cost to the player.\\So I (and many others) play nickel.Bullet end?  If you are playing a Stratocaster with a tremolo bridge the bullets are designed to fit into the string receivers in the trem block and in effect add more mass to the tremolo block which adds and aids the transfer of tone to the guitar as a whole.Those two beneficial features alone convinced me to give these an honest try and over time (I've been using these for years) have proven to me to be the optimal string for the Stratocaster.These are durable.  Do they last?  Well, yes they do.  I rotate guitars on the gigs so I would say that if I was using the strat exclusively and playing it as much as I do through the week - I end up changing them out every 2 to 3 weeks and I'm playing 4 nights per week not including rehearsal or noodling around and I put them through a rigorous workout.What would that equate to  in hours?  Hmmm...  60 to 80 hours perhaps, maybe a bit more.  Add to that sweat, natural oils, oxidation, and that I don't use cleaners or chems on the strings, although I do wipe them down after a playing with a dry shop towel.", "id": 667}, {"review": "Best Ukulele strings I have found to date.  And I've been playing stringed instruments and uku's for quite a while now.  I like 'em.", "id": 698}, {"review": "I use Fender strings and I have used many other brands as well.  I like Nickel for the reduced fret wear and the sound.  I change out my strings about monthly and if a particular guitar is being used quite a bit I can go 2 to 3 weeks for hard playing.I started using Fender strings with the Stratocaster bullet strings as they are specifically designed to fit into the tremolo bridge on the strat.  They sounded great.  I use these for my telecaster in 10 -46 (factory spec) and they are real nice too.I do not recommend using stainless steel strings on guitars because stainless strings are like using stainless steel files on your frets.  I have seen some real damage in some cases in a relatively short time period.  Stick to nickel and you will be glad you did!", "id": 88}, {"review": "I used to use 009 to 032 and decided to up it a size to the 010...  I like light strings for a more classical and sweeter sound.  The heavier gauges such as 11's are okay too but the 012's seemed to be used a lot for the chop rhythm which I don't ascribe to. At one point I did have a set of Bluegrass 012's on it but they didn't feel right for me plus I didn't like the way the 012's sat on top the nut, I was a bit worried that the nut would crack, which is what happens when the gauges are too fat for the nut slot.IF you want 012's I would highly recommend you take it to a tech so he can evaluate the nut and slot it to the proper width to accommodate the 012.The reason I switched from 009 to 010 is that I was hard pressed and in need of a set and the local music shop didn't carry the 009's any longer so I went to the 010.  I believe my mando was set up with 10's or 11's but I wasn't sure.  I tweaked the action and the 010's are fine and I've made the adjustment.Strings, ahem....  are just about all the same.  They local music shop is very knowledgeable and they told me a story around NAMM shows and how the string booths don't really give out too much info and the origins of their products.  There may be (according to the my local music shop) a few companies that actually make their own strings but the bulk of the strings out there are probably manufactured in a mass quantities at factories in PRC or other offshore sources, sold in bulk and packaged by the companies.  Who knows?  And the shop sure tried to find out but it's a dark dark secret out there at the trade shows, so nobody is talking, and making a logical assumptions from a corporate standpoint are probably not too far off the mark, i.e.  Strings are mass produced for market and most string companies as I said earlier are buying bulk and packaging for the consumers.What does that mean?  That means I need some inside info to this bulk purchasing and I'll sell my own!  The quality is probably up as much as the tooling and raw materials will allow, so why not!Cheers!", "id": 408}]