[{"review": "This does what you expect, it stands up a guitar. What can else can be said? It has a swing lever that keeps the instrument an an unfortunate accidents. It is portable, folds up easily for storage. I usually have a guitar on it all the time.", "id": 133}, {"review": "I use the chair for guitar, bass, keyboards,ukulele and even cooking breakfast. Lightweight, slightly awkward, but provides good back support.As a right-handed player I practice, both classical and jazz style, with the guitar on my left knee. For the position I use in this chair it is necessary to use the On Stage FS7850B Guitar Foot Rest. I do this to keep my thumb in the center of guitar neck. I can report that I have been very comfortable for long practice sessions.As for the four out of five star review, the price does seem steep when you look at what you get for $85. But it's a nice design and thank you to the designer. I would recommend it to those who can afford it.As for durability..... we shall see. I have had it for three months now and it is still fine.  I use it daily.", "id": 518}, {"review": "This is accurate and can be used for many different purposes, It is durable and can be used while playing.", "id": 763}, {"review": "I have the Fender Mustang IV and I would say the fender is a superior modeling amp, but if you want to use an amp for bass and acoustic guitar as well as a modeling amp this is the amp to get. The bass sounds great and when I played Here Comes the Sun on my acoustic, I'd swear the tone sounded like the Beatles record. The modeling sound is ok  and they tell me there's a looper here but i'd have to pay an  extra $120 for a pedal to access it. Oops, there goes a star for the con job. Peavey could have easliy included or at least offered a pedal for much less. I'll wait and pick up a pedal used in the future.", "id": 872}, {"review": "Its a tight fitting case. I am a proud owner of aEpiphone Les Paul Custom Proand it fits as snug as can be. When I ordered the case I assumed it would be made for my guitar. It arrived double boxed and wrapped in plastic. I am sure I received a new case. Being perfectly  protected as it was, it hadn't a mark on it so.As far as the construction, it not a flight case by any means. It looks as though it will hold up to at least some abuse and still do its job, to protect the guitar. My guitar does not move in the case due to its perfect fit. With this said, over time there is a possibility of wear. I would predict the buckles may be the first to fail. And then handle doesn't look as durable as it could be , we'll see on that.Overall this is the case for the Epiphone Les Paul. I saw the Gibson case and I just don't see them as superior enough to justify paying more. I am satisfied with my purchase and I think most people would be. Five stars for now. I will edit in the future if necessary.", "id": 50}]