[{"review": "At &lt;$20, this is a great bargain, but it is a very basic bag. It fits my Les Paul Standard snugly and has back straps for easy carrying. These are also easily removed if they bother you. This Epiphone gigbag also has a zippered pocket for accessories (holds a strap, patch cord, but not much else) and features nice looking graphics.", "id": 51}, {"review": "Sorry, but I'm not as smitten with this cloth as some of the other reviewers. It's okay; good size, works pretty well, but sheds when new. And despite claims of being laundry-safe, the edges began to unravel after the first wash. I used with Planet Waves Restore polish and got good results, but probably would not buy again.", "id": 184}, {"review": "Despite an overwhelming petroleum smell coming out of the box, this is a high-quality gig bag with plenty of storage space. Fits either a Tele or Strat. I don't typically keep my guitars in their cases, but bags like this one come in handy for gigs, short trips, moves, etc. Nice styling touches, too. The bag has removable back-straps for carrying ease.", "id": 473}, {"review": "Any product that can make an intermediate-level player like me sound like a pro is a sound investment. The RP255 is an amazing processor loaded with features (looper, drum machine, tuner) and dozens of cool pre-sets (\"Greasr\" is my favorite). You can customize your own sounds but I still haven't gotten tired of Digitech's choices. The AC adaptor (included) allows for hours of rockin' fun. I live in a condo, so the headphone jack is essential. I run my iPod through the unit and play along to my favorite tunes - sweet! The control settings can be a little daunting at first, but the owner's manual will walk you through the tough stuff. Bottom line: a great toy.", "id": 590}, {"review": "A cute little monster that's surprisingly loud and versatile. I bought primarily for travel and I'm pleased with my purchase. Don't expect too much for $20 (it's all plastic) and you should be satisfied too. The amp comes with helpful instructions showing different tone settings (fuzz, twang, etc.). I also purchased the AC adaptor since these things typically eat batteries.", "id": 605}, {"review": "If you're looking for an inexpensive leather strap, this one will do nicely. Leather is supple, not hard, and it looks great with natural finish guitars. My only complaint is that it is difficult to attach at first (holes are smaller than usual, probably an anomaly). So for the price of polypropylene or cotton, you can upgrade to leather.", "id": 656}]