[{"review": "Not that many good products/accessories for ukuleles.  This one is perfect in size and price.  However, you must be creative when attaching it to the headstock.  Just give it a little thought.  Overall it's fine.", "id": 190}, {"review": "I only needed one string, but it works fine.  These are good strings, but not 5 stars good.  And I have spares for later or to share.", "id": 225}, {"review": "I just got these in and I have to say, very disappointed.  It's as if I went into a boy's shop and bought a large shirt and expected it to fit a man.  What do they call medium or small?  This \"large pick\"  barely goes over my thumbnail area. I can hold it, sort of, so we'll see how well it works with my hybrid plectrum project.  (BTW, I'm an average grown man, 5'7\", 165)  More to come...Here we go, a few months later:  I just had a chat with a music store guy and found out that a \"large\" thumb pick refers to the thickness of the pick!  Bottom line, if you want a thumb pick that fits, go to a store and try before you buy!  Good luck to all.", "id": 343}, {"review": "There aren't enough uke straps out there for a good price.  This one is great.  I take away one star because the padded part could be a bit smaller, lighter.", "id": 352}, {"review": "This is one of those products which is easier to find and purchase online than trying to shop.  Its performance is min/max the same.  I've used three with no trouble.  You can get excellent instructions and tips on YouTube.", "id": 598}, {"review": "The absolute best strings money can buy for a uke.  Installed on a cheapo soprano, they helped a lot, but they won't do magic.  Good luck.", "id": 698}, {"review": "If you play a string instrument, this one is a must.  I have several and a Snark for each one.  Unfortunately, in the span of about two years, they've gone from about $6 (in bulk) to about double that.  It's a good product, but shop around wisely for the best price, and hint:  read the fine print, if they include a battery, you'll pay lots more.  I even found the batteries online about half the price than in a drug store. Five stars for performance, take away one for greed. And another comment in 2013.  I decided to buy 4 more, but went to another source which only charged ONE shipping price, not 4.", "id": 707}, {"review": "I've been playing and collecting ukuleles since spring of 2010.  Good news:  these Aquila strings are on most new ukuleles.  Bad news:  These Aquila strings are NOT standard on some others.  I was able to take off the old ones and install these in less than half-hour.  (You can get a tutorial to do anything on YouTube!)  They will stretch and de-tune for a few days, but once tuned, they sound, and just perform, great.  Good price, great product.  Order extra to keep on hand.", "id": 829}]