[{"review": "I didn't expect this cable to be so thin. It's easily 1/2 the thickness of any guitar cable I've used. Not sure about long-term durability or signal loss/interference. If I had the foresight I'd spend a couple extra bucks on a thicker cable.  Still, it works and was inexpensive.EDIT: 6 months later and it's dead already.  Wire frayed at the right angle jack.  You get what you pay for.", "id": 6}, {"review": "I've had this pedal for about five years.  I own a bunch of other overdrive pedals, including the Boss SD-1, TS-9, a Klon clone, and a bunch of DIY pedals.  The Bad Monkey is cool for a couple of reasons.  First is the bass and treble controls.  Most overdrive pedals only have one tone control, the Bad Monkey lets you sculpt both the highs and lows.  Second is the mixer out.  Not everyone will appreciate this feature but it allows you to jack the pedal into a mixer or audio interface with a \"speaker sim\".The gain sound is ok, but what I do is use it as a boost by diming the output and turning the gain all the way down which slams my tube amp giving me a natural tube overdrive.  This pedal will work best with a tube amp but some people may dig the gain tone on a solid state.It's built like a tank.  Can't go wrong for the price, IMO.", "id": 145}, {"review": "The Rat has been used by everyone from David Gilmour to Dave Grohl to give you a grasp of its range.  It does everything from light crunch, to Marshall-style thick rhythms, to all out face-melting distortion.Rich harmonics, near infinite sustain, and a mid-range push that will cut through a mix like no other distortion pedal.This pedal has not left my board since the day I bought it.  The fact that it's built like a tank ensures it's going to be around a long time after my playing days are over.", "id": 232}, {"review": "The Good:This is a good tool to practice guitar with headphones.The Bad:The tones are not good by any stretch of the imagination, unless you like hyper-distorted noise.  The cleans sound artificial and the crunch tones have obvious digital distortion applied.  The effects are hit and miss as well.  Plate reverb is decent but spring reverb is so artificial sounding that it's downright offensive.Throw in the fact it chews through batteries, the software interface you use to program it on your computer is really difficult to use, and how it loses its small-and-portable-factor with a guitar cable, headphone cable, and power adapter plugged into it, I'd be hard-pressed to recommend this product unless you really need to practice through headphones.", "id": 427}, {"review": "While I've never been a big delay guy, I've always felt my pedal board was missing this particular effect.  I'm definitely not a fan of digital delay, so I did a lot of R&D; on analog delays in hopes to find the right one for me.There are basically three options out there for delays under $200: MXR Carbon Copy, EHX Memory Boy, and Malekko Ekko 616.  I realize that there are other pedals out there, but according to my research these are the best three for the price.The Memory Boy seemed good but my concern was it can do a lot of exaggerated modulation, something I was not interesting in.  Crazy effects are an EHX trademark so if you're looking for that sort of thing the Memory Boy might be up your alley.  I read nothing but good things about the Malekko Ekko and tossed back and forth between that and the Carbon Copy for a while and ultimately went with the Carbon Copy because I was able to find the most first-hand reviews of it.I don't regret my decision, this pedal sounds great.  The repeats are long and do not sound artificial.  Some people complain the repeats are too dark but I don't think those people understand the difference between analog and digital delay.  If you're looking to recreate The Edge sound, analog delay is not for you.I'm able to create all types of sounds from this pedal from just thickening up a rhythm track, to slapstick, to dreamy repeats on solos.  I love it.  Sometimes I just leave the pedal on with the mix knob dialed down for subtle ambience in my tone.One minor criticism is that the modulation effect is subtile, at least out-of-the-box.  There are internal trimpots to make the effect more pronounced but I have yet to mess with them.  I would rather have had the controls be knobs on the pedal itself.", "id": 507}, {"review": "I could never see myself buying a dedicated compressor, reverb pedal, harmonizer, ring modulator, etc.  The Line 6 M5 seemed like a good way to have a \"jack-of-all-trades\" pedal on my board for those times I needed one specialized effect.  I have to say that it serves that purpose in spades.I have an all-analog board and was reluctant to have anything digital on it based on past experience with modelers.  I was wrong to worry; digital has come a long way.  Almost all of the effects sound great to my ear, especially into a tube amp.  True bypass means no tone suck to boot.High points for the delays, reverbs, and mods.  I am not a fan of all of the drives but the Overdrive and Boost Comp sound pretty awesome.  The Rat model \"Classic Distortion\" sounds exactly like my ProCo Rat2.  Wish I could say the same for the Big Muff model but I guess they couldn't get them all right.The only issue is I liked it so much I could not resist the urge to get the M9 so I can run three effects simultaneously.  However, if you need a pedal to fill in for those times when you need a certain single effect the M5 is a winner.", "id": 756}]