[{"review": "Another quality product from Hosa.  Just what I needed for an insert patch from my mixer to EQ.  I always like slightly longer length as I can always zip tie back but hard to stretch!  No noise from this cable!", "id": 9}, {"review": "I play 5-string bass, both electric and acoustic and love this stuff.  Each bass I have has different strings for various reasons and I use this on every one.  My wife uses on her 6-string acoustic and electric guitars.  We keep a can in every case!", "id": 72}, {"review": "I probably should buy another one for other guitars, but I carry in my electric case.  I'm sure the day I will need it, I will have acoustic with me!  I use different method for my bass, but this is perfect for 6 strings!", "id": 94}, {"review": "This kit has just about everything needed to clean and maintain your guitar or bass.  I would also by the Dunlop lemon oil as well.  Worth the money.", "id": 95}, {"review": "You should find another review from me, but suffice it to say I just won't skimp on my cables when I spend 1000's on amps and cabinets for good sound.", "id": 125}, {"review": "A big help on the workbench when working on either guitar or bass.  Seems sturdy enough.  I side on safety so I use a soft cloth for extra protection, but this item does what it was designed to and should last a long time.", "id": 163}, {"review": "I can't remember how many years ago I started using this great stuff.  Like everything else, moderation is the key and having good clean neck and strings is where it all starts, but a quick spray and a wipedown with a lint free cloth does wonders before every time I play!", "id": 173}, {"review": "This sure wipes down any guitar to get finger prints and such off.  Remember, I would not use this with any kind of polish, a little pricey, but then again, aren't our toys!", "id": 184}, {"review": "I bought this for one of my heavier 5-strings as a replacement strap and love it.  I use that particular bass for slap and usually hang that bass higher on me that the others for good slap technique.  This strap adjusts well and the padding is in the right place and comfortable.Good Strap!", "id": 188}, {"review": "This comes with adapters for just about any pedal you would need power for and if you look at the picture, I LOVE the way this mounts to power strip.  You can actually put several (if needed) side by side, unlike most other power adapters that take up as much as 2 spaces.  It is rated to 1700 mA but I try to keep to 1500 or less.I looked at power requirements of all my pedals and combined accordingly.", "id": 191}, {"review": "I am buying several more to mount on assorted amplifiers for practice room and studio.  On stage, I prefer microphone boom holders.", "id": 233}, {"review": "By far the best to use on the neck of any guitar or bass.  Applies easily and what is not absorbed between frets, wipes right up.  A must to keep wood looking fresh.", "id": 234}, {"review": "A must have in every gig bag for checking all your cables.  I keep this with my battery tester for my active's.  Sure eliminates a lot of guess work at this first hint of audio trouble.  Easy to use and economical product.", "id": 318}, {"review": "I have always trusted the Graph Tech TUSQ products and this is no different.  The compensation for this saddle was almost spot on with little adjustment needed.", "id": 414}, {"review": "The compensation built into this saddle makes another hit with GraphTech TUSQ products for me.  They have done the hard work, just needed some personal fine adjustments and good to go.  Good sound quality for not being bone.", "id": 415}, {"review": "Bought this to power all my stomp boxes, wha peddle, tuner etc.  Works just fine.  In fact, bought a 2nd one that stays on my workbench for powering various items being tested or worked on.  Has all the adapters I needed.", "id": 428}, {"review": "This is a good micro-fiber cloth, but I guess because its from Ernie Ball it costs more than other clothes.  But if you are like me, its all about my axes, I have one in each gig bag/case!  I don't recommend using with polish, just a wipe down after each guitar or bass use.", "id": 437}, {"review": "Bought these to plug into practice bass amp (wifey a little nasty when I get itch to play at 2 am).  I play 5 string and I could not believe the deep sound I get out of these, especially in this price range.  Highly recommend!", "id": 458}, {"review": "I bought a couple to replace some of my old rusty chrome stands and was skeptical at first.  I have several bass guitars and they are very stable and very economical.  Have bought several more.", "id": 519}, {"review": "I simply love the cradle from Jim Dunlop (although a little pricey).  First, the material that the neck rests in is very soft.  Overall it is bigger than appears and it gives me warm fuzzies to know my guitar won't fall off of that skimpy little 3 legged arrangement sold elsewhere on this Planet.  I did find it to be a little short to support my Ovation Acoustic Bass, but a small length of 2 x 4 fixed that.  Second, it is nice that it just rotates over to support the front of the fretboard while guitar is on its face which I need to get into the back guts side of my Ovation.", "id": 550}, {"review": "I ordered two sets so that I could set everything up in nice orderly progression on my stomp box.  Heard no evidence of hum and they seem to work just fine keeping everything in order!By the way, these are listed as  .5 feet (6\"), but actually are 10\".  Wish I had measured as I ordered a 12\" long cords thinking they would be twice as long.  Oooops, my bad when I discovered they were only 2\" longer!", "id": 578}, {"review": "It does not stick on to the guitar very well.  Trying some of the other reviews as to ways to get it to stick worked but I now have a small circle in the finish of my Martin.  I made mistake of attaching so wife could play Rocksmith and now wish I had used cheaper guitar or better yet, bought a better pickup.", "id": 610}, {"review": "It performs ok, although it takes a learning curve getting used to the strobe dial.  I found it too difficult to see from my pedal board, (I am over 60, so eyes ain't what they used to be!).I was also disappointed to find there was no power plug, just battery.  Adding a 1 Spot power proved difficult as the only way to run the battery adapter is along the side where the pedal is pushed.  I fixed problem by taking my Dremmel and grinding a groove just big enough for wires to be unobstructed.For the above reasons, I have elected to use this as my work bench tuner for guitar set up and have gone to the Ashdown Engineering tuner for my pedal board.", "id": 651}, {"review": "Good cords with a decent length.  I like the right angle as sometimes it gets tight in a pedal box.  I order the longer cord to go to my wah pedal which I always set outside of my pedal board.  Works quite well.", "id": 663}, {"review": "Good quality cord and connectors.  I had zero noise level using these cords.  Seem to be of a good value.", "id": 692}, {"review": "GREAT WORK MAT FOR ELECTRIC AND ACOUSTIC GUITARS AS WELL AS BASS AND STAYS AT MY WORKBENCH.  HOWEVER, I NEVER LEAVE IT ROLLED OUT UNLESS WORKING ON A GUITAR, TO MANY OTHER STRAY FRAGMENTS OF WHO KNOWS WHAT FLOATING AROUND IN MY WORKSHOP AND I DON'T WANT ANYTHING FALLING ON MAT THAT COULD POTENTIAL SCRATCH ONE OF MY BABIES!", "id": 705}, {"review": "Far better than any light weight chrome stand, this has guts!  Easily adjustible, knobs tighten easily and firmly.  Good height adjustment for sitting or standing.  Highly reccomend this stand!", "id": 858}, {"review": "Good quality rack screws that come with rubber washers to protect face of equipment.  Arrived ahead of estimated arrival time which is always nice.", "id": 22}, {"review": "I use this primarily when setting up guitar and measuring strings by locking down on 1st fret and taking measurements from there.", "id": 116}, {"review": "I bought this for my granddaughter to use at home for her flute practice.  Very sturdy and well made stand and adjusts very easily even for a 12 year old.  Should last her a very long time.", "id": 696}, {"review": "I ordered this primarily for my 5 string Ovation Bass.  First, there is very little room on the head stock for it to clamp without hitting strings.  My Ovation has a beveled end to the head stock but I was finally got it on the bottom between the D & G string tuners.  It does not respond well to an open B, but octaves are fine and as long as I have confidence in my intonation it is no problem.  I tested it against some of my more sensitive tuners and found it to be spot on.  When I tried it on my Ibanz solid body 5-string I found it to be even less likely to &#34;read&#34; quickly or at all. Also worked great on my 6 strings.", "id": 762}, {"review": "I bought these because I needed just a few more inches to reach a couple boxes on my pedal board.  I have the Planet Waves patch cords called 6&#34; so I thought these would cover it being 12&#34;.  When I went to hook up, they were still too short so I immediately blamed these cords.  OOOOOPS, took out the tape measure so I could complain and found that these are indeed 12&#34;  I then measured the Planet Waves and found they were actually 10&#34;, not 6&#34;.  My bad!  These seem to be good quality and they are exactly what they say they are.  If you want to spice up your board, go for some color!", "id": 805}]