[{"review": "They're just great.  Awesome for chord based songs.  If you need to pick individual notes/strings, then you might want to go a bit thicker.  With that said, you can do it with these, but the tone is not as nice (sounds a bit softer).", "id": 62}, {"review": "I've had these on my Yamaha APX500 for a while now and they sound really good.  A tad brighter than I like, but that's just the nature of the lightness of the strings.  It's real smooth when playing and they seem to be lasting longer than most strings I try.  In fact, I've had these strings on for over 4 months now and they still feel and sound good.", "id": 103}, {"review": "It does a good job for it's primary purpose as a capo so I gave it four stars.  It works flawlessly, but the one minor annoyance is that it doesn't easily stay on the head of the guitar except above the nut where if you screw it a bit tight it could mess with the tuning of the guitar.  With clamp on capos you can just clamp them on the wood.", "id": 304}, {"review": "Works as advertised.  Makes the fretboard look and feel nice! I imagine this stuff will last for quite a long time as well since you only really use this when you're changing your strings.", "id": 344}, {"review": "Spray on a fairly minimal amount across the body of the guitar and rub down with a lint free cloth.  Shines nice and doesn't leave it feeling oily/sticky.  Smells nice and makes your guitar looking new!", "id": 351}, {"review": "I read the reviews on this product and decided that a lot of these reviewers probably know more about guitar effects than I do and since most people seemed to like it, I figured I'd give it a try.  I was not disappointed at all.  It gives you great sound for solos.  I've tried it on a few different kinds genres and found that it's quite versatile.  I still have to play with the settings a bit to really get the sound I want, but I think that's just learning about the effects this box provides.", "id": 471}, {"review": "Pros:1) records excellent audio through built in mics2) records excellent audio through all the inputs and is very portable and versatile.3) I love the 4 track ability and the effects built in to the device.  I can record multiple things in less time especially when I'm just messing around to get a feel for a song4) comes with a memory card and batteries so it was ready to go out of the box.Cons:1) battery life is weak2) built in mics have to be placed very well so not to pick up other noises and only what you want.", "id": 581}, {"review": "It doesn't seem to be loud enough for a recording device that I have, but other than that, it works as described.", "id": 690}, {"review": "This thing is awesome!  I think it's the best tuner I've owned and it really does an excellent job.  It's easy and clear and everything a tool should be.  It's fast and easy just like a tuner should be.", "id": 706}, {"review": "I was a bit skeptical about the quality of the guitar when I was thinking about buying it, but I read all the review on it and decided to give a shot.  I figured for the price ($39.99 in late Nov 2012) that it wouldn't be a big deal if it was a crap guitar because I bought it to play around with while I visit my family in CA.  When I opened it, I was pleasantly surprised!The guitar came in great shape.  It was packed well and didn't have any damage on it.  The top fret on the fretboard has some extra glue on it, but it doesn't affect the performance of the guitar.  It came with an allen wrench to adjust the trust rod and once I lowered the action on the guitar, it was much easier to play.The sound is excellent even with the strings they provide which seem like medium weight.  Overall, I'm extremely pleased with my purchase.  It sounds as good or better as my old school ovation that cost three times as much.  The pick guard looks a bit cheap, but that's just nitpicking.If you want a cheap guitar that sounds great, I totally recommend this one.  I am extremely happy with this purchase.", "id": 726}, {"review": "Open cap, rub across strings a few times.  Basically, you're done.  If you want to take a lint free cloth and clean each string after one glide over, that works well too. Doesn't leave the strings oily or full of residue.  I will probably clean my guitar strings every time I play now!", "id": 730}]