[{"review": "This is a good solid cable with no problems. When I'm on stage, I like a longer cable but at practice I don't need all the extra length tangleing up on everything...", "id": 6}, {"review": "This is a very good cable. I don't forsee having any problems with it. It's just right for hooking my pedals together eithout the mesws of long cables. If you need this get it. The price is right and shipping was right on time.", "id": 11}, {"review": "If you own more than 1 pedal (and we all do) you need this and the 1 spot adapter. It will save you a lot of money on batteries and aggravation when you battery runs out on stage. It's worth it's weight in gold. and RockIsland Sound sends it out FAST!. You can count on me for future purchases! Thanks Guys!", "id": 192}, {"review": "I just got it today and haven't spent too much time with it yet. It sounded OK and I like the features on it. I especially like not having to step down hard on the toe to engage the pedal. As soon as you press down it's on. Lots of adjustments so I'll be tweaking for a while to find my sound, but it seems like it's going to be OK. It's a lot different from my crybaby so there will be a little learning curve. For the money It's a great pedal.", "id": 379}, {"review": "I like the sound of this pedal. It gives my ss Fender Princeton chorus a good tubelike sound. I have 2 all tube amps but they are both heavy. I prefer taking the fender ss on smaller gigs. The TO800 gives me the sound I like without breaking the bank. I haven't used batteries in it because I use a 1 spot adapter on all the pedals on my pedalboard. If you'rethinking you want this and are on a tight budget go ahead and pull the trigger. You won't be sorry.", "id": 381}, {"review": "I love this pedal! That said I would like to address some of the reviews I see on here. I have been playing guitar since I was 14 years old. I am now 57 so I have a few years of experience. First you guys who complain about the plastic housing. Are you jumping up and down on your effects pedals? If you are stop doing it. All you have to do is gently step on the switch and it works. The plastic housing is extremely strong and won't bust when used properly. The next thing I would like to address is the battery running down &#34;even when it's turned off&#34;. Every effects pedal I ever owned would run the battery down if you leave your guitar plugged in when not playing it. Get a one spot adapter and a daisy chain. It will save you a fortune. The ones saying the sound sucked, buy something besides a $50 amp, and learn where to put the chorus in the pedal chain. Thi is a good pedal and I've used it on stage for 2 years without a problem. That means I have spent about $11 a year for a pedal that has earned me Thousands! Buy one, learn how to use it and you'll be happy.", "id": 487}, {"review": "I've had this amp about a week now and I'm still finding cool things about it. The first thing I did was went through all the presets. I didn't like the clean channel,( it wasn't really clean) but I quickly found out how to set it like i wanted it (press the clean button then turn all the preset effects to 0 and then hold down on the clean button about three seconds until the lights blink and now it's really clean. You can also do this with all the other channels too! just set every thing like you want it and hold down the button on the channel you want and there it is. and don't worry, you can always reset it back to factory settings and start over. It's a small amp but it's bigger than I thought it would be. But the sound that comes out of that 8&#34; speaker is BIG!. I have been playing for about 30 years, and I know I could use this amp in a small club without running it into the PA. If you do need a little more volume, it has a line out so you can run it to the PA and have all the volume you want. I would buy this amp again if mine was stolen. Makes a great practice room amp. You can take it without all your pedals and still have all the effects you would need. For the price it's a bargain!", "id": 619}, {"review": "I have several tuners. one is an inline tuner, one built into my amp....etc... This is my favorite go to tuner. It's fast and accurate. Every one in my band uses this tuner. It works for guitar and bass. It's easy to read and dead on....", "id": 707}, {"review": "This is the answer to your all your power supply needs. If you own more than 1 pedal (and we all do) You need this. It powers my Wah and all my stomp boxes with 1 plug. It comes with all the different power plug options and a daisy chain for 5 pedals. It has the adapters to power pedals without a place to plug in by attaching the battery snap to the battery place on the pedal then pluging into the daisychain. It also has the pin plugs to attach to the daisychain for pedals that require that kind of plug in. and it has a 10 foot lead wire so you can reach out to your pedals or pedalboard without having to drag a heavy extension cord across the stage to trip on while your playing. you'll save enough money to pay for it in no time, not having to buy batteries. Get it, you'll love it! I", "id": 191}, {"review": "Nice strap for the money. I ordered black but got brown.", "id": 659}]