[{"review": "This pedal has been around for a long time, and though the overall quality has declined as Boss has cut corners to enable lower priced mass production of their pedals, the boss ds-1 remains the staple image of distortion stompbox's. The ds-1 is a no-frills tank of a pedal; it was designed to withstand a direct nuclear blast as well as Michael Moore stepping on it, so you know it can take any amount of punishment you might care to give it.This pedal doesn't replicate any type of amplifier-it's not a \"Marshall-in-a-box, or a mesa boogie, or a vox, or a Fender; from a tonal aspect it isn't complex or dynamic. It will add plenty of grind to your tone, and plenty of hum to go with it. If you're looking for your first distortion pedal to use with your 15-watt practice amp, look no further. If you have a decent tube amp, look elsewhere, because with this pedal, you get what you pay for, and it simply will not do a quality amp justice.Pros: Inexpensive, good build quality, distorts your signal.Cons: Lots of hum, the tone control gets really shrill really fast.Without the excessive hum and almost-unusable tone control, this would get 4 stars.", "id": 35}, {"review": "I'm not going to do any explaining about the \"science\" behind how this pedal works. I'm just going to focus this review on how the pedal affects your tone. This definitely isn't a boost, and it's also not an eq, the BBE sonic stomp is a uniquely functioning pedal. To the ear, it serves to add clarity, depth, and body to your tone. Essentially, this pedal allows you to get the most out of the tones your amp is already producing.The lo contour knob doesn't \"increase\" the amount of bass produced by the amp. Rather, it tightens up and generally increases the depth of the bass (and low mid) tone. To the ear this may sound at first like the bass has been increased, but it hasn't. You're just hearing all the bass tone that was there in the first place, that was jumbled up as the signal went from your guitar to the amp.The process knob really just focuses on the treble and high mid frequencies. These frequencies can often be very unpleasant and grating to hear, and the sonic stomp sort of evens and smooths out those tones so they are clearer and less harsh.That's not to say that you can't dial in some very aggressive and cutting highs if you play lead metal or something; indeed, it'll make those searing lead tones even better.Now, I gave this product 4 stars not because I've had any issues with it or haven't been in any way unsatisfied with it; but rather because it's really a fairly subtle effect. At first I almost couldn't tell a difference between having it on and off. With time I've been able to better recognize and appreciate the impact that it has on my tone, but it doesn't make a \"night and day\" difference.I recommend this pedal to someone who already has a tone that you're happy with, and just want to make it even better. This pedal won't make a cheap 15 watt solid- state combo sound like a tube half-stack. It won't make you love your tone when you were completely unsatisfied with it before.In conclusion, though I definitely wouldn't put this pedal into the \"must have\" category, it definitely improves the quality of my tone. This is a pedal that I leave on all the time, as it improves both clean and distorted tones.", "id": 300}, {"review": "This pedal is based on the famous Ibanez TS-808 pedal. My hat's off to Behringer for doing an excellent job of recreating the classic sound in an affordable package. I don't own the TS-808, but I do own a TS-9, and while the TS-9 does offer a nice gritty overdrive overdrive that has enough bite to bring your tone out in a mix, the TS800 offers a warmth and a sweetness that I've simply fallen in love with. Several of the classic tubescreamer characteristics are audibly present: Slightly rolled off bass and a bit of a mid-range hump, with a tone control that offers useable tone at any setting. I usually max out the level knob and adjust the drive know to taste(which never exceeds 12 o'clock); I've found that this setting gives my tone the most body and depth. I use this pedal primarily with my Jet City JCA20H head just to \"pump\" it up a little bit. This combination takes me straight into Guns 'n Roses (or that type of 80's/90's-era rock) territory.Used over a clean tone the TS800 offers a very warm, smooth, bluesy overdrive that can either be more of a clean boost or add some grit depending on where you set the drive knob.The pedal is made of plastic, and while it seems solid enough, it's the only area where this pedal really merits any criticism. But considering that Behringer is offering this pedal for [...], it's clear that in order for Behringer to offer such great tone at such a low price, sacrifices in build quality had to be made. That being said, I don't feel concerned at all that this pedal will suddenly break on me; don't be too rough with it and it should last a good while.", "id": 381}, {"review": "Since, as of right now, this is the only review of this product on amazon.com, I'll try to answer any questions you might have about the EHX Pocket Metal Muff Pedal. This pedal is the model of simplicity; a volume control, a distortion control, and a switch that changes the amount (or lack thereof) of mid-scoop. That's doesn't leave much room for tone tweaking, so \"tweakers\" beware! That being said, Electro-Harmonix did a commendable job of pre-setting useable treble and bass tone levels that should only require minor tweaking of your amp's eq to get it right where you want it. Playing through my Fender hotrod deville amp, I was immediately shocked at how good this pedal sounded. The bass was powerful and chunky, great for heavy metal palm-muting riffs; the treble had a good bite but it wasn't harsh; and all three midrange modes sounded great, depending on the application: Want just a flat midrange for a punchy tone? Just leave the mid-switch on the flat setting. Want a slightly scooped midrange tone for a good all-round metal tone? Move the switch down to the low mid-scoop mode. Do you want to play Master of Puppets by Metallica? The high mid-scoop mode is calling your name. This pedal offers quite a bit of distortion, but I was amazed to find that even at the higher distortion levels, my tone remained clear and defined. It didn't turn into a plastic-y, fuzzy mess like most distortion pedals *cough* metal zone *cough* will. I will mention that this pedal isn't the best if you're looking for a more modern metal tone. You won't get a slightly fizzy, ultra-gain (think Slipknot) sound out of this pedal. Rather it offers a very crunchy, defined roar more characteristic of the pre-dual rectifier mesa boogie amplifiers.In conclusion, I give this pedal 5 stars because it does what its designed to do very well; this version of the metal muff line isn't designed to be highly versatile and \"tweakable\" in and of itself; get the metal muff with top boost pedal if you want a 3-band eq and a boost function. This pedal is designed to be a very simple, small box of pure classic metal tone, and that's exactly what it accomplishes.", "id": 397}, {"review": "This is a pretty awesome pedal, especially if you're going for more of an 80's or 90's metal sound that's more chunky and defined than fizzy. Think earlier Mesa models, like the famous Mark III C+ that was used by Metallica on the Master of Puppets album. Of course no pedal can perfectly replicate that sound, but the Metal Muff does a pretty amazing impression.Some of the best aspects of the Metal Muff include:1. Great clarity and definition, even on higher gain settings. Seriously, most high gain pedals cause you to lose a lot of definition in your playing, but the metal muff doesn't do that. So especially for the lead guitarist, this should be a major selling point.2. Wide range to the tone controls. With some pedals it's really hard to hear a difference when you adjust the tone controls, but not so with the metal muff. You can easily dial in the sound you're after, or maybe even find a new sound you like even better.3. The quality of construction is absolutely superb. Everything about the pedal is rugged and durable. I'd feel totally comfortable gigging without a backup.On a different note, I've only used this pedal with my Fender Hotrod tube amp, and it sounds great. However, I prefer the Rocktron Zombie pedal to the Metal Muff(see my review of the Zombie for more info on that). However, the Rocktron Zombie doesn't sound good through solid state amps. I mention this because if you're using a tube amp, I honestly feel that the Zombie is a better option. But if you're playing through a solid state amp, the I've read that the metal muff still shines. Just something to consider.To conclude, this pedal is awesome if you're looking for a pedal to give an all-round good, straight-up metal sound. Sure, it's a bit of a one-trick pony, but it's a pretty good trick. If you're looking for an ultra high-gain distortion monster then look else where, but otherwise I recommend giving the Metal Muff a look.", "id": 399}, {"review": "If you're anything like me, then I know what you're thinking: Digitech= Digital, fake-sounding junk. Not anymore. The Digitech HardWire CM-2 finishes what Digitech began with the Bad Monkey, which is a great overdrive pedal in its own right. But the CM-2 offers tone quality that compares to the best on the market (and as a pedal maniac, I've owned wayyyy too many overdrive and distortion pedals, so in all humility, I know what I'm talking about) and flexibility that is rivaled by none in the market for anything close to the price.What makes the CM-2 so great is that, like several other reviews have mentioned, it's not just another tube-screamer clone. There is no distinct mid-range hump and slightly rolled off bass that tubescreamers (particularly the TS-9) are known to have. There is a lot of range to all the knobs; the level can add some serious boost, bass and treble knobs allow you to significantly change your tone if that's what you're after, or you can dial it to be more (but never completely) transparent. Also, the CM-2 has more gain on tap than most overdrive pedals; you can go from basically a clean boost to adding a surprising amount of saturation to your tone. Lastly, the classic vs. modified switch gives you the option of adding some gain and bass by switching from classic to modified.I've tested the CM-2 as both an overdrive to a clean channel Fender Hotrod Deville, and as a front-end boost to my Bugera 1990 (basically a Marshall JCM 900). The CM-2 sounds great in both applications. Over the clean channel of the Fender, it sounds very full and smooth. Even turned all the way up, the overdrive never sounded very \"grainy\" or fuzzy; it maintained warmed, organic, and tube-like. \"Boutique-esque\" is how I would characterize it. Great for blues playing, and I'm sure that playing with the tone knobs you could dial in some good country tones as well.However, I use it more as a front-end boost to my already-overdriven Bugera amp. In front of the lead channel, CM-2 serves to take my tone from hard-rock crunch territory to a more metal tone, with chunky bass and roaring highs that make palm-muted riffs sound as at home as if they were coming through a Peavey 6505.As a conclusion, I'm really pleased with the quality of the Digitech CM-2. Both the sound and build quality are top-notch, and for a price similar to or less than most quality overdrive pedals on the market, I highly recommend checking out the CM-2.", "id": 529}, {"review": "To start, as the full name of this pedal would indicate, this pedal is for tube amps. I can't comment on how it'll sound for a hybrid, and my experience is that it's definitely not for solid state. Distortion pedals go much better with solid state. Further, tube screamers aren't meant to take your tube amp from clean to high gain; again, that's what a distortion pedal will do. Tube screamers in general are designed to drive your tubes a little harder,and are most commonly used as a solo boost. Tube screamers are in the category of \"overdrive\" pedals, and like the name would indicate, they're meant add a little extra \"over\" an already \"driven\" amp, but in a more natural, smooth, organic way then a distortion pedal would.HOWEVER, the Ibanez TS-9dx does more than your typical tube screamer. The extra knob that switches between ts9, +, hot, and turbo mode adds a whole lot of tone and use options. Let me expound:I play hard rock and metal through a Bugera 1990 head (basically a Marshall JCM 900)and cab with celestion vintage 30 speakers. While that amp does have a fair amount of gain and bass on tap, it's not quite enough to accurately get more modern tones unaided. A standard Ibanez TS-9 or some other knock-off tube screamer will not be able to get an amp like mine into more modern, heavier tones, because standard tube screamers also slightly cut bass and add some mids, again, to help solos cut through the mix. But the extra knob on the ibanez ts9dx solves this problem. By switching to +, hot, or turbo mode, the pedal adds bass and a little extra gain incrementally. I like the \"+\" setting the best. So the way I use this pedal is that I'll set my amp for my standard crunchy rhythm tone with the gain on the amp already fairly high. Then, for the songs that utilize a little heavier sound, I'll kick on my ts9dx, with the drive pretty low (9 o'clock), volume at 12 o'clock, tone about 1 o'clock, and + mode. With these settings it increases the bass and general thickness of my tone, and adds a little gain and volume. So it's basically like adding another channel to my amp.I will add one detail that might make or break this pedal for you: tubescreamers in general, and certainly this Ibanez ts-9dx, add mid-range to your tone automatically. And you can't dial it out. The regular ts-9 mode adds some low mids, and a little more high mids. The other modes add more low mids in particular, which in part contribute to the overall \"thickness\" to the tone, which can be great. But if you're after a scooped mid sound, say for metal, then I would only recommend this pedal as a solo boost, where the mids will help cut through the mix.In conclusion, it's probably safe to say that most people who buy tubescreamers are probably playing blues of some sort and are just looking to boost their volume and maybe add a little dirt. And yes, this pedal will do that. So will the BBE greenscreamer, behringer tube overdrive,mxr distortion plus, Boss SD-1, digitech bad monkey, or several other ibanez tube screamer pedal variations. But by adding the turbo-mode options, the Ibanez TS-9dx will work for the hard rock and metal players (depending on the exact style) in a way that these plethora of other options won't.", "id": 447}, {"review": "I own several tube amp combo and half-stack. However, I wanted a smaller, lighter combo that would be easy to transport and wouldn't need any pedals, but would also be loud enough to practice with a drummer. The line 6 spider IV 75-watt combo was the perfect solution. Up to this point I haven't been very impressed by solid-state technology. Sure, the cleans are glassy and crystal-clear, and some sound ok with the gain cranked and mids scooped at super low volume, but as soon as you turn up the volume a bit or try to dial in a smooth, bluesy overdrive, the sound turns to crap. Not so with the spider IV. I've been extremely impressed with all the different amp models. ALL of them. The different amp models each have their unique sound and characteristics, which means that your tonal options are literally limitless. I play mostly metal and hard rock, thougn I use less gain and more mids than is typical among players of the genre.I'd describe it as a hard rock tone with a vintage edge. And I was able to get that tone in less than a minute of fiddling. The tone in general is surprisingly warm and organic- very tube-like, which is a comparison that I don't make lightly. Additionally, the highs don't have that artificial \"tinny\" sound that so often occurs in solid-state. Solos and leads have more of the natural, smooth quality that tube amps are valued for.The effects are fun to play with, though I've never used many effects in my playing. I really like having multiple user pre-sets, so I can dial in the tones that I use the most and then switch between them at the press of a button. The artist pre-sets are cool; it's interesting to see Line 6's take on the sound of many popular bands and songs. Some are surprisingly good, like Cliffs of Dover, Master of Puppets, and Sunshine of Your Love, while others don't really sound like the artist, like Killswitch Engage.I'm also impressed with the quality of the celestion speaker that comes with the amp; it holds up pretty well even at higher volumes. The tone has continually improved as I've broken in the speaker.Just in conclusion, there's basically nothing this amp can't do at least fairly well. All the amp models actually sound good (can't say the same about my roland cube), and when you combine that with all the effects, tuner, mp3 connection, and user and song & artist presets, it's a winning combination. This will never be my main stage amp, but for practice purposes I couldn't be more pleased with the spider IV.*edited to add*: A few months later I bought the FBV express pedal board. It's a simple, affordable way to get more out of the amp by making channel switching easy and adding a volume/wah pedal. Especially if this is your main amp, I recommend getting a FBV pedal to go with it.", "id": 620}]