[{"review": "Cables are cables. They usually all work. And with Amazon, you will always find the best deals for the same quality.", "id": 10}, {"review": "BY FAR the best distortion pedal out there. No doubt about that. Several of my friends use this pedal, and they all love it. I also see many popular bands using this distortion pedal. It's great for medal. It have a nice punch to it along with a great &#34;cut&#34; so you're palm mutes don't blend into each other like other pedals. There are several knobs offering seemingly unlimited combinations. AMAZING", "id": 36}, {"review": "This tool definitely comes in handy for anyone who works on a guitar. It gets the job done easily and very fast.", "id": 94}, {"review": "I love these picks. Medium is the perfect size for me, as well as the majority of people. This is a great looking pic and you get 12 of them at such a great price. I wouldn't buy anything else.", "id": 120}, {"review": "Will hold any guitar that I've seen. It holds the guitar on the wall safely without having to worry about it falling. It's also very easy to install. It's a great price; and it's definitely worth the investment. Not only do you not have to have your guitars on the ground, but you save space putting them on the walls, and not only that, but it make any room look even better.", "id": 154}, {"review": "Great sound quality, meets full expectations. Cable is very flexible and also seems strong and good physical quality. It's worth spending a few extra dollars on a good quality cable rather than to buy other crappy cables.", "id": 168}, {"review": "This does a great job blocking out the wind on a microphone and other unwanted noise. I can literally blow into the microphone and you won't get any &#34;pop&#34; in the microphone, only sound waves.", "id": 178}, {"review": "I'm new to acoustic so I'm not too sure how things go, but from what I have learned from using these pics is that they seem pretty good. A little to thick for my style though. They make a very deep and loud noise. I prefer placing electric strings on acoustic. They sound much better and aren't quite as loud.", "id": 198}, {"review": "This is a great quality microphone and at a good price. Keep it mind it is XLR, for those that haven't noticed. XLR is a better quality than other connections. It's the same physical shape and size as a rock band microphone (Looking for a good comparison.), and is MUCH better quality. It's flawless in quality and doesn't give any feedback. I would recomment for anyone, especially having such a great price.", "id": 213}, {"review": "This device has so many uses whether it comes to mixing audio for a presentation, a gaming video, or playing musical instruments. There are so many controls and this mixer has just enough inputs/outputs/controls for just about anything that I've been using it for. It seems to be very durable as well. It does seem to get hot after a while, but that hasn't affected it's use at all and so far hasn't damaged the device in any way. Behringer is the way to go!", "id": 368}, {"review": "This is just like any other microphone stand. It works the same and is pretty durable. The weight at the bottom will definitely stop it from falling if someone were to acciddently bump into it...which is great, but could also be bad if you want to carry the stand around a bit. In order to do that you must either support the weight, which can be a pain or unscrew it from the base. Other than that, it's great.", "id": 515}, {"review": "Pop filters already work great to block out wind and other unwanted noises from a microphone. And this with that extra filter on it, it blocks even more. It's simply amazing. Worth the extra few bucks to get the double filter. If I want I can blow directly into the filters and it'll block all wind from the microphone and will only pick up soundwaves.", "id": 533}, {"review": "This is a very good investment. Everything just sits in this case  so I never have to set up any cables again. All I do is setup the input from guitar to the case, from the case to the amp, and let's not forget the power cable. It works amazing and saves plenty of time. I've also seen reviews that it's VERY druable, so you don't have to worry about it breaking easily. I love the fact that you can hide the wires and also convert the storage bay into space for larger pedals (such as wah or volume). The only concern by some people was a slight buzzing. I replaced the power cable that came with it with one of the power cables that came with one of my pedals, and the sound went away. I would recomment this to anyone who travels alot, doesn't have a lot of space in their room, or someone who just likes things neat and compact all the time. This item is VERY convienent!", "id": 616}, {"review": "This thing works wonders. If you are anyone who performs live or just someone who happens to switch between channels alot I recommend. I hate having to let go of the guitar to switch channels, and this just is perfect for the job. The pedals are all easy to press and I love the volume/wah 2-in-1 pedal. I just use it as a volume, because I already have a wah pedal. The tuner works amazing as well. I also love the fact that it connects to your amp via RJ45 ethernet cable.", "id": 621}, {"review": "I bought this strap because I wanted to draw on it with sharpie and then cover it with a clear coat to preserve the sharpie. This is a good sized strap with a  nice drawing surface. My plan worked, and this is a good quality strap to do it on. And such a good price.", "id": 659}, {"review": "I figured I'd buy a cheap second guitar, so I found this one. One of the cheapest prices on Amazon. And I thought wow, what a great look this guitar has. I was also hoping that it played well. Well I've been playing it for a while and it still sounds pretty good, and I've had no technical issues what so ever. I would recommend to ANYONE. Keep up the good work! =)", "id": 754}, {"review": "This is obviously a necessary item if you want to attach this to a microphone stand. It holds great and keeps the microphone snug into palce. However, The gap for the cable to fit through should be a bit bigger, as well as the tail-end of the grip; because if you have a certain kind of XLR adapter that is wider than the microphone, you won't be able to take the microphone out of the grip without disconnecting the XLR adapter first.", "id": 179}, {"review": "I lke these strings very much. They bend quite a bit and are very easy to use. However, they tend to come untuned because they're so susceptible to temperature and humidity.", "id": 240}, {"review": "When it comes to noise gates, this definitely does the trick. It had a noise-detection sensor, so it knows when you are playing guitar or not, and will turn itself on and off automatically. This means that while you're not playing, it'll block that annoying static sound your guitar and pedals make - and when you start playing, it'll lower itself so that it doesn't effect the noise of the guitar. It'll sound the same. I would defeinitely recommend. Plus Behringer is the best brand for pedals.", "id": 615}]