[{"review": "This is a pretty good stand and is relatively robust for its compact size.  Opens easily and folds up to a fairly small footprint for storage/transport, and it cradles the guitar nicely.Two minor issues:1) Personal gripe - the git leans back a bit more than I would like.  Makes it more difficult to hug a wall and ends up taking more 3D space than it really needs.2) Product gripe - the two footer bars are not quite level with each other, so it rocks just a little bit.  However, with a solid body electric on it, even a little rocking can be a really bad thing.I like OnStage and own several of their products.  They are well constructed and a good value so I have no doubt I was just unlucky with this one.  I've been applying a little persuasion to even it out and it's getting better, but with the relatively robust construction it just doesn't want to give much.  Kinda sucks that it's not level out of the box, so 4 stars.", "id": 132}, {"review": "I'm not a performing musician, so I actually use this on my guitar stand to keep a variety of picks close at hand.  Holds everything from a .5mm nylon pick to a 3.1mm rubber pick, and I have yet to see one fall out.  Simple solution to a simple problem.", "id": 210}, {"review": "This thing is relatively heavy for such a small stand.  Of course one might think that would translate into sturdy, and one would be correct.  Super simple to use.  No buttons, levers, or knobs. Just pop it open.  It doesn't have an actual mechanical locking feature, but the design is such that if you fully open the outside legs they will basically lock in place.  It holds my acoustic securely, and I have no fear that it's going to tip over on its own.  When you're done, just nudge the outer legs to \"unlock\" them and it's super easy to fold back up.I had a Fender mini acoustic stand, but it didn't fold flat enough to fit nicely in my gig bag so I figured I would try this one.  I am quite happy as it does in fact fold flatter.  HOWEVER..... I can only give it four stars because when folded the three back feet stack up and give it about a 2.75\" thickness.  If Hercules could have figured a way to avoid that, this baby would truly fold as flat as a magazine.  It's still pretty flat and takes up less room in my bag, but I think the Marketing guys used a little creative license with that description.  (Either that or they're comparing it to the Cosmo year end recap issue.) Still a great little stand and I would buy it again if needed.", "id": 417}, {"review": "I'll be honest here - I bought this one primarily because of its looks.  Not a lot of white clip-on tuners around. I also own an SN-8 and in comparing the two, the SN-13 seems to be as tight, but it's only four stars because as another reviewer mentioned you can get the SN-8 (which has more features) for a few dollars less than what you're paying for the SN-13.  Still, it's a typical Snark.  It registers very quickly, it's easy to read, and you don't have to pluck the string very hard at all for it to pick up the vibration. The stem on mine is a little looser than I would prefer but it still stays in position.My only real gripe isn't unique to this model but to all Snarks.  The curved stem combined with the round head means it won't sit very flat in a gig bag pocket and the stems aren't exactly robust, so I'm always concerned that one day I'm going to take it out of my bag and it will be in three pieces.  Other than that, I'd recommend this to anyone looking for an inexpensive and pretty accurate tuner.", "id": 861}, {"review": "I'm a beginning player so I'm trying to make things as simple as possible starting out.  I was looking for an easy way to get my strap on and off my acoustic, and really didn't want to mess around with changing out the hardware to mount straplocks.  This strap performs exactly the same function without having to do anything additional to my guitar.  The ratcheting heads are kind of wide and my top button is fairly close to the neck so at first it was a really tight squeeze, but a little customization of the strap head with a file and some sandpaper solved that issue.The locking mechanism works by way of a keyhole that rotates closed with a ratchet gear to lock the strap head to the button. To attach, put the keyhole over the button and rotate it closed.  Your strap is now locked in place. To remove it, hold the release lever and rotate the keyhole back to its fully opened position.  That's it.  Really, it's that simple.I'm a taller guy (6'3&#34;) and after adjustment there is plenty of strap to spare should I need it longer at some point. The leather feels robust, and it was pretty soft and comfortable right out of the box.  Can't wait to see how it does after it breaks in. This was a great choice and I couldn't be happier.", "id": 666}]