[{"review": "I have a small apartment in a small but densely populated apartment complex - space and noise is an issue. As a beginning guitarist, I contemplated a small amp but decided on the Mini Tone Master (because in my apartment, the smaller the better). Also, I had no need for ample volume or a variety of controls being at the level that I am... I just wanted something no-frills that was small, compact with enough quality sound to help me as I practice. The Mini Tone Master delivers well.I was pretty surprised at the range of sounds the little guy can produce (from distortion grungy to a softer bluesy tone). It does not come with a power adapter but we already have on in the apartments and works well with that or with a battery. Battery life is also pretty good. I've had the same battery in there for several months already, playing several times a week and sometimes leaving it on accidentally for a day or two and no signs of battery drain so far.It is a little frustrating sometimes, as another reviewer mentioned, to remove the distortion but with enough fiddling, I found a setting that was acceptable to my ears.While I didn't need volume, this little guy can be loud! No weakness there.I also plugged an acoustic-electric classical guitar into the mini tone master and it also worked surprisingly well.", "id": 391}, {"review": "I snagged this beauty during a holiday sale here on Amazon and this baby is wonderful for the price. I previously had theLucero LC100 Classical Guitar Black (Black)which I was completely happy with as a beginner. When it got damaged beyond repair, I looked into theCordoba Dolce 7/8 Size Classical Guitarwhich was absolutely wonderful but I decided I didn't really like the size, so after liking the Cordoba brand I decided on the C5.It is absolutely a wonderful guitar at this price range. The Lucero was great for my level and it was decent enough to look at but the C5 has a vibrancy and deep tone to it that I was surprised to hear from a budget guitar. While it isn't it the prettiest guitar out there, it's by no means ugly. Even though mass produced a lot of quality is still apparent in this guitar.The smell of this guitar is also amazing. It doesn't have the cheap wood glue smell of other low-end guitars, but a nice rich smell of wood. Even after a few months, kept in a humicase, the sound is great and that fresh wood smell is still present.All praise aside, it is not a flawless guitar. My main complaint would be that the action is really high but this is something that is pretty common with new guitars, especially those at a lower price range. Not necessarily a flaw but something to be aware of: being a cedar guitar, the wood is very soft so I recommend wear soft clothing without buttons or zippers on it while playing because these will leave small dents on the back of the guitar.I do enjoy the padded gig bag and thought that it was a nice touch to the package. It is a high-quality gig bag with lots of padding. Inside the bag is a velcro neck rest with a strap to keep the guitar in place. It also has a large front packet that is large enough for a few music books. When I ordered this guitar from Amazon, the guitar shipped inside the gig bag and inside of a big box. I had no issues with shipping and the guitar arrived safely.Overall, I do not regret this purchase and once I take it in for a setup to get the action lowered, it will be a superb guitar that I will enjoy for years. Highly recommended!", "id": 566}, {"review": "I bought this cable long with my epiphone les paul special II and the Fender Mini Tone Master thinking that either one did not come with a cable. The epiphone came with a cable which ceased functioning after a couple days. The curly cable has fared much better. No problems, works great and doesn't tangle so it stores easily too.Great as a primary or backup cable. Buy one, it's cheap!", "id": 709}, {"review": "I've been using aKorg TM-40 Large Display Digital Tuner and Metronomefor a long time with my guitar. While adequate, I wanted the Snark because it was made specifically for guitar and the clip-on feature would counter my laziness in finding the tuner.The snark is great, and the price is amazing. The Snark, unlike the Korg, tunes by vibration.. so if it isn't attached the the guitar, it won't work. I feel that the vibration tuning is more accurate and efficient. With the Korg, the dial would spin all over the place and I would just mentally estimate where the right tone would be. The Snark is much more decisive and faster so it eliminates all the guesswork out of tuning. You will know exactly how sharp or flat the guitar is or if you want to try alternative tunings like drop-D it is so much simpler than with the Korg.No metronome but that's what I'm keeping the Korg for. I also wish that this specific came in another color other than black. There are Snarks in other colors but this model is specifically for guitars.Overall, extremely happy with this purchase.", "id": 762}, {"review": "I did some research on capos and decided to give Planet Waves a try. I previously had one of those bungie cord like capos, which was fine but it is a bit cumbersome.The other capos I looked into were Kyser and Schubb. Kyser is great because of its easy trigger grip. It's disadvantage however is that it has a lot of weighted tension on one side so it can knock your strings out of tune. The Schubb deals with this issue by having an adjustable tension spring that will adjust pressure according to the thickness of the neck. The problem with the Schubb, however, is that it can't really be manipulated with one hand and it can easily fall of the guitar.In comes the Planet Waves. It has a trigger grip so technically you can easily move it around the fretboard. However, because of the adjustable tension, you do need to adjust it when moving to a different neck thickness. It might rule out the one-handed ease but it does take care of Schubb's problem of falling off. In reality, I only found that I need to adjust the tension when switching between guitars or if I move up way up the fretboard. Between the 1st and 5th fret, I don't really need adjust. However, if for some reason I want to capo at the 7th, I do need to adjust the tension because it's too tight. In all, it's not that big a deal and it's nice to have the option to adjust the capo.In all, I'm happy. No capo is perfect. You can do partial capos with this one. Another review complained that it created buzz but all you need to do it adjust the tension.In case you aren't aware, this particular capo model only works on six string steel guitars. I have an electric guitar, a nylon and a Recording King ROS-06 with a chunky neck. Works great on the electric with the skinny neck and the ROS-06 with that chunky neck. Since the capo was built for guitars with a radius fretboard, it does not work on classical guitars (or anything with a flat fretboard). The capo will not reach across the entire fretboard and since the cap is curved, it will not apply pressure on the middle strings.It's a nice capo but it may not be what you're looking for so I recommend looking into the other two big hits in capos.", "id": 843}]