[{"review": "Solid construction and well weighted, this stand is perfect for desktop use with height adjustments from 8.5\" to 13\" and a 6\" base; per the measurements given on the box.  The locking die-cast steel clutch works well to keep the fit secure.  The color is darker than pictured on Amazon - black powder coating.  There's no tipping or imbalance to worry about with this mic stand, and it's reasonably priced. (* I picked mine up for under ten in the Amazon Warehouse.  It didn't ship with any directions for set-up, which may or may not be the standard packaging.)Do take note that this stand has a US standard 5/8\" top.  I needed a 5/8\" female to 3/8\" male adapter to get my mic to mount to this stand. There are a few on Amazon, but I found the best deal at another retailer online.  These are the adapters that I'm talking about:Windtech Adapter 5/8\" Female Standard Microphone to 3/8\" Male.  You may not need one if your microphone mount ships with one installed, which can be easily screwed out to then expose the 5/8\" space.Overall, I'm very pleased with the fit, finish and construction of this item, and I'm sure it will work very well for my uses. I recommend it to others looking for a stable, sturdy, adjustable desktop microphone stand.", "id": 224}, {"review": "TheDanelectro Honeytone Mini Amp - Beatnik Burgundyis an easy way to get great sound from your electric guitar. The color of this unit is a soft burgundy (almost brick red in color). Paired with the Zero Hum AC Adaptor, it's a highly portable amp setup. \"Ultra-portable\" by using a 9V battery instead of the AC adaptor. I do think they are best purchased together to enjoy all the benefits of this rig though.A headphone jack on the amp means you can enjoy the amp's impressive sound quality without bothering the neighbors or waking your spouse.Included with the amp is an Owner's Manual with simple start-up instructions. You'll need to have your own cord (the one that goes from the guitar to the amp isn't provided as part of the amp package...). The manual has several control settings for the following sound tweaks:-Clean & Spanky-Warm Jazz-Big Amp Overdrive-Killer Blues-Distorted Rhythm-Thick Solo-Woodstock Fuzz-Send the Cats Under the Bed-Twang-Mondo Sustain-Brit Solo Tune-Sparkle Clean-Early 80's Clean Solo-Late 60's Neck Solo-70's Brit-70's SoloI paid under $20 for this amp and couldn't be happier with the product. Don't hesitate to pick one up for yourself.UPDATE: 7/19/12There is a space in the back of the unit for 1 9-volt batteryDuracell 9-V Alkaline Batteries, 4-Countor you can use the included AC adapter to power the amp.UPDATE: 9/19/12 Per reviewer Paul Stewart: \"As a point of clarity - the current version of this item does NOT ship with an adapter nor cable. Be prepared to purchase these in tandem.\"  FYI...UPDATE: 11/17/13Almost 4 years ago I bought this item, and it's still going strong!  Great deal.UPDATE: 7/11/14YUP!  It's still kickin' along. Super buy on this mini-amp.", "id": 303}, {"review": "Smart design, excellent performance.  What more could you want?  The Samson Meteor Mic USB Studio Microphone is a cardioid mic that is easy to set up and use, with great pick up for desktop podcasts, user testing, screencasting and similar.Being a relatively new user to anything but a basic desk mic, I had to look up what 'cardioid' meant.  I found a solid explanation at a site called WiseGeek.  They explain 'cardioid':  \"Several different microphones have been designed throughout the years to accomplish very different tasks. Some -- such as condenser microphones -- pick up a great deal of sound from several directions, while others pick up one focused sound only from one direction. Of this latter group, the cardioid microphone is perhaps the most popular, as it picks up almost exclusively the desired sound while ambient noise is hardly noticeable. It gets its name because of its pattern of sensitivity, which is roughly shaped like a heart when drawn out on an axis. This means that most of the sound it picks up comes from the front of the microphone, while minimal noise is picked up from the rear and only marginal noise is picked up from the sides.\"  (My apologies to those pros out there who didn't need this clarification.)Having used the Samson Go Mic USB Compact Mic for a few months, I was familiar with the Samson brand prior to receiving this mic through the Amazon Vine program.  I had actually wanted to purchase it instead of the Go Mic, but the price difference of about thirty was a bit too much for me at the time.I've been happy with theSamson Go Mic Compact USB Microphone - Plug n' Playfor use with my desktop and laptop PCs.  I do a lot of usability testing for various websites, and it's imperative that clients are able to clearly hear my explanations via voice without background noise, pops, hisses or similar.  I have to say that the Samson Meteor is a touch better, offering clear, crisp recording and reproduction.  It also seems to pick up virtually no background noise, which is fabulous!I like the retro styling of the Meteor, and the built-in stand is great for desktops.  Less portable than the Samson Go Mic, the stand does fold neatly onto the mic for easy transport in the included soft pouch.  The included USB cable is also of ample length for easy set-up in a multitude of situations.The mute button on the front of the Meteor is very handy.  Much easier than using software to get the job done, and an amber light makes it easy to recognize it's muted.The build quality of the mic is excellent! Very solid, high-end feel.  You can use the integrated headset port to monitor your voice and adjust levels with a dial that rotates around the mute button on the front.The Samson Meteor didn't ship with any software, which while unnecessary for installation (my Windows 7 and 8 PCs automatically installed it when hooked up via the included USB), but would have been nice to have some music mixing or other similar software bundled with it.Another product I'm reviewing the:Samson C01UCW Studio USB Mic with Cakewalk Sonar LEand the Samson Go Mic both ship with Cakewalk software. The Samson Go Mic with Cakewalk Music Creator LE, and the C01UCW ships with Cakewalk's SONAR LE software, so I found it kind of surprising the Meteor did not at this price point.  For me it works out, as the others have the software and they work with the Meteor.The included booklet includes a Quick Start guide for PC and Mac, Installation how-to, the Layout (diagrams), Specifications, Polar Patten & Frequency response, and Recording Techniques for vocals, acoustic guitar, piano, guitar amp, and overhead drum kit.  The Samson Meteor Mic Warranty Card is also in the booklet.Overall, I'm very pleased with this microphone and will be using it instead of the Go Mic on my desktop for daily work which will include using Dragon voice recognition software.  I have purchased an adapter to use it with my iPad so I can play with Garage Band, and know it will be great for future screencasts.My only disappointment is in the lack of an included software package, which other Samson products (as mentioned) have packaged with them. I give this product 4 out of 5 stars (\"I Like It\") for this reason.  If Samson included software - it'd be a 5 star product for me.", "id": 743}, {"review": "I received these TASCAM headphones as part of the Amazon Vine review program.  I was excited to receive them, as I've looked at them many times and considered ordering due to the reasonable price point and 'professional grade' designation.I'm not an audiophile, nor am I snob about audio devices.  Any brand that works well at the right price, I'll buy it.  That being said, I've recently been fortunate enough to get to try out lots of headphones, with theBose AE2w Bluetooth Headphones - Blackbeing the most recent.Obviously the Bose beat the TASCAM ones, so it would be unfair to compare them other than to say that 'sound wise' you can really tell a difference in the mid and high range.  These TASCAM TH-2000-R 'Professional Grade' Headphones don't sound clear to me in the mid and high ranges.  Bass is great, but even when tweaking the equalizer settings I never could find the clarity I was seeking in the full range.I listened to several genres: Classical, Blues, Pop, Rock, Electronic, Country, and Latino with these headphones.  Each time, the quality was good, but not great despite attempted software and device adjustments on my iPhone, PC andYamaha RX-V675 7.2 Channel Network 3D AV Receiver with Airplay (Black).The fit of the headphones is big for me.  Usually, they are too small.  Having them as small as I could make them (top of my head to ears), the cups still dropped down a bit lower than I liked. I had to hold them in place to get a solid fit.  The padding underneath the headpiece is minimal, and after about 15 minutes of use the top of my head hurt.The build quality of these phones appears to be excellent. The cord is thick and can be extended to an estimated 6'.  The screw on adapter: 1/8(3.5mm) to 1/4(6.3mm) allows for use with multiple devices, stereo components and sound boards.  The foldable design does allow for some size reduction, but not much.These headphones will appeal to those who like heavy bass.  Great for those who want the chunky headset look, are on the go DJing, and/or have larger heads.They are not for those looking for a wide range and subtlety in their listening.  They're also not for those with smaller heads.", "id": 888}, {"review": "I purchased this mic to use for screencasts (recording what's happening on my PC's screen while I talk about it).  I set it up to sit on my desktop, approximately 2' away from me and usedCamtasia Studio 8 [Download] and a free program called CamStudio to test it out.  Both programs worked well with the mic and did what I'd hoped it would do - eliminated my need for a clunky, wired mic headset.The build quality of the mic seems excellent, and the compact design is fantastic!  I love that it comes with its own carrying case and that it can be on a desktop or clipped to a laptop's monitor.KINKS IN MY SYSTEM: MUFFLED AUDIOThe included software: Cakewalk's Music Creator LE can be installed on one computer.  You get 30 days to register it.  I installed it and registered it immediately, but it would not allow me to put in my registration code, saying I wasn't the system administrator.  I am, and my Windows 7 PC says I am, but alas, it wouldn't work.  This software is optional, but I decided to install it prior to the microphone (per instructions) to try it out.  Eventually I ended up uninstalling it.Soon after installing Cakewalk, I had a PC issue: muffled audio recording.  No amount of system tweaking seemed to fix it.  I was stumped.Then I decided to go to the Samson site and see if there were updated drivers for the mic.  The generic ones installed were from 2010.  No luck.I began reading online about 'muffled audio' on Windows 7 PCs.  Somewhere I noticed a name I recognized: RealTek, which was a name associated with my speakers on my PC (RealTek digital audio).  I went to the RealTek site and noted updated drivers for Windows 7 64-bit (2012), and decided to download and install them.  I rebooted my PC and tested out the audio recording once more. Much to my delight, this solved the muffled audio problem!I did set the bitrate to the highest level for the best sound quality recording.  Afterwards I tested out the mic using Camtasia and CamStudio, both worked beautifully with the Samson Go Mic!On my desk at a distance of about 2.5', this mic pics up my voice perfectly for dictation and screencasts.  No hiss, hum, breath noises or distortion.  Very clear and with the properly installed drivers for my audio - works perfectly with the USB 2.0 connection on my powered USB hub.CONCLUSION: BUY IT FOR GREAT RECORDINGSThis mic is a truly great if it's recognized and properly configured by your system.  Impressively clear recordings, unlike any I've been able to obtain using aPlantronics .Audio 655 USB Multimedia Headsetor the mic on myMicrosoft LifeCam Cinema 720p HD Webcam - Black.For the price, I don't think you can do better.  It's compact, has great voice pick-up and audio recording clarity. Installation issues may occur, but updating audio drivers, using a powered USB hub connection and tweaking audio settings within the operating system should give you the quality you've been hoping for at a price that's right.UPDATE: 12/30/13Been using this mic consistently for a couple months and I'm liking it.  It's a condenser mic, and doesn't filter out ambient noise as well as I'd like, however for an under forty dollar purchase - I'm still very happy with it. Cakewalk never has registered correctly with my system so I uninstalled it.  I guess if anything, that's been the downside to this purchase.", "id": 583}]