[{"review": "I've been a gigging musician for almost 20 years, and this is the most well made, most comfortable guitar/bass strap I've ever used.Pros:- Substantial padding where you need it- Perfect stitching- Heavy, stiff leather ends- Soft, fine-woven material - not the coarse nylon you find in most cheap straps- Underside is lined with an even softer material - makes the strap comfortable even without a shirt on- Did I mention it's super comfortable?Cons:- None to speak of.  Seriously.  It's that phenomenal.Perfect whether you're rocking a featherweight Strat or a 16-pound 6-string bass.I use it with a 13-pound 5-string Warwick bass, and it makes it feel like the bass is a part of me.  I hardly notice I'm actually wearing it.Combine this strap with a decent set of strap locks, and it could easily last you 10 years.You will not be sorry with this purchase.", "id": 188}, {"review": "This pedal is solidly built, and works as advertised.  If you're using it strictly as a volume pedal, it does the job nicely.The only problem with it is when you use it as an expression pedal -- it has no polarity switch for expression output.Plugged into some gear as an expression pedal (my Digitech RP55, for example), the down position is muted and the up position is full volume (the opposite of where it should be), and wah effects are backwards as well.  There's no way to correct this without making your own crossover cable (which requires destroying a perfectly good patch cable).", "id": 212}, {"review": "I've owned a lot of cables over the years, and most have been junk.  For the money, there is no better instrument cable out there than the Spectraflex.  I've regularly rolled 100-pound half stacks over them, jumped up and down on them, and tossed them in the back of a truck with all manner of jagged and unholy acoutrements, and they stay clean and work like the first day.Pros:- Proper shielding means this is a quiet, accurate cable- Slick braided covering makes it super easy to untangle- Very flexible- Metal sleeves enable easy repairs should the unthinkable happen- Available in some very cool colors- Lifetime warrantyCons:- None to speak of.Spend a little extra money and get the best value cable on the market today.  A lifetime warranty means you'll have it forever.", "id": 586}, {"review": "As is the case with all tools, you really do get what you pay for with this string cutter.  It's extremely well-built, and performs its task very well.Pros:- Extremely high quality metal- Comfortable rubber grips- Red accent handle makes it easy to find in a bag-of-tricks- Effortlessly cuts even stainless steel bass stringsCons:- Has no ability to lock the cutter closed for storage; the tool is spring-loaded to open.  While this may be a plus for some people, I find it less than ideal.Overall, this is an extremely well-made tool for your guitar kit.  If you're a bassist that likes stainless steel strings, you'll appreciate how they cut like butter.", "id": 648}, {"review": "This is one beefy string winder.  There is really no comparison between this professional tool and those cheesy $2 toy string winders you find 100 to a bin at the accessories counter of your nameless local guitar superstore.Pros:- VERY sturdy- Rotates extremely smoothly- Well balanced- Fits every guitar tuning key I've tried- High-impact plastic body should withstand years (decades?) of abuse- Clandestine compartment in handle was a nice bonus -- for earplugs, extra end pins, whateverCons:- None whatsoever.Buy this immediately and save your wrists for more lucrative pursuits.", "id": 683}, {"review": "This little beast works great for guitars or basses in loud or soft environments.  Just clip it to your headstock and tune up in under 30 seconds.  I've even used it on the bell of my trumpet to tune up to pitch.Pros:- Dead-on accurate.  You can easily set your intonation with this little monster.- Works great in extremely loud environments.- Clips on tightly.  If you don't jump around like an orangutan on stage, you could probably have the Snark ride your headstock through the whole show.- You don't have to plug into it.- Extremely responsive.- Enough display detail for you to know when you're getting close to in tune -- not just 3 indicators like some tuners (flat, dead-on, sharp).- Very inexpensive.Cons:- A little twitchy on the open low B string on bass. I use the 12th fret harmonics (first partial) to tune, however, since it's a purer tone that seems to resonate in the headstock more, so this has never really been a problem for me.Inexpensive enough to keep one in every gig bag or case -- for every instrument you own.", "id": 707}]