[{"review": "This is a great tool the only issue was it was a little tight and it squeaked loudly as i was attempting to use it..  i had some graphite powder and i put a little around the screw head on the winder part and now it spins freely without noise.  Its so much nicer to not have to wind those tuner heads by hand when changing strings out.  the wire cutters also work really well. Im glad i bought this product.", "id": 94}, {"review": "Elixir strings are very nice.  so slick and last forever compared to standard strings..But i will admit D addario strings are just as good but have to be replaced more often. So if you have the money and want to try these technology advanced strings i dont think you will be disappointed. Some people say they are too slick.. and i can see that when you put new strings on you expect them to feel a certain way..  But you will get over that once you see how long they last.", "id": 107}, {"review": "These strings are just prefect and feel awesome.  As you can tell from the amount of reviews on this product they are extremely popular.. and all those people cannot be wrong", "id": 156}, {"review": "Nice basic guitar strap.. Great price and should last long enough.  I have started using the padded Levies strap as it doesnt hurt my shoulder like a regular strap. This can be a little scratchy", "id": 282}, {"review": "They sound just like i thought they would.  I love them and use them when i play guitar and they sound awesome.I would buy these again.", "id": 458}, {"review": "This amp is non stop fun.  Has so many features.. I head to the 90s and it has all the sounds i like for that decade..it sounds great at low volume and has some amazing models that sounds like the real thing.", "id": 620}, {"review": "Well... its a stand..  its super cheap and i don't mean the price.  the edges are sharp and the piece that holds the neck of the guitars is leaning too far back.. i stuck some cardboard under the rear post to help keep that back brace more up right and no leaning back.  its going to work but i bumped the bottom with my bare feet and it cut me pretty well.  Instructions were ok..  came with more parts than what were required... all holes filled and i have  of of each part extra.. the guitars do not sit very well in this stand... i will use it until i can find a better one.. it will get replaced.. i really should send this POS back to Amazon.  the concept is great but the execution of it sucks. it folds down but not sure i would use this as a portable stand..  there are better options out there for something portable.  this stand is worth 10.00 tops... if i had it to do all over i would save my money.", "id": 769}, {"review": "Great Selection of Dunlop Picks  it was a good choice of finding what type of picks i preferred.. Didnt know until i sampled quiet a few..", "id": 773}, {"review": "Very nice strap.  is comfortable as this type of strap can be..  it will with heavier guitars feel like its wearing on you after about an hour.  I ended up switching to their padded strap.  I still think this is a great strap and use it on a lighter guitar now.", "id": 286}]