[{"review": "...for something, but not a guitar.  Wasn't sure what to do with it so I now use it to mount a large cookbook, or notepad computer, so I can follow a recipe.  It seems to work okay for that.  Just don't use this for guitars.  An electric guitar will slide out and fall because it leans back too far, and the arms have no grip.  This thing was obviously created by a monkey in some closed door creative testing experimental project.  It may even give you AIDS!  But probably not.  However, animals could have been harmed in the making.  But most likely, and in reality, it will not hold your guitar in a safe manner.", "id": 91}, {"review": "Not onlh are these good for the price, but they have become my new fave.  I switch acoustic strings 3-4 times a month on my 2 main guitars.  I gig 1-2 times a month.  These last long, without compromising the tone.  Great price too!  I tried every brand until I got to these.  Not sure why I did not try them earlier :(.  Probably because I was drinking the Elixir Koolaide.", "id": 198}, {"review": "I put this in a $200 guitar.  I have a Recording King (RD-06) that sounds so good, that I wanted to use it for live gigs.  So I popped in this K&K.  I ran it through my SWR California Blonde II acoustic amp.  If you have been wanting an acoustic guitar to have that &#34;miked&#34; when you plug it in, this is as close as it gets!  I recommend getting a sound-hole cover if you play with a band, but you will not be disappointed.  The installation can be a little tricky, but with a little patience and reading, anybody can install it.  If you don't feel comfortable, just go pay a local luthier to install it for $30, or ask your grandmother for help :P", "id": 416}, {"review": "I wouldn't consider this a $30 backup mic, I would consider this a professional vocal mic.  Period.  This is a great mic!  Out of the box, it has a nice weight to it.  It sounds slightly hotter than say, a Shure SM58; which is why I like it so much.  I typically like to stand back from a mic when I sing live and this seems to work very well for my vocals with that technique.  I have also tested this mic with harmonica as well.  Seriously... I don't work for the company or have any ties whatsoever.  I'm just a dude in a band.  Trust me on this one.", "id": 425}, {"review": "I use this stand for a smaller 50 watt Fender amp.  I don't think I would recommend it for larger amplifiers, especially since it sits a little high, but for my amp, it's perfect.  Nevertheless, I also don't really plan on packing it up or moving the stand around much, so I can't imagine it being ideal for portability.  If you have a music studio and are doing more recording and/or rehearsing than playing gigs, this is a really nice stand.", "id": 517}, {"review": "I really wanted this to be a great product.  The screws strip out too easily.  Basically, if you put a microphone in it, and ever have to use it for a microphone, it is going to strip out.  I had two of them and was hoping that the first one was a lemon.  Nope.  Even the pop filter fell off.  I LOVE the design, but they need to make them strong enough to handle the weight of a microphone and strong enough to handle regular studio usage... ex:  adjusting the position of the mic, picking up a mic stand and moving it, etc.  Otherwise, don't have an adjustable tilt option.  Just make it one solid piece.  I'm tempted to try to fix it with Gorilla Glue because I do love the design.  It's just not strong enough.  Not that it's a surprise though.  Not much of anything is worth the money these days.  It's a damn chore to return every friggin' purchase these days that they don't really have to care about actually testing products.  Why should they?  They already have your money.  I feel like I should get paid for testing their products and the time spent un-boxing and packing things back up.  Besides, what are they going to do?  Replace it with another broke a$$ product?  Better yet, refund my money for the product I paid - minus shipping????  That doesn't include the time I spent trying to prevent you from buying one and testing their damn product in the first place.  I want a refund, plus an hourly wage.  Whatever, don't buy one.  Companies that don't test their products don't deserve your business.  What would make me happy, is for one of these companies that make these products to answer the question(s):  Did you test this product?  How did you test it?  What were your results?  Is it ready to be sold to the public with confidence?Nope", "id": 584}, {"review": "This stand rocks!  Literally! I don't even have to play the guitar anymore, it does it for me.Kidding aside, this thing is really nice.  I added the boom stand so I can run an SM57 to the surround of my amp's speaker.  I went ahead and ordered two for another amp, just so I don't have to switch them out.  I have a couple of medium sized amps(2 x 10's in each), so I would highly recommend this stand for amplifiers around the same size.  This may not be so great for smaller amps.", "id": 653}]