[{"review": "No complaints, it's quiet enough and the price is right. Is it a Monster cable? No, but it doesn't cost as much either. I've used this on lead vocal tracks into a studio condensor mic for professional album sessions and it was fine.", "id": 21}, {"review": "Phantom power supplies aren't very sexy items, but they're extremely important if you want to use condensor microphones. This Nady box is dead quiet and works like a charm. Totally no-frills, rock solid metal construction and you can't hear it at all.", "id": 485}, {"review": "Nothing exciting about these things, but they do the job well. I polished my 1991 Gibson Les Paul with this recently and I'd forgotten how shiny and beautiful that guitar was. Does a great job.", "id": 572}, {"review": "I've been using Shure microphones live and in the studio for nearly thirty years now and I can honestly say that I can hear no audible differences between a genuine Shure SM-57 and this GLS Audio ES-57.This isn't based on any scientific data, it's based on A/B'ing this mic and a Shure 57 on the same tube amp at the same volume and distance going through the same mic pre. I made sure that I marked the exact location of the mic with a little masking tape on the amp's speaker grill. I recorded about 30 seconds of the same simple chord progression first with the Shure mic, and then this one. When you play them back either through studio monitors or some very good Bose headphones you can hear no audible difference between the two. If you were to examine the tracks in a waveform editor I'm sure you'll see some visual differences (but they are also two different performances), but my ears really hear nothing audibly different. Some may disagree, but I'm convinced.This mic is built solidly and weighs the same as the Shure and for all intents and purposes looks almost identical both inside and out.Is it as good as the Shure? I don't know, I think so - others may not. I do know that you can buy three of these for the price of one Shure 57 though. I'd highly recommend these on guitar cabinets, snare drums, and toms for sure, maybe vocals in a pinch on a particular type of voice.A no-brainer as far as I can tell.", "id": 594}, {"review": "This is a great little amp especially for the money. It's all tube, has a power attenuator, headphone out and reverb all for under $200 - CRAZY!! It's built extremely well and has some weight to it, but you'd have no problem carrying it to a small gig. A 5 watt tube amp is still quite LOUD, so the attenuator is a god-send.How does it sound you ask? Tone is subjective, but to my ears it can get quite \"Marshally\" without a lot of work with a Les Paul as well as a Tele. I don't own a Strat, so I can't comment on single coils through it. On the 1 watt setting with the volume pinned and the gain on about 5 I had a damn good \"Back In Black\" style hard rock tone. If you want to play Metal you're going to need a distortion/overdrive pedal. I've found that if you pin the gain it can get a bit boxy and fizzy. The headphone out isn't great, it's good enough for practice, but don't try to use it as a line out for recording.I've done some recording using a 57 on-axis about an inch from the speaker grill slightly right of center. When stacking 3-4 tracks (especially using different guitars) I got a HUGE, Plexi like tone without it getting muddy or fuzzy.I haven't swapped tubes or the speaker - it's completely stock. I might try putting a Jensen speaker in it, but the stock tone is just fine as it is. The stock speaker is an 8\" Bugera \"vintage\" (think greenback clone) and it is darker than a lot of small speakers. A lot of guys are swapping out the tubes for JJ's or GT's, but it all depends on what you're after for tone.A lot of guitar snobs are afraid of the Beringer name on it (Bugera is made by Beringer), but I found this amp to be very good quality - especially given that it was made in China.I would recommend this amp if you are looking for good tube tone on the cheap. It's an excellent platform for mods if you are the tweaking type. I was able to get great Marshall like tone out of it quite easily. Good stuff!!", "id": 618}, {"review": "This mic is fantastic! I've been singing, writing, and recording for almost 30 years and this mic is pretty much just as good as all of the silly expensive German mics I've used in larger studios over the years. There's a very slight presence peak, but nothing like most of the other Chinese mics. It isn't shrilling or peaky at all. Male tenor vocals and acoustic guitar sound great without any need for EQ whatsoever beyond a hi pass filter for the sub 100hz stuff. This mic is also an excellent candidate for a Michael Joly mod, he calls it one of the 7 audio wonders of the world because it makes no sense that this mic is this good at under $200. Michael mods these mics and you'd be hard pressed to be able to tell the difference between this one and the famous U87 with the German name that starts with an \"N\". I'm using it totally stock and it's been great. Buy it.", "id": 371}]