[{"review": "I have 10 of these hanging on my wall with different types of guitars, banjos, and mandolins.They attach to the wall with 2 screws.  Hardware is included to attach those screws to drywall.  It takes about a 1/4 inch hole in the drywall where a large screw shaped plastic piece is inserted into the drywall and then the regular screws go into the plastic.The piece that touches the guitar has some sort of silicone/rubber which protects the instrument.  The holder can be bent in or out a bit to better fit the instrument that you have.I have moved a couple of times and these can be removed and attached again.Very sturdy, well made product.", "id": 166}, {"review": "These look so neat that my brother and I both unknowingly ordered these for each other as gifts last Christmas. Unfortunately they feel too chunky to use and the colored tip grips the strings in an unfortunate way making it difficult to play.", "id": 170}, {"review": "I have been using this Pre-amp for a year and it has been great.  After I figured out that you have to attach a ground cable to the record player it installed very easily just plug it in and it plays!  I have not noticed any excess heat or other problems even though I keep it inside of my closed entertainment stand.", "id": 363}, {"review": "These patch cables have worked well and done their job just fine for me but when they arrived they smelled really strongly like band-aids ... kind of a gross plastic smell.  The smell did go away some but it made me not want to touch them much at first.", "id": 847}, {"review": "Very fun to use.Comes with a power supply.Very easy to control.I enjoy using this to play alone - It is easy to lay down a rhythm and then play over it.It can be used for drum tracks or to practice a section of a song that you want to repeat.", "id": 668}, {"review": "I don't do heavy gigging just home studio play but I have had no issues with quality or sound.  It looks cool and sounds just fine and clear.  I like the metal connecters, they are easy to plug in and pull out at have a nice heft.It is not a super high quality cord but it does an excellent job for the price.  I will be buying these again.", "id": 735}]