[{"review": "I've owned these for several years and found them sufficient for mixing purposes -- so long as I keep using reference songs for comparison ... that's because by themselves, the ATH-M50 don't have a flat frequency response. They're flatter than most phones under a hundred, but you will find that they're a bit too middy and lacking in lower treble regions compared with a good set of studio monitors.Fortunately, I found that this deficiency can be fixed with a corrective EQ curve. Load up a parametric EQ and do the following: [+1dB @ 80Hz Q of 5],  [+1.5dB @ 350Hz Q of 2], [-2.5 dB @ 1kHz Q of 1], [+1dB @ 3kHz Q of 1], [+2dB @ 6.5kHz Q of 3.5], and [+1.5dB @ 15kHz Q of 3].  Save this as a preset.If you listen to reference songs with this, you'll find a more pleasing, balanced, 3D kind of sound compared to the original.  I base this correction curve on published frequency response graphs of the ATH-M50. The proof that this worked is that now these headphones sound a lot like my good studio monitors. They translate better with the correction curve active.The bass on these is solid and seems to go down to 20Hz or so, more felt than heard. Subsonic thumps feel like head motion more than sound. This is where these headphones are better than studio monitors, unless you have a well treated room with a good sub. I therefore use these headphones to adjust bass, in relation to the reference songs. I also use them for editing slight sounds (pops, clicks) and getting reverb tails right, and with help panning tracks -- they are VERY good for this, like a magnifying glass.The foam pads and black 'paint' on the headband will crack and fall off after 2 years. I wrapped black sports tape around the headband, works well. Replacement pads can be bought on Amazon. So the padding material coating could have been better made.  That plus the middy frequency response is why I give 4 stars instead of 5.  But I still think they're the best headphones for mixing and tracking under a couple hundred.", "id": 458}, {"review": "Well made tube with good amount of gain and highs. Excellent for cleans and crunch due to increased clarity. For high gain metal, however, I found that it's a bit too hairy. For instance, as V1 position in my preamp, it had a little too much trebly sizzle versus other tubes. For comparison, a Sovtek has less of this \"hair\" and is tighter sounding but also has more of an upper mid-range fizz which can get annoying. In the end, I switched the Tung Sol with a Ruby AC7 which was formerly in the V2 (overdrive) position, and that got me better articulation with less fizz. So Ruby AC7 in V1, Tung Sol in V2 - that's been my best combo so far.", "id": 514}, {"review": "This is the one pedal I can't do without. You can sculpt your guitar tone before it hits your amp, and that's the key to getting a tight rhythm tone at high gain. So if I encounter an amp that isn't tight enough, or the high gain distortion doesn't sound good by itself, I just turn down the gain or use a lower gain channel, and then hit it hard with this pedal. Sounds so much better than the internal high gain distortion.Alright, so here are some things you might want to know before you buy:* The gain knob when turned to zero still produces overdrive. So you can't use this as a *clean* boost pedal. With high output humbuckers, you still get some mild tube-like overdrive at zero gain. But this isn't advertised as a clean boost pedal.* So how much gain / distortion does this pedal have if you're going into a clean channel of an amp?  Plenty for classic rock and blues. Not enough for metal, though if you crank the gain and high knob all the way you can just barely get a prog style metal tone. But it's not a distortion pedal, it's just an overdrive.* This thing uses tiny SMC components in the circuitry and therefore isn't really moddable.* Unlike the Bad Monkey, this doesn't have an additional mixer / cabinet emulated output.* Like a tube screamer, it boosts the mids and reduces the bass so that going into a mushy sounding tube channel you get a tighter distorted sound. Anyone who has a nice warm amp and gets this pedal thinking they'll get more of the same, may be disappointed. What they need instead is a transparent clean boost pedal that keeps their guitar the same tone just louder volume.* The classic/modified switch is pretty cool. I have two guitars, one is kind of bassy and scooped sounding, the other is bright and middy. Well, using the switch, I can make one come out more equivalent to the other when needed. This keeps me from adjusting my amp each time I switch guitars. Classic is a slightly lower gain, more mid-boosted sound. Quite tight. Think Peavey 6505 EQ structure. Modified is more scooped, saturated. Think Mesa EQ structure. So this switch is a useful little bonus.*  It eats batteries, sucking in around 150 mA at 9V, so my 300 mAH rechargeable lasts 1.5-2 hrs. I swear if that blue LED weren't so bright it would probably get an extra hour. Instead of getting an adapter, I got an 8-battery AA clip, 9V battery clip, 12V DC plug, and 8 Sanyo Eneloop batteries. Hooked it up with negative tip, positive sleeve and now I have a 16,000 mAH monster = about 100 hours play time.This pedal is perfect. You get what it's advertised to do. It's rugged, looks good. I haven't found it to be noisy at all, unless there was something wrong with my guitar (strings not grounded through the bridge, etc...). Someone mentioned the silver tops of the dials falling off as if they were decals, but I looked and the knobs seem like all one solid piece to me.Another thing I found is that instead of using an overdrive plugin in my DAW, if I use this real overdrive pedal in front of my interface, that magically makes all hum / noise from my pickups go away.Overall, yes I highly recommend this, and would suggest people check out the Hardwire Metal Distortion if they want something as a standalone rather than an overdrive into a crunchy amp. Like others, though, I can't stop playing through this. Great purchase, especially if bought used.", "id": 529}, {"review": "What you need to know about this mic:1) This mic is very directional. You must keep your mouth in the sweet spot at all times for best results. Pulling back an inch gets into tinny muddy territory, and an inch too close makes for a strong proximity effect. I found that a palm's width from the tip of the mic works best. As long as I keep my mouth there, the results are predictable and good regardless of the room I'm in. Also if the mic is aimed too low on your face (like at the lower lip or chin) you'll sound like you have a stuffy nose. Aimed too high (like at the bridge of the nose) sounds sneering and nasal. Right at the upper lip works well for me.2) The bass cut and presence boost are convenient. Use a plastic thing like a guitar pick to switch them, as metal will scratch it. I've played around with the switches and in the end both set to flat was best. Initially I thought the presence boost was a good idea, but in a mix it made my vocals too honky in the upper mids. Flat's where it's at. Flat sounds most natural.3) Being a dynamic, it won't sound as open and airy as a condenser might. Though it takes EQ well, and you can EQ that in. If you remove the foam and use a pop filter, you do get more highs, but after working with that for a while I realized it doesn't always sound right, seems to unbalance the highs above 5k toward sibilance a little too much, but it might work for you. After using it for a few years, I learned that starting with a bad mix that is too bright or blaring and then adding in the SM7B on vocals causes the mic to appear dull and muffled, but really it's the mix that's the problem. Whereas if I start with the vocal sound and make it clear and natural, and build the mix around it, the mix turns out to have a natural sound that's not too bright or dull either.4) Yes, it rejects room sounds more than a condenser, but not gobsmacked amazingly so. It rejects what's behind and to the side, but in front it's pretty sensitive. So if you're singing with an echoey room behind you, it will pick that up. So don't think this will make you sound like you're in a dead control room, unless you actually are in one. Hang some blankets or acoustic foam behind you and you're set. Being that it records about twice as dry as a condenser, it takes reverb pretty well in a mix, meaning you can add reverb and delay without having your vocals drop too far away and undefined in the mix.5) So what does it sound like? The sound is *very* natural and true to my voice. It truly is a vocal mic first and foremost. That plus the dry/up-close characteristic are this mic's top selling points. It works fantastically on death metal growls and clean singing atop sparse/acoustic/clean backgrounds. It does have slight color in the mids; I agree with the frequency response chart indicating it has a slight scoop 400-900Hz, slight boost 1000-2000Hz, but it's still natural sounding despite that. The color is tailored to the voice: reduce the honky boxy mids, accentuate the main vocal intelligibility range. That's one reason why this mic is considered \"flattering\" on vocals. It still has body though, definitely not a thin sounding mic.6) This thing is heavy and rugged. The capsule is surrounded by this truncated cone-like metal screen enclosed on all sides. The screen is like the kind you see behind microwave oven doors. What I like about this mic is that I can throw it inside a bubble mailer or wrap it in a scarf for storage and not have to worry about crushing or damaging it, and it doesn't need a big case like some condensers and especially tube mics do. So it's actually compact in practice and quick to set up with one of those detachable mic adapter mounts. Even without the adapter, it has a convenient free rotating collar to screw it onto a mount/stand so that you can hold the mic in place while screwing it down.7) This mic needs 50 dB gain for loud singing, 55-60dB for quiet singing, 65-70dB for whispering. Make sure your preamp is designed for at least 60dB of clean gain. Some cheaper USB interfaces only go up to 35dB. If your interface lacks the juice, no worries, get yourself a CloudLifter and it'll add 25dB of nice clean gain and it's phantom powered too.Overall, I would prefer a condenser in a good room since it allows me to move a little more without coloring the sound, and because it has a more openness and air compared to this one. But since my room isn't perfect, this will do. The biggest pros are that it's natural sounding and that even with reverb and delay it stands out in a mix. It's especially good on spoken voice, as it was designed for, since unlike a condenser the SM7B does a very good job of not picking up as many mouth clicks, mouth noises, and background hissing.In the end, if I had to get rid of all my mics and keep only one for vocals for the rest of my life, it would be the SM7B. Mainly because I know I can conveniently use it anywhere, anytime, and get reliable good results.EDIT 2014:  Forgot to say, when you listen to mic shoot-outs on the net, often times the tip of the SM7B will be positioned the same distance as the condenser. This is a problem because the SM7B's diaphragm is actually back a few inches. So the condensers will be closer to the talent (or lack of talent) than the SM7B in such cases, causing the latter to sound more duck-ish, honky, un-detailed, or thin due solely to distance factors, and is thus not characteristic of the intrinsic mic color. In shoot-outs where the proper distance was used, you'd be surprised how much the SM7B sounds like a good condenser. It really does. Of course it may be missing air (or conversely, be less prone to sibilance) but as I said below you can *easily* EQ that in, since this mic takes EQ very well. Seriously, a 2dB shelf in the highs. Another thing I wanted to add, is that the gentle bump in the 1k to 2k region (for vocal definition) that his mic has, can sound slightly honky or strident or blaring depending on some sources, but again you can EQ that down a bit. And finally, when Shure says this mic has a flat response, that's not true, it has color and the frequency response charts show it. Yet, the color gives it a larger than life natural sound on voice, so it sounds natural even though it's not completely transparent and honest.", "id": 136}, {"review": "After tons of experimenting, I settled on the EXL116 for D standard and E flat standard. I've tried 10-52 but the top is a little too floppy for D and that makes notes sound out of tune if you don't press the string just right. Also tried 11-56 and while that gives a real solid and full rhythm tone, the attack is too rounded due to the pick taking longer to travel over a wider string. That reduces articulation. So while you get a fuller sound with the 56, you get more dynamics and attack with the 52, and the latter makes metal rhythms sound heavier. You can EQ fullness into a rhythm track, but you can't add in pick attack and greater dynamics.Tension wise, at D standard 11-56 is ideal but 11-52 is doable. Sound wise, 11-52 has been best for my metal recordings and that's why I'm sticking with the EXL116 set from now on. I also replaced the G string with a 20 gauge wound for better sounding power chords. And compared to Ernie Balls, D'addarios start off less bright but maintain their brightness longer, thus a more even and predictable response over time.", "id": 156}, {"review": "I'm using this as a DI box for recording. It does some compression, overdrive, EQ'ing, notch EQ'ing, and excite-ing all in one pedal. So compared to the original bass signal, you get this clear, deep, punchy sound that fits right into a mix.The Bass Attack sounds a lot like a SansAmp Bass Driver but at 1/3 the price. One difference is that it has an additional \"Shape\" knob, which is a lot like the ISF knob on Blackstar products, and is a notch filter. The other difference is that the SansAmp uses tougher chassis and components, so would last longer for the gigging musician. But don't take me wrong, the Bass Attack uses a solid metal chassis and doesn't feel cheap at all.The Harmonics knob adds some overdrive, and gets kind of farty when turned up 100% but sounds pretty good at 75-90%. It doesn't do that high gain super gritty/fizzy distortion though, for that you could connect a distortion pedal to the parallel output, or duplicate the track in your DAW and add a distortion plugin.This pedal is very versatile. I found that the Shape knob is indispensable; it takes the place of a mid control. For example, by notching (reducing) the boomy 60-130 Hz region and turning up the level, you get plenty more mids. The treble and bright control seem very similar to each other, one seems to amplify the 4k region, the other the 5k but that's just an estimate. By keeping both of those around 10 o'clock and the Shape control beneath 115 Hz, I can get a solid, deep, yet mid-full sound for a metal mix. Thus anyone who thinks this pedal is all bass and treble and no mids, ought to try settings along those lines.Another good feature is that this pedal can run on 48V phantom power. As in, no adapter or battery needed when recording direct or running to a mixer. In conclusion, for recording, you can duplicate the SansAmp sound that you hear on a lot of albums using the Bass Attack, and tweak it further via the Shape control. And yes, the various button pushes get you four different sounds total, but I prefer having both buttons on. Then in my DAW I only throw on an extra compressor and it sounds great. This pedal is a steal for no frills bass DI recording.", "id": 236}, {"review": "I've been a Jazz III fan since 1997 starting with the red (too buttery and rounded sounding) and then moving to the black (durable but a bit tubby sounding). Eventually I tried a 1.0mm Tortex of this pick which had good attack but was somewhat mushy sounding through amp sims.But then I tried this .60mm and holy cow the sound change was like getting new pick ups. More mids, more attack, faster attack, scratchier attack, and less lows. Now you'd think this would make your guitar sound thin, and indeed it sounds thinner but also clearer by a factor of two.Thus when recording through amp sims, you get a clearer more dynamic more attack-ish sound. When using the 1.0mm the fundamental was a bit too strong which made for a mushy amp sim sound, but this .60mm did the trick. It just sounds heavier, tighter, and more articulate. While it does wear faster, for recording purposes it's my current ultimate pick of choice.So if your guitar doesn't sound clear, articulate, or aggressive enough first give this pack of picks a shot. But you don't have to take my word for it... da-nehh-nan!", "id": 341}]