[{"review": "Ive been trying different strings for years!!!  Ive been stuck on elixirs for some time now and wanted a change.  These are very bright and clean!!!!  very playable!!!", "id": 58}, {"review": "Im a huge fan of Elixir's!!!  This, however, is my first go with the polyweb, but there is no disappointment here!!", "id": 100}, {"review": "OK, so they are just screws....... but a quality replacement for ones for the rusting one!!!  And it is fender licensed!", "id": 215}, {"review": "There was nothing wrong with my original neckplate, but I was replacing the rest of the hardwear and pick this up just to add just a little something extra.  IT was a direct replacement for the original.", "id": 475}, {"review": "As a huge Gilmour fan, it was a no brainer to pick these strings up.  Had been playing DR and Elixer for the past couple of years and  to my recollection,  have never tried ghs.  This custom gauge set plays great.  They tuned right up with very little stretching.  I will buy these again!!!", "id": 499}, {"review": "This arm is a direct replacement for the original.....  It is a bit to long for my liking and I may shorten it down in the near future.", "id": 558}, {"review": "I think a set of five is a bit overkill since i only needed three, but these are a direct replacement for the originals.", "id": 676}, {"review": "As a guitar player, I recently (march 2013) started to play the uke.  I bought these strings to replace the set that came on the instrument.  These string play good and stay in tune pretty well.  I will buy again.", "id": 698}, {"review": "Works great and easy to use.  It also seems to be very accurate.  Definitely worth the money!! (Should also work for any stringed instrument)", "id": 763}, {"review": "This is a cheap and easy upgrade!!!  At about 20 years old, my MIM Standard strats' hardware was starting to show her age.  Most of the screws and the bridge had some surface rust.  For about $40 bucks, I was able to replace all the screws, springs, bridge, neck plate.  This is stage one of my rebuild.  The tone block on the replacement bridge has about twice the mass as the original which increases the tonal quality 10 fold.  Don't forget the bridge screws as this bridge replacement does not come with them.", "id": 678}, {"review": "Very nice!!  Super vivid, easy to see color.  The clamp portion seems to be sturdy and well built.  This is a great buy for the money!", "id": 706}, {"review": "For the price, this lil guy does the job.  I got this to add to my pedal board and it seems to do a good job boosting the mids and highs that seem to get lost in the pedals and cables.  The pedal is somewhat cheaply made, the jacks don't really seem to fit the housing so well, but i do have it somewhat semi-permanently fixed to the board so i do not think that this will be an issue.", "id": 835}]