[{"review": "There seems to be a lot of know it alls when it comes to this case. One reviewer says it's made by Fender. I seriously doubt that and have to wonder on what he bases that on. Show me proof. Someone else seems to think it's made by Epiphone. Sorry to disappoint you but Epiphone doesn't make cases. They accept bids from case manufacturers who can build a case to thier specifications at the lowest cost. I have several Epiphone 335 Dots and a Gibson ES335. I bought Epiphone cases for all of them. I found the Gibson case to be identical except for the color of the lining and the logo on the outside of the case. I couldn't see any sense in paying more money just for the Gibson name. My Gibson fits perfectly in the Epiphone case. Although the cases have the Epiphone logo on the outside, they are all made by TKL. How do I know that you're wondering? They have a TKL tag on the inside of the accessory compartment. That's been a few years ago. The cases you get now could be made by a different company. The case is very heavy and is actually heavier than the guitar. Regardless of who actually makes the case, it has to meet Epiphone's manufacturing standards so it's got to be good. This case will fit The 335 Dot, Casino, Sheraton and the Gibson ES335. Anyone who knows anything about guitars knows that the Epiphone Joe Pass Emperor II has a much thicker body than the 335 Dot. This case was not intended for the Emperor II. It's a great case and will protect your guitar, but it's not designed to be thrown from a rooftop or run over by a car. I just bought two more of these cases for my Harmony Rockets. One is a single cutaway reissue and the other is a vintage double cutaway. Both guitars fit perfectly.", "id": 157}, {"review": "This pedal works but doesn't have the depth of echo I expected. I doesn't even come close to the same sound quality of my old Dan Echo DE-1 pedal.  That certainly explains the difference in price. You get what you pay for. I'm using it with a Fender Eighty-Five solid state amp. I tried it with other amps and it sounds the same. If you're looking for a good slap echo effect, I would recommend spending more money and buy the Dan Echo DE-1 pedal or even the Danelectro BLT slap echo pedal is less expensive than the Dan Echo, but still sounds better than the FAB echo pedal. The FAB echo pedal works and you can hear a definite difference with and without it. It's just not as good as I expected. I'm sorry I bought it and I don't recommend this pedal. There are much better ones on the market. Shop around.", "id": 315}, {"review": "I've been using HOSA cables for quite a few years and find them to be professional quality and very dependable without being overpriced. I particularly like the right angle plug. It works well on most guitars except Strats and Strat style guitars. That's still not a problem because I simply put the right angle plug in the amp and the straight plug in the guitar. This cable is far more flexible than plastic coated cables. I'm very pleased with it and recommend it.", "id": 492}, {"review": "I received this capo yesterday and it works perfectly on my acoustic guitar. It is styled very much like the Kyser capos but cost about one third of what you'd pay for a Kyser. It is made of aluminum, NOT ABS plastic as another reviewer suggested. The spring is plenty strong enough to hold down all 6 strings with no problems. The rubber pad is flat and this capo works well on guitars with a flat fret board. I don't know how well it would work on a guitar with a curved radius fret board. I'm thinking it may not hold the high and low \"E\" strings down sufficiently to keep them from buzzing. I could be wrong. Keep in mind it is very important to fully depress the spring when moving the capo up or down the neck. Sliding it will cause wear on the rubber pad on any capo. The wound strings will cut into the rubber  like a file if you slide it on the strings. I really haven't had it long enough to see if it will stand the test of time, but as the title of my review reads: \"So far, So good\" It's very reasonably priced and I'm very pleased with it. I rate it at 5 stars. It's well worth the money. It's very unlikely to break and if I find the rubber pad wears out prematurely, I will update my review.", "id": 603}, {"review": "These tuners are amazing! I like them so much I bought another one. They work better than tuners costing ten times as much!You don't have to be a rocket scientist to use it. It's so simple a child can use it. The face of the tuner is lighted and easy to read even in the dark. It is extremely accurate. This is so much better than my Intellitouch tuner and cost less than half of what I paid for the Intellitouch. It's very affordable and is something no guitarist should be without. It uses one CR2032 3 volt battery and comes with the battery included. You have to install the battery which is no big deal. Just read the instructions. I recommend it highly and give it two thumbs up and a couple of toes too!", "id": 706}, {"review": "I have a collection of guitars that exceeds well over 100. I have guitars that cost thousands of dollars and I also have some cheapies. Some of the best sounding and best playing guitars are the \"Cheapies\" I've been dealing with Musician's friend forever. Rogue is Musician's Friend's brand. Music 123 is a Musician's Friend affiliate and they also sell Rogue guitars. I have several different models of Rogue guitars and I'm impressed with all of them. The Rogue RA-090 is an entry level dreadnought acoustic guitar which is every bit as good if not better than the Fender Starcaster. Here's the good part, the Rogue is about half the price of the Fender! Many people think they want to learn to play a guitar until they get one. Once they realize it's not as easy as they thought and it hurts thier fingers,they quickly lose interest and the guitar gets stored under the bed to soon be forgotten. If you're not sure if you're serious about learning to play, this is the guitar for you. Even if you're an intermediate to advanced player, you still can't go wrong with this guitar. It has a deep rich tone like that of a much more expensive instrument. The finish and workmanship is also like what you'd find on a more expensive guitar. They look, play and sound great! Many people tend to shy away from Rogue guitars because of the low price. They figure a guitar that cheap can't be much good. That's where they're wrong! You have to actually play one to understand what I'm talking about. Once you play a Rogue guitar, you too, will become a believer. This is the kind of guitar you can take camping to play around the campfire. If it happens to get damaged or stolen you're not out an arm and a leg. I love Fender guitars and they are among some of my favorites, but for an entry level dreadnought acoustic guitar, the Rogue is a much better value than the Fender and equal if not better in quality. The Rogue RA-090 comes in a variety of color choices. If or when you decide to sell it, you can usually get back what you paid for it.I give Rogue guitars my highest recommendation and promise you will not be disappointed it you buy one. I've been playing guitar for 51 years so I should know what I'm talking about. I do not own stock in Musician's Friend, Music 123, or Rogue guitars and I don't get paid to endorse them. This review is my honest opinion.", "id": 726}, {"review": "This power supply is advertised as having the capability to power multiple pedals. That's good to know, but since I plan on using it to power only one pedal, it works fine for me. The variable voltage settings give you some interesting effects. I am very pleased with it and recommend it over other brands.", "id": 760}, {"review": "I honestly don't know how they can sell these cases for the price and give you free shipping too. I've seen cheap quality chipboard cases and gig bags that cost more. This is a hard shell tolex covered case. They are sturdy, well padded with plush black lining, and look as good as cases costing much more. These cases are made for dreadnought guitars, and I bought two of them. One is for my Ibanez AK75G arcrhtop electric guitar and it fits perfectly. The case has 4 brass latches and one is lockable and comes with 2 keys. It's made in China, but isn't most everything these days? I wouldn't recommend it for airline/railroad baggage, but this case will offer ample protection and safe storage for your instrument under most other conditions. I don't think you'll find a better deal on a hard shell guitar case anywhere else. Don't be fooled by the popular belief that more expensive is better. Do yourself a favor and save a few bucks by buying one of these great cases!", "id": 753}]