[{"review": "I have an Acoustic B100 MKII 100 watt bass amp with a 15 inch speaker. My bass is an SX jazz bass. I have always loved the tone of my Acoustic amp, until now. After I plugged this little bad boy in, it brought my amp to life! Now, I cannot live without it. This is the Swiss army knife of bass preamps. Every bass player should have one of these. You can dial in tons of different tones and it gives your amp that tube-like sound. For 29 bones, you simply cannot beat it! Spend the extra 10 bucks and get the Behringer 9V power supply, so you don't have to worry about batteries. If you are a bass player, just buy it!!!", "id": 378}, {"review": "This is a very good quality, nice sounding delay. You can get that classic \"slapback\" sound or dial you in some nice lead delays for that classic rock sound. Very simple to operate and that's what makes these Joyo pedals a \"joy\" to use. Nothing fancy, but simple and to the point. Another great selling point to me is that they are absolutely \"true bypass\". I have bought the cheaper, \"plastic\" pedals and they make noise. They say that they are true bypass, but they are not. These babies are dead quiet! I run mine through the effects loop on my Bugera V22 tube amp and it sounds great! I also own the Joyo Vintage OD (TubeScreamer clone) and it is great as well. Highly recommend!!!", "id": 731}, {"review": "I am truly amazed at the quality of this guitar! I got the natural finish and I am blown away at the beauty of this thing! Mine arrived in perfect condition. Will only need a minor setup. The intonation was surprisingly spot on and the strings are actually alright to practice on for a while. If you are looking for a great quality strat for under 90 bucks, then don't hesitate and order one of these babies!", "id": 754}, {"review": "An all-in-one guitar tool that is a must-have for any guitar case! Great quality string winder and cutter! Plus, it is extremely low priced! Don't hesitate...get one!", "id": 94}, {"review": "This is a really nice, sturdy pedal with a really warm tone. I have a Marshall MG15CFX solid state amp. This pedal sounds really good on the clean channel, but you can hear that it is not designed for a solid state dirty channel. It has given me another tool in my toolbox and basically added a 5th channel to my 4 channel Marshall. Great classic rock 70's tone! It responds really well to my pick attack. You really can't go wrong for the money.", "id": 728}]