[{"review": "The rosin does the trick, and it's cased in a nice wooden holder, so it shouldn't crack easily (unlike those round rosin containers).", "id": 78}, {"review": "I have used Elixir's on all my guitars for the past 3 years and never been disappointed. Their tone is great and the nanoweb's feel nice when you're playing.Disclaimer, I would only recommend the nanoweb, NOT the polyweb.", "id": 106}, {"review": "As a professional guitar player, I am always nervous playing a show with &#34;old&#34; strings. However, I've been using Elixir for over 2 years now, and the strings really do last a long time. I would usually replace my strings every month, but I've started leaving them on for up to 6 months.", "id": 107}, {"review": "I started by powering 1 stomp box on this chain and it worked, but when I tried to add a second/third stomp box, I couldn't get any guitar sound only a loud buzz. I returned this product I did further testing, I would not recommend it to anyone. With my personal experience in mind, I would advise you to save your money and get a pedalboard power supply. hope this helps", "id": 192}, {"review": "I've only had these strap locks for a couple weeks, however, they've performed well so far. The fail proof U holding the guitar is what sold me on these. I would recommend these strap locks over any others currently on the market, but I'm working on designing a better lock.", "id": 278}, {"review": "Erm, it does what it say it would do. The nice thing about the &#34;super&#34;, is its size, in turn, and its ability to hold more water.", "id": 299}, {"review": "TC makes very high quality pedals, and this thing is built like a tank. I've had it for over 2 years and done many gigs, and a couple tours and all my TC pedals are in perfect condition. Now for tone, this overdrive is a light overdrive and works really well for me when I'm leading worship n my band, we play heavier music, so I was messing around with this overdrive so I could use it there as well, and I discovered that if you try to use it as a boost pedal, it makes your tone really muddy, but if you send a dirty tone (overdrive or light distortion) into it, it screams beautifully.", "id": 749}]