[{"review": "It works for what it is, it just feels a little light when you wind after getting the tension up.  Not a bad product, just don't know how long it will last.", "id": 161}, {"review": "I was honestly amazed at how flexible this cord is.  I really like the right angle plug for my amp, it doesn't make the wire 'stick out' like a straight plug would.  Good stuff.", "id": 168}, {"review": "I wear a large sized glove, so assuming that would translate, I got these.  While I can force it over my thumb, it is very tight and uncomfortable (i.e., pinches).  My thumbs don't have a particularly excessive diameter either.  I'm gonna try to heat these so I can stretch them a bit.  I know they need to be snug so the pick doesn't rotate when being used, but this is ridiculous.  Three stars because if they fit you, it is a nice pick (it would be 5 if they were described correctly for sizing).", "id": 343}, {"review": "The width is nice, wide enough to distribute the weight, but not too wide.  Attaching it is a snap.  The suede gives it a nice 'grip' to your shoulder so the guitar doesn't slide around.", "id": 483}, {"review": "The screw holes are just a shade off for my guitar, and you would think they would want to standardize so they didn't have to carry so many parts.  Nope, doesn't fit a Squire Affinity, just FYI.", "id": 562}, {"review": "Dunno how, but mine came with no cable and the pickguard wasn't installed.  The pickguard is no biggie, I actually didn't want it on there (it seems oversized to me).  If I wanted it on there tho, it's got a peel off sticky back.  Not having a cable was kinda a big deal.  I sent an email to Epiphone (Gibson), got a response within a day and after sending in proof of purchase, they promised to send me a cable.  Nice customer service.As far as the Uke, the finish on mine was perfect, no blemishes I can see.  I did change out the strings, and it does sound a 'little' better I suppose, but not that much.  Probably would have messed around on the stock strings a bit longer, but I listened to the reviews and did a change right away.  For $100, if you want a uke, this one looks awesome and plays well.", "id": 772}, {"review": "Doesn't reduce sound worth a darn.  I thought plugging the sound hole would muffle things.  Muddies it up a bit maybe, but not really a reduction in dB.", "id": 497}]