[{"review": "The Pignose is not the world's best travel amp, or portable amp, or practice amp. It's not very good for vocals, it's inefficient, what with its 40-year old design, and it distorts way too easy. There are far better amps for most purposes from Boss and others that deliver a lot more clean volume, thanks to modern class-D amp technology, and a variety of digital effects to boot.BUT... there is one area where the Pig prevails. If you're looking for the sound of a big overdriven amp in the studio, or miked on stage, the Pignose will give you that sound for less than the cost of one good quality overdrive pedal. By opening and closing the box, you can get a range of cabinet sounds from the open-back Fender to the classic Marchall sealed cab, and everything in between. Frank Zappa recorded a lot of his guitar parts using nothing but his SG running into a Pignose, and he got fantastic sounds.Beyond that, it's cool looking, reasonably rugged, and even has pegs that allow you to hang it from a guitar strap. Every rocker needs one.", "id": 76}, {"review": "There are two ways guitar strings go bad. If you leave them on long enough, the steel cores and bronze windings will actually corrode- but that takes months, if not more. Before that happens, grease from your fingers, dust, bits of skin, and other detritus from the environment gets into the strings, between the windings. This interferes with the free vibration of the strings and deadens the sound. Back when strings were a lot more expensive, some guys used to take their strings off the guitar and regularly clean or even boil them; some bass players still do. Coated strings are a simpler alternative.These strings and similar ones like Elixirs have a thin polytetrafluoroethylene coating bonded to the wrappings, which accomplishes two things: First, it creates a barrier between the atmosphere and the metal wrap, which prevents rust and corrosion. Second, it provides a physical barrier that prevents contamination from getting in between the windings. The strings stay fresher sounding two or three times as long as standard strings. They do sound just a bit less bright than the equivalent uncoated strings, but it's not a huge difference, and after a month or two they still sound the same.They also cost about twice as much as equivalent non-coated D'Addarios. Are they worth it? That depends. If you're an active performer, maybe. You're probably changing strings for every performance to make sure you're getting a bright sound. You're probably also buying your strings by the box. There's no real benefit to these strings. Where they really pay off is for the casual player who may not have a few dozen spare sets handy. These days I'm strictly a hobbyist who might play publicly once or twice a year. I have four acoustic guitars, and some of them may go go for a month or more without being played. With coated strings, I can leave a set on a guitar, and a month or two later I can pull it out of the case and it's ready to play. I still change strings if I'm going to be playing in public, but for guitars that spend most of the time sitting around the house, these are great.", "id": 130}, {"review": "I was in a local music store the other day and noticed a huge stack of these cymbals, with a few examples mounted on stands to try. While they're not as rich as Zildjians or Paistes or other more expensive cymbals, they do have that trashy sound that you look for in a China. And at the asking price, who can resist?", "id": 144}, {"review": "I've tried just about every make of round wound electric guitar strings in the last 30-40 years, and I've settled on D'Addarios for all my guitars. Their strings are of uniformly high quality and excellent consistency, the price is right, they're color coded to make string changing easier, and they come in an air tight plastic package that keeps them from corroding even after sitting in a guitar case or a year or more. The 10s are my choice for rock and blues.", "id": 156}, {"review": "Thee only flatwound strings I've tried that sound significantly better than these are the Thomastiks, which cost twice as much, and they're not twice as good. Maybe if I was a working pro I'd buy the Thomastiks, but for me, the D'Addarios sound good, and last a long time.If you've never played flatwounds, you might be surprised to discover that they far outlast round wound strings. That's because what kills the sound of strings is gunk from your fingers and the air getting in between the windings and damping the vibration. Back when guitar strings were more a lot more expensive, it wasn't that unusual to remove strings, boil them, and put them back on. Some electric bassists still do this.) With flats, the gunk doesn't get in between the wraps, and if you don't break a string you can play a set for months.I have different guitars set up with different strings ranging from .010s (my Fenders) to .013 (my archtop.) Rockers playing .010s and .009s might be intimidated by .013s, but they're not that much harder to play, and after a little practice it's easy. Jazzers seldom if ever play six-string bar chords or bend strings, which means you just don't need that much muscle anyway. Flatwounds are also generally set with a fairly low action. They don't vibrate as widely as roundwounds, so they don't need as much clearance.If you're looking for that classic electric jazz guitar sound, flats are the way to go, and the D'Addarios are as good as you need. (Rockers looking for that 60s sound might try the D'Addario flatwound .010s. Almost the same sound as the Pyramids, and a lot cheaper.)", "id": 259}, {"review": "Maybe it's because I cut my musical teeth on Motown and 60s rock, but I've always preferred the sound of flatwound strings to round wound, or even ground wound strings. It might also have something to do with the fact I play upright as well. Flatwounds are easier on the fingers of both hands, and they have a natural damping that makes them sound more upright-like to my ears. It doesn't hurt that a good set of flat wounds will last practically forever, too. I use D'Daddarios on all my my electric guitars and basses as I've found them to be very consistent from set to set, and the sealed plastic packaging means that I can buy a set today, put it in my case, and it's be as good as new a year later.I used to use LaBella flats on my fretless, and then switched to Thomastik Jazz Flats. Then a friend told me he'd switched from the Thomastiks to these.  He found them much more consistent in quality, and smoother as well. I'm now a convert, too.", "id": 407}, {"review": "I play a few stringed instruments, and ukulele isn't one of them. But after seeing so many great uke players lately- Jake Shimaukuro, Joe Brown- I had a hankering to try some ukulele playing myself. I wanted a playable instrument, and I didn't feel like spending a lot of money. I've tried $30-40 ukes in stores that were big disappointments- bad intonation, no tone, etc. After reading reviews here and elsewhere I decided to risk a purchase.Result? This is a surprisingly good instrument for less than fifty bucks. Sure, it doesn't have the volume or the rich tone of a soprano with a solid top, but it delivers good tone, excellent intonation, and good playability at a very good price. It may not be a 5-star intrument- but it's a 5-star value.If you're thinking about trying ukulele, but you're not sure you want to buy an expensive instrument right away, I would strongly recommend an LU-21. Even after you buy a better uke, this is a great one to keep on hand to shove into the hands of unsuspecting guests, so that you can play ukulele duets!", "id": 536}, {"review": "My first reaction on opening the box that this came in was &#34;Gee, it's a lot smaller than I expected.&#34; It looks like a CAD Equitek E100S but it's a fraction of the size. I'd even say it was cute. But how does it perform?I have two microphones I use for recording at my computer: A Blue Yeti USB electret mic, and a Sampson SAMTR101A. Of the two, the Yeti is closer in design, as it uses an electret capsule and a built-in USB interface, like the Go Mic, so that's what I compared it to. I fired up Garage Band and plugged both microphones into the computer (a four year old iMac) so I could lay down some parallel instrumental tracks with acoustic guitar, ukulele, and double bass.Right off the bat I was impressed with the Go Mic's lack of latency; it was as good as the Yeti- maybe better. There was no perceptible delay.  No need to find a special driver, either. Plug it in and it's ready to go. There's even a headphone jack in the mic- something unusual in a package this tiny. Sound was good, too, though perhaps not as uncolored as the Yeti. I tried all three modes: Carodid, Carodid + -10bD pad, and Omni. Omni gave the best, clearest sound, not unexpectedly, but it was hard to get a good level when close miking. No matter how I backed down the volume in Garage Band I got clipping. Using the -10dB pad I was able to get some acceptable levels from a few feet away. Best sound on all instruments was obtained from 6-10 feet using the Omni mode.It has one advantage over the Yeti: It's very modest in current requirements, so I can run it directly off my iPad. The two together make a nice portable recording/production combination. Packaging is well thought out, too. The mic is permanently attached via a swivel  to a strong clip that also serves as a desktop stand, and when not in use the mic folds into the clamp for protection. And if that's not enough, there's a separate case to keep dust and dirt out of the mic.While the Go Mic wouldn't be my first choice for recording music, it would be a very acceptable one for recording musical ideas on the go, and perfectly acceptable for voice recording, podcasting, or Skyping.", "id": 583}, {"review": "The latest addition to my desktop is the most flexible recording device I've yet found: The Blue Microphones Yeti USB Microphone. Long known for their line of high-end condenser microphones, Blue is increasingly known for their computer-ready USB microphones, like the Snowflake and the Snowball, and the Yeti is their latest and certainly greatest computer-ready microphone yet.Advertised as the first fully THX-compliant (a standard devised by Lucasfilms) microphone,  the Yeti is a large (12\" tall on its removable stand), hefty, multi-pattern microphone suitable for recording, podcasting, or any other computer-related audio activity. It features four switchable patterns- omni, carodid, figure eight, and stereo- a built in headphone amplifier, gain control, headpohone volume, and a mute button. For even more flexibility you can remove it from its desk stand and mount it on a standard 5/8\"microphone stand or boom.And it sounds great, too- even better than their well-regarded Snowball series. I've been using it for recording music practice, building tracks with Audacity on my Windows and linux boxes, and with Apple's GarageBand, and making calls with Skype. The ability to record in full stereo or mono is a real plus. Up to now I've been using a variety of microphones together with various microphone preamps and an A/D converters- a mass of cables and power supplies that bad enough on the desk, but a real hassle when trying to use with a laptop away from home. The Yeti has it all in one package. It may not sound quite as good as a multi-thousand dollar condenser microphone and vacuum tube preamp, but for the money it simply can't be beat.", "id": 644}, {"review": "I've been playing D'Addario XLs in their standard  .010, .011 and .013 gauge sets for many years now, so I was curious to see how these new \"balanced\" sets would feel. I expected a more even feel across the fingerboard, but experienced something quite different- right off, the B string felt a lot stiffer.  Looking at the tension table D'Addario publishes it's clear why this is the case. In the traditional .01s, the B string has about 30% lower tension that the E and G. In these new sets, the B is at the same tension, which is to say it's under 40% more tension than the B in the traditional set. That's a significant increase.  If you're used to the lower tension, the \"balanced\" tension feels a lot stiffer at first.The higher tension string requires a different amount of compensation at the bridge, too, which means changing the setup- not easily done on a Telecaster, where changing the length of the B changes the length of the E as well. Being higher in tension, the new B should require more compensation, since it'll shift pitch even more when you depress/stretch it. Since my Tele is currently set up as close as I could get the E and B to perfect comnpensation, I didn't feel like playing with it.After playing a while, the set started to feel more natural to me. I don't think I'll be changing gauges on the Tele right away, as I have about a dozen .010s in stock as well as over a dozen .013s fro my archtop. But I may experiment a bit with the new gauges for my Epiphone Dot Custom, which I string with .011s. I'm wondering if the balanced sets will give me a more even string-to-string feel, and if so, it would be worth my effort to change over.", "id": 868}, {"review": "Tascam had the first inexpensive multitrack recorder on the market, and even as competitors entered the market they've managed to stay on top. I've owned or borrowed models from Fostex and Korg going back several decades but Tascam always seems to be out in front when it comes to ease of use and value. Even as the market evolved from cassette to digital, Tascam recorders have kept the same feel and ease of use. I had a Boss Micro BR-80 for a while, but I found the all-menu interface annoying and difficult to use. I kept forgetting the sequences to set up rhythm tracks, record, and mix down, and ended up having to repeat things over and over. I soon sold it, and then replaced it with a Tascam DP-004 when that appeared on the market. The Tascam wasn't really any more powerful than the Boss, and lacked the built in rhythm tracks, but it had fewer menus and more actual switches and knobs that made it more intuitive in use, and more like an actual mixing board or traditional cassette-based recorder.After the DP-004 Tascam produced a follow-on six track unit and this recorder, the 8-track DP-008. When it was first introduced a couple of years ago it really was a revolutionary unit. There were plenty of 8-track recorders out there, but none that were that small and that inexpensive. It's also more than just a DP-008 with more tracks. The DP-008 has a much improved mastering ability that allows you to adjust EQ, compression, and effects individually on tracks for the mix down, while leaving the original tracks unaffected. Like the DP-004, it has built in microphones and can also be used for direct stereo recording. Unlike the DP-004, it comes with an external power supply in the box (a $24 option with the original 004) and can use an external battery pack.I've been playing with my 008 all weekend, doing a mixture of stereo and multitrack recordings. One thing I noticed right off was that there's a significant amount of noise in the monitor mix while multitracking. I was afraid this would translate into noisy recordings, but the noise isn't there in the finished playback. I also noticed that while the basic recording functions are more or less unchanged from those on the 004, the new mixdown functions are much more complex and required constant reference to the manual. As mentioned previously, there's an awful lot of capability there and it's going to take some time to be able to use it effectively. Most of that functionality is menu-based, rather than being accessibly directly from the front panel, and I have to say that's one thing I don't really care for. The only input device you have to select functions and parameters and menus is a scroll wheel that's not nearly as comfortable as a knob or a mouse or touchpad.Most of my recording lately has been done with various Apple platforms. At home, I use Garage Band on my iMac and a USB-equipped Alesis console for input. Away from home I use Garage Band on my iPad and (for ultimate portability) iPod Touch. All of these platforms are much more intuitive to use than the DP-008 and much more powerful. Of course, they're also a lot more expensive, and lack the built-in stereo microphones and ability to plug instruments and microphones directly in without some sort of additional interface. Having XLR connectors as well as 1/4\" inputs is a really nice touch, something you never saw on portables from a few years ago. I like the old-school approach of the DP-008 as well as the all-in-one package approach.If I was just starting out in home multitrack recording and didn't have a lot to spend, I think the DP-008 might be a good choice. It's really good enough to produce music for a band's first CD releases, and costs less than a decent microphone. WIth 8 full tracks there's no need to do track bouncing to get four instruments and four voices down, and if you really need to, you can bounce and add a further six tracks, giving you 14 in all. I don't think it's going to replace my iPod for pocket portability or my iPad for functionality (Garage Band gives me a full orchestra, keyboards and drums as well) but having the microphones and instrument preamps built in does make it much easier to set up and use for live recording. It should get a lot of use at my home and elsewhere in the coming year.", "id": 873}, {"review": "I've been recording on my iMac, iPod Touch, iPad, and iPhone for some time, using Garage Band. Interfacing with the iMac is easy, using various USB devices- I'm currently using a USB-equipped Alesis preamp. iOS device interface is a bit more difficult; it is possible to use USB preamps, with an externally powered USB hub, but that starts getting very complicated and messy.  I've been using simple devices like the 1K that  split the headphone/microphone jack into two separate cords, one for headphone, and one for guitar. The problem with this sort of configuration is that it's very easy to overload the microphone input, and the recording quality done this way is not very good. The Apogee JAM is a big improvement over this method for a number of reasons. First, it contains its own dedicated preamp and A/D, and because of that it delivers a wide dynamic range and excellent fidelity. Interface issues are non-existent; plugged into both the iPad and iPhone it was immediately recognized. I didn't have any problems with either of the three supplied cables.The JAM is significantly more expensive than the simple interfaces, but on the whole I think it's worth it. It's simple to use, has no detectable latency, and delivers excellent sound quality. It does seem to draw a fair amount of current, and battery life  is shortened significantly when using this with an iPhone. You'll want to plan on more frequent than usual recharging sessions. With the iPad, this isn't as noticeable. Even with that issue, I think the JAM is a good value.  The various iOS devices are capable of making very high quality recordings, but only with quality input. Given the cost of an new iPhone or iPad, the cost of the JAM is rather trivial in comparison.", "id": 895}, {"review": "I've been thinking about trying the Nanoweb strings for a while, but I was a bit put off by the high price (they cost about twice as much as the uncharted strings I've been buying)  and the comments of some reviewers that the tone of coated strings is noticeably duller. I was intrigued by the promise of long life, though; I have a Taylor Big Baby that I bought used, and which came with a set of Nanowebs that had probably been on it for a year- and they didn't sound at all like old strings. This review set gave me a chance to finally see for myself how they sound when new.I'd just changed the strings on my 1970s Gibson Gospel a week ago, so I decided that would be my reference. The Nanowebs went on my 1970s Guild D-35. Both are well broken in, solid spruce top guitars. The Gospel is a bit brighter sounding, but I'm pretty familiar with the sound of both guitars. If they D-35 sounded dull, I'd notice.As I was unwrapping the Nanowebs I noticed that while they were labeled \"Light\" gauge, they had a 0.013\" E string- something you'd be more likely to find on a set of medium gauge strings. The B was a .017, compared to the .016 of the D'Addarios I usually play. The rest of the strings were there usual light gauges. Turns out that these are \"HD Light\" gauge, designed to have a slightly more tension and better articulation at the high end. The difference shouldn't be enough to require any truss rod adjustment so I went ahead and installed them on the D-35.So how do they sound? The unwound E and B don't sound different from any other plain steel string, of course. The E does feel a tiny bit stiffer, when I switch between the D-35 and the Gospel. Sound-wise, I'd say they sound like a good set that have been on a guitar for a day. I wouldn't call them dull by any stretch of the imagination. If I didn't know that they were coated strings I certainly wouldn't be able to tell from playing them. So they're good sounding strings, and they last a long time. That leaves the question of cost- are they worth twice the price of uncoated strings?Here's the way I see it: If you're a heavy strummer, or playing gigs every night, maybe not. You're probably breaking strings or losing them to metal fatigue long before they'd go dull from corrosion or contamination. But if you're a finger picker, or a light strummer, a coated string will probably save you a lot of money in the long run. And if you're a hobby player who keeps a guitar around the house, and picks it up once in a while to entertain friends or family, coated strings are probably an excellent choice. For myself, I'm going to leave these on the D-35 for as long as they still sound good. I'll update this review when I find out just how long they do last.Follow up: After playing these for a few days, I actually went out and bought a set in the same gauge for my Loar LH-350, an arch top guitar with a carved top that gets played more than any of my other guitars. They sound great on the Loar, and now I have two guitars to do a long term test on.", "id": 899}, {"review": "As a lot of Epiphone owners have learned, cases designed for the Gibson ES-335 clones won't fit Epiphone guitars, as the Epiphones have a slightly larger headstock. This case, however, fits my Dot Custom like a glove. The padding is perfect, the top is arched to precisely fit the guitar, and the build quality is better than you might expect at this price level.", "id": 157}, {"review": "I was a little concerned after reader some of the reviews here, but the warranty, Blue's reputation, and Amazon customer service convinced me to give it a try. And in general, I'm pretty satisfied with it. Using it with one of my Oktava MK-301 microphones I get excellent sound, no hum, and so far, excellent reliability. I'm using it with Audacity and a few other programs, none of which have any difficulty recognizing it. There were some issues setting it up initially, and I'm a bit leery about the plastic construction, but for what I paid I think it's a good value. For those thinking of using it in field recording- stick it inside a carrying bag, and tape the cable to it to prevent stressing the USB connector. You shouldn't have any problems.", "id": 538}, {"review": "I've been using D'Addario XL nickel wounds on my P-Bass for a long time. They have a lot of tone, they seem to last a long time, and they're not very expensive. These strings have the same feel as the nickel wounds, but are a lot brighter You get lots of overtones and high end from these. The choice of gauges is a little different from the regular XLs, too; instead of the .085 A and the .100 E they have a .085 A and a .105 E. That's just enough to give you a slightly more solid low end, and more metal to dig into, while retaining low tension in the D and G. I'm more of an old-school player and prefer nickel for that mellower sound, but if you're into funk or more modern sounds, you may feel that the bright SS sound is for you, and if so, these are a great string.", "id": 896}]