[{"review": "Purchased the 6-string Kyser capo when I meant to get the 12-string version (slightly longer, stronger spring?), but find that this 6-string Capo not only works great on my 2 6-string acoustics, but also works on my 12-string acoustic with a little adjusting.  Quality seems top notch, design is simple and effective.", "id": 25}, {"review": "I was a bit concerned about this tool after reading some reviews that owners had damaged expensive guitars, but thought I would just be careful with it.  But I have no concerns after using it on two string changes.  In fact, I cannot see how one could nick the guitar while winding, since the tool does not even cover the entire tuning key so it never gets close the guitar head.  The string cutter works great, one squeeze and any size string is cut cleanly.  The pry tool for acoustic guitar pegs works, and though it is a tighter fit than I expected, it does work and means I don't need to find a pliers.  Overall, I am very pleased and saved time on string changes.", "id": 94}, {"review": "I purchased Elixir strings after hearing them repeatedly recommended at the music store.  Put them on my Eko Ranger XII acoustic 12 string.  Have 2 problems with the strings.  First, the bass E (11th string) broke while tuning it up.  Had to go to music store and buy a single replacement string (not Elixir).  I have changed strings many, many times, so I am convinced it was not my stringing, but a weakness in the E string itself.  Second, the high D (8th string) seems \"dead\"; it does not \"ring\" as it should and as the other high strings do (though none as much as other 12 string sets I've used).  Considering these strings cost much more than others, I certainly am disappointed in them.  Hardly matters if they last longer if they don't sound as good.", "id": 103}, {"review": "The Planet Waves Classic Series 10ft Instrument Cable is basic, but works great and is very flexible.  Seems sturdy enough to last a long time.", "id": 168}, {"review": "Re-strung my Eko Ranger 12 with these D'Addario EJ-38 light strings and am again getting a nice ringing tone with good sustain.  No issues like breaking or dead strings that I had with Elixir's, just good sound.", "id": 274}, {"review": "The Behringer ACX-450 is a good looking, great sounding amp in a small package, but should be used at low to medium volume.  At higher volumes one has to take care with the equalizer to reduce bass and midrange, and also use the anti-feedback button, to avoid a \"muddy\" sound from too much (distorted?) bass.  This not an amp to play loudly, but rather for low-to-mid volume accompaniment in a smaller venue.As to the sound effects, it is great with 16 effects covering reverb, chorus, delay/echo and many combinations.  I especially like that you can have all the effects with totally different settings on either channel.  Also nice to have a separate XLR microphone input on channel 2.The CD/MP3 input is good for backgrounds (or maybe drum machine) when playing, or music during breaks, although one needs a cable with RCA plugs to connect it.  Lack of a headphone jack is a drawback, but is balanced by all the good things this little amp offers.Overall, a great sounding and very flexible amp for a low price, if you don't plan to crank it up too much!", "id": 389}, {"review": "Not much to say about a basic bag.  It fits a dreadnaught acoustic 6 string guitar, has good padding, and has a large front pouch for music and small (fairly flat) items like a tuner, winder or spare strings.  Has a carry handle/strap, but no shoulder straps on the back as some others have.  Seems well made.", "id": 400}, {"review": "Nice overall, with a good sustained ring from the steel strings (1-2) and a bit of a metalic sound on the wound strings (3-6).  I like the sound I get on my Yamaha acoustic.", "id": 85}, {"review": "Tried D'Adario EJ36 Extra Light 12-string set on my Eko Ranger XII 12-string acoustic, and the EJ11 Light 6-string set on my Takamine.  No trouble stringing or tuning either set.  With the 0.012-0.53 Light weight strings I tuned a full note lower than normal to ease string tension, and they still sound fine.  Good acoustic, but a rather strong metalic, sound with a nice \"ring\", and notably more metalic than the EJ15 Phosphor Bronze strings.  Sound does deaden over time, as expected, but I especially noticed deadening on the high E and B non-wound strings, losing some of their \"ring\".  (Tried Elixir's for better longevity, but they did not sound as good to me as these D'Adario's.)", "id": 199}, {"review": "I tried the Dean Markley Blue Steel Light accoustic strings on my Takamine guitar, and will soon replace them.  On quality control, the high E steel string in the set looks bad with dark spots on it, two of which show after stringing the guitar.  String did not break as I rather expected, but it looks bad.  On sound, these seemed okay at first, but I still find it hard to keep in tune after a week, especially the high B and E steel strings, which just don't sound that good to me.  And I find the low E wound string notes tend to be too high as I move up the neck, more so than other sets I have used.Guess I'll go back to D'Addario and Ernie Ball.", "id": 204}]