[{"review": "I use this cord in my church to run from my pedalboard to my amp (which is in a soundproof box). The cord is reliable and clean sounding. I like it and have used HOSA products in the past with confidence. Excellent cord. Hopefully this review will be usefull to you.", "id": 6}, {"review": "I've been using elixers on my Godin Multiac Steel SA for many years now. They have a great, not-too-bright sound and you don't get the string noise when you move your hands across the neck like you do with traditional strings. These tend to last me about 3 months! So, I am very happy with them. They also track pretty well with my roland synth, so no gripes there. All in all I really like these strings and think they sound great.", "id": 108}, {"review": "I've come to the point where anytime I buy a new guitar cable it is a planet waves. They are good quality, decently priced, and I don't have to worry about them shorting out on me. Definite buy.", "id": 168}, {"review": "I use this pedal mainly for the &#34;church&#34; setting in ambient volume swells. It has seven different reverbs you can choose from (including reverse). So it will definitely suit your needs for whatever you require reverb for. It is ruggedly built and digital, which some will like and others won't. I like it. That said, I have taken a liking to other digitech pedals as well. They sound good and are affordable.", "id": 185}, {"review": "The digitech main squeeze is an okay compression pedal. Do I use it? yes. However, I would likely trade it for an MXR or DUNLOP if I had the opportunity. It doesn't sound bad per se' but does have some hiss to it. It also boosts your signal (a noticeable volume increase). While some may like this, I want my compressor to be a little more subtle and just provide some added sustain.", "id": 186}, {"review": "I own a one spot but ran out of plugs for all my pedals. This product allowed me to lengthen my cord and provide the added power supply that I needed. No tone loss at all. Great to have an extension rather than having to get another power supply!!!", "id": 192}, {"review": "These are great strings for such a \"rare\" instrument. Not many people play the baritone yuke - it has a unique quality to it, sort of like a miniature classical guitar. These strings sound full and warm on the instrument.", "id": 203}, {"review": "I use these patch cables on my pedal board and they save valuable space. They work well and I haven't had any problems with any of them shorting out or making static or other noises. I highly recommend them. Plus, they look nice, unlike the various colors that come with the bulkier, cheaper 1' cords.", "id": 207}, {"review": "The Alpha is a great little interface. It accepts 2 inputs with 2 outputs going into your computer. It's powered via the USB. The &#34;mix&#34; knob is a nice feature, allowing you to hear your input more or less prominently within the playback mix without affecting the input to the DAW. I'm using cakewalk's Music Creator 6 Touch so I didn't bother to load the LE software it came with. I like cakewalk's software better anyways (just my preference). Some reviewers have commented on hearing a hiss from the unit while recording. I haven't had a problem with this. It is extremely silent save any noise I would generate anyway from my rig. All in all I feel this is a great product and definitely worth the money.", "id": 364}, {"review": "My son and daughter love playing with this mic and stand. It comes with a cord that has a standard 1/4 inch end. I plugged it into a small guitar amp. They use it mainly to sing along with their cds/mp3's. Note that this is not really a mic I would use in my studio - it is more of a toy to be honest, but a quality toy for a young child. In that regard I give it five stars.", "id": 422}, {"review": "I take a medication that makes my hands shake; therefore, I have a difficult time with fine muscle movements. I switched from Dunlop Jazz III's, which I loved, to these puppies because they have a great feel to them and you don't have to worry about dropping them. They are also bigger than the Jazz III's, making it a bit easier to hold on to.", "id": 503}, {"review": "I've used Dunlop Jazz III's for years but always had a problem when it came to a song that required a lot of strumming. The DAVA changes that for me. Not only does it allow for accurate picking, but it also allows you to strum when needed - just roll your thumb back a little (works great). I've been using this pick for about 2 months now and have not gone back to any of my other picks. A definite 5 star for being my favorite new pick!!! You won't be dissapointed!!!", "id": 580}, {"review": "First of all this strap looks super cool. The Hootenany style is sweeeet! I have this on a cream colored strat(like) guitar and it looks great. The reason for only four stars is that the material is a bit thin, but hey, for this price I am not expecting a Levy's strap. All in all this is a great guitar strap. Throw some strap locks on it and away you go!!!", "id": 657}, {"review": "The ZT Lunchbox is some sort of new technology that allows LOUD and GOOD sounding tone to come through a box the literal size of a lunchbox! I was amazed at how small the amp was when I first purchased it - tiny. Then I was amazed at how LOUD it could be and still have clean headroom. Others have reviewed and written about a hissing sound, but I have not had a problem with that. After trying it with 3 guitars (1 passive p/u's, 1 active p/u's, and 1 acoustic electric) it remains nice and quiet. I have been using it as a practice amp as well as in a band setting.Now here's the thing... it does NOT have a lot of bass frequency to it, but I noticed that setting it on the floor does help some, but still not enough if you're looking for that heavy metal \"scooped\" sound. So, I would not recommend it for you metal heads out there; however, for all you jazzers and rockers, the tone knob makes a big difference. I keep my tone at about a 9o'clock setting because I prefer a little darker sound and it has enough mids to cut through the mix nicely still.Bottom line... I would recommend this amp (obviously I gave it 5 stars). I don't think you will be dissappointed.", "id": 685}, {"review": "There are a TON of reviews here, and I don't have a lot to add. You can read about what this tuner does and does not do in the specs section or from other reviewers who tend to review specs instead of how they like or dislike something. Bottom line, this is my favorite headstock tuner. I also own the new NS mini and it has its own qualities that I like as well (like being small), but it doesn't fit on my Godin's headstock. This tuner, the SNARK, fits on my Godin's small headstock with no problems. On a dark stage this works great. I love this little tuner. five stars.", "id": 706}, {"review": "I purchased this pedal recently, a bit skeptical with such a low price tag; however, I was completely impressed with it. I don't use a tremolo effect often, but when I do I just need some subtle, shimmering swells. This box does the trick. Construction wise it is housed in an all metal chasis. The knobs feel sturdy enough and the button seems strong - by the way, it is true bypass which is nice. It doesn't seem to affect my tone when I kick it on, no volume or tone changes, just the tremolo effect. And, silly enough, the yellow paint looks cool on my pedal board. I don't know if I will purchase other joyo effects, but I am impressed with this one. 5 stars.", "id": 758}, {"review": "This little tuner is sweet! I put it on my strat-style guitar and it works brilliantly. Agree with another reviewer in that it would probably not work well on my Les Paul or Acoustics, but for the 6-in line guitars it's perfect. It is very precise and accurate, leading you to perfect tuning every use. I totally recommend this product - you won't be dissappointed.", "id": 785}, {"review": "This is a simple and cheap way to hook your pedals together on your board. I have bought 2 packs of these and have only had one go bad on me. note that they are cheap and are NOT the quality of, say, George L's cables. That being said, they also don't cost $70. Can I hear a tonal difference between these cords and my more expensive ones??? Not really. People who say they hear tonal loss with some cords are scrutinizing the imagined auditory experience. Why only four stars??? because I wish they were all one color and not a rainbow of colors. it does look dorky on your board to have a bunch of different colored cords. but, that's my opinion.", "id": 805}, {"review": "These strings have a snappier feel and a louder volume (amplified) than regular nickel / steel strings. Cobalt is a different material for making strings and is supposed to have a higher output and a longer life. I recently ordered the new M-Steels from Ernie Ball to try them out as they are supposed to have even more Cobalt for even better output. I use P90 single coils on my Godin LG and these strings sound great. They have a nice feel to them and I can bend the heck out of them. No breaking. No problems with slipping and tuning. I'm hoping the M-Steels will be even better, but if not, these are a vast improvement over the regular strings that I was using, which were Ernie Ball's regular slinky's, made from Nickel.", "id": 825}, {"review": "NS (Ned Steinburger) Capo is different than your traditional Kyser style capo. I really like how it is designed, where it conforms to the neck nicely and feels more a part of the guitar than other capos I have used. It boasts minimal string bending across the frets, where it will stay in tune better up and down the neck. I tried this out and, sure enough, their claim was true. I capo'ed from the 1st fret up to the 10th (where I would actually never use it) and tuning stayed pretty much accurate. There is also a nice slot in the capo to put an extra pick in, just in case you drop the one in your hand. Overall, this is a great product and I give it a high recommendation and five stars.", "id": 843}, {"review": "The Flashback x4 is an awesome sounding and flexible Delay pedal. I got this through a third party seller on Amazon for under $200 new... a steal in my opinion. Having three settings is awesome since I will use them all in a set. Having the tap tempo is a must and this one works perfectly. The toneprints are cool to choose from if you find something you enjoy on the website. It's simple to use my Galaxy to &#34;beam&#34; the toneprint into the pedal from the pickups - very cool technology, makes me feel like I'm on a guitar version of star trek. I can't say that I have a favorite delay type since they all sound so great. I am partial to the 2290 with modulation - very clean and very cool sounding without having too much chorus. The space setting is also very cool and has a hint of tremelo in the background, which coincides with the delay time - sounds great with a little overdrive added in.All in all, this is a great pedal and a purchase that I am totally happy with. It is by far the best delay pedal I have ever owned as well as being the most versatile. Five Stars from me!!!", "id": 856}, {"review": "The Tascam DP-008EX is great!!! I love this little box! It's got a lot of features packed into a small unit about half the size of your average laptop. Here are a few of the features that I really like about it...1. It's portable and runs on 4AA batteries.2. It has compression, exciter & de-esser as well as EQ and Reverb.3. It has a mastering section with effects.4. You can record 8 tracks and then bounce them to free up more tracks.5. It feels sturdy (not that I would drop it)....just to name a few.  I compared this against the Fostex MR8mkII, which I also own and like. The Tascam has more features for the buck, as well it should as it just came out this year and the Fostex has been around a while. As another reviewer put it, this won't replace your DAW. I can record some very polished songs on my laptop, but the Tascam does come close. The mics in the front are a great feature and sound pretty good too. I have recorded a few songs on this already and found it to be a very enjoyable experience. The portability factor is huge in my opinion. Being able to take it downstairs when the kids are upstairs, or vice versa, is great. Plus it's fun to record vocals in the bathroom and kitchen areas.I totally recommend this for any songwriter who wants a nice scratchpad to put down ideas in a quick and creative manner... and then polish them up a bit in the mastering section. FIVE STARS!!!", "id": 873}, {"review": "The TASCAM TH-2000 headphones are like putting a pair of studio monitors on your ears! They are great! Excellent bass response (not muddy at all), tight mids, and clear highs. To boot, they are extremely comfortable as well. The foam fits nicely around your ears, conforming to the contours of your face. They are adjustable, so if you have a huge head you can still wear these. The only drawback that I can see, and I don't really even consider this a negative, is the coiled cord. Some people may not like that. All in all these are great headphones - I have listened to all varieties of music with them, monitored recordings with them, etc... excellent! By the way, they also are pretty good at cancelling extraneous noise in the background, making the music come out clearer. Kudos to Tascam for making such good headphones!May 12, 2014 UPDATE ------These headphones quit working after just a few months of working properly. I have a couple pair of inexpensive behringers that have lasted through more abuse and are still working. What a disappointment!!!", "id": 888}, {"review": "I am a fan of Planet Waves NS capos, but this new one is not very well designed. The way it sits on the guitar is sort of backwards. I find my left hand hitting the lever when I'm in open position. Frustrating. It does have a pick holder, which can be handy, and a place to put an NS tuner, which can also be handy. I just think it could have been better designed. I don't particularly care for this capo and will likely not use it for much stuff. I'll stick to my other NS Planet Waves capo or my old faithful Kyser.", "id": 894}, {"review": "The apogee Jam works great and it sounds great. The operation is very simple: you plug in your guitar and plug in to your Mac or ios device. I have mine hooked up to my MacBook, running Garage Band. If there is any latency I can't hear it. It works beautifully. Apogee is known for making good music products and this Jam is no exception. I was able to plug in a microphone (line level) into this as well and record my vocals. Likewise, it worked well with my 4-string bass as well. I was able to record a whole song in no time. For a simple audio interface, this is affordable and dependable.", "id": 895}, {"review": "I've used Elixirs for about five years now. This set offers the same great sound for my acoustic as their electric strings provide for my electric. Some people don't like the polymer (nanoweb) that coats the string, but I find that it cuts back on string noise. Sliding your fingers around doesn't cause too much noise, and with acoustic strings I find that very important, especially if you're using a piezo pickup in your instrument. Phosphor Bronze has always been a great alloy for acoustic guitars IMHO. These are great strings, worth the money, and sound great. They also last 3 times longer than regular, non-coated strings in my experience (been playing for 24yrs). Great product.", "id": 899}, {"review": "I have used D'Addario strings for years on my Gibson Les Paul and they sound GREAT. Had a stint where I tried coated strings on the Paul but they just didn't have the ringing bright tone that D'Addarios have. I've never been one to have strings break on me that often, guess I just don't play that heavy-handed, but I have many friends who do and who still use these and find them very reliable. They are comparible in tone to Dean Markely's and Slinky's IMHO. I very much recommend these strings to anyone who plays electric guitar of all styles - I have used them on rock, country, jazz, fusion and christian contemporary gigs. Very dependable. The set usually lasts me a couple of shows before I change them out - like any string they will lose brightness after a couple of gigs. Strings claiming to last longer than that in tone are, in my opinion, usually somewhat lifeless to begin with. Anyway... these are great threads for the ole geetar - if you have never used them you should try them out... good stuff.", "id": 156}, {"review": "Schaller strap locks keep your guitar in place. They have been around a long time and hold up well with time. I also have used dunlops, which are nice as well, but these seem to be the better product IMHO.", "id": 278}, {"review": "Simple review here...Good Strings help create Good Sound!!!These are nice strings and on a quality instrument stay in tune well. They are not overly bright nor dark but rather have a nice \"round\" sound to them. Highly recommend.", "id": 500}, {"review": "We got this for my young son who enjoys reading in his bed prior to going to sleep at night. He really likes this light and it is bright enough for him to read by, but not too bright that it hurts his eyes. A good buy. I could see where this could be useful in other applications, like on a music stand, but it also makes a great reading lamp attached to a bed.", "id": 827}, {"review": "I am a \"newbie\" to the world of playing the blues harp; however, I am not a beginner to music. I have played guitar fervently for the past 22 years, so I knew a little something when I thought I would try to learn the harmonica. Technique is of utmost importance and I found learning how to pucker and tongue block on this instrument was effortless. It sounds, for the most part, in tune and its tone is great. My kids love to hear me play it! However, there is 1 \"con\" to this wonderful instrument. After owning it for several days, the DRAW 2 hole went flat. I researched this and found that poor technique would likely be the culprit... so I worked on my technique some more. To my dismay, the one note on the harmonica that allows you to bend into 2 other tones, and is considered the \"sweet spot\" of the instrument, did not work right. Obviously you cannot take it back to the seller - it's not really his/her fault. I am not sure how to repair it, but I feel that I should have to do so this early in the game. Maybe it's my naivete' in hoping for a perfect instrument. So, I took one star away because of this problematic issue. Otherwise, I really like this harmonica.", "id": 828}, {"review": "I've used D'Addario strings for a long time (been playing 20+yrs) and have always been satisfied with their tone. The balanced tension brings a new element to the game of guitar in that these are suppossed to be mathmatically matched to have the perfect degree of tension. Do I fully understand how this works... nope, but they sure do sound good. Their feel is a little more \"snappy\" than regular XL's in my opinion and they have nice clarity as well. Their sound is bright, just like their XL cousins. I think it's more of a \"feel\" thing than a sound thing with these balanced tensioned strings. Now if they could just disect the dna of my guitars and match the tension of the strings with my instruments...All in all a great product that I recommend to any electric guitarist.", "id": 868}]