[{"review": "Hosa, has good cables. I use them between my guitar effects pedals and then a 5 footer from effects to the amp. Had them over two months a they work great.", "id": 207}, {"review": "Hands down the best cable I have ever owned. I was spending money on cheaper cables continuously and now I spend that money on other stuff. I play one to five hours a day and have used this same cable for 3 or 4 months. Well worth the money. Lifetime guarantee to boot. Definitely will buy Mogami from now on.", "id": 493}, {"review": "For a Fender guitar bullets are the best choice for tone and longevity of strings. They seat snug and enhances sustain. Quality can be found behind the Fender name.", "id": 667}, {"review": "I use this 5 footer between my guitar pedals and amp. I do move it around plug and unplug it often and after two months of daily use it works as well as it did when it was brand new. I was initially concerned when I first received the cable that it would not last. The cable is not as fat as I had hoped, however the ends are solid and sturdily built. I usually use Mogami Gold cables and do so because budget cables are crap and only last a month or so, if that long.  This Hosa Cable is a very good cable and I even chose to use Hosa jumper cables between my over drives and effects pedals. They last.", "id": 419}, {"review": "I recently received my multi plug cable (daisy chain) for use with my guitar pedals and I am very pleased with one spots, product. I can tell it is a built to last cable with eight plugs spaced out enough to allow me to put my pedals where I like them. It plugged into my Behringer 9 volt power adapter nicely. Its so nice to not to have to replace 9 volt batteries every week. A real money saver in the long run. Buy this cable.", "id": 486}, {"review": "This Behringer box is a very good tool, effect I would recommend to anyone from beginner to pro. One thing should be noted the light is amber not blue and no 9 volt battery is required. The device comes with a removable power cord, which  to me is a big plus.", "id": 608}]