[{"review": "I'm not sure what else to say. The picks work well and they don't wear out easily. I like these because they have a nice grip and when my fingers get sweaty they don't slide out.", "id": 64}, {"review": "These mics are great. I wasn't sure what they would be like but I would buy them all again. They are cheap enough to replace and they sound great. We Shure mics and they needed repaired all the time. These have a bigger sound pick up area and they have not had any problems at all.", "id": 405}, {"review": "I purchased the plastic and it worked fine but the notes were not as distinguished as the TUSQ. I did have to sand to make it fit. That may sound badm but I am glad because it's better than too small. I did not purchase this from amazon but sweetwater in case you were wondering.", "id": 415}, {"review": "I searched on Amazon for a banjo strap and this came up. When I received the strap I realized it doesn't fit a banjo. I then looked at the description closely and found it says it's a guitar strap. Just to let you know, this is not a banjo strap  :)  I was able use it anyway on my guitar. It's not the best strap in the world, but it's not bad. I gave it four stars for that reason. I think it would wear quickly with lots of use.", "id": 657}, {"review": "It's not that great. You go through batteries like crazy and it doesn't work at all for bass. It's fine for guitar or banjo", "id": 762}, {"review": "These Martin strings (M170) aren't bad. They just are not the sound I was looking for. I ended up like the Ernie Ball Earthwood extra light instead. The Martin's are little shallow on the low end unlike the Ernie Ball. Other people will love them though. They are easy to play.", "id": 27}, {"review": "My guitar originally came with D'Addrio exp and they sounded good. I replaced them with Elixir nanoweb coated strings and they also sounded good, but the finish was wearing fast. This time I got a 3 pack of EJ16-3d light. The were easy to put on and have held up well other than tarnishing quickly.But the sound is the problem. It's terrible. They sound very muddy. Crisp tone distinction is just not there. I thought light would be the better route, but now I'm not sure. I purchased some others to try. Also, since a purchased a 3 pack. I may just change the strings completely again to see If I just have some dead strings.", "id": 198}]