[{"review": "Let me say this is a a great cable in every aspect.First, it works extremely well.  No popping or clicking at all.  Very flexible but solid feel to it.  It looks better in person than in the pic too.  And with the lifetime guarantee, you really can't go wrong here.", "id": 586}, {"review": "I have been playing for over three decades, and it has been a while since I have owned an electric guitar.  I bought this amp along with a Epi Les Paul 100.  All I can say is wow!  This is a great combination.This amp has almost an unlimited number of tones and effects.  Well built and looks even better in person than the picture.  Plenty of power as well.  Better than anything including the stage quality amps like Marshals from back in the day.  A great practice amp, but good enough you could use it for a small gig.  Going to pick up the optional foot switch.If you buy you won't be disappointed.", "id": 718}, {"review": "I have been playing guitar since I was 6 years old (over 3 decades) and I must say this was a very pleasant surprise.  I haven't had an electric in years, and didn't have the budget to get a Gibson, so picked up this Epi Les Paul 100 instead, along with a Fender Mustang I Amp.  Great combination.  This guitar has a very sloid feel, and came set-up perfectly right out of the box.  All it needed was tuning.  Unlike others, I didn't feel that the strings I got needed to be changed right away, but probably within the first two weeks you will want to change them.  Replaced mine with Ernie Ball \"Not Even Slinky's\" and couldn't be happier with the way this thing plays and sounds.  Great sustain, beautiful harmonics, the clean tones are warm, can get nice blues tones out of it, and superb thrash metal too.  Very versatile.  It does not quiet do country or jazz, but it wasn't really meant to.The action is extremely easy, fret board has a great feel to it, good width on the neck, not too slinder but not too thick.  It just feels good in your hands.The finish on this product is very nice.  One thing though, the pick guard is kind of a tan / cream off white color, not bright white as pictured, but it still looks great.Also, not mentioned in the description, but this does come with a 12 foot cord, but it's not the best quality.  Would recommend picking up a new one when you order.Overall, this is well worth the $500 that they list as the MSRP.  At less than half that its a steal.If you are considering this instrument, don't hesitate.", "id": 30}, {"review": "I have used Ernie Ball strings for along time.  Mostly slinky's or super slinky's.  I read the review on these and thought I would give these a try for the sound they make paired with a LP.I bought these to replace the stockers on the EPI LP 100 I just bought.  Luckily I order two packs.  I was putting on the top E string and had turned the crank less than a few times, not near enough tension on the string yet to even be in tune yet, and \"pop\" it broke. I had ordered two sets, so I put on the one from the new set. No problems until I got to the G string, then \"pop\" another breaker. Very sad quality.After finally getting them on and in tune (you will need to stretch the top 3 strings alot to get them to stay in tune, especially the E) I have to say they have a great sound to them.  Nice tone and sustain.  Great crucnhy sound for metal, but still a good clean tone too.  These are thick strings, but still bendable, just not very far.  I would rate the sound 5 stars.Unfortunately, it takes two packs of strings for one successful stringing to occur because of how brittle the strings are.  So I have to give these three stars overall.", "id": 97}, {"review": "This strap is very thick and heavy, which give you a good secure feeling.  The heavy leather ends are difficult to get the buttons on the guitar through, but your know that they are not going to slip back out.The picture does not do it justice. I paired it with my black EPI LP and it looks phenomenal. I am very impressed with how nice this strap is.", "id": 286}]