[{"review": "There is no way any kind of rig is complete without at least one of these.  I have several.  Came in perfect working condition.  Great Buy.", "id": 187}, {"review": "I love these patch cables.  They can be serviced if need be, but mine have never needed it.  I've ordered about 3 batches of these guys and I would order them again in the instance that my already excessive pedalboard where to become more complex.  The length of the cable presents limitations that should be expected, and the bulb on the ends may be an issue in tight squeezes.  However there are many cables of much lesser value, which are unserviceable in the event of a breakdown.", "id": 207}, {"review": "I love this product.  this will power many pedals with low milliamperage ratings.  No need for expensive large pedalboard power adapters.  For a modest rig, or on the road use, I recommend this product.", "id": 428}, {"review": "Product arrived in exactly condition as described by the seller.  This unit allows for great sweeping of frequencies.  the 15 dB pull in each direction for each of the seven bands are filter worthy,  My only dissatisfaction lies in the amount of noise this unit adds to my chain when engaged.  When inactive this unit is transparent, no tone suckage.  When this unit is engaged, each frequency band carves the sounds nicely however, consideration to have this unit modified to reduce its noisy output has begun for me at least.  I am thankful for the internet and the opportunities it presents for me to MOD this Pedal.", "id": 433}, {"review": "I love the sound of this pedal.  It's as versatile as can be.  If you want to sound like 5 Dimebag Darrels, then don't buy this pedal.  If you want a nice drive that is responsive, this is for you.  I employ this pedal more than my boss distortions and my electro harmonix distortions/overdrives.  I have noticed the on off light is intermittent, but the pedal still effects the signal either way.  For a pedal that I have stomped on so many times, I'm not even the least bit concerned.  For an inexpensive unit, this thing rules.", "id": 798}, {"review": "I use this pedal in tandem with my APC-40 and map the buttons to various controls in Ableton.  The foot switch opens the door to more organic sound live performances with a prepared track.  The polarity switches are nice, however the momentary/latch switches are what makes this unit so compatible with my DAW. Some functions such as play and stop are momentary functions, other functions such as track on/off are toggle/latch functions.  Without a foot switch that can toggle between the two, applications are limited certain functions.  I use the footswitch for a variety of applications, in a variety of songs with different arrangements.  If I could hook up more than one of these to my controller, I'd have about four of them, but the one is so nice on its own.", "id": 412}]