[{"review": "This was an impulse buy.  After playing the guitar for many years I thought a ukulele would be a fun addition, and I was right.  This one proved that you don't have to spend big bucks for a nice instrument.  It has a great sound, appears to be good quality and well made, all for a very reasonable price. At first it didn't seem to stay in tune for more than a day, I decided that it was likely due to new strings as it seemed to improve after a few months.  If your a beginner and am looking for good quality without spending a lot, this is a nice instrument.", "id": 536}, {"review": "I purchased the H4n after being unhappy with the H2's performance most significant where I couldn't record a good sounding signal that wasn't distorted with the Line In jack.  Only to find that the H4n has the same problem but not as bad.  If I try to record a line level signal from a sound board or stereo receiver and connect to the H4n's 1/4 inch jacks, it is almost impossible to not to have a distorted signal.  It appears that on both models the line in preamp is too sensitive and clips very easily and because it is clipping in the preamp, adjusting the gain doesn't correct it.  I contacted Zoom's tech support about the H2 and was told that I likely had a defective unit.  I returned the H2 and decided to give Zoom another chance and try the H4n after seeing many positive reviews.I really like the H4n's design, the menus and controls are nicely organized.  It feels more sturdy than the H2.  The recording quality using the built in mics is excellent.  Most other recorders in this price range don't have XLR inputs.  Since I plan to use it mostly for recording concerts by connecting to a line out or tape out on a sound board, if the line in jacks don't work properly and can't accept a normal line level signal without clipping, I can't use this for what I bought it for.  I have used my Sony minidisc recorder for the same type of application for the past 8 years and have never had any problems.  I've worked with pro sound equipment for over 25 years and have used many types of recorders and so far the Zoom products are the only ones where I have encountered this problem.  If you are using this to record with mics, it works great, but if you need to record from line level sources, the Zoom recorders may not be a good choice.  I exchanged this for the Tascam DR-07 and while the Tascam doesn't have as many bells and whistles, It is a nice recorder and I'm very happy with it.", "id": 581}, {"review": "I purchased this to use with my old Yamaha acoustic guitar and my ukelele.  It works great on both, very accurate and easy to use.  The swiveling head works very nicely and makes it easy to see at any angle.  It appears sturdy, and the clamp appears soft enough not to scratch your instrument. I haven't used other tuners of this type, but this one works great and seems like a great value for the price.", "id": 707}, {"review": "I purchased this after reading many favorable reviews online and it seemed like a good unit for the price. After trying to use it I promptly returned it. I do sound for concerts and wanted a recorder to connect to the sound board to record shows.  I have used a minidisc recorder to do this but wanted something that would easily inferface with my computer.  I tried recording on the H2 using it's line in jack and recording from a line out or tape out my Mackie sound board or my stereo receiver.  No matter how I set the levels the recording on the H2 was very distorted.  I played with the record levels and the AGC and limiter functions and tried recording from several different audio sources and always got a very distorted signal.  I have used my minidisc for the same application for many years and have never had a problem and have always got very clean, good quality sound.  The problem with my H2 was that the gain on the mic and line inputs appear to be the same and are meant for a mic level signal, which caused any line level signal to overdrive the preamp. Recording from the internal mics seems to work fine.  I have worked with professional sound equipment for over 25 years and the Zoom recorders are the only brand where I have found this problem.The H2 has a nice menu set up and the instructions are very easy to follow but if you want good line level recordings, look for something else.  I exchanged this model for an H4n and it had the same problem recording a line level signal, but not as bad as the H2.  I finally ended up getting the Tascam DR-07 which I am very happy with.  It has a few less bells and whistles but appears to overall be a better quality recorder.", "id": 463}, {"review": "If you are looking for a good quality inexpensive case, this is a very good choice.  It has a durable feel to it. It has a handle and a removable strap as well as a zippered slot on the outside for accessories.  It works very well.", "id": 593}]