[{"review": "I was using the standard version of these, I saw these at Amazon and figured I'd give them a try.These cables are a little more stiff than the standard cables I was using however the ends seem much more well belt.Doesn't make a difference in the sound? I don't know but I am satisfied with this purchase.", "id": 195}, {"review": "This is a quality product.Super fast SHIIPING  through Amazon as always.The product is well built easy  to use pretty straightforward.It's perfect for my Samson mic.", "id": 393}, {"review": "Just recently a few months back got my first tube amp, wanted a good analog delay pedal to go with it I found that the digital delay pedals left something to be desired at least for my ears.After a lot of research and reading reviews I decided to give this Pedal a try.All I can say is wow!It has excellent sound quality ,very low noise while off it is transparent in your petal chain.The settings are outstanding, you will not be disappointed very well-made.", "id": 507}, {"review": "This makes changing strings of breeze I was using a hand winder for many years.Unit takes four AA batteries but is very powerful also has a lock on it so it won't accidentally be put into a drawer and engaged.Looks to be quality made just what the doctor ordered.", "id": 522}, {"review": "This Mike is an awesome value you could pay twice or three times more and the frequency response is excellent service was super fast I would've no problem buying from these folks again in the future", "id": 594}, {"review": "To start off with the unit is all metal construction and built like a tank, it is very easy to set up and use the controls are self-explanatory.You can get a wide variety of coarse effects from this unit from the very subtle to the crazy overdriven David Gilmour sound.One distinct feature this pedal has that sets it apart from the rest is you can actually use base and trouble cut off controls to tailor the sound to make it sound less tinny  and more full.Overall for the money this is a fantastic value well-built and has outstanding sound get it you won't be disappointed!", "id": 767}, {"review": "I recently got myself a Kenny Wayne Shepherd Stratocaster guitar, I decided that since the guitar he had a set of tens strings installed I would go with these.They work flawlessly.The qualities excellent cannot go wrong with Ernie Ball strings no matter what gauge you get.", "id": 812}, {"review": "I had previously owned it Digitech jam man, I also try the boss.After seeing demos of this item on YouTube I decided  I'll give it a try, I can always return it if I didn't like it.The unit is extremely small but don't let that fool you. This unit is a high-quality all metal construction it has simple easy operation and it works flawlessly. You get up to five minutes to record a loop for loops and you can get an infinite number of overdubs. Let's be serious how many people really Loop for over five minutes?The unit is transparent when turned off I would highly recommend this Looper it's well worth the money.", "id": 869}]