[{"review": "I had fairly low expectation for a ~$25 pedal, but many people said it sounded very close, if not better, than a vintage Boss VB-2. Considering I didn't want to spend 20x this pedal, I can't compare the 2 but can say it works very well. It can do subtle low-rate, low-depth to fast shimmers to ridiculous warbles. The rise knob seems to act as a reverse level control, or at least turning it up weakens the effect (which I guess is good, I might swap around the leads). Finally, a non-blue LED is used, which means it won't blind you when you try to adjust the settings.Being $25 however, the plastic case is noticeably cheaper quality and looking compared to even Behringer's $50 pedal, and the hinge is a little less stable. It will still hold up with moderate use. However, it could wear out if you plan on heavily using the latch feature (which is a momentary mode).", "id": 429}, {"review": "The reason I bought this pedal was for the &#34;Space&#34; setting, which is essentially a shimmering organ, octave up effect. On the shortest time it is still slightly off with tracking, and it can get crowded with chords, but it does sound ethereal and choir-y.Features:Time controls the delay time between the dry and wet signals, decay controls the length of the reverberations, tone controls the color of the reverb, and mix controls the level of wet to dry (it can basically cut all the dry signal if desired).The trails feature can hold a reverb sound until it decays even with the switch off; however, if your mix is set to max wet signal, no sound will come through if enable and the pedal is off. I haven't really been able to use it effectively, so I just leave trails off.Dual ins and outs are useful for plugging in another instrument.Sounds:The classic reverb sounds (spring, plate, room, chamber) aren't very distinct from one another. The hall setting is bit more expansive; the ducking is nice for a continual shift from note to note, removing excess reverb for the latest notes/chords played. The cave and tile are a bit different timbre than the other reverb sounds; and the echo setting acts like a short regular digital delay.Cons:*The blue led is VERY bright, as on all Behringer pedals; I just cover it up with a sticker, and it still shows through.*the foot switch is digital, so it doesn't preserve state, and doesn't have the best assuring &#34;click&#34;*because it is buffered bypass, the effect will continue to draw power from a battery if a cable is plugged into it, even when off*the battery is difficult to get to because you have to press in on both sides of the switch, and then lift upAlso, almost 50% of the pedals weight is the bottom metal plate, which can be removed, but that makes the pedal almost toy-like in weight.", "id": 508}, {"review": "Pros:I bought this pedal primarily in place of a volume pedal, or swell pedal, because it does that function fairly well, and a lot cheaper. Aside from that, it also does nearly every other type of delay needed:*the tape/digital/analog switch slightly changes the sound of each delay*the trails feature can be useful for holding a sound (in swell mode with high repeats) when the pedal is &#34;off&#34; and then playing over it with notes or harmony*the time knob acts like an analog knob, pitch shifting when turned after playing a note*the repeats knob can go from a little more than one repeat to self oscillation (sometimes runaway) depending on the delay type*the mix knob can nearly cut out the dry signal*stereo input allows for multiple instruments to play into itWhile the pedal has small problems, it compensates by inexpensive fixesCons:The modulation is a kind of adjustable width/depth all in one knob, and isn't the best compared to a chorus pedal. Just a general warbleThe blue led is VERY bright, to the point where you can't see the settings on the knobs, so I cover it with a sticker (it still shows through enough haha)*The casing is plastic, but it is thick and durable enough (maybe not for consistent gigging)*being a digital effect, the footswitch is not state dependent, in other words, if you turn off the pedal, unplug it, and plug it back in, the pedal will turn on*because it is buffered bypass, the effect will continue to draw power from a battery if a cable is plugged into it, even when off*the battery is difficult to get to because you have to press in on both sides of the switch, and then lift up*there is no noticeable &#34;click&#34; when you change delay type; however, the led flashesOther notes:almost half the weight of the pedal is the bottom metal plate. The pedal without it feels shockingly lightweight, but with it has a good amount of heft.", "id": 509}, {"review": "So i decided to amplify my Martin Dreadnaught (a really, really nice acoustic guitar). I didn't want to spend a lot if it just wouldn't sound good with a pickup, and saw this had consistently good ratings. I can't speak for other acoustic pickups, but this far exceeded my expectations, and I don't plan on buying a more expensive piezo, or soundhole pickup.ATTACHING ITUnfortunately the narrow portion of the barrel is not long enough to fit through the end/tail block; and I didn't want to drill a new hole in my not-so-cheap guitar just to test out a relatively cheap pickup.So I attached the pickup in the regular position inside the body behind the bridge, and just ran the cable out from the sound hole. The jack is held onto the pickguard with some scotch outdoor mounting tape (which is kind of like really strong gum, it can be removed without leaving sticky residue); which holds it in place well enough to plug in a cable and move around as long as I don't jerk the guitar quickly.SOUND QUALITYI plugged it into my cheap, regular guitar amp, and whoa! The package mentions two locations you can place the pickup, and because I needed to run it through the sound hole, I could only place it where more treble is picked up. So I have to compensate on my amp by turning down the treble to 7 or lowerBecause the pickup is a transducer, no electrical feedback/interference is picked up, so the sound will be very clear and crisp. It would probably sound even better on an amp with better electric shielding; the only noise I get even at max gain, max input volume, is from the amp itself, heard with every instrument I plug into it if I turn the master volume up too high.Another thing to consider is that transducers pickup vibrations, so it won't pick up sound when placed a millimeter away from the guitar body, but will when touching it. So with that in mind, the pickup will strongly output every sound you make to the guitar body; like it brushing up against your body, a zipper hitting the guitar, your fingers sliding on the strings etc.", "id": 611}, {"review": "I don't know if it lives up to all the hype and mystical powers of the all-mighty vintage tube screamers of Ibanez, but it is an exact clone including the same component values, potentiometers, ICs (JRC), etc.For proof that it is exactly the same, I was able to modify it for different frequency response (corner frequency), and add asymmetrical clipping with the exact same components in exactly the same spot in the circuit as seen in TS9 mods. Of course the board is layed out a little differently.The only reason I gave it 4 (really 4.5) stars was because it does produce some noticeable noise (hiss) at higher gains, but this is expected given the boosting stage acts like a high pass filter (this gives it the characteristic mid-range boost). It can be cut with the tone control, but it also may have been due to a poorly shielded amplifier, and or a one-spot power adapter.", "id": 728}, {"review": "This pedal has a great range of function (with variable width and depth) along with an independent level control, and tone controls for low and high frequency cutoffs. It also has a dry through output.It can go from low depth high speed shimmers, to high depth, low speed oscillations, to ridiculous warble.The pedal is light weight, very high quality, durable, quite good looking, and all around a good pedal to play around with.Cons: The blue led, like many blue leds, is VERY bright; I usually cover them up with a sticker so I can see the setting on the pedal.It can also be easy to accidentally touch the pedal casing with the positive barrel of when plugging in (this can frighteningly spark). So make sure to plug in the power adapted into the pedal before plugging in the wall.", "id": 767}, {"review": "Joyo continues to surprise me. This thing is all metal, looks very sleek, is true bypass, and all around works well.The individual bands actually light up, which is pretty cool.The only reason I didn't give it 5 stars was they forgot to drill a hole for the power indicator led left of the footswitch. You can see the led on nearly every other Joyo pedal for an idea of how it should look. However it doesn't even show up in the product picture on amazon. It wasn't a big deal, I just drilled a little 1/8&#34;ish hold and it fits through.", "id": 835}, {"review": "I bought these cable to use on a pedal board, and they don't disappoint. They're fairly flexible, have solid construction, and are different colors for easy identifying.", "id": 805}]