[{"review": "i been using these for over thirty years and they have always served me well.I like 11s because for me it has a nice balance between strong steady sounding power chords while the top end is slinky enough to play leads hence the Power Slinky name.", "id": 239}, {"review": "I wish there was a fine pivot/angle adjustment to orient harp to mouth. I feel I have to angle my head awkwardly to use harmonica no matter how I set it up. I have a big neck and a prominent jaw so the armature does not extend as far as I think I need it to - causing the position of harmonica angle to be awkward for me. for the angle to be right it would be in my mouth ( LOL ).This is the least expensive holder I could find Nov 2013. Since it was inexpensive comparatively I will use a vice and bend it to suit me if my grand nephews don't want it.Also not sure why they don't make these wider to accommodate a larger variety of Harmonicas as it has a very strong spring action holding harmonica in place, could easily hold a much larger and longer harmonica if designed to do so. a 5 star mechanism 4 star armature design.", "id": 354}, {"review": "Awe... it might have deserved 5 stars had it had a chance to prove itself. But I did buy another that I still have but it is still in it's original packaging as a back up for my other cords. Until i break it out and use it hard for 6 months I have nothing else to say here.", "id": 419}, {"review": "These tuners are so convienient and I have yet to see a musician I show these to who who doesn't appreciate it's simplicity.", "id": 706}, {"review": "I still love these things. I remember spending over $60 for a guitar tuner in the 80's and having to unplug from the amp to plug into the tuner to tune and then back to the amp with my guitar hanging round my neck. Now??? I just clip it and forget it till I need it and push it's little button. If I forget to turn it off it has an auto off feature if it detects no vibration for a while. A new batterry lasted me almost two years. My first tuner's battery it came with lasted over a year. Expect to pay $5 TO $6 for a replacement battery. My more recent Snarks are still running on original batteries.", "id": 724}, {"review": "-  This tuner is affordable and it works well. I have purchased six so far. They are sturdy. They have all come with a battery in the box you have to install yourself.-  I actually sat on one and thought I broke it, turned out the main tuner head pops right back on to the goose neck. The LED is bright in low light but does not display well in bright daylight. If the display starts to dim in the dark you need a new battery. The fairly large disk style battery cost me $9.80 for a two/pack at  Walgreens.-  We had a Birthday Jam at a friends house. I used this tuner for my guitar and ending up passing it around all night between three bass players and four guitarists. At the end of the night I gave it to the birthday boy as he had admired it all night.-  I gave one to my grand-nephews. I keep one on each my favorite acoustic and electric guitars. They stay on in their cases. I like the goose neck style but I have not tried the other no-neck swivel ones. I also have one for my Bass. It's a great musician's party favor.-  I always had trouble reading my old analog tuners in low light so I really like these tuners. Don't forget - Practice, Practice, Practice.", "id": 762}, {"review": "Let the testimony of my repeated purchases be your guide. the batterry that come with it lasts an average of 6 -9 months - A new battery will last over a year - I get replacements at local CVS - Savon store", "id": 820}, {"review": "It seems redundant to review again except to point out I have bought more and will buy more. I will have one for every instrument stored with and actually on each guitar inside it's case. I have given out 5 and kept 4 - I have 11 working guitars - I need 7 more Snarks.....  some have had their batteries run down in under a year - but I get close to 2 years off a new battery - ( Batteries are a bit costly)", "id": 821}]