[{"review": "I hesitate to write this review simply because it's pretty obvious nearly everyone else loves these strings. To be honest, I was very, very impressed with their feel and handling. I do think they're the best playing strings I've used when it comes to pure playability. Hands down, none better. They were butter-smooth and great for flat picking. But for me it was a trade-off, because I simply wasn't impressed with the tone. I even took the time to try them on three different guitars (all dreadnoughts): a classic maple sides/spruce top, a mahogany back/sides with spruce top, and a maple backs/sides with a nato top. On all three, I didn't like the tone as much as the strings I was using. I really wanted to like them, but they simply didn't have the tone of the medium gauge Martin SPs I normally use.This isn't to say they're not great strings that sound different on other peoples' guitars, but I simply didn't like them on mine. I love good projection with rich bass tones and ringing treble for the folk and traditional music I play in our jam group. The Elixirs just lacked the punchy high tones of the Martin strings I use, and the treble sounds tinny vs. the clear ring of the Martins I normally use. To be fair, the bass strings sound great, and aren't much different. I would have to say choose your strings carefully based upon how you're going to use them. I play in acoustic groups, and the Elixir strings just don't have what I need to be heard, in spite of how great they feel under your fingers. If playability is more important than great tonal range, then by all means buy these strings...you won't be disappointed. I'm guessing these would be fine on an acoustic electric, where the electronics could compensate for the weaker treble tones.", "id": 104}, {"review": "These strings aren't for everyone, and probably not what you want for everyday, normal playing. But if you're looking for a fast-playing string with a bright sound, this is the string. In addition to putting them on my guitar, I also have a six-string banjo (guitar tuning) and just couldn't get the sound I wanted from regular guitar strings. Light guage nickel strings were recommended to me, and they were exactly what I was looking for. They have a clear, bright sound that great for picking and strumming. I play a lot of bluegrass and Irish music, and I feel these strings are ideal for that purpose. I use a lot of D'Addario strings on my various instruments, and I think they offer the most bang-for-the-buck in terms of quality and tone. You can pay more, but I don't think you get that much more. Although these were intended for electric guitar, they also work well on resonator guitars.", "id": 156}, {"review": "Based upon some of the other reviews, I feel I got a different product, as it didn't fit the descriptions given by others. I ordered two of these, and both were very thin material, not sturdy at all. Second, both straps were not adjustable to 59&#34;. Both mine measured 45&#34; from strap button hole to strap button hole, fully-extended. They are useless to me, as my guitar, a dreadnought, covers the middle of my chest when I put it on. I believe I was given a substitute product, since when I ordered these straps, the price was just $1.00, and now they're back up to $4.95 as I write this. I'm really sick of these Amazon substitutions. For what I paid, I won't bother returning them...not worth the hassle. I will donate them to a local music teacher who has students with smaller guitars. Very disappointed. Warning...if you see a price drop below $4.95, don't buy...it's probably not the product that's described here.", "id": 208}, {"review": "It's definitely high-tech, but since I don't own a classic-looking or vintage mandolin, I don't really care about looks. My primary concerns are comfort and function, and this product gets five stars on both counts. I really like the fact that you can attach the contact points, and using the click-locks, remove the strap from the instrument while leaving the contact points in place. Also, if you get the strap twisted up while installing it, just undo the click-locks, take out the twist, and reattach it. Pure function! This strap was very well designed and thought-out before going to manufacture. Five stars!", "id": 352}, {"review": "I chose this for its good looks, but was pleased by its construction as well. A very well-made strap with great looks and a super price. My only complaint, which is very minor, is that I think the webbing could be thicker and have a more sturdy feel. It just feels lighter than I like, but that's a personal thing. I have no complaints about the construction, the looks or the price. I use mine on an Irish bouzouki, and it really looks great and works great. I don't like straps that have smooth liners that allow the strap to slide around. This cloth doesn't slide around, and that's a good thing.", "id": 353}, {"review": "I am extremely happy with this product. I own several shoulder rests, and this quickly became my favorite and stays on my favorite violin. I have no problem whatsoever keeping it on the violin as long as it's in the proper position. The adjustability is a key factor, and I can turn one side low and the other side higher for a highly customized fit. The padding is also excellent and comfortable. A top-quality product.", "id": 637}, {"review": "I have reviewed these strings before, and frankly, I wasn't all that impressed with the tone the first time around. I think they feel great on the fingertips and they're very playable, especially for a picker, but I just wasn't sold on the tone. To be fair, I only tested them on a few of my dreadnought guitars, and found them lacking. There seemed to be a drop-ff in tone when switching from my usual strings (Martin SPs) to these.So this time, I decided to try them on a much smaller guitar. I have a Yairi Alvarez AY-20, which is a 000 sized guitar, and they sound terrific. I'm no engineer or physicist, so I really can't explain the mechanics of it all, but they definitely sounded much better on a much smaller guitar body, and they produce a very clear, bright tone across the higher range, and hold their own on the low range.I still don't think they're the best thing since sliced bread, and I still think they're a bit overpriced, but I have no complaints about the quality other than the fact that the coating seems to wear off sooner than I would expect. This seems to have no effect on the tone, but for what these cost, you'd think the coating would last a lot longer than two months (I play daily for at least 30 minutes a day).Overall, these are good (but overpriced) strings that definitely work well on certain types of guitars. You'll just have to experiment to see which guitars sound good with them, and which don't. In my experience, large body guitars lose tone, but they sound great on a smaller body.", "id": 898}, {"review": "I have lots of friends who play these strings. Some love them more than any other string, and some are like me. They're clearly good strings, and I love the way they play and feel on my fingertips, but I can't get past the sound. It could just be about how the strings sound on my particular guitars, but in any case, I'm not happy with the sound and that's why I have a hard time giving them a solid five-star rating.I tried these on two separate guitars I play regularly, and wasn't terribly impressed with the sound on either. One is a vintage dreadnought mahogany guitar that normally has excellent tone, and is crisp, clear and fairly loud. These strings softened the tone, which I wasn't looking to do. They sound okay, but nowhere near as good as the Martin SPs I use to really bring out the best in that guitar.I also have a cutaway electric/acoustic I use to sing with because it's fairly quiet, and the softer tones don't drown out my voice. These strings made the guitar even more quiet, and there was a considerable drop-off in tone quality as well. They might have been cheap, old strings, because I couldn't tell that there was anything special about them. This particular guitar didn't have spectacular sound to begin with, and these strings did nothing to improve it. I like strings to either sound as good as other strings, or improve the tone and pull more from the guitar. These strings did neither for me. However, they sound just great when the instrument was plugged through an amp.Based upon my experimentation, I would guess that if you have a great sounding guitar and you're not a fanatic about slight drops in tonal quality, you'll love the way these strings feel and play. I rate them excellent in that category. But for me, tone is 80% of the equation. I'd play wire-wrapped rope if it sounded better than regular strings. In the tonal category, these strings fell short. On a guitar with excellent tone, I noticed a distinct drop in tone quality, and on another softer, more muted guitar, tone quality vanished.In the final analysis, if you're a picker and your guitar can be plugged in, you'll love these strings. If you're really into great acoustic tone and your guitar doesn't have stellar tone to begin with, you might gain some 'playability,' but you will most likely experience a slight drop in tonal quality.", "id": 899}, {"review": "Like many modern capos, this has an unwieldy look to it that I don't like, but once I get past that, this is a top-notch capo that is as good as it gets for capos. I play several very different stringed instruments (guitar, mandolin, octave mandolin, tenor banjo and Irish bouzouki), and I like having a capo that I can use on all of them. This is ideally suited for guitar, but holds its own on all the other instruments. I particularly like that there's nothing hanging out under the bottom to get in the way. I can play right up to the capo without my left hand hitting anything on the underside of the neck.I really like that fact that it's adjustable, and this feature comes in really handy when moving it from guitar to the tenor banjo or mandolin. I also really like theMeideal MCapo10 Bronze Guitar / Banjo / Mandolin Capoas my 'all purpose' capo, and I own several of these because they're inexpensive and just a great product. But this is definitely my new guitar capo, and will replace the Meideal in my case. Great product, solidly built, and it's a bonus that you can add the Micro tuner to the bottom of it.The construction appears to be very solid, and the finish is a flat black baked-on paint (or so it appears). Might be some sort of powder-coating as well. The top bar of the capo is covered with hard black rubber, and the spring seems very strong with great tension. As noted, it will accept a D'Addario micro tuner on the bottom, and includes the bracket for mounting it.", "id": 894}]