[{"review": "I was thinking it may affect the ability to tune properly, but it seems to have no affect at all. Super audiophile tone hounds might say it affects the resonance and sustain, but just take it off when recording. Very handy to have two picks with you at all times. It's great not to have to make a trip back to the mike stand to get a pick or having to attach something with sticky tape to the guitar's finish. Me likey!! Price can't be beat either!", "id": 29}, {"review": "Works as advertised. The cutter makes this thing really worth while. If I lose it, I'm buying another! 2 more words required?", "id": 94}, {"review": "Back in the 90's I used to have an Ampeg guitar head with an effects loop. I discovered the rack version of the BBE in a music store and was amazed by what it did for the money. The amp I have now is a totally bad ass Fryette Deliverance 120, but sadly it has no effects loop. So I thought I was out of luck as far as a BBE goes, because as far as I knew they were only available in rack mount units that could not be placed anywhere but in the effects loop. Then I was looking for pedals on Amazon and, lo and behold, there was a BBE Sonic Maximizer pedal! I snatched it up with a quickness and I am very pleased that it sounds just as good as the rack version. One caveat- if your signal is noisy the BBE can actually increase your signal noise. For this reason I highly recommend using top quality patch and instrument cables and doing all you can to clean up any noisy aspects of your sound before you use it. This pedal is very subtle, but to an audiophile like me it is absolutely essential. It also works great for ANY instrument or sound system. It's also great for vocals as well. But you may want the rack version for those applications. I would also buy the rack version if I had an effects loop to run it through. IMO, the pedal is really only for those folks who have no effects loop but still like what the BBE does. I'd go with the rack just for ease of use and keeping it in the proper place in the signal chain. Plus you can get a stereo rack version and have two BBE's for not much more money that you can use for another application.", "id": 300}, {"review": "I bought this boost to use in one specific situation. When playing a lead line with my bridge pick up with the tone knob all the way down, my volume drops quite dramatically. This boost does what it says it will do to remedy that, but it also seems to add a lot of noise. When the boost is off, my super high gain Fryette Deliverance 120 is very quiet when I just hold my hand over the strings. I'm using a 2010 LP Custom with a stock 490R pick up in the neck and 498T in the bridge. When I turn on the boost I immediately hear a lot of extraneous hissing and noise. When playing it isn't so bad, but I definitely am not used to so much extra noise. There are a couple of adjustment switches inside, and I haven't fooled with those yet, but I'm definitely going to do that. This boost will prob help guys with lower end gear get a better sound, but if you've already got pro quality stuff I don't see too much of an advantage here.", "id": 643}, {"review": "I like the tuner and I'm definitely keeping it, but the \"polyphonic\" aspect of it is pretty useless. When you tune using the needle (or LED version of a needle), it will show each string as being in tune. Then when you strum and use the polyphonic mode, it often shows some strings are out! And that's even when I use the neck pick up and strum with my thumb, as the manual says to do. But the tuner works great in the single string mode, and I also like the drop D setting and the easy way to switch between the 2 modes. It also has very cool and easy ways to adjust the 440 Hz pitch, and it is very easy to switch to Eb tunings and other settings. I also like the LED lights and the automatic brightness setting. That is a very cool feature for those folks who still use batteries to power their pedals. The tuner works great, and that is its saving grace after a kinda gimmicky sales pitch regarding the polyphonic setting. So buy it, but do it because the price is right and it works great as a tuner in the traditional sense, not because of the polyphonic gimmick. (August 2013 edit as follows) I just found out a feature of this pedal that I definitely do NOT like!! I dislike it so much, I had to edit my review. I wanted to hear how some of my licks sounded in E flat. So I set the tuner to the E flat setting as explained in the manual, then I tried to tune. All the strings kept showing that they were still in standard tuning. It seems as if my drop settings on the tuner were not functioning. I wrote the manufacturer (they did get back to me quickly) and they explained that the drop tuning functions ONLY WORK in polytune mode!! So if you're like me, and you find that polytune doesn't work very well, then basically all this is is a standard needle chromatic tuner that will not tune in any other drop modes! LAME!!", "id": 650}]