[{"review": "This strap kicks butt im a tall and big guy so its hard to find longer straps for cheap and baby is long if I have it to max its TO LONG that never happened to me and im 6 4 300 LBS so if your tall buy it don't waste your time with the Planet Wave ones there junk too short and the leather ends are really thin and brake after a few weeks of hard usage", "id": 74}, {"review": "CRAP these strings are bad do not buy them if you play any kind of harder music or do a lot of string bends unless you like having strings almost take out your eyes then by all means buy em errrrr i always buy Ernie balls but i got cheap and tryed to save a few buck and buy 2 3 packs of these hunks of crap for under 18 bucks i should have spent the extra 7 bucks and got the 6 pack of Ernies I didn't even get a week out of them and they were rusted and poppin off left and right....................never again", "id": 156}, {"review": "They have no grip at all they brake and ware out in a hour or so of hard playing there just junk for newbie that don`t know any beter but hey what do you expect they are made by D Addario get some real picks like Dunlop Tortex", "id": 574}, {"review": "Its a good amp im happy with it. The high gain is not the best a lot of unwated noise even while playing and i see a few people on here have had the same problem. But i mostly play punk/hardcore and blues which is does very well. So when im in a metal mood i use a BOSS metal zone pedal on a clean BUTCHER seting and no unwated noise even at loud volumes. so its good amp i just wish i didn't need to use pedals to get good metal sound thats why i got this amp so could get rid of my pedals o well", "id": 872}, {"review": "Come on now these are Ernie Ball strings what can I say that hasn't been said a 1000 time already there the best buy them", "id": 226}, {"review": "its ok for a bedroom amp its has a weird buzz that goes away when you touch any thing metal on the guitar even if the vol is all the way down and no its not the guitar i have plug it into other amps and no buzzing and it really dont like florescent lights im thinking about sending it back", "id": 734}]