[{"review": "As several of the previous posters astutely mentioned, 'you will need a noise gate to use this pedal'. I completely agree with that. And it will sustain your notes. It will actually raise the volume to make them sustain. But you will have extraneous hiss when the guitar is not playing to cover it up. The only way to get rid of this hiss is to use a noise gate. I use the NS-2 when I use my chain of pedals. That said, this pedals has some wonderful uses. Every note will have the same volume. You can hit the chord as hard as you like or as softly and it will play at the same volume. You can set it to sustain for days. Again, you will need a noise gate. There is nothing transparent about THIS compressor as there is almost all of my other compressors, but none of them are as \"ACTIVE\" as this one. Perhaps that's the price you pay for what this pedal can do. I recommend messing with it quite a while. You can do some incredible funk, jazz, metal vibes out of it.", "id": 34}, {"review": "Sorry, I don't like these as they're just too big. They stand out too much. They do work and they're effective but they are too pronounced. There are many good alternatives; strap gaskets, strap locks, undoing the pin and putting it straight into the guitar strap.  Again, they work, but they're not aesthetic nor elegant. I also got a gold set for my bass and now it looks like I should be wearing big purple platforms when I play. Not cool.", "id": 44}, {"review": "Ive been using this polish since the early 80's. It doesn't smell the way some do and works fantastic on all of my guitars. Wonderful polish and has not hurt my guitars. What has hurt my guitars is me dropping them or sweating all over them, but this polish? No way. Martin knows what they're doing. I use it on my expensive nitrocellulose finishes.", "id": 55}, {"review": "There are something special about these strings. They ring so bright and beautiful. I absolutely love them for my fenders. I honestly don't use them on all of my fenders but they are on my tele. They're gorgeous sounding, especially when new.", "id": 88}, {"review": "I've wired and rewired countless guitars and have had a couple fail recently. Don't know if their QC has gone downhill or what. I didn't send them back because they're usually around $10 but it's disconcerting when a Fender product unexpectedly fails. It would have 5 stars but for the recent failures.", "id": 214}, {"review": "I've never had one of these pots fail on me. Never had one go scratchy. I'm sure they will, as most pots will, but I've either been fortunate or these are very well made pots.", "id": 216}, {"review": "For the price this is a wonderful strap. It can get twisted and wear out, but keep it straight and it will last you a long time. It has a vintage look, very soft and comfortable. It also has that vintage Fender coolness factor. I have 30+ year old leather straps that will be around years after I'm gone but I paid a lot for them and they're not as comfortable as this. I've even used these on Gibson's (oh, the shame) but of course they look best on Fender's, I guess. The truth is they will work on anything. The strap ends are great, but they're not really secure. Gaskets can take care of that. I own quite a few of these are they're great quality, look cool (in a vintage kinda way) and feel soft on my shoulder.", "id": 353}, {"review": "I don't know why more people don't use these: they're amazing. I've used many strings and owned many guitars. These aren't diamonds or gretsch but they're fantastic. I love them on my strats. The last and make playing a breeze. I don't have any tone loss between these and .10's. If I do it's more than made up by the fact that I can play better with lighter strings.", "id": 396}, {"review": "This comes COMPLETE with bridge, saddles and full size block... and it's FENDER! I don't think this is a true steel block. I believe it's Zinc Alloy but that's Fender's fault. The company I bought it from, Ant Hill Music via Amazon, is very honest and likable people. I have nothing but respect for them and bought two of these for Squiers. They made my cv50's sound fuller with greater sustain. I'm sure I'll buy more in the future.I should add it does not come with a whammy bar but your my old squier whammy bars fit perfectly into it!", "id": 678}, {"review": "Great strings! Used them for years -- always loved them. Put them on an Eric Johnson strat. Wouldn't use anything low quality for that guitar.", "id": 679}, {"review": "I have countless delay pedals and racks. This inexpensive delay is very special. It has the tone and mojo of an analog delay. It won't give you a thousand features but it will get you close to that rich vintage analog delay tone that many of us are looking for. It sounds great clean or dirty. it's a relatively short delay, which is great for many genres. Long delays are generally unusable except for very short passages at the end of a phrase or surreal Eric Johnson like music. I would qualify this as a working musicians delay that can be used in the studio and in a live environment. It's bring an atmosphere of surrealism without going overboard, to your music. Pair it with a nice fuzz or overdrive and you'll be near the dark side of the moon. Many musicians use two delay pedals. I know, I often do. This one is my main delay and my 2nd delay is a very expensive feature rich stereo delay that is a bit sterile and only sees occasional usage. Both work together to help me find the tones that I am searching for. The unit itself seems sturdy and well made. I use carbon zinc batteries in mine. They just seem to sound better to my ears. Keep it unplugged when not in use and it lasts a long time.True bypass and no hiss. Great surprise as I never took Rogue seriously. Never thought it'd be my goto pedal.", "id": 725}, {"review": "My classical guitar stand was metal and short, like this, but did not have the front brace or download slant. If I had this then my beloved flamenco guitar might not have tipped over and broken it's headstock on the hard flood. So sad. I mourn it still.", "id": 880}, {"review": "That's not to brag but to illustrate my experience with AMPS. Everything you can imagine. This AMP ranks up there with the best of them. I'm surprised as I've hated (with a passion) every DSP solid state amp I've ever played. This hybrid is incredible. The effects are excellent. The built in compression is amazing and the amp works excellent for recording. It has many onboard effects but I have racks and pedals that outdo those, so I don't use them for recording.It's not a band amp unless you're an acoustic band or your drummer has electronic drums. It's 15 Watts, but it's loud... it's just not quite loud enough to get those cleans over the drums, though you might be fine for overdrive -- depending on the venue and situation.It's not going to emulate certain amps like a VOX very well, but it does excellent with a Fender Black face (excluding the tube reverb). It does a Bassman ok, but doesn't quite capture that chime and nuisances tone of the original '59 Bassman. Doesn't cost $11,000 dollars other. It does a Marshall pretty well. Marshall's based on '59 Bassman without the delicate touch, so there's no wonder. The acoustic gives a very clean sound and makes that clean sound more full, yet doesn't sound like a filter. 0, 6, 7, 9 and 12 are amazing voices. You can bypass that and use  it without effects or voicing and it sounds a lot like the original Super Champ.I also have a 2x12 Vintage 30 box I connect it to for even more of a wonderful fully dynamic and full rich sound. When I'm just playing around the house or need a quick recording and don't wanna have to dial in sounds with my Vox AC30 or Fender Deluxe Reverb then this my amp of choice. It is miles ahead of a Fender Blues Deluxe.Yes, this is indeed the best amp you will find for the price and the most versatile amp I've played outside of a $2000 mesa boogie.Buy it. In fact, buy two. This is a future classic.", "id": 561}]