[{"review": "I purchased this guitar after much thoughtful consideration of other possibilities, but the nearly universal high marks for this particular make and model finally persuaded me to go with this one, and I do not regret that decision.First of all, it is a beauty. Initially, I was a little disappointed in that very little wood grain shows through the orangish finish. (My guitar was made in China, which may account for the darker hue.) I thought I had wanted a lighter color, but the more I look at it the happier I am with what I have. Second, this instrument is no light-weight, either in heft or playability. It is solidly constructed, very well put together, and plays like a dream. (I lowered the action until I encountered some fret buzz, then backed off the adjusting screws just a bit; that's basically the only adjustment I've made, or likely will make.)It's been barely a day since the guitar arrived and, as yet, I've only played it unplugged. I can't wait to hear how it sounds amped up.", "id": 31}, {"review": "I didn't know what to expect given the price, but am happy to say this is a very nice guitar for the money. I am impressed by the quality of materials, components, and construction. For example, the tuning machines are substantial and heavily chromed; they work smoothly, and firmly hold the strings in tune. The instrument came relatively well set up right out of the box; the action didn't seem inordinately high, but I couldn't resist taking a little off the bottom of the compensated saddle even so, and now the guitar plays even better. I might tinker some more at some point, probably when it comes time to replace the strings, but for now I am quite happy with the playability and sound of this full-bodied dreadnought, which is rich and resonant and very impressive. I still can hardly believe it is possible to deliver such a fine instrument at such a low price, but the proof is indisputably before me.", "id": 148}, {"review": "I needed to replace the strings on my acoustic, and chose these D'Addario's based on price and the favorable reviews given them by other users. I'm glad I chose them, as they play easily and have a nice sound. The lighter gauge allows for rapid yet sure fingering, and makes 'bending' notes for a blues effect a cinch. In fact, I occasionally have to remind myself there's no longer any need to press down nearly as hard as I previously had to when playing the heavier-gauge strings my guitar came with. In short, these strings make playing so much more enjoyable, I wish I'd gotten them from the start. But then, without the comparison of playing with the old strings, I might not appreciate playing with these half as much as I do now.", "id": 198}, {"review": "This is a great bag, regardless of cost. The fact that it sells for less than $20 makes it an absolutely fantastic deal. (Free shipping only makes it that much better.) Unlike some other reviewers, I have not noticed any objectionable smell. I will attest to the fact that it is very well constructed. The fabric itself is a heavy cordura material, the zippers and pulls are heavy duty too, and the padding is stiff and thick enough to afford your (solid body) guitar some very substantial protection. (I would estimate the padding, which is entirely concealed within the cordura, to be approximately three-quarters of an inch thick.) In addition to the main carry handle at the side, there is another in back, at the top, as well a pair of backpack-style straps, so finding a convenient means of carrying your guitar shouldn't be any kind of an issue. The two zippered accessory pouches (for picks, a spare set of strings, and perhaps some music) are also a nice touch. In my opinion, this bag could easily sell for twice the price and still be considered a bargain. As it is, it's very cheap insurance for my Epi Les Paul II.", "id": 311}, {"review": "It looks nicer than pictured, seems solid and well-constructed, but most important of all it sounds fantastic! I've only had this amp now for roughly a day, but stayed up a good part of last night playing. I couldn't stop. This morning I opened the outside doors and cranked it all the way up to about half volume. (Scared the cat and made the dog wonder what the heck that new thing is making all the noise.) Beyond the halfway setting, it would've hurt my ears. Yes, it's that loud! Absolutely more than enough amp for your practice and small-event purposes. So far, I've only played through the amber pre-sets and only experimented some with the modulations knob. I like the bluesy, tube-effect modelings the most and don't know that I'll see much need to go looking to create a lot of custom settings. But it's nice to know this amp can deliver, either with or without the additional FUSE software, such an incredibly diverse array of sounds should the need ever arise. Thanks, Fender!", "id": 718}, {"review": "Exceptionally well made, this is a fantastic case for the money. (Fifty dollars, including shipping, at the time of my purchase.) It has four(!) very solid clasps, one of which locks. (Two keys are included.) It also features a plush velvet interior, cushioned neck brace, and a strap to keep the top from flopping back, which could stress the hinges and perhaps alter the factory-perfect lid to case alignment. But best of all, it fits my Takamine Jasmine guitar like a glove, holding it secure and (knock on wood) keeping it safe from all harm. I could not be happier.", "id": 753}, {"review": "The saddle, after some minor rounding at the edges, fit perfectly as a replacement for the one that came with my Takamine acoustic. I haven't replaced the nut yet, but even so the improvement in tone and sustain is quite noticeable. These are high quality parts, well worth the relatively small investment.Edit: I have since replaced the nut too, and am pleased to report it is a near perfect fit, though it is a tiny bit shorter across than the old one. But the difference is negligible, and the improvement in tone and action was well worth the small additional expenditure of time and effort.", "id": 860}]