[{"review": "I have used Fender Medium picks since the late 60's.  Yes, they are made in China now (!!) but they are still the same pick as far as I can tell.  The picks arrived fully sealed in an outer envelope and contained within a nice little mini zip-lock baggie.  All 12 were in there, all of them Fender Mediums.  (purchased from B&G; Music Associates)  Shipped from Illinois to California in 3 days with normal shipping.The picks are great and I couldn't be happier with the order. Whatever issues occurred with missing picks and poor shipping no longer exist from where I stand.  Recommended if you want/need a nice little bag of Fender Mediums.", "id": 117}, {"review": "These D'Addario  strings are great!  I am currently using them on my Epiphone Sheraton and compared to the Fender Bullets I had been using, these stay more uniform in tone throughout their life.  Intonation is good and I've noticed less breakage as well.These strings are a bit bright but have plenty of 'good' sparkle too and really sound good on my Strat, even more so than my Sheraton.  Being from the 'old school' I still much prefer strings to be packaged individually in paper, but what can ya do? Besides that, I am totally stoked and happy with these.  I think I might try 9's on the Sheraton but even as is they play (and sound) very good.", "id": 156}, {"review": "This Epiphone Hardshell case is a real bargain!  Well built and functional, just the perfect size for your Dot,  Casino, 335 , or in my case a Sheraton II.  Finished in faux leather, a nice scuff resistant vinyl of some sort, much like the old Fender Tolex.  NICE hardware on this case. All the latches are fitted well and are both good looking and rock solid. Hinges too.  The handle isn't going anywhere!  Inside you get a nice soft plush interior, the obligatory hinged compartment for strings and things, and a good solid rattle free fit for your guitar.Top all that off with 2 feet on the end for standing upright,  2 well placed feet on the side and 3 on the bottom. NO matter which way you place the case (other than upside down) both your guitar and case are protected.  You get a total of FIVE good quality latches (one of them locks, key included) and hinges at either end. As I said, the hardware on the case is really good.  For under one hundred dollars this case is an unbelievable bargain.I was immediately struck by how SOLID this case feels.  It is no lightweight either.  I feel totally secure keeping and transporting my Sheraton II in this case and unworried about it breaking apart or popping open, etc.  Mine came almost scuff free out of the box, but there were a few signs that it had been handled a bit before packing. Still, it looks super and the overall visual presentation far outstrips the price.If I could make just two criticisms, it would be that I notice the stitching appears to be single stitched, rather than double stitched. Also, the strip of fabric that holds the lid open seems overly thin and not well implemented. It is a smallish piece of colored vinyl attached to the lid and case body and it looks like this will be the first thing to wear out or even just up and break.  Also, when you close the case , instead of folding in on itself it tends to stick out the back of the case, necessitating you manually pulling it into the case before fully closing.  I would have much preferred a nice self folding piece covered with the same material that lines the case itself.  This is just a minor niggle and could easily be replaced by either yourself if you are handy, or most any music store with a halfway decent tech in the backroom.I have no reason to believe this case will fall apart anytime soon . Overall, I am extremely pleased with this case and my Sheraton II is happy to have found a long term home.  An excellent value, highly recommended!", "id": 157}, {"review": "This stand was very inexpensive and I thought I could save a bit of money and give it a try for use with my Epi Sheraton II.  Unfortunately I am just not all that comfortable trusting my guitar to this stand.  It seems to be built well enough for what it is, but it seems quite unbalanced and always on the verge of tipping backwards. Also, for left/right stability you need to set the guitar just so in the bottom support piece or it seems 'tippy'.The construction itself is 'ok'. The rubber tips on the feet seem fine, but the front legs seem overly long with the rear foot overly short.  The body cradle is nicely padded but isn't firmly seated inside the center tube and even though it has a rudimentary locking design, it just isn't all that solid.  You can adjust the height but just inserting the top piece into the bottom caused deep scratches in the black paint of the top tube piece.  It ships with an unsightly white UPC sticker which must be tediously removed if you want it to look good onstage.Granted, the Sheraton II is a large and heavy guitar but the OnStage is billed as \"Heavy Duty\" and to me that means SOLID, which this stand just isn't, at least with larger guitars or basses.  When you use a guitar stand you can't afford to be dealing with something that is in the least bit temperamental or you risk damaging your instrument and possibly even your livelihood.Bottom line, you get what you pay for. For smaller, lighter guitars, Strats and such, it may be ok, but for Dots, Sheratons, 335's and larger Gretch's, I just wouldn't trust it and that goes for most basses as well.I will need to look for something else.", "id": 436}, {"review": "Got the black one.  Bought this to help hold up my heavy Sheraton II and needed something at least 2 inches wide and strong to do it.  On that level this strap succeeds. It is definitely strong enough to keep my guitar from falling off or shifting on my shoulder.  It also looks very nice.But any positive thoughts I have about it are outweighed by the constant shedding of black dyed leather that continually falls off the strap and onto me, my guitar, my carpets, etc.I need things like guitar straps to be ready to USE without causing a shower of little leather bits all over the place!  I am not sure how long this will go on but I've been using it for two weeks now and there is a trail of small black leather wherever I go.  I have not encountered the dye running yet.Honestly if I had it to do over, I would skip this particular strap. Suede and me are not getting along too well at the moment.", "id": 481}]