[{"review": "I've used D'Addario's on so many different Guitar's the only opinion I can honestly give Ya is that They are the best. In the Studio or on Stage, They stay in tune and work very well with any pickup You are using. I put these on My Wife's Bass cause She is still learning and with a Fender Squire it sounds almost as good as a Precision Fender Bass. They stay true to the note so She will get to know what the pitch and note should sound like every time......", "id": 197}, {"review": "This is a cool little amp. Sure it's really nothing to write home about but I like being able to take My Strat and just sit somewhere and jam without having to have a Generator to supply the power to conventional Amps. I wouldn't perform with it but great for personal use........", "id": 235}, {"review": "I have found that everything Schaller make's is Grade A-#1 in My book. Made in Germany ( NOT China ) these locks are fast and secure. I like the way they slide on & off which if Your like Me having to change Guitar's during a show or just at home, the change is smooth and safe. No dropping guitar's around here !!! I have them on all My guitar's.", "id": 278}, {"review": "It's a good ideal but the big problem I have is if Ya are using a tube Amp. ( have a 65' Twin Reverb Fender tube ) Ya get one HELL of a HUM. It's so bad I just can't use it at all. I'm not sure about a transistor Amp. but who uses those ????", "id": 428}, {"review": "All that needs to be said is that  &#34; It's a Peterson &#34; Just the best Tuner's ever. I also use one on My Pedal Board, Wouldn't use anything else !!!!!!", "id": 711}, {"review": "The best EB Slinky's I've ever used. On these I use the light's--9's. Even with the whammy bar they stay in tune really well. I use them on all 4 of My Guitar's. Two Fender American Standard's, Gibson ES-335. Gibson Les Paul/ with Bigsby. I always have a set in each case..... Try'um... Ya won't regret it !!!!!", "id": 825}, {"review": "I have gone through a lot of stands and this one for the money is Great. As a matter of fact, I ordered 2 more. Get this one and have No Regrets........", "id": 436}, {"review": "I'm a very big fan of David Gilmour but never was a fan of GHS's. So I thought I'm wanting to step up one gauge to 10's so why not try these. It took a little longer for them to get stable but My Strat and My Les Paul sound and feel Great. Now , ( and I didn't see this at first ) on David's Les Paul , He use's 10.5's and I have a Bigsby on Mine like His. I may try those next time on My Les Paul. I'm not sure how they will work on a Epiphone Les Paul 'cause I have a Gibson and there is a BIG diference. And on the MIM's Fender's either cause both of mine are American Standards. All in all I'm very pleased with the DG GHS's....", "id": 499}]