[{"review": "I've played this pedal for a while now and really dig it. I'm old school, Fender Blues Deluxe reissue and Strats and Teles, this pedal has a great, warm, organic feeling tremolo that I use a lot. You can barely bring it in for some warmth, or really crank the speed and depth for a great sort of rotary speaker effect.I'll use it with the rate set at tempo for a song and record clean guitar chords up on the middle of the neck. This effect will give you a nice almost Hammond B-3 type of organ sound.", "id": 39}, {"review": "They have good ends, they do feel a little flimsy on the cord side of things. They have good signal though and don't seem to alter the tone. I have them all on my pedalboard now so time will tell if they hold up or not.", "id": 207}, {"review": "I could go on and on for days, but the best things about EZD are the endless EZX packs you can add in and the fact that all drum grooves have a mic on each drum as well as room and overhead mics which give you that live, organic sound that you can never get with loops.You can edit the grooves and fills via MIDI if you need too, add in cymbals, etc. It's really, really an amazing program. Best money I ever spent!", "id": 385}, {"review": "This is a great pedal, very well made and fairly compact so as to fit in pretty well on my small pedal board. I also like the tone a lot. Bear in mind I like the more vintage tones, it's not a crisp, crystal clear tone like you'd get with a digital delay, it's got more warmth.There's a great video on YT from proguitarshop.com that demos it very well. It's got great short and long delay, very smooth feel and the mod switch adds just the right amount of modulation to your tone to make it a tad fuller. This is not a bright sounding delay, it can be a tad dark at times if you're not careful.I use this for my long delay sounds and use another delay for short, slap back and echo sounds, it's a Mooer micropedal. They work well together too to get a huge, fuller, ambient type of sound going. I put the Mooer before the MXR in my chain. I use all my pedals right into the front of my amp as there's no effects loop.I hope this helps your decision. If you like warm, old school tones you'll dig this pedal.", "id": 507}, {"review": "I just bought a tweed Blues Jr. and love the amp. It's got a great tone, much better than the black one I had 3-4 yrs. ago. I just downsized from a 40 watt Blues Deluxe reissue and having compared them side by side I can say they sound very, very similar, as they have the same speaker, but the BJ is much lighter.That being said the fat switch really makes a lot of difference when taking a solo. I was actually surprised at how much it fattens up the tone, didn't do that on my last one. This pedal works great for that too, It feels very solid and it doesn't make any audible clicking noises that I can hear when engaging it.", "id": 563}, {"review": "They call these mini tuners, but to me they are just right. Some tuners are too big and bulky looking imho. I installed them on a PRS SE Santana in just a few minutes. They were direct drop ins. To use them you simply grab the top and turn it until it clicks. Then you line the hole up with the center of the headstock, insert the string and then turn the tuning peg. You'll feel it &#34;lock in&#34; then about another quarter turn and the string is in tune. They are really good tuners and I think anyone will be pleased with the tuning stability they offer.", "id": 275}]