[{"review": "I have one one these from the 80's back home, and when I was looking for a new peddle, I found this was still the best around. I remember searching for the right peddle back in the 80's and going through dozens of them before settling on the Rat. And it's exactly the same... Simple, sturdy and its settings are perfect from crunch to blistering distorted sustain. I run it through all manner of amps - including Marshalls, Vox, and even Crate, both tube and transistor, and with a few quick easy adjustments I get exactly what I'm looking for no matter the box.I'm an old school player - meaning I want my sound to come from the guitar and amp instead of processors. This is just an enhancement to my sound, and not the basis of it... though I expect anyone will get what they want from this baby.", "id": 232}, {"review": "Some have complained that it's construction is not the best. I actually had to send the first one back because it did not work. But a new one came the day after I lodged a request for a replacement.It's a very simple echo device, I use just to give my guitar a little bounce. I prefer to play 'dry' most of the time so as to define better what I'm doing. But some solos need a little filling, and this keeps it subtle. It can do a lot more, but it's what I wanted.Sturdy enough, well priced, and simple to use.", "id": 506}, {"review": "Right size, well made, and these do the job. I prefer them at 90 degrees, so these are just right.", "id": 578}, {"review": "Saw this sucker on my bass player's head, and got one a few days later. Not pitch perfect on the fly, but keeps you very close when on the run. Unbeatable value. Silent tuning, so on stage it's almost a must.", "id": 724}, {"review": "These are a little course for what I wanted. Brass is a lot better, and the edges are too sharp for fast picking. They may be giving the strings a little premature wear, and the loss of tonality is the problem. There are better options if like me you like your picks hard and firm.", "id": 804}, {"review": "A simple affordable instrument cable. I prefer cable ends that are formed (not the type which can be unscrewed), as there is less risk of breakage and noise. Cable quality is not high (for professional recorded you'll something better), but very good in general.", "id": 168}]