[{"review": "Purchased this to replace the Dampit as a no drip alternative. With the solid base it will not drip and it fairly easy to use. Distilled water will extend the life of the sponge. Overall simple and effective.However, I may have added too much humidity. Was using in conjunction with humidipak to keep them from drying out thinking they would absorb any excess humidity, but I then noticed an irregularity in the reflection of the pick guard and the tone seemed to be muted so shifted over to humidipak only and will re humidify them outside the guitar case.I do use a hydrometer but I don't think it was effectively reading the inside of the guitar, but only the inside of the case.So I think the Planet Waves humidifier works well for its intended purpose, but you do have to monitor that you are not over or under utilizing it.", "id": 71}, {"review": "I almost always play finger style without a pick, but on the occasion I need a pick I like these.Easier to strum sounds good to me.If you're doing a lot of picking out individual strings, you'll probably want something thicker, but these make it really easy to strum chords and sound good, plus pick out a few strings here and there.", "id": 120}, {"review": "Scratch free, durable, machine washable. I use it dry to wipe down the acoustic guitar strings after each time playing and the tone lasts much, much longer. You place the cloth next to a string, then hook your little finger under and pull up so the cloth surrounds the lower surfaces, sides and top of the string, then pressing it in around the string slide up and down the full length a couple of times, then repeat on the remaining strings. I then slip it under the strings and sort of buff the fingerboard, then wipe down the surface of the guitar and tuning keys. Takes a matter of moments and works great. Then once every week or two, it just goes in with the laundry, comes out perfectly clean again.Polyester microfiber is kind of an unusual fabric. It is fully synthetic and water will bead up on the surface, but it works well for polishing. If I'm using carnuba wax, I use a 100% cotton towel to remove it, but for dry polishing wouldn't be without one for each guitar.", "id": 184}, {"review": "Low end made in China dreadnaught acoustic - Bristol - actually sounds somewhat fantastic in terms of low end resonance and sparkling high end.Here's what I've found. The way you string the guitar makes a difference. With practice I've become more proficient.Curve the ball ends for better seating under the bridge plate. Not just a simple bend but kind of bend them over my thumb so they can sort of catch before inserting the bridge pin. Then check with a mirror and flashlight to confirm.I use a locking pattern on the tuning pegs and keep the string quite tight so it loops tightly around the peg.Then I use a microfiber cloth and wipe down each string after each time playing, - use my little finger to hook the cloth under each string and wipe down each length.Try to practice for about an hour daily. The tone as I say is pretty darn good. Played a high end adirondack, rosewood, name brand and was disappointed that it didn't sound that much better to me.", "id": 198}, {"review": "Dampit was recommended to me by a guitar instructor years ago, and I have used the standard model for some time. It seemed kind of tricky to get it to hold enough water to humidify the guitar yet still get it dry enough to have absolutely zero drips inside the instrument.I used to hang it by the clip and let it drip dry for about 15 minutes while I was doing other things before placing it in the guitar.Later I wound up trying the Humidipak humidifiers and to help recharge them on a Dreadnought, I took to putting the Dampit in a gallon plastic bag with distilled water and a resealable top, pressing on the sides to saturate it, then rolling it up in a Planet Waves Microfiber polishing cloth and pressing on the end of the cloth to soak it. Then unroll the cloth, put the dampit in under the headstock where a drop of water would just go into the hard shell case, then rolling up the end of the polishing cloth to cover the wet end with dry material and pushing it into the sound hole over the humidipaks. Worked great.So I ordered a super dampit for my new 000 acoustic planning to do the same. They now ship without the clips. Company says they've had too many complaints about scratches, though I didn't seem to have a problem, wasn't about to take a chance with a costly new acquisition. More importantly, there is supposed to be a sponge to absorb water inside the tube and when I pressed on the sides of the tube, it was empty. So I sent it back to Amazon for a refund. No problem getting the refund, but I'm moving on from dampit to try the planet waves insert with a sponge that has eliminated the chance of water dripping in the guitar or damaging the finish.If you use it to soak the polishing cloth as described above, that still works great, but there's really not enough room for that in the OM model, so between that and the missing sponge, will just try something else.", "id": 299}, {"review": "I will no longer use other humidifying methods for my BR-243A. There's too much that can go wrong with over or under humidifying a solid wood acoustic guitar. Woods swell and shrink based on moisture vapor and it can also affect the tone quality.The beauty of these is that the gel packs maintain consistent humidity and make any changes gradually.", "id": 406}, {"review": "For about 30 yrs. have been playing finger style only - usually with alternating bass, and never really used a pick so this seemed like a good first choice.For the song I was performing, chords were Bm, E, F#m, and G (1st & 3rd position) and I needed to back up the singer so it was really just strumming with a tiny bit of playing just the first two strings as an intro.I found a very old and very thin Peavey pick unintentionally picking up what looked like the blue Dava in the bottom of my guitar case and it worked perfectly so I then ordered the Fender Abalone Thin picks and find they make playing chords quite easy.Fender 351 Premium Celluloid Guitar Picks, 12 Pack, Abalone, ThinMy ancient Peavey broke in half not long after, and I continued using the stub turned sideways while waiting for the new Fender picks to arrive because I liked the extra flex)Seems like more advanced players like at least a medium to better pick individual strings, but since I never liked using a pick at all, the Fender Thin works best for me and I'm enjoying learning to use it on songs like Eric Clapton's interpretation of Bessie Smith's \"Nobody Knows You...\"I'll try the Dava picks again later if I feel the need. I play Simon and Garfunkel's version of Scarborough Fair which is exclusively finger picking and George Harrison's \"Here Comes the Sun\" - where he uses a pick, but it is still easier for me to pick out the individual notes fingerstyle.This is all on an acoustic 6 string steel guitar, using D'Addario EJ16 Phosphor Bronze light strings.Bristol by Blueridge BD-16 Dreadnaught Acoustic Guitar (Natural)D'Addario EJ16 Phosphor Bronze Acoustic Guitar Strings, LightFor the rank beginner who has never picked up a pick before, the Fender thin makes it easier to strum because the pick flexes so it's not as essential to turn your wrist as much to get the pick to move smoothly over the strings.The grip is better on the Dava, but they aren't going to flex as much. Undoubtedly better for more accomplished players. Most advice I've seen says try 'em all and decide for yourself. I was just amazed and delighted how much easier the Fender thin made it for me to get started.", "id": 503}, {"review": "Was looking for something slightly improved over the Snark, but still easier to use and lower cost than a strobe tuner.Works well to quickly tune and still zero in on the correct pitch.Appears the tuner is a AW2 and the G (guitar) function is in that the clip fits a guitar headstock.Works as anticipated. Easy to get that last bit of fine tuning.", "id": 595}, {"review": "Well made, proven over decades. Switched from NS capo to improve tone with a one piece mahogany neck. Not sure there is a huge difference but there does seem to be an improvement. Requires less adjustment. Square pad allows placement right next to the fret. Easy to adjust with a bit of practice.I enjoy using quality machined parts, so this is a pleasure, plus it is built to last.", "id": 761}, {"review": "Primarily purchased to have a string cutter in the guitar case rather than going to get one from my tool box.Found the pin puller did not really work for me, so put my old string winder from 20 yrs. ago back in the case to use that pin puller which worked just fine. Seemed no matter how I tried, I was almost scratching the saddle tried to get that groove under the head of the pins and could never get it to work on a six string steel acoustic guitar.It seems that &#34;C&#34; shaped opening in the end is for stretching strings, and I find that is better done by hand. So really I just use this for the wire cutter feature.  And the string winder itself also works well.", "id": 94}, {"review": "Was very pleased with JP 600L PB acoustic guitar strings. I wipe the strings with a Planet Waves microfiber cloth each time after playing and it seemed like they would last forever. Plus the tone of the bass strings was improved over the D'Addario EJ16 light I had been using that were installed by the factory, so I kept replacing with like kind. 600L is the exact same string gauges.I read a review on Shorline Music (an Amazon affiliate) about the John Pearse 710 NM PB and after trying those I like them even better than the 600L. They keep most of the same bass strings as the 600L (A, D, and G) but add some strings from the medium size: low E (.055 replacing .053) and high E and B each increasing .001, from .012 to .013, and .016 to .017.I had a concern about my ability to bend the B string using little finger only in blues F chord position - no problem.The improvement in tone is in all the right places. Very nice. Yet the overall tension of the set is increasing only very slightly under 10 pounds total, from the 162.2 lbs. for the D'Addario light.I play fingerstyle only and this set is said to be ideal for fingerstyle offering a balanced tension across all strings.I suppose things are always subject to change, but for now, I am amazed and delighted with these strings. You wouldn't think a simple string change could make much of a difference, but somehow these do.", "id": 160}, {"review": "I purchased this wax for a brand new guitar to help minimize scratches on the back though I make every effort to avoid them, and to protect the side where I rest my arm when playing to keep from wearing through the finish over time.I've used Carnuba car wax many years ago, and this is a much higher grade, easier to apply, easy to remove.There were some really tiny cracks in the polyurethane finish that I did not notice at first and I was actually able to fill them using a couple of coats of this product so they now look like tiny indentations with a smooth surface. They were very minor and did not affect the wood, but this will seal them. Not a sufficient defect to return the instrument.Another reviewer mentioned a problem applying to metal. I have open tuning machines, and before applying Tri-Flow with a pinpoint applicator, I used this wax, let it dry then buffed it out with a pure cotton towel. The chrome is gleaming. They're really beautiful. Did a great job on the headstock as well with MOP and abalone inlay when the strings were removed. Also got the tuning pegs. This is a 000 - OM acoustic. Only way I can imagine harming metal is you slightly dampen the sponge, (I used distilled water) so if someone left too much water - possibly a problem, but all worked fine for me.", "id": 336}, {"review": "The odor of adhesive lingered for some time, but that's not really a problem.Size and fit were good. The storage compartment is nice and large.One hinge broke after about a year of normal use. It was in the house almost the whole time, I just open the case to play the guitar and then replace it when done. I noticed if you look carefully, one of the hinges is cracked on both sides, so it is not holding anything anymore, but it is one of three, so the other two still do the job just fine. It is only if you look carefully you see one hinge fractured.This was not an expensive guitar, and I had a better case, so I switched to the better guitar case, and used this one for another guitar that I really don't play at all, and it just stays in storage.", "id": 753}, {"review": "Wanted a tuner not dependent on a quiet environment.So far, works well.Sometimes slightly imprecise on a bass string, but generally works great. Can tune up quickly every time.", "id": 811}]