[{"review": "I tend to sweat when I play, so coated strings are a necessity for me.  These are as good as any coated string on the market, I prefer the thinner coating and super light strings.  Everyone has their preferences so you should try a few different gauges and manufacturers until you find your favorite string. These provide an nice smooth feel while providing excellent tone and they last reasonably well.  Of course that depends on your playing style and how much your fingers sweat when you play!  Oh, and do yourself a favor and store your guitars in their cases when you are not playing them.  The guitar and the strings will last longer and thank you for it.", "id": 105}, {"review": "This is basically the same as the other stand I rated, just from a different manufacturer.  Same basic materials, you can't go wrong with either.  See my other review for the World Tour GS-1 Folding Tripod Guitar Stand.  Honestly, I can't tell them apart since I threw out the boxes.", "id": 258}, {"review": "This is my favorite light weight guitar stand, simple and does the job.  I try to avoid the stands with lever locking mechanisms at the neck rest which are a pain in the arse when you are trying to switch guitars on the fly.  These are lightweight and collapsible so you can take them anywhere, and are sturdy enough for 'normal' use.  If you're a klutz no guitar stand will be sufficient unless it is encased in carbonite.", "id": 310}, {"review": "This switch goes with the Fender Blues Jr. III series of tube amps.  The connector is well hidden, it is up underneath the main badge on the back of the amp and you have to reach up underneath to find it.  These are single channel amps, the foot switch activates the Fat Switch, which gives a little extra boost to folks playing single coil pickups.  For an LP or other double coil the switch is almost overkill.  But this is the switch for that amp.", "id": 563}, {"review": "Sturdy, portable, and the little extra weight is worth the investment if you ever want to put a music book (rather than single sheet music) on your stand.  Those flimsy, backless music stands are worthless IMO, especially on a breezy evening.  My bandmates are upgrading to this stand as well and we primarily play indoors!  I guess at least one of us is a bit of a windbag.", "id": 696}]