[{"review": "I can't believe these were actually sent to me. The heads are smaller than normal pickguard screws and the metal is blackened. They come from Taiwan but look like they were subcontracted to China. I am sending them back. There is no way I would use these. Any screw you get from Home Depot would work better and look more attractive. I am seeing nothing but product after product like this coming from Fender and it is a clear sign they are simply trying to maximize profits at any cost.", "id": 215}, {"review": "Wow, I'm shocked. A Fender aftermarket product that didn't come with some sort of defect or problem. Amazing. Whomever does QC for this part should take over the the complete aftermarket parts division and replace the guys that do QC for the other parts I've purchased.", "id": 218}, {"review": "Unless you guys are receiving something I am not, how can you give this anything more than one star. My backplate is so thin and cut so close to the screws that you can actually see were the route begins on the back of my Fender stratocaster. This is inexcusable. All the other Fender backplates I have have enough lip to cover the route, but not this mint green one. I simply cannot understand what Fender is thinking.  I am seeing nothing but product after product like this coming from Fender and it is a clear sign they are simply trying to maximize profits at any cost.", "id": 222}, {"review": "Yes, ever so slightly. Does it give you more sustain? None that I can really tell. People have been debating whether a steel, brass, or pot metal block makes a difference in tone and sustain. I think the main difference is the actual weight or mass. This is what is giving the deeper sound. The strings go over the bridge pieces and so I don't think material matters for the block much, if at all. I think it is about the actual mass. People who will say it makes a big difference are suffering from the placebo effect. Without debate, this will add weight to your guitar. I think for the price, it is worth upgrading the thin old style Mexican blocks. This is pot metal as well, which, again, is fine. The rest of the assembly is well made, as well, and seems just like the stock bridge you would find on a stock MIM strat. If you are thinking of going GFS blocks, this is cheaper, and will fit perfectly without you having the problems of not having holes line up etc., which is a common complaint and indicative of GFS's crummy products in general. I used the bridge pieces on one guitar and the block on another.", "id": 678}, {"review": "The four-way diagram that comes with the switch does not tell you which side to use. Both sides have five tabs and look the same from the above diagram given no matter which way you turn it. I figured it would go the same way as the three-way - wrong. You think Fender would have the sense to figure this out, and give us a proper diagram, but guess again. Just another example of the incompetence at Fender.", "id": 113}, {"review": "I like these strings. I have had nothing but problems with Ernie Ball strings, especially the higher ones unravelling at the ball ends and breaking as you are tuning up for the first time after a change. I have also found that the Ernie Balls break easily as well. I have had no problems with these, they sound good, feel good, and they are priced right.", "id": 156}, {"review": "I found this tube to sound pleasant, be cheaper in cost than the Electro-Harmonix, and work, unlike the Electo-Harmonix tubes I received.", "id": 459}, {"review": "I have seen people complain about battery life. I turn it on, tune, and then turn it off and my batteries last forever. The display is good, and the tuners work well. I have four of them and have compared them for accuracy and sensitivity. I think it is a well made product and good value. Thank god for tuners. There is nothing worse than a bunch of out-of-tune, loud guitar players.", "id": 706}]