[{"review": "I'm very satisfied with the performance of the CM-2.  With a few tweaking, I could emulate the sound I get from my Fulltone OCD.  I'd say it's very versatile because there are two seperate controls for low & high frequencies unlike most pedals with just the \"Tone\" control.  A toggle switch lets you choose between \"classic\" & \"modified\" setting.  A tweaker's delight!  The \"level\" knob has a lot of juice.  If you set it at 10 or 11 o'clock, it's plenty loud enough.  Although you can't use it as a clean boost because it gives off a little gain even if you set the \"gain\" knob to zero.  If you have a single coil, it may sound like your tube amp is just breaking up, not so for humbuckers (too much gain).  You can also stack the CM-2 with other pedals.  I dusted my old Boss DS-1 and run it along with the CM-2 and was able to get some good tones.  The DS-1 usually hurts my ears but with the CM-2 behind it, sweet!  The Hardwire CM-2 may not be exotic as the boutique offerings from Klon, Zvex or LovePedal, but it will get the job done at a significantly lower cost.  It's well built, will take the pounding a gigging musician will subject it to.  There may be others better but they cost more than twice the price but not twice as good.  Try it, you can't go wrong!UPDATE:  Did a full comparison between the CM-2, Fulltone OCD & Joyo Crunch Distortion.GAIN:  Joyo obviously has the most gain followed closely by the CM-2 and OCD, 3rd.MIX:  The CM-2 has the most amount of control with separate high & low controls, followed by the OCD with just a tone control and the Joyo Crunch more or less sounds the same no matter what position you put the tone control.  Since the CM-2 has the widest tone range, I can make it behave like a Treble Booster!NUANCE:  The OCD cleans up well when you roll down the volume control on your guitar and is very dynamic.  The CM-2 is a close second and the Joyo Crunch, being strictly a distortion pedal is far behind.", "id": 529}, {"review": "A booster makes your signal louder!  That has been the case with all the clean boosters on the market like MXR Micro Amp, EHX LPB-1, BBE Boosta Grande, Modtone, etc.  They keep your guitar's original tone, make it louder and when pushed enough, will add a good amount of gain & grit.  But there is something else going on with the Xotic EP Booster.  Yes, it also makes the signal louder, adds gain or a little dirt, but also makes your overall sound bigger & wider!  Based on vintage echoplex units used by guitar heroes like Jimmy Page, Duane Allman, Gary Moore, etc.  This pedal is really small in size, has one knob & the footswitch.  It does have an internal dip switch.  You open up the back of the pedal & choose you own setting.  I leave at the classic setting, turn the gain knob at 9 or 10 o'clock & leave it on all the time.  I tried it before & after my OD pedals and my personal preference is \"after\"!  Being in front of the amp, it didn't do much when I tried to use just the dirt channel on my tube amp.  I put it in the FX loop & it boosted the signal alright but I didn't like it as much as in front of the amp boosting my OD pedals.This is one pedal that will stay on my board.  I doesn't take up much space, built to last and will make anything you throw before it sound better.  It does one job only but it does it so well!", "id": 643}, {"review": "First, let me tell you what this pedal can't do.  It won't do long delays.  So, if you're into the sound of The Edge from U2 or David Gilmour, look for something else.  Expect to shell out over a hundred dollars for a delay pedal with lots of knobs and switches that are more versatile.  But if you just need a slapback delay or just a touch of ambience, this pedal will not disappoint!  Analog delay pedals are known to have a warm tonal characteristic.  Users of MXR Carbon Copy swear by them.  But for around $30, the Rogue pedal will get you close, minus the longer delay time.  I've read in some guitar forums that these are the same as the Belcat and Modtone boxes.  The pedal itself looks sturdy, made out of metal.  Compared to my digital delay, the Rogue sounded warmer, although my other delay has a switch for \"echo\" that made it warmer too.  This pedal sounded good and I have no complaints.  I don't use a long delay time, in fact, I don't max it out.  I only use about 75-80 percent.  Before judging this pedal, please experiment on it's placement on your pedal board.  The user manual advises you to put it before the distortion but unfortunately, it doesn't sound good on my rig.  Placing after the distortion pedal sounded better.  However, everytime I use the dirt channel of my Traynor YCV40, the tone gets muddy.  Now it's in the effects loop just like my other delay.  The sound has better definition.  It might sound different on your amp but at least try placing it before the distortion, then after the distortion and finally, the effects loop in your amp.  Ultimately, you and your gear will have the last say.  Overall, a good deal for the price.  I'm thinking of setting up a smaller board of 4 inexpensive pedals for that grab and go situation where my big board will be too cumbersome.  And if anything goes wrong, I can easily replace the pedals (Joyo, Rogue, Mooer).  Play on!", "id": 725}, {"review": "Good:  Plenty of gain on hand.  Lots of sustain!This thing can get really loud.  It gives yourinexpensive tube amp that Marshall crunch.Built well, it's casing is made out of metal, not plastic.Inexpensive but performs and sounds just as well asboutique boxes costing 3 times as much.  If you're lookingfor your first cheap distortion pedal, forget the Boss DS-1 andget this one!  Well worth the money.Bad:  Adds a little noise & hiss specially to single coils (strats & teles).You might need to use a noise gate to tame the noise.Quieter with humbuckers but hums when I use it with my Xotic EP Booster whichI always keep on.  It doesn't happen when I boost my overdrives (OCD & Hardwire CM-2).If you move farther away from your amp, the hum disappears butyou can still hear some noise.  I guess this is typical for distortion boxes.No need to boost it though, it already has that thick & big sound to start with.It didn't come with a 9V battery as shipped, not a big deal 'cause I use a poweradapter anyway.", "id": 794}, {"review": "I don't play professionally so there is no need to buy expensive pedal tuners such as Hardwire HT-6, Polytune or Korg Pitchblack.  I researched for other alternatives and decided on a \"clip on\" tuner.  I narrowed it down to 3 - Korg AW2, Snark SN-1 & Intelli IMT-900.  All 3 have a lot of positive reviews and all of them are under $20.  I visited each manufacturers' website for more information and found out about the Snark SN-8.  Snark claims that it's their best tuner yet.  If their SN-1 can go toe to toe with the others, then I would assume that their best will do even better.  I took the plunge and ordered one.  I have only 2 requirements for a tuner:1.  It should be accurate.2.  It should be fast.The Snark SN-8 delivered on both counts and more!  It came with other extras like \"tap tempo metronome\", \"super tight tuning\", \"pitch calibration\", \"transpose features\" etc.  I may not have any use for all of them right now but it's nice to have them at your fingertips.  You can use it for other instruments as well but I only use it for my guitars.  The SN-8 is small & unobtrusive.  The display is bright and easily readable and can turn any which way you like.  After tuning, I turn it off and put it back in the guitar case.  I don't like it hanging in my guitar!  Of course, it doesn't stay long because it tunes fast!  For under $20, these little tuner is all you need.....fast and accurate.  Try it, you won't be disappointed.", "id": 811}, {"review": "If you don't like too much dirt in your tone, this might be the pedal for you.The Sweet Baby is a low gain overdrive pedal that is also on the bright side tonally.If you have a fairly clean single channel amp, it won't give you the full crunch or theextra sustain specially at low bedroom levels.  However, if you set your tube amp towhere it just starts to break up or is already cooking, step on this pedal and you'll be rewarded. If you like the sound of the dirt channel on your amp, set the gain low and boost it with this pedal. The notes ring clear with the extra bite, and brightness to cut thru the mix.......sweet! You can use it like a Tubescreamer although the Sweet Baby doesn't color your sound.  (No mid-hump)I use it to boost my Barber Direct Drive, OCD and the dirt channel on my amp.The pedal is housed in a metal casing and looks well made.  It's not noisy even when you stack it with other overdrives.  Instead of a tone knob, it has a \"focus knob\" which controls your picking dynamics and presence.  All the way to the left, the sound is smooth with a tone that sounds like you turned off the presence control on your amp.  All the way to the right, when you pick the strings hard, it gives you that bite as well as the brighter presence.  The pedal is very transparent, smooth and touch sensitive and cleans up well.You can't get a bad sound because there is not a lot of knobs to mess with.This pedal basically takes the sound of your amp, adds a little gain with very little compression and gives you picking control.  I just wish it had more gain so you can go from blues to hard driving rock with a twist of a knob.  At a fraction of the cost of the boutique pedal it was patterned after, it's a no brainer.", "id": 833}]