[{"review": "I bought this Capo for myWashburn D10. It works on my Orlando classical guitar as well. I wanted a capo that was simple to operate and wasn't too expensive - and the Kyser Quick Change Guitar Capo fits the bill nicely:[Update 7/25/10: My Orlando guitar was stolen. Boo Hoo!!!]- Easy On, Easy OffThe spring mechanism makes it easy to put the capo on or take it off.- Rubberized ClampsRubberized clamps helps prevent the Kyser from scratching or marring the neck and the frets.- ErgonomicThe arched arm with the weird-looking loopy looking thingy and the other straight arm help you to firmly grab on to them without slipping so you can easily and quickly remove or reposition the Kyser Capo.- DurableThe Kyser is made from durable aluminum.[Update 7/25/10] I've had this capo for almost 3 years and it's still working like a champ! (According to Amazon's Instant Order Update for moi, I got this capo on  November 22, 2007.)- The Same Capo Colbie Caillat Used in BubblyCheck out the music video! It's the same capo Colbie Caillat used inBubbly!---The Kyser Quick Change Guitar Capo is excellent! I don't think you can go wrong with this one!", "id": 26}, {"review": "I had for years been using Elixir Strings on myWashburn D10simply because I was accustomed to them and saw no sense in making a switch. I'm glad I tried out these D'Addario strings. These strings are an excellent complement to my Washburn, which has mellowed out over the years. They are a fair bit cheaper but has a tonal quality that rivals that of the Elixir strings. I can't speak to the manufacturers claim of \"4 times more life,\" but as of now, I'd have to say these strings are a fantastic value for your money. Highly recommended.", "id": 130}, {"review": "I already own aMighty Bright LED Book Light with one lighting head, but I bought this light as a semi-permanent fixture on myDocument/Book Holder, which is mounted on anarticulating arm(took a little DIY'ing).This music light has one drawback; it doesn't have a master switch. To turn on both lights, you would have to independently turn on the switch atop each light head (two switch presses). To turn off both lights, you would have to independently double-click each light head (four switch presses) -- the first press brings the light to a lower level and the second press turns it off (each light head has two light levels: bright and medium-bright -- for a total 4 illumination combinations).I use this light for music sheets, documents, and books. The &#34;mighty bright&#34; label is no misnomer to be sure; these lights ARE mighty bright. They provide more than enough illumination to make even smaller texts readable in low ambient light conditions. Each light head provides very even illumination for a letter size sheet (the light starts to get dimmer just beyond the fringes of the sheet), so two light heads will provide sufficient illumination for a good-sized area. It will simultaneously illuminate the verso and recto of even the largest books. The flexible goose necks of the music light allows you to easily position the lights to reduce glare (which is inevitable on glossy or semi-glossy pages).This music light is a mighty sweet deal because:(1) it comes with anAC Adapter(which doesn't come with the book light with a single lighting head and has to be purchased separately). The adapter works on both this music light and the book light with a single lighting head.(2) contrary to the product description, this music light DOES come with 3 AAA batteries (at least mine did).Important Note: If you switch from using batteries to using the AC Adapter, the 3 AAA batteries will first have to be removed from the battery housing or the light(s) won't power on.I picked this music light over theMighty Bright Orchestra Lightbecause:(1) I've had my single head book light for many years and I trust this book light to offer the same durability (both lights are indistinguishable save for the single/dual light heads)(2) two goose necks offer more lighting flexibility(3) this music light is about half the price of the orchestra light.---The Bottom Line: The lack of a master switch on this music light makes turning on/off the lights somewhat of a hassle (an unfortunate but tolerable drawback). All the same, this music light is very functional, and as far as durability is concerned, I'm quite confident that it will last me for many years to come (it has the same build quality as my Mighty Bright single-head book light, which I've had for many years). Recommended!", "id": 524}, {"review": "The Yamaha guitalele sounds absolutely beautiful. It's like a mini classical guitar, except the recommended tuning is A-D-G-C-E-A (A-D, followed by the standard G-C-E-A tuning on a 4-string Ukulele), but it can also be turned to E-A-D-G-B-E (standard tuning on a guitar).On the standard tuning for a guitar, however, the strings sound a little floppy. A reviewer suggested using an extra hard, high tension string like theD'Addario Extra Hard Tension Classical Guitar Stringsto get around the floppiness on the E-A-D-G-B-E turning. You can use a capo with this instrument. MyKyser Capoworks on it just fine.The guitalele measures 27-1/2\" x 9\" x 2-3/4\" at their widest points. The construction quality on my copy is tiptop except for a minute area (where the neck meets the soundboard), which is lighter in color because it missed an application of wood stain (not a big deal really). The guitalele has a satin (non-glossy) finish, which is a lot less prone to the unsightly scratches a high-gloss finish might incur.The package includes a black nylon gig bag.For a high quality instrument that costs a tiny fraction of the price for a full-size guitar, the Yamaha Guitalele GL-1 is a good buy (just under a Ninety as of this writing).", "id": 747}, {"review": "Right out of the box, the low E string had a buzz and the intonation was WAY off (fretted E note on the 12th fret too sharp). After the appropriate truss rod adjustments the buzz problem was solved. Next, I proceeded to adjust the intonation. I was able to get the intonation for the A, D, G, B, and high-E strings spot on. However, after bringing the saddle for the low E string as far back as it would go, the fretted E note on the 12th fret was still sharp.I also noticed that the bridge is slightly crooked (the low E string end of the bridge is closer to the neck than the high E string end of the bridge) - the bridge could have started out crooked or it could have shifted due to the high low-E string tension (loose bridge) -- which would definitely contribute to the defective low-E string intonation.I love the Red Burst design of this guitar (it looks absolutely WICKED). Unfortunately, I'm going to have to return it. I'm going to get a Squier Strat instead (with either aMapleorRosewoodneck).---[Update November 15, 2013]I ordered the Squier Strat direct from Amazon 6 weeks ago, but it was placed on backorder. I contacted Customer Service a week ago and was told me they wouldn't get it back in stock until December. Then, to my surprise, the Squier Strat was delivered yesterday! Yay!! :D The happiness!!I was able to get the Squier perfectly intonated. It's Red Burst like the Legacy (Fender calls it Antique Burst). It's a beautful guitar and and I'm loving it!", "id": 754}, {"review": "[Update 2013-09-24]Star Rating downgraded from 5 to 3 because the pick holder broke (a rather thin and fragile plastic flap that helps to wedge the pick in place broke off).The Planet Waves Capo trumps myKyserin both speed and ease of use. Its triple spring action provides the leverage needed for opening or closing it with much less effort, and it's every bit as well-built as the Kyser. It also has a couple of features that the Kyser lacks:(1) Integrated Pick HolderI'm always losing my picks (God knows how many picks I've run through), so the pick holder is a very, very handy feature!(2) Tension AdjustmentWith the capo attached to myWashburnat the lowest tension, my G-string would buzz. But at the maximum tension, this capo has a stronger grip than the Kyser, which makes for a buzz-free playing experience.---The Planet Waves Capo definitely gives the Kyser a run for its money. For years, the Kyser had been my favorite capo, but having found the Planet Waves, I find myself liking it more than my Kyser. If you prefer a quick-change capo (as opposed to aShubb-style capo), the Planet Waves Capo is well worth considering.", "id": 843}]