[{"review": "Although The cloth I got was black and not yellow just pointing that out. It works amazingly for my guitar now its like a mirror. I can see my reflection perfectly clear.", "id": 194}, {"review": "The fact of the price for this and the 18 cent shipping is pretty damn good Because I have 2 Silverstone SS-11's and a stratocaster and I took parts of of one ss-11 to fix the other then I bought these strings for it Fixed it up And now that guitar sounds better and less (Buzzy) than the strat Also pretty cool how it came with free picks which is nice becuase I lose them alot and one side of my thumb feels like a brick and the other side feels like a pillow Anyways great product nice little thank you note and free picks and REALLY cheap shipping I will buy more later to fix my other guitar when I get the bridge nuts replaced", "id": 226}, {"review": "Since they are light strings they are easier to press down and easier to bend which really helps me because I'm a beginner and don't have much Calais yet. Also I like the first day of new strings look Shiny! I would recommend this to any beginner.", "id": 227}, {"review": "I bought this with super saver shipping 5-8 days and it came in 3 so I was very happy about that. Also the lightning itself looks awesome and the black in the background is darker in person than in the (low quality) picture. One more thing is that the strap locks on very well by it self (I have a big problem with that because the strap that came with my guitar sucked) But hell this one is amazing. I bought this one for my black fender and I think I'm going to buy a white tribal for my white Ibanez Grg120bdx. Great product cant go wrong especially with the double sided design and the price.", "id": 273}, {"review": "I set this to free super saver shipping 5-8 days and it got here in three! Its very shiny looking and easy to see because there is a little thing where you can move to point the screen of it. Although my friend told me there is a way you can see the chords you are playing don't know how though. But all I bought it for was the purpose of tuning Mission accomplished. 5 stars for you!", "id": 861}, {"review": "Its not a very big capo like it looks in the picture and is sometimes hard to get on sometimes. but it does hold on to all strings so the job is done. the only problem I have with it is that I get the strings a little bent but that might just be me.", "id": 802}]