[{"review": "for the price of this winder/cutter its awesome, if it were made with a harder plastic would have been perfect!", "id": 94}, {"review": "It didn't naturally fit onto my Blue Yeti mic which is weird, since this IS a Blue mic and its supposedly universal but whatever i made it work. For 10 more dollars instead of the meshy pop filter you could have this one which looks and feels like it'll last a looong time! If the pop filter fit on right i would have gave 5 stars :x", "id": 200}, {"review": "now it doesn't work(same day i got it). In my control panel the mic is there but it doesn't pick up any sound. Followed all the instructions, emailed blue support and at first the person was quick to reply but now its been 3-4 days no answer. Maybe i'm being impatient but the mic only worked for a couple hours since i got it... If you guys know of any good alternatives please leave a comment.", "id": 644}, {"review": "Not too hard, not too soft. My friend gave me this pick and i missed it after using .36mm. Everyone has their own preference and i just didn't like the feel of those. I bought this 12 pack and they... Are... AWESOME!! I lost like 3 already but hey, there's more. I use them for my electric and acoustic guitar.", "id": 680}, {"review": "I bought the wrong pack(Was supposed to buy the light/medium pack) but its alright these picks let me try out a bunch of different gauges and materials to see what fit me best. My favorite pick out of this bunch was  the Dunlop Jazz 3 pick. It would be great if the item name was changed to like 'Dunlop 12 Med/Heavy pick variety pack' but that might be me being too picky.", "id": 773}, {"review": "Purchased this after owning a ernie ball polish cloth that was given to me. This cloth cleans up pretty well, but what i noticed after wiping down the strings a few times is that the fibers would hook. I dunno if they weren't meant to wipe the strings with but my ernie ball cloth is A LOT more durable than this cloth. They do the job but i believe that the ernie ball cloth does it better. Like a previous reviewer, i'm a little iffy about putting this cloth in the washer.Update: Putting it in the watcher was fine and idk why but after washing it for the first time it cleans up 1000000x better than before, i like this and my ernie ball cloth :)From 3 to 5 starts!!", "id": 184}]