[{"review": "This is a fun pick.  I play a lot with my fingers and thumb and thought I'd give this a try.  Its great!  I love the tone of this pick striking strings.  I love the way it transmits the feel of the strings.  More organic than plastic picks.  Yes it might crumble on you if you play too hard.  I think if you play as hard with this pick as you would with your thumb you'll be fine.  Its a lot of fun and for such a little price can open your playing to different tones for your instrument.  Worth a try.", "id": 244}, {"review": "I've owned several poor quality foot rests in the past and needed a new one.  This one exceeded my expectations and for the price is an excellent value.I'm 6'2 and weigh 225.  There are numerous adjustment angles that I can switch to and be comfortable and I'm not concerned about the legs bending.  The photo makes them look weaker than they are.", "id": 321}, {"review": "I bought this guitar in 2005.  It sounds and looks wonderful and manages to stay that way.  I think this is a good guitar and when you think that something that might sound better would cost three to four times as much it is a great guitar for the value.This model has the cedar top.  I love that sound vs the more typical spruce top on flattop guitars.  It is a bit more mellow and has a hint of a classical guitar tone because of that.  If you prefer the bright concert sound of a Martin then you'll not want this cedar top.Yes this guitar has an oiled finish.  This allows the soundboard to really sing unimpeded.  It also allows you to knock the heck out of it.  Funny thing is that after five years there isn't much damage just a little arm wear.  I think you'll like this guitar enough to not knock it around.The neck feels silky smooth.  The frets are well placed and don't stab you by hanging over the neck a little which is what you'll get in other guitars in this price range.  Paying to get the frets filed down is an additional expense on those competitors so beware when comparing.This doesn't come with a case so I bought a hard shell by the brand name \"Canadian\".  Great case.When I bought it it really didn't need an adjustment but I took it to a local shop to make it perfect for me.  I've also taken it in every other year for setting the action - checking and tweaking the neck - and getting the frets polished.  I also use a humidifier in its case during the winter months in Chicago.  Performing these tasks will prolong the life of your Seagull and your enjoyment of it.--------------------Update: 10/13/2012 update of my 2010 review.  This guitar sounds even BETTER.  I went to a handful of guitar stores looking for another acoustic \"just for fun\" and I had a few bucks burning a hole in my pocket.  To my surprise all the guitars three times its price sounded vastly inferior.  You see I learned that as you play a good wood guitar that over time it will \"open up\" and keep sounding better.  Yet another reason to keep it humidified and taken care of.  It will increase in value (to you at least).", "id": 432}, {"review": "I've tried the Fishman FT-1 and the Tune Tech ttm-201.  I like this one the best.It seems as accurate as my other tuners.  Like all clip on tuners there are \"sweet spots\" on the head that work better than others.  Oddly the Snark likes different spots from the Fishman or Tune Tech.  I tested the Snark against them, my Korg tuner and my Android App tuner.  The Snark was fine.The biggest plus I see on the Snark and the reason its my new \"go to\" tuner on the guitar is the large bright screen.  My vision isn't so great in dim light and the clarity and brightness is wonderful.  I don't have to guess or squint.It has a metronome which can be fun.  I personally don't use it because these hearing aid batteries are a bother so I don't want to waste the energy on a metronome and not have the tuning function work when I really need it.The only minus that I can possibly see is that the clamp is pretty fierce.  I don't have a custom made Brazilian rosewood guitar where the headstock could be marked by this thing.  If you do have something expensive check this clip out first to be sure you'll trust it.  If not then the Fishman is more your speed.", "id": 706}, {"review": "I bought this in 2012 to record music classes and workshops that I take in both acoustic / fingerstyle guitar as well as electric guitar, bass and percussion.  All of those environments are very different and require different approaches otherwise you'll wind up with only mumbling or with the sound blown out.  The DR-07MKII has worked well for over 100 classes recorded.This unit has been great for picking up the human voice about 20 feet away while it has been sitting on an extra tilted music stand.  With it set to auto level then I can take it to a loud percussion class or electric band class and it quickly adjusts itself to the environment.You can also set limits for clipping or set the levels manually.  I've needed to do that for classes that involved a lot of lectures but then bursts of high sound.  I was willing to let the bursts clip so that I didn't miss the human speaking around them.One little feature that I now love is the fact that you can preset the file names and it uses them followed by a number to create next file.  I set them for certain venues that take classes or even a class name if I know that I'm going to be taking only that class for a few weeks.  This makes it easy to copy to my PC and keep organized.", "id": 755}, {"review": "Mine came flattened in a little box.  I wasn't happy that its form was deformed.  Well in a few days it popped back into shape so I didn't have to ship it back.  A good sign!I am using it for both some music and computer stuff.  The bag is well made considering its price.  You cannot even get a backpack for this price.  I love its depth.  A number of these types of bags are too shallow so the zipper is about to burst once loaded.  This is a solid 4\"+ depth and cozy padding around it for protection.  Be sure to check out all the dimensions though.  Its very long - I was a bit surprised but that was me misreading it.  I think I saw \"micro\" and thought shorter.Not only is this a great music tote but also a decent computer / electronic or other tool tote for equipment that is wider than a brief bag or backpack.  I'm thinking of getting another because of this.The only minus is that I wish the outside pocket was a little larger and maybe had an inside pocket or folder / paper slot.  But these are just wish list items.  Finding padded bags this size is a pain so if you need this your options are limited.  Lucky this is a good option.", "id": 165}, {"review": "This is a very good nicely wide guitar strap.  Its weathered look is exactly what I was looking for.  Its a nice solid piece of leather that looks like it will last decades.  That is what I wanted but that is also why I got it weathered - to speed up about 5 years of personality.  I'm not sure how you would wear it out really.  Its buttery soft and doesn't have a strange fabric suede backing so it won't muck up your clothes, pill or crumble.The only minus is that its a standard 53 inches though the description says its \"long\".  Pretty standard vs all other straps.I paired this with my reissue Fender Telecaster Thinline in natural.  It looks wonderful.  I can barely feel the weight of the guitar wearing it.-------------Update: Since I got the strap as a Christmas gift I've worn it to class and jam sessions.  I started getting nice compliments about the guitar.  Thought the guitar IS beautiful I've had it for a while.  I think this strap is like a fine piece of jewelry accenting the guitar!  Beauty and Function.", "id": 253}]