[{"review": "I have absolutely no gripes with Elixir nanoweb phosphor bronze strings. I have been using them since the first appeared on the scene and have become my go-to brand. I've read many reviews where some people complain of sting breakage. I have yet to ever break an Elixir acoustic guitar string (in over 10 years of playing them). Can't even imagine. The only other coated string that may be a little better is Clear Tone--but I have had inconsistencies with them and because they cost more, I just go with Elixir and am never disappointed. I'm not a fan of the \"Polyweb\" which has a much more visible thick coating. The nano-webs get it right--they last a long time, sound great, and as far as I know don't flake polymer dust in your kisser.", "id": 297}, {"review": "This amp sounds great, looks great, works great and is a breath of fresh air from &#34;modelling&#34; amps or ones with many effects that require regular use of a manual to cycle through. This Behringer has a dial offering four effects styles with five &#34;flavor&#34; settings in each. They are all on one dial and there is no pushing, pullling or holding for seconds for lights to tell you you've switched gears. Here you just turn the dial one little click at a time to find a sound out of the twenty. There is a simple level knob for the intensity of the effect and the great thing is that a foot switch is included where you just stomp on a button to invoke your effects or return to clean acoustic guitar. The foot switch has a second button for the other channel which can accommodate another guitar, microphone for singing, drum machine. The EQ sliders are quality and give you a nice reference from a distance whereas if the were knobs you'd have to be right up on them to see how they are set. I've had no problem with the front cover as a few others have mentioned--it's velcroed on there just fine. The cabinet is covered in a nice brown leather-like material. Plenty loud.", "id": 389}, {"review": "Unlike those who have complained that they dry out fast, I have always gotten much longer life out of them than the product promises. What I can't tell you is how well they actually meet humidity ideals because I've never monitored the humidity in the case to see what it is and if it is on par with what the manufacturer says. I have taken it pretty much on faith that they deliver what they say and they have read some endorsements by people like Bob Taylor of Taylor guitars that they work. Bob has too good a name and no incentive that I know of to be frivolous about endorsing such a product that might not work, so, I take it that Taylor had his lab people check them out thoroughly to be sure of Humidipaks effectiveness before Mr. Taylor would give them an endorsement. That was good enough to sell me. But I didn't just buy it because Bob Taylor says they work--they occupy a very cool niche which I was hping someone would fill. Planet Waves Humidipaks are for the person who is willing to spend a little extra to not to have to keep fiddling around with water, sponges, gauges and those Oasis water bag and just have something that you can dispose of and replace every so often. That's what I want. Sure, water is free. But it evaporates fast and it's a job to keep having to take care of. So, is it worth it to buy a disposable thing like this that you don't have to mess with? Or do you want to save $15 or so by doing all that work wetting sponges and whatnot weekly? I'll gladly pay the extra few bucks not to have to worry about hydrating my guitars and cases but once avery 6 months.None of my guitars have shown any signs of humidity issues and I have lived in New York City and Virginia Beach in the years since I've been using the Planet Waves Humidipaks. One accolade that I will give Planet Waves is that they did recall the product a few years back and promised replacements when the new model which resolved a potential leakage problem was released. That re-release seemed to drag on for a while and when I contacted Planet Waves to gripe, they sent me a check for the \"list\" price of all the units I had returned to them. Well the list price was three times the retail price at the time and that was a bit of a minor windfall at the time for me which impressed the heck out of me and I used the money to buy their other humidity products in the interim to humidify my guitars. But when the Humidipaks were available again they sent me replacements ANYWAY. That was really being treated well by Planet Waves and I have never used anything else but Humidipaks since. Humidipaks give me peace of mind that my guitars are being humidified and I'm more than satisfied with how long the paks last.", "id": 406}, {"review": "Unit is sturdy. Lots of good presets and capabilities. Works with down-loadable X-Edit software. That gets confusing a bit because the unit displays one thing, the computer screen another. I haven't mastered it yet and after a month am just knocking about and settling on sounds that are acceptable but far from ideal. I've see much easier software that puts all effects on screen as stomp box graphics and you build a sound. With the X-Edit you call up a canned sound and start changing it. The interface does not match the RP 255 and has a lot more provisions. The thing is, they get to be a bit overwhelming, at least to me. I got this for Christmas and would shop around a lot more. Perhaps I wind up choosing this but so far, eh. For one thing, plugging headphones into it, the output isn't as loud as I'd like. I kinda demands output to another device/mixer/amp if you want to play loud.", "id": 590}, {"review": "Fender springs. You'll need a pliers or needle nose to grab and stretch them to reach the hole. There's too much tension to do it with your fingers. My American Special Strat came with 3 springs and now has the five. I find it stays in tune like a &#34;instrument&#34; should now.", "id": 676}, {"review": "Perhaps it may do something of worth for you but if you have one of the finer made guitars this will probably do more to subtract than add to the sound. Be advised that I did not use it in front of a microphone where perhaps the shape of this internal plastic cone might do something you like in directing the sound to a mike. As strictly an issue of natural acoustics, I found it deflected sound in a way that seemed to decrease my guitar's output and resonance. I have an Aria AD-80 which is a very well-made Chinese attempt at cloning a Martin D-42. It can not compete with the real Martin but for the money I paid it was a great buy and it is known as a \"sound canon\" for it's great natural volume. Adding the O-Port deadened the lows. It just didn't provide any plus at all anywhere else. It is however pretty inexpensive so if you're a nut for nuance and you want to try it for yourself it's not going to break your bank. But again, if you have one of the better makes of guitar where a real person \"voiced it\" in his or her manufacturing process, this plastic gizmo will likely subtract from that and not add anything. I'm an acoustic nut and I'd love to have a sound port in the side of my guitar to hear everything that goes on inside that box. The O-port seemed to \"corral\" the sound and shoot it out that plastic horn not allowing me to hear some of the resonance of the sound bouncing back off the back and sides below the sound hole. Sorry to be a crab about it--I like Planet Waves stuff and they were very good to me personally in the \"Humidipak\" recall a few years back. But this product was a waste to me.", "id": 704}, {"review": "These strings are so soft to the touch that they almost feel like \"flat-wound\" acoustic guitar strings. When you uncoil them out of the wrapper they don't spring out like most other strings but sort of flop out like a string string instead of a wire wrapped in wire. They sound wonderful but I swear the feel easier to play and I was doing things with them I usually am pretty clumsy at with my mitts. They won't last as long as coateds of course but they have a depth and a character all their own worth checking out and you may find, like me, that it's worth going back to changing them out every few weeks to get the fresh sound. If you're really an acoustic guitar aficionado, you'll want to try these. The almost play themselves IMO. And that makes me want to play twice as long.", "id": 613}]