[{"review": "This plug works very well.  I like the right angle connectors.  I have a Korg Pitchblack plus that can act as a powersource for other pedals.  It included a multi-plug cable, but not a right angle one.  The connectors kind of stuck out and got in the way on my pedalboard.  This works much better.", "id": 192}, {"review": "I typically use dimarzio cliplocks on all my basses and electric guitars. they work very well for my needs.  however, I bought a junker bass for outdoor gigs and to play at places where i don't care what happens to the gear.  This strap is perfect for those needs. A nice nylon and the lock works wellBUTthe locking portion might be a little thick for some strap buttons. It works on the bass i use it on, but not my Gibson SG, so be aware. I would buy more of these if i needed a cheap strap.", "id": 208}, {"review": "I keep an acoustic out on a stand in my office to keep handy for when inspiration strikes.  I used d'addarios for many years. I switched to these and their longevity is drastically more noticeable.  they sound great too. The added expense is more than made up for by the extra long life afforded by the coating.", "id": 295}, {"review": "The tuner is great  -  seems very accurate and senses all the notes with ease. my only complaint is the little kickstand on the back, doesn't hold it at an angle that i find very usable.  otherwise? a fine product that i expect to last for years. korg makes great tuners. i also have a pitchblack and a pitchblack plus. if any of the three of them were to ever be lost or stolen, i'd replace them in a heartbeat with exactly the same models.", "id": 330}, {"review": "These are very sturdy cables and really work well on my pedalboard. I expect them to last for a long time", "id": 578}, {"review": "I've been nothing but pleased with this pedal so far. I use it boost my jazz bass to the same volume level as my precision.  It does the job perfectly.  The LED is REALLY bright, which for me is a good thing, but others might find distracting.  Also, it would convenient if there were external switches instead of internal dip switches for varying the settings, but in such a small footprint, there are bound to be tradeoffs. I'd buy this again for sure.", "id": 643}, {"review": "I bought this hoping it would be a no-frills looper and that's what I got.  It sounds great and the level adjustment works really well.  I can layer even as many as 10 or 12 layers and hear every one without problem.  I give this five stars, but I have two minor quibbles that in my mind don't take away from the rating but might be important to some:1) there is no included power supply.  If it doesn't take batteries, that's fine, but give me an adapter.  This thing was over a hundred dollars. Don't force me to buy an accessory just to power it up.2) Personally I wish there was an option to remove layers in the order they were added (not just removing the last layer, or all the layers).  I'd like to be able to build up a song with layer on top of layer- moving to a crescendo - and then back off the layers one at a time, eventually returning to a single layer.  I played a solo at church with this thing and the congregation loved it.  I started with one part, and then added layer after layer until I had a really big intricate sound.  It would have been nice to be able to then take it back down to a single part and then quietly end the song.This is a wonderful little looper.  You won't be disappointed.", "id": 869}, {"review": "I am really liking the size of this board. I have a Line6 G50 wireless, Korg Pitchblack+, Xotic EP booster and Xotic SP compressor and they all fit very nicely. The board itself is very sturdy steel with good welds and nice straight angles. The case is also really well made- good zippers and stitching.  I'd buy this again in a heartbeat.", "id": 588}]