[{"review": "I've needed one of these for my fender amp, yes I used to spend time dialing in the delay pedal for the rockabilly/blues numbers and if my settings got messed up, well, that would slow the show down. I wish my fender amp had this built into the amp but it didn't. This pedal makes playing rockabilly on my fender simple fast and easy. Really quick to setup and use. It's not a delay unit, it's not versatile either, but what it does, it does perfect!", "id": 315}, {"review": "How many times did I tweak a chorus pedal for hours and in the end decided I didn't need chorus at all. This pedal is not like that, not much to tweak but the chorus is great. Sweetens my cleans, makes the blues sound groovy and fattens the power chords. I even like it with the bass. Just a great chorus with not much to tweak.", "id": 319}, {"review": "Depending on the amp and guitar you have, this pedal is going to either really be great or be a bummer. It sounds terrific with my fender strat (single coil) Danelectro (lipstick pickups) on my solid state amps, giving them a warm tube like overdrive.It sounds terrible on my tube amp and my vintage silvertone amp, it really sounds aweful with my 1980's Kramer, loaded with humbucker pickups.You'll either love it or hate it! That will decide mostly on the type of guitar and amp you use, it's a different pedal with every combination.", "id": 355}, {"review": "I was amazed how much better this stand was then the one I had just bought at Guitar Center for the same price. I thought they would be the same but they were not. This stand is built much better.", "id": 519}, {"review": "It looks nice, it's really really long and it's made strong but you could also use it for slicing skin and maybe a whip. After throwing it into the washing machine 3x with lots of softener, rubbing it with lard, dirt and baby powder, then soaking it over night. It's finally soft and I could play naked without slicing off my head!  So buy it and prepare to really abuse it for a few days to soften it up!", "id": 657}]