[{"review": "I am in agreement with others that state this is a must-have. I battled with fret noise on recordings and fingers dragging on the fingerboard. This really lowers the friction and makes for a much more playable instrument and supposedly protects the wood. I've used it on the back of the neck as well and it helps as much as on the fingerboard. I rub the entire neck down before and after I play. It makes the guitar smell like it came right from the shop, which I suspect is what they must've been using all these years and never told me, though I never did ask...foolish me. Since I've recently gotten into doing my own setups, where I've read many forums and posters have recommended this and I figured what the heck, it's less than $5.", "id": 72}, {"review": "It didn't seem like slight difference in shape would make it almost useless. It may work well with Dunlop picks but not for thePlanet Waves 10 Standard Guitar Picks - Duralin Blue ###GT!!! Medium/Heavy, also the thicker the pick, the fewer it will hold. It has sticky back foam tape on it for mounting to a surface like your amp or whatnot. I've found it mostly not useful thus far, maybe it would help more when playing live so I can grab for a pick and know they will be there.", "id": 167}, {"review": "I know most budget guitars don't come with cases, most not even a gig bag anymore. That's the trade-off I guess in the internet age in order to keep costs down. Even my Fender Standard Telecaster came sans-case and I had to coax the salesperson to throw in a gig-bag as an incentive but even that was back in the day. I had not looked at guitar gear in so long that I didn't think about guitar cases until I got the itch to get a new six-string and came across these. They look great, seem well built(I am not a professional touring musician) and apparently do the job.The exterior is covered in black tolex, just like a pricey case, and the gold stitching and plush interior really make this case seem worth much more than the asking price. The storage compartment is adequately sized and there's a simple lock that would only be functional as a safety measure to ensure it stays latched. There are brass feet on the bottom and along the edge to keep it level and prevent damage to the case. It fits both my MiM Tele andSquier by Fender Deluxe Stratocaster Maple Neck, Pearl White Metallicperfectly and I suspect it will do a fine job protecting them.I will be picking up a tweed version for the Telecaster to match up with the style, and my lovely Fender amp. Like I stated, there's no longer any excuse for not having a good guitar case.", "id": 324}, {"review": "I've never been much of an effect pedal guy; lots of batteries and cables when I can just get a good tone direct into my Fender tweed. I've recently conceded to using more effects and have gone, quite frankly, hog wild on new gear. This is the best of the pedal purchases I have made so far, it's not quite the MXR sound I was going for but there's definitely something here. The boost works very well for lead work and really ups the sustain on my Strat.Just two controls, one for volume, one for compression. My only concern is that the knobs feel like they could be much more sturdy, I haven't pulled them off yet but I would guess the pots have plastic posts as opposed to metal ones.", "id": 454}, {"review": "I've been trying out different picks for a few weeks now looking for the perfect one for hybrid picking. So far this is the one and I think my search is actually over. I've tried theJim Dunlop 427P3 Dun Ultex Jazz Iii Ply Pkand that was close but this is the one. These Davas have a great feel in my bigger fingers, doesn't slip around at all and is very sharp and fast on alternate and hybrid picking. Pick noise has also been reduced because there is much less friction than with most others; the notes ring out very clearly even on fast runs.", "id": 580}, {"review": "But dont let that deter you. That just means it will break-in that much more quickly. My favorite strap is not padded in any way, like this strap, but a little wider. I use this on a Telecaster and it looks nice and matches well with the color scheme of the guitar. I hooked a couple4pcs Round Head Strap Locks Black for Guitar Schaller-styleon it and away we went. The strap is made in Canada from decent quality leather(not bonded) and the gold Fender logo is understated, yet classy. It's a classic strap from Fender. What else is there to say?", "id": 632}, {"review": "While not as soft and supple as suede straps, I am pretty sure this solid little strap will break in fairly well. The button holes were a little tight, but thats not a bad thing. It is definitely longer than a normal strap by a few inches and it smells nice to boot. It is fairly thin but that should help it break in quicker. All-in-all it's a good strap for the money, which wasn't much.", "id": 659}, {"review": "I have always hated tuners; I would rather use tuning fork on the A string and go from there. Most tuners are too cumbersome and require large batteries or external power(pedals). In addition I couldn't use those on my acoustics. Snark solves all of these problems. The display is colorful and easy to read and hides neatly behind the headstock. There is also a visual tap metronome that shows a beating heart in sync with the tempo. I can easily move it from electric to acoutic, and Amazon's pricing is so low I am considering getting one for each of my guitars. This is one of the few 5 star ratings I've given any product on Amazon and I rate a lot.", "id": 706}, {"review": "really you hate warm, sustaining, natural-tube overdrive; you won't like it at all. This is my favorite OD pedal that I have. I have compared it to the Vox ValveTone OD, the OD side of a EHX Germanium4 BMP, a EHX Linear Power Boost(my second favorite), an Ibanez TS5(90s model) and a Boss Fender Bassman FBM-1. They all have their uses but I find the MojoMojo to be the most versatile, warm and punchy OD I have. I pretty much use it as my base tone to push a lightly crunchy tube amp into overdrive. This thing really wants to sing to you. There are so many things going on in the mid to upper registers. That's not to say it doesn't have some serious punchiness on the low end, which it does; so much that there is a voice switch that will cut the bass a little to keep it from getting too flubby on the neck pickups. I pretty much leave that on all the time with humbuckers. Single coils really benefit from the round lows this pedal dishes out and I am guessing that's why there is the voice switch.The knobs/pots are nice and the bass/treble pots are notched at 12. Turning to the left cuts and to the right boosts. The drive goes from really clean and subtle, like a  mild boost, up to super drive territory. I actually prefer the sound of this pedal to a Fulltone OCD, it just sounds a little more livelier to me. I really like to push this pedal into the Fender Bassman pedal and get some seriously chimey bell-like highs with a medium crunch by setting it to a mild boost level and upping the gain on the FBM-1, as a third channel of sorts, and it sounds like a totally different amp stack.Like I said, this has become the base of my tone now in just the short amount of time I have had it. I was using the EHX Linear Boost to perform these duties before, and it performs well, but the soulful tone I get from the MojoMojo just adds the extra dimensionality that the pure boost doesn't. I play mostly original compositions but I am going for the Jeff Beck tone and this helps me get where I want to go.Of course none of this means I will stop buying OD pedals... |o)", "id": 749}, {"review": "It does the job though. I wasn't impressed by the lack of range, but then again I've never found a use for the more extreme settings on a phaser anyways. It seems that this unit keeps the effect within a safe and comfortable range and that's okay with me.", "id": 498}, {"review": "I was unaware when I originally purchased these that there was a threaded mic mount on the back extension pole. I already had a couple 13\" posi-lok boom arms that I popped on them and was able to reclaim two floor mic stands and save a little bit more floor space. They are fairly well constructed for the price and fit perfectly in my small home studio. The mics are now perfectly positioned and dont get kicked around anymore.", "id": 653}, {"review": "I much prefer curly cable as they keep the slack up off the floor and help prevent nasty little tumbles and equipment spills due to general clumsiness. These cables are no different. They may not be the nicest looking cables ever, but for this price you can't shake a stick at it.The connectors are injection molded so theres no easy unscrew and re-solder when the time comes, but hey for a budget curly cable I am not complaining. I'll just nip the ends off if I need to replace them later. The cable seems to be of good quality; I'm guessing it's about 24 gauge wire and has a nice bounciness to it. I have not yet noticed any degradation of tone so it's probably fairly well-shielded. With the right-angled jack on one end it ensures a low profile so I don't easily kick the cable out of the pedal and will probably help it last longer with the reduced cable strain on that end. That's more than I thought I had to say about a cheap, but good, cable.", "id": 709}]