[{"review": "Okay mine has just arrived.. So first of all I want to say packaging is great!!..I have just put it on my guitar and I have to say that I am impressed!!... the sound is so warm and bright. I have a nanoweb before, and so far the EXP16 is better...  I will stay on with the EXP16 right now!!..Great quality string...", "id": 130}, {"review": "well.. First of all, I am a beginner.. I do not know anything about guitar... I saw that some people complain about the corroded strings and buzzing frets... Mine came yesterday and I am afraid that it would have issue, so I brought it to school and let my professor checked for me.. It surprised me because mine does not have any issue at all.. The string does not corroded, but I changed mine anyway. The fret does not have any issue at all.. and the Truss rod adjustment is perfect.. The action is low and the guitar structure is perfect. When my professor starts playing it, he was surprised by the sound it produced. He thought the guitar cost $300 above!!... He also bought one this morning...haha...anyways, I buy it from amazon and the packaging is great!!...My guitar comes in a perfect condition, and I strongly recommended this guitar for anybody!!...", "id": 183}, {"review": "I have just receive mine just now.. It was awesome...I never thought that it would be so solid... It is made with steel and covered with rubber on the very edge.. Can't beat the price... I would recommend this to anybody who are looking for a guitar stand!!.. A+++", "id": 258}, {"review": "I did a lot of research and I finally found the right capo.. It is a little bit pricey, but you get what you pay for...It is made from a very good material and I have been using this for years!!..There are some others capo that are less expensive, but most of them are built with plastic and some will hurt your guitar.. This capo is made with stainless steel and you can adjust the tension.. I like this and I highly recommend this capo to any guitar players regardless of their level. Good Luck.", "id": 541}, {"review": "Okay.. I used to tune my guitar online.... However, adding a $10 for this item is worth it... It is so accurate and works great so far... I saw that some people complaint that the tuner comes without a battery, but mine come with one... Probably it is because I bought it from amazon &lt; not from some sort of seller in amazon> ... Moreover, there's also a warranty for this item... For those who want to start playing a guitar like me, I strongly recommend to get this tuner!!... You won't regret!!..Owyea..", "id": 706}]