[{"review": "I'm a bassist, and am familiar with the flat/round/half-round debate on BASSES (I prefer flats). Anyway, my son wanted these for his Epiphone Casino because he heard John Lennon used (a different brand of) flat-wounds. They sound AMAZING! They make that Casino ring like a carillon, yet will get &#34;down & dirty&#34; when called for. A VERY &#34;different&#34; sound range than round wounds. In fact, it's about time to order another set or three....", "id": 259}, {"review": "It's a guitar strap. It holds up the guitar. Using it on an acoustic dreadnought and it's plenty long enough.", "id": 285}, {"review": "Bought as a gift for my son, and he's very pleased with it. What can you say? It's a guitar strap, it does the job, and looks good. And $20 for a Levy's Leather strap is a good deal. I got the gold, and it's good-looking without being garish.", "id": 286}, {"review": "I'm just getting into miking and recording music, mainly to get my son off to a good start. I'm kind of feeling my way. When I wasn't getting a good result from a dynamic mic, a friend suggested a pre-amp and/or a condenser mike. I ended up getting both (the AMP tube pre-amp) and running this through the AMP into my Tascam DP-008. WOW! I have to work on getting the levels matched properly, but this thing is just SO much cleaner than the dynamic mics when used on an acoustic guitar. Our music sessions have slowed down a bit (he just turned 16, so hanging with the Old Man is the LAST thing on his mind, LOL), but this is a quality piece of equipment that seems durable. Includes a nice hard plastic carry-case, too. For this kind of money, you can't really go wrong.", "id": 327}, {"review": "Well, that's overstating it a little, but several people told me I wouldn't like FW strings on my bass. I wanted to try them to get closer to an earlier electric bass sound, smoother and more mellow. I considered RWs to be way too bright on my guitar. So I put these on my 1978 MusicMan Sting-Ray bass. I only have a little Peavey practice amp, which may account for how bright these still sound. But I love them. I have to dial the active EQ treble control all the way down, this is just a bright-sounding bass! But I wanted more of a stand-up doghouse bass sound, like early basses had. I have a low-level Hofner violin bass, also with FWs on it (it shipped with RWs,what were they thinking???), but I loves me my MusicMan. And I love the sound of these strings. Oddly, a smidgen of the wrap extends below the nut, but it doesn't seem to affect the sound. As soon as I get a REAL amp, I expect these to completely satisfy. And they WILL pop, but then again, this is an awesome bass, made during Leo's time with MM. But if you want that real \"vintage\" sound, these are pretty damn good. Lack of a good amp, and not knowing how long they'll last is why I gave them 4 stars. Otherwise, 5 star all the way.", "id": 407}, {"review": "This was a bit hard to install; over or under the strings? We tried both. Over the strings, it would slide below the nut, which isn't good. Under the strings, and it muffled a few. So we kind of WOVE it, above some and under others. Other than that, it works fine, holds the strap with no problems. And it puts the name &#34;Martin&#34; on the lowliest box guitar ;). In hindsight, I'd have probably just got a strap button and mounted it to the base of the neck. But if you don't want to do that, and hate the &#34;lace&#34; approach, this will do the trick. It may even fit better on different guitars, ours is a 50 year-old Norma (that actually sound AMAZING considering its origins; guess old wood just SOUNDS better). And the price is VERY right to be able to claim you own &#34;A&#34; Martin, lol.", "id": 568}, {"review": "I ordered these as my first mic cords for a pair of dynamic mics I recently bought. They are very flexible, easy to handle, and of good quality. Even though the jacket material is flexible, it seems strong, and I have no fear of it tearing. The ends are sturdy metal, and they include a pair of velcro straps to keep the unused length (if any) under control. I am very satisfied with these cords, and would highly recommend them.", "id": 692}, {"review": "This stand folds into a pretty small package, but supports the guitar very solidly. You would almost have to INTENTIONALLY knock it over, I don't think a casual bump would do it. The only complaint I would have is that the guitar leans back a bit far. My other stands are pretty standard, with a vertical riser to support the neck, and I'm used to a more upright stance. Maybe that's just a matter of taste, but otherwise this is a great stand.", "id": 92}, {"review": "Works just fine for the Tascam DP-008 I also bought through Amazon, and saves a lot of batteries. What else can you say? It works.", "id": 461}]