[{"review": "I purchased three of these (three different colors) to make a mini-snake for my keyboard to their Di's.  I typically used Mogami 2524/Neutrik, but need cakes while in the road (I usually roll my own to exact length).  These have worked well, quiet, no handling noise, seem well built (I treat cables well, so I don't really test them with under tough circumstances) and hopefully will remain in their spot for the foreseeable future.  They are used 6 nights a week, and after 50 uses, no problems.  I recommend them (plus, for live, the fabric cables in different colors are great for easily identifying which is which for a road crew member who might not know audio well.).  Nice pieces...", "id": 47}, {"review": "Ive had good success with this piece.  I use it with a straight mic stand topped with a Shure Super 55 for vocals.  I put a Heil Fin on the boom arm to mic my tenor sax.  The arm allows for a variety of positions, and serves to eliminate a second stand just for the horn mic.  My only (small) &#34;concern&#34; is the length of the arm itself.  If it was a bit shorter, or adjustable, it would help offset the (potential) balance issue created from having a mic hang that far off the stand.  In my case,  I am using a heavy microphone, so I didn't rate down the product for this reason (as I know Im pushing the issue).  I doubt that if someone was attaching a lighter microphone to the arm, it would be a issue.  That said, it's a great way to get rid of a second unnecessary stand cluttering up your stage.  We ended up buying a total 4 for our stage and freed up a ton of floor space.  A highly recommended piece.", "id": 143}, {"review": "I am a professional musician, keyboard player, and keyboard collector (mostly vintage poly analog, but also a ton of mono phonics, modulars, and built your own kit units (shrugging, ambik-) etc - not that that has a lot to do with a pedal, however, I do live the life of a person surrounded by keyboard instruments that I use to make my living.  have purchased every brand and style of pedal (for the purpose of this, we'll stick with sustain.).Compared to other units, it is heavier than most and I find the point where sustain engages to be just about right comparing electronic to acoustic.  It is just an on/off switch, so no half modeling here,The only reason I gave this unit 4 stars instead of 5 is because Yamaha decided not to include a polarity switch and alienate perhaps 20% of the market who will get home and , if they hadn't thought to check, may be stuck wi a pedal that sustains when not being used and stops sustaining when pressed.  A backward sustain pedal is not fun.  Many manufacturers include a simple polarity reverse  switch that would eliminate that potential headache.These days, most keyboards have the option to switch polarity internally either thru a global bemusement or by sensing whether the pedal is engaged at startup and adjusting accordingly (never press the sustain pedal while turning your keyboard on, you may very well cause an issue you don't expect and are confused by - turning on and off again without the pedal depressed will clear everything up in those cases.)So - build quality, excellent.  Durability - excellent (I've had a bunch of cheaper pedals - used on stage - break  at the switch point or at the jack), this Yamaha endures.  Design - some older pedals used to have a flip out rubber footrest that was supposed to make the pedal more secure- I don't see that much anymore, but, so long as you aren't on glossy hardwood, this will stay I place with no issue.I've read a few reviews that give this pedal a bad rating because of what appears to be a change in a global setting on a keyboard, or something similar,  All a sustain pedal consist of is a momentary contact switch, engaged when contact is made by depressing and completing the circuit, and disengaged when the pedal is released.  There are no electronics - so - if it doesn't work, there are three points to look at 1) unscrew the jack and be sure that the wires coming from the pedal are all  connected to the metal posts inside the housing. There are usually two wires of differing color.  if one is disconnected, the pedal will cease to function (and, in rare instances, cause the keyboard to sustain all notes indefinitely.  This is easily corrected with a soldering iron and a bit if solder - jacks are points of strain so it isn't inconceivable that a wire could come disconnected. 2) The switch itself it either out if adjustment or is damaged.  The switches in the Yamaha pedals are of good quality and unless you received a faulty part, would be unlikely to wear out with normal use. I have, however, needed to take the pedal apart and made an adjustment.  this was easy and a quick fix, even with limited tools.  The third option is 3) the keyboard has had a change in a global setting causing the pedal t operate in reverse.  This can be corrected by consulting your owners manual and reading whether your keyboard has a software polarity &#34;switch&#34;, if it senses on startup, or if you pedal simply stopped working altogether - doing nothing At all - it is #1 or 2 or a problem with the jack on the keyboard (HIGHLY unlikely,,but I've seen it happen.). Hopefully this helps some who have posted questions.To conclude - a nice pedal for the money, much better build than the m-audio (decent, just not as nice as the Yamaha - certainly not a bad unit)/on stage (if they can't get most of their mic stands right, I don't trust them with even basic electronics...) or generics.", "id": 147}, {"review": "I have a crowded rig already and the las thing I wanted was another mic stand.  I already have a straight stand with a Shure SH55 mounted on it as a talkback to call tunes to my band members.  I wanted to eliminate my wireless sax mic, as I was using it infrequently, and decided to mount a Heil Fin on this extension arm on the same stand as the talkback.  Nice and stable - no issues - works perfectly.", "id": 246}, {"review": "a well built pedal of good quality, with enough weight to keep the body stable, and a good &#34;middle of the travel&#34; execution point for sustain.  With the correct keyboard, the pedal will also allow for half pedaling.**very important to someone who has keyboards from multiple manufacturers, especially older models; this pedal does has a switch to allow for polarity adjustment (for most newer keyboards this doesn't matter, as polarity can be edited globally, or, alternatively, polarity is sensed on startup so long as the pedal is plugged in)  Some other pedals, particularly those from name manufacturers, will only work with some keyboards.  That said, I feel this M-audio compares favorably to it's most visible competition, Yamaha's FC4 offering.  The Yamaha pedal is a bit heavier, which I do like and subjectively implies better quality, but, in reality, the Yamaha did not last under the same circumstances, breaking down and needing a spot repair after a year on the road.  Last,  the Yamaha FC4 does not have the half pedaling option or polarity switch, making this M-audio pedal a great all around option.In my case, this pedal has been on the live stage, unpacked and packed, tossed around a fair bit, for 2 1/2 years with no problems.", "id": 251}, {"review": "These great little accessories are a nice convenience.  The allow a singer to remove the mic from the stand without the normal loud pop from removing it from a wireless clip.  This particular model adds a feature that locks the microphone in the desired position (older models would swivel without much effort).  Bought 6 to replace to older models I had on stage.  They've worked out great: the mics all stay in position when popped on the straight stands, no spinning.  Copasetic.", "id": 271}, {"review": "i bought this cable in an emergency situation - one where I was on the road, needed a great cable, and didn't have access to roll my own using, what would've been, essentially the same parts.  I exclusively use canare and mogami in the studio, and in critical places of my live setup.  The cable itself is top shelf, quiet, and will provide years of use if you treat it even with modest respect.  As an instrument cable, this could possibly  be a little short if you move around a bunch, making it worth it to go for the 18' cable as a bass or guitar player if you don't like being tied down.  I used this as part of a keyboard rig, where it was perfect on all levels - quality reproduction of sound across the entire spectrum (the highs were crystal, the bass clear), connection is solid (I am not a gold fanatic, but these are excellent), great warranty, and a reputation that holds value.  (These are real deal pro cables, as opposed to some cables priced similarly that have a monster price, but not necessarily a superior build or sound, which is why I didn't walk into guitar center and buy a pair of monster 1000's and waited for these to be delivered overnight instead,,,)", "id": 493}, {"review": "A nice work mat of adequate size that provides a nice non-static covering for the bench.  Grey color makes it easy to easy to see small parts, etc, as opposed to some black mats where black objects are hard to differentiate.", "id": 705}, {"review": "The title says it best, it's a decent basic mic cable.  It's nothing special, like a canare or mogami, but does the job in a non-high stress position.  cable is a bit thin (but the supple, quality thin those that have high end mic cables will recognize). it was priced right @ $7.50 usd.", "id": 169}]