[{"review": "Originally received the wrong item, but I contacted customer service and they returned my email that night (on a Sunday) and said they would ship out the correct product the next morning.  I received the correct item in one day as well as a postage paid envelope to return the incorrect picks.  Great customer service, and love the pics...the color in the pictures doesn't do it justice!", "id": 120}, {"review": "Bought these because I thought they'd be a nice alternative to a plastic or nylon pick for use on my ukulele when I want a different sound than finger picking and strumming can produce.  They give a great tone without hearing the pick strike the string, and they don't wear down the strings and I actually use them on occasion for my 3/4 steel string acoustic guitar when I want a nice mellow tone.  The only negative is that because of being rubber, they &#34;stick&#34; to the strings, so they aren't great for quick strumming, which I wish they were.", "id": 245}, {"review": "What a great price and product!  Bought two of these so I can keep my guitars handy and I love them.  Really love having the rubber strap to secure the neck in the event of a mishap.  The wide frame legs make the stand extremely sturdy and love that it can come apart easy if I want to pack it up.", "id": 258}, {"review": "Everywhere I go, anytime I hear 'ukulele', I also hear 'Aquila strings.'  I've tried several different uke strings for both my soprano and my concert ukes, and I've got to say, these are not my favorites.  I think the sound these strings produce are overly bright, a little squeaky and they don't seem to allow for smooth transitions from chord to chord in my opinion.  At least for the two ukes I have, these strings did nothing for their tone.  I much prefer the Martin Clear Flurocarbon strings!", "id": 698}, {"review": "Got what I needed - a basic capo for a good price.  The tension is a little tighter than I'd like, but works for me.  Covers all strings, and depresses them fully.  I don't use it often, so I can't speak to its longevity, but good for me!", "id": 25}, {"review": "The strings sound great on my full size acoustic - nice bright, but warm tone, full bodied sound - but not so great on my 3/4 size guitar.", "id": 198}, {"review": "Pretty basic strap, but durable and works for me.  The only thing I noticed is I think that one of the end pieces was attached with the stitching on the wrong side, but it's just a picky detail.", "id": 208}]