[{"review": "Great pedal, but if you pull it open and put in a couple of cheap mods, this thing is absolutley rediculous!  It's a boutique pedal with only a little time and solder.", "id": 41}, {"review": "If you are familiar with Shubb's, they are by far the best capo you can get.  Some people do like the big close pin, but if you don't, buy a Shubb", "id": 121}, {"review": "You can find \"cheaper\" ones, but sometimes the Schallers are same price if not cheaper.  These are the best design of lock in my opinion and will hold up to years of abuse and use.  I've had several sets for 13+ years and use them without hesitation.", "id": 277}, {"review": "I take this thing out of my rig every once in awhile, but it always finds its way back in.  Unlike Kaga, I put it at the end of my chain, right before a Boss Line selector, for multiple amps.  I used to put it at the beginning of my chaing, during my metal days, and it does well there too.  I'm more blues orientated now, and love it at the end.  With my fuzzes I can have them cracked and nice and lightly smooth, then at the end with the EQ, I got it jacked up!  Unlike most people I love a bass players V on my EQ.  I love that bass, but I play through 10's and 15's and those speakers handle it better than 12's, although I do have a 2x12 with V30's in it and it sounds nice.  This is a must have pedal though, no matter what you want your sound to end up like, if you have crapy stuf and just need an edge or really nice stuff and looking for that last bit of tone, you got it with this thing.", "id": 433}, {"review": "It's a stand, it does what it's supposed too?  That being said, I try not to use stands as they are extremely unreliable.  I use these to put my instrument down for a short time only.  These are by far some of the better made ones I've found without a contraption to &#34;lock in&#34; my instrument and give a false sense of security.  These are made no where near how they used to be 20 years ago, in a negative way, but the foam/ medical piping has gotten better as the old stuff used to scuff and deteriorate really quickly.  I'd prefer a better stand, however, I question it's existence.", "id": 436}, {"review": "I've owned just about every muff.  No Triangle or Civil War.  But this is my favorite muff thus far.  Way more versatile than any other muff.  The switches involment in the the circuit really isn't too elaborate, but then again all bypasses aren't.  I love wicker on and tone off.  Cuts like a buffalo.  I hate to have a bunch of fuzz's and distortions in my chain, but its there right next to a Keeley Fuzz Head, a Analogman Peppermint Fuzz, and a TS-9 modded to an 808 w/ Brown that I modded myself.  I love this Muff!  I can't wait to see what they do next.  Plus...  These new EHX pedals are build tough as nails and full true bypass.  If you like muffs, you'll really like this one.  If you didn't like muffs before, you'll probably like the wicker feature, it makes it far more clear and pronounced and less of a glob a goo and more distortion/ fuzz friendly.  I give it four stars, because the five is only meant meant for devices that you just freak out and half to have, for me the Keeley Fuzz Head is a five, I love that thing.", "id": 570}]