[{"review": "The plastic is pretty lightweight, but it is a big help.  I keep various guitar picks, clips, pencils, etc. on it which kept falling off when I just set them in front of the music.  Glad I bought it.", "id": 128}, {"review": "I've bought 4 of these over the past couple of years.  I wanted a stand that is pretty solid but also had a clamp to hold the guitar that I could use one handed.  It gives me piece of mind that somone won't just brush up against a guitar and damage it.  I've noticed that it has been backordered on several sites, so I expect that there are a lot of other people who really like it too.", "id": 133}, {"review": "I was looking for something more solid than the usual fold up stand and this is it.  I can put a heavy notebook full of music on it and a lamp and a tray and more stuff and it is rock solid.  Very happy.", "id": 604}, {"review": "I've used a variety of tuners.  When the Snark first came out the price was so low I thought it must not be that good.  However, I borrowed one one time and ended up buying several.  What I like is that it has a very good display which is very easy to read (the colors help a lot as well as the layout of the display) , is seems to be very accurate, the clamp does a good job of staying on the neck and it seems durable enough.  I have had issues with one or more of these criteria with other tuners.  About the only thing that has been an issue, is that on occation, it won't register. Turning it on and off or just trying a different string usually solves the problem.  Also it may be a litle larger than some like.", "id": 821}, {"review": "I found the brightness of the light to be adequate, and would probably give it 4 or 5 stars, but it takes three AAA batteries that according to the packaging are only good for 7 hours. I did not realize this when I bought it, but after replacing the batteries a few times I went to a local music store and asked for a light that you could plug in to the AC.  They sold me the Encore model for $35, it is brighter, includes the AC adaptor and a nice carrying case  After I got home I figured out that they sell an optional AC adaptor for the hammerhead for about $10, so for only $5 I could have just bought the Encore model and been better off.  If you are going to get one of these hammerhead lights, go ahead and spring for one that includes the adaptor, it will save you a lot of money in the long run.", "id": 827}, {"review": "I own Dunlop, Kyser and G7th Nashville Capos.  I don't like the direction the Dunlop faces, it seems awkward.  The Kyser spring is very poplar, but I think the spring tension is too strong, making it harder to take on and off and I think it makes the strings a little sharp.  I like the G7th Nashville Capo, but the spring tension is inconsistent.  The used to be softer, maybe too soft, but the lastone I bought was almost as still as the Nashfille.  Ths Planet Waves NS Artist Capo is similar to the Kyser and Nashville Capos, but the tension is adjustable and seems to be the best of all combinations. Only downside is I think the Nashville capo looks better.", "id": 894}]