[{"review": "Cheap and good texture rubber that does not get stiff.  Only time will tell how well the soldering is.  Sounds fine to me.", "id": 6}, {"review": "MY experience with crybaby is it has a great tone.  More overbearing than the Vox or cleaner wahs.  BUT I know several people who have had problems with the switch, and I have watched countless others stomping on their crybaby in futile attempts to engage or disengage the pedal.I actually use a BBE and Vox since this frustration with my 1st wah.  But I am not sure that I am giving up tone in exchange for the headache avoidance!  I kinda think I am.  The VOX and BBE seem to have a brighter sound which is less \"wah-ed\" if you will.  It could be accentuated by me playing a Strat instead of the Les Paul Custom/Boogie combination I used with the crybaby.", "id": 41}, {"review": "The screws are too long for my very thin bodied Gibson SG Classic.  I can not find shorter screws which fall into the pin so that the straplock will work either---the heads are all too large.I believe I used these on my Gibson Les Paul Custom years ago, and they worked perfectly.  Not on my newer SG though--at least with the new screws it comes with.Fender Start appears to take the system well--only time will tell.", "id": 44}, {"review": "Good strings, though in 1 use I didnt notice any significant improvement over the standard Diaddario phosphor bronze strings.", "id": 130}, {"review": "Boosts the signal without too much noise, though not totally quiet.  Good for lead w/ single channel amps; boosting signal into effects that vary depending on signal strength--especially at lower practice volumes.  Should be INEXPENSIVE!", "id": 365}, {"review": "None of the problems on/off that plague the Cry Baby.  Better sound too!  People are sold on that because of its association with Hendrix.  But THIS is the original, and the best.  Obligatory.", "id": 451}, {"review": "HOLD feature allows you to \"record\" individual \"tracks\" and overlap them on one another on the go--live!  Dont get too ambitious though as the more \"tracks\" you add the more distorted the sound becomes.  I haven't used expensive rack units etc., but this is great fun and versatility allows many different uses.  Excellent value.  Battery runs out fast so get an AC adaptor!", "id": 511}, {"review": "I used to swear by Hard and stiff picks on my Les Paul Custom, but I recently bought a Strat '62 re-issue--and these are TOO MUCCH FUN for fast rhythms with a WAH or Phase 90 (phaser) pedals!!!", "id": 61}, {"review": "Works perfectly for both my Martin dreadnought and my Fender Stratocaster.  Solid unit, good material and construction, though it is made in China apparently--but hey thats why its such a bargain!", "id": 132}, {"review": "Absolutely Obligatory for any fan of rock n roll jamming with tastes of jazz influenced rock--1970's influences.  I would probably buy the Phase 100 today though, as it has 4 different positions to choose from, I assume including the original set-up as one of them.Well, I need to correct this.  This review was for the OLD models.  The NEW models have FAR too high midrange and the components are no longer easily modified.  I thought I was replacing an old model with the NEW one, but alas the NEW is not worthy of a place in my effects chain!I will probably get an EH Small stone now, though that pedal looks like it may have been changed lately too.  Sadly it appears boutiques are being bought by non-musical business men who care ONLY about the bottom line and NOT enough, if AT ALL about the sound/quality of their products.  The capitalists have become too greedy, and the socialists think they are worthy to tell everyone else how to live.  God help us!", "id": 177}, {"review": "Not much to say about patches...they haven't given me ANY trouble, which is as good as it gets with cables!", "id": 181}]