[{"review": "Construction is fine, and you can set it up in 30 seconds. It holds my bass just fine and the swiveling bottom is not an issue for me. I don't know why some people hate it. The rubberized neck holder protects the wood and the strap keeps the guitar in place. For under $10 and prime eligible, what more can you ask for?", "id": 258}, {"review": "I love these picks and the .88mm seems to be the perfect balance of stiffness and suppleness for my playing.", "id": 350}, {"review": "I bought this for a practice amp for my bass guitar. It showed up on amazon when I was doing a search for \"Bass Guitar amps\", other regular guitar amps were not showing up so I was curious about it. After a bit of searching online to see if a guitar amp would work for practice situations, I thought I would give it a try because some people say yes, others said no. I wanted to test for myself. While I did get sound and was able to practice, it didn't have anywhere close to the tone I was hoping for. So I ended up returning it the next day. I'm not upset about the amp itself, just that it shows up as a bass amp off the search, which is the only reason I gave it a shot. For a regular guitar, this would be fine but not bass. I which they would take bass out of the key words or whatever was in there to trigger this to show up. I was in the market for a practice amp for under $100 and was hopeful, but what I ended up doing was buying a used Acoustic B20 1X12 Bass Combo Amp for the same price as this new practice amp and I am a lot more satisfied. Again, this review is strictly on the aspect of a bass guitar, not regular guitar.", "id": 564}, {"review": "I used this on my bass, which up until recently I was trying to tune by ear. I had it close but it's the fine tuning that really helps. This tuner really opened my eyes to how much even being a little bit off can change the sound. I am a beginner so you gotta cut me some slack on that one. But the tuner was a snap to figure out and I had my bass tuned in less than a half hour.", "id": 706}, {"review": "I used this on my bass and I don't know what more you can say about it. It works and does at it is supposed to. I have no issues with quality or feel it's too loose.", "id": 802}, {"review": "A strap is a strap, what can you really say about it? It was about $5 with prime shipping and connected to my guitar just fine. It's comfortable and fits my bass well. I'm a bigger guy and have plenty of length if I needed it. Nice value.", "id": 285}, {"review": "I love these strings. I'm a novice and have been using the strings that came with base which were roundwound strings. I don't like the sound my fingers make when moving between notes. With these flats, the sound is gone. What more, the sound of these strings is a lot more bold and has some awesome tone. It's easy to tell what strings are for notes, but just in case you have a hard time telling thickness for some reason, they are color coded to help with that. I can't speak out about other types of strings, but I love these over roundwounds in both how they play and the sound. I will experiment with other flats over time, but I am very happy with these.", "id": 664}]