[{"review": "The Dunlop Dual Design Straplock System is a sturdy, fairly easy-to-assemble and easy-to-install alternative to guitar straps slipping off of instruments.  The screws that are used to attach the Straplok to the guitar are heavy gauge and pretty large--there's little chance that these are going to come out.  The locking mechanism seems like it is secure and should require little maintenance.  The only disadvantage of the Dunlop system to Schaller's system is that the the Dunlop sticks out measurably farther from the guitar's body.  Ordinarily, it seems like this should be only the most minor of inconveniences.  On an instrument such as a Hofner \"violin\" bass, though, or any guitar with a strap button on the back of the instrument, this makes it difficult to hold the body of the instrument against your body for support.  Schaller's strap locks might look a little more elegant to some players.  The Dunlop Straplok System is sturdy, should provide a long life of service, and can be found at a better price than several of its competitors.  Recommended for most guitar body styles", "id": 44}, {"review": "I put a set of Elixir Nanoweb custom light strings on my main acoustic guitar maybe a couple of months ago.  Although I don't play gigs on it, I play the guitar just about every day, or maybe every other day.  The custom lights are wonderful:  great durability, nice tone and projection, easy on the fingers.  I bought a set of the Elixir extra lights for a Laguna 3/4 size travel guitar I have.  The reasoning was that the lighter body guitar with a shorter scale could use lighter strings, thereby putting less stress on the body.  Compared with the light D'Addario strings that came with the guitar, these have a more muffled low E string.  The A string, too, doesn't project as much as the standard strings.  Although I've not tried the extra lights on my full-sized acoustic, I suspect that there, too, the lower strings would not have the presence or ring of other brands.  Even with the custom light set--where the lower strings are a heavier gauge than a normal light set--the bass notes have a slight hint of that muffled quality.  The thing that most players of Elixirs seem to talk about is the playability and the durability.  They are smoother feeling than non-coated strings, and certainly don't degrade because of perspiration nearly as quickly as regular strings.  The other thing that's important to know, though, is that the Elixirs are excellent at holding a tune, once they're stretched and broken in.  That being said, I'm not sure that I would put the extra lights on the Laguna again because of the bass projection issue:  a small guitar has little enough bass to begin with and these strings don't help.  As you might have guessed, though, I'm thoroughly convinced about the custom lights on the full-sized acoustic.", "id": 108}, {"review": "I've owned a Seymour Duncan Woody for several months now, and have had a chance to try it out with various amps, with the pickup tipped for a stronger low end or high end, and so on.  This is an excellent value and is basically as feedback free as you're likely to get from an acoustic guitar pickup.  The one thing I've found is that I get a significantly more natural acoustic guitar sound playing the Woody through my Ampeg bass amp than through my Peavey guitar amp.  The high ends are too grating through an electric guitar amp and there's a tendency for distortion to creep in, even with the clean setting.  Through the bass amp, though, the tone is absolutely clean and clear.  The pickup is easy enough to install and remove and it's easy to get it to sit low enough that it doesn't interfere with finger picking any more than any other sound hole pickup would.  The other great feature of this pickup is the look; the natural wood finish actually enhances the look of the guitar.  If you are looking for an acoustic guitar pickup, this is the one to buy!", "id": 129}, {"review": "For a good, basic set of regular light gauge electric guitar strings, it's difficult to go wrong with D'Addario's EXL110s.  The range of thicknesses generally works well, and D'Addarios tend to be pretty consistent.  Some other brands may offer special features that go beyond what you get with the EXL110s (e.g. coating, super brightness, and so on), and some players prefer a slightly heavier or slightly lighter gauge string (e.g. sets that start with 9s or 11s), but for most purposes these work great, hold their tuning well, and seem to last pretty well, too.", "id": 156}, {"review": "I purchased the On Stage brand microphone stand to use with a theremin, although I may use it at some point for the purpose for which it was designed.  This is a substantial, stable, very solidly built stand.  The base is heavy enough the I can't image that the stand would fall over in normal use.  Should the need arise, it is also easy to disassemble and assemble.  Highly recommended.", "id": 231}, {"review": "I recently purchased two Protec guitar straps in order to avoid having to switch straps between instruments.  These straps are quite flexible length-wise, so if you have ever been disappointed by a strap that you either couldn't get short enough for a high playing position or long enough for a low playing position, you will not be disappointed here.  These are also a nice medium width, so they should be suitable for all kinds of players.  Although one reviewer complained about the size of the holes for the strap buttons, I actually find the snug fit to be an advantage:  it doesn't feel like I'll have to worry about the strap coming disconnected from the guitar.  And, the price is right.", "id": 285}, {"review": "Dampit humidifiers have been around for years and years.  I think that I can safely say that the basic design looks to be amazingly similar to what I remember when I saw these for the first time in my university days of the late 1970s.  Generally, Dampits can be used over and over for years.  Sometimes the rubber becomes discolored, sometimes the rubber rips near the end of the Dampit, but basically this is a very workable way to maintain at least a minimum amount of humidity in and around your instrument, something that is especially important during the winter months when artificial heat zaps the humidity out of the air.  This is the first instrument-specific Dampit product that I've ever purchased and it seems to work exceptionally well.  In addition to the standard Dampit, there's a sound-hole cover.  In case it is not clear just how it works, the clear sound-hole cover has a short string with a loop on the end.  You simply attach the Dampit to the loop and it hangs inside the guitar.  My first impression is that it does an excellent job of keeping some needed humidity in the body of the instrument, something very important on a solid-top classical guitar.  I would recommend this over the standard Dampit because the sound-hole cover is so convenient (hopefully it will continue to keep me from having to fish around inside the guitar for a runaway Dampit) and seems to keep the humidity focused in an area that is especially in need of it.  A must have if you keep your acoustic guitar in an environment that gets much below 40-50% humidity.", "id": 299}, {"review": "These D'Addario silk and steel strings are excellent for finger picking.  A couple of notes, though:  (1) on the positive side, they are made in the U.S.A. of American-produced materials (unlike silk and steel strings by a famous American guitar company whose name starts with \"M,\" which are assembled south of the border); (2) on the negative side, they cost more than M-----'s silk and steel strings; (3) in general, silk and steel strings squeak more on position changes than straight steel strings, especially more than flat-wound acoustic strings; (4) the tone is very nice and mellow, sort of a cross between flat-wound steel strings and nylon strings; (5) the D'Addario folk set is very easy on the fingers and therefore are ideal if you play a lot, or if you primarily play a fairly light gauge electric string and only acoustic on occasion; (6) they really work best for finger picking (whatever you do, don't use metal finger picks), and are less effective than steel strings for flat picking.", "id": 409}, {"review": "Although this is hardly a high-end microphone, it is fully functional for amplification of voice or an instrument, although the output signal seems like it could be stronger.  The stand is sturdy, too.  So, this is probably not the best choice for the full-time professional musician, but for busking around or playing in clubs, it's worth a look.", "id": 422}, {"review": "Although I purchased a Lanikai LU-21 ukulele some time ago, I have not had the chance to play it for hundreds of hours.  Despite that, I've been highly impressed with its quality and sound.  As some reviewers note, nylon strings have a tendency to go out of tune pretty quickly and to fret sharp; however, that's more of a function of the strings than a function of the ukulele.  The Lanikai frets well all the way up the fretboard, although as seems to be the case with soprano ukuleles in general, it tends to sound better and more resonant in its lowest range.  The tuners seem solid and all four function consistently and the construction looks to be pretty solid as well.  If I were going to be playing gigs, I'd probably look for a more expensive and presumably higher quality instrument (and I probably would not purchase it without trying it first), but for having some fun, this is a workable and recommended instrument.", "id": 536}, {"review": "There is no doubt about it, National fingerpicks are pretty much the standard.  The metal fingerpicks are rock solid, sturdy-gauge steel.  The plastic thumbpicks match tone very well.  And, note that unlike what you may read in another review, they are adjustable.  You just need to heat them up in some hot water and bend to fit.  On my resonator, these provide a full, loud sound.  The only reasons that for me these don't rate 5 stars are that (1) the Pro-Pick F Tone fingerpicks I usually use provide much more of a sense of feel, and (2) the National fingerpicks have a tendency to be a little noisier than the Pro-Picks on the guitar's unwound strings.  Even though I like the National metal fingerpicks much better than plastic fingerpicks I've used, and even though they produce more fullness than the Pro-Picks, for me the sense of feel that I get from the open-finger design of the Pro-Picks trumps volume.  This is important to keep in mind for players whose only fingerpicking experience is with fingers alone.  Players who are already used to metal or plastic fingerpicks should give the National picks strong consideration.  They are solid, sound great, and this packaging of them is excellent!  By the way, the bonus pick is cute (and will go in my logo pick collection), but it's a very thin gauge to be useful to me on anything other than electric guitar.", "id": 640}, {"review": "I purchased a set of Fender Vintage Tremelo Tension Springs in order to \"beef up\" the tremelo tension on an inexpensive Squier Jagmaster guitar that I recently purchased.  These springs clearly are better and more consistently made than the springs that came on the Jagmaster (the loop actually goes all the way around, which is not the case with the springs that came on the guitar) and it seems that they are of a higher tension. Highly recommended as replacement springs, or to supplement the three springs that come on less expensive guitars.", "id": 676}, {"review": "The Planet Waves tuner works effectively on acoustic and electric guitars, using the instruments vibrations to read pitch.  The tuner seems to be reasonably accurate, is lightweight, and is easy to read without being obtrusive to the audience.  It is also nice that such an inexpensive and small tuner can be adjusted to standards on either side of A-440.  Note that the photo of the tuner shows it on the headstock of a Fender-style electric guitar.  It works particularly well on the instrument shown because of the fact that the tuners are all on the same side of the headstock.  On something like a Gibson jazz guitar (ES-175, or one of the Epiphone or Ibanez clones, for example) it's more difficult to find an ideal place to attach the tuner.  Classical and acoustic steel-string guitars are also a tad problematic, too.  It's not that this tuner is unusable on other types of headstocks, it's just that the design limits where you can place it and still have it readable right-side up.  Some headstocks, too, may be too thick in order to attach this tuner.  As long as it fits on your guitar, the Planet Waves tuner is highly recommended.", "id": 785}, {"review": "The Planet Waves Tri-Action Capo features a trigger action, which makes it easy to put on and remove, compared with any other style of capo I've ever used.  As the product description says, it has a built-in pick holder, which certainly is not necessary, but which is a feature that some users will find attractive.  If the photo on the Amazon product page looks confusing, don't worry.  What looks like a spring actually is a spring.  The spring mecahnism is adjustable, similar to the way that vise-grips work.  This capo is adaptable to guitars with various neck radius shapes, and narrow neck, standard acoustic guitars, as well as acoustics with wider necks (e.g. Godin's Seagull guitars).  The only quibble I have--and it's a minor one--is that when you get the spring mechanism set up for one guitar, you may need to adjust it when you switch instruments.  Once adjusted, though, the downward tension on the strings seems to work well with no fret buzz.", "id": 843}, {"review": "After suffering through crackles, lost signals, and all the rest, I decided to heed the numerous positive reviews of the Spectraflex tweed cable and purchase one through Amazon.com.  Because the new acoustic-electric classical I received as a gift has an end-pin outlet, I bought the Spectraflex with the right angle connector.  Although I have been using the cable for only a few weeks, I am very impressed.  The connections on all the guitars and basses on which I've used it are sure, with no loss of signal, no crackles.  Perhaps most impressive is the fact that I can turn the right angle connector around and never have any change of signal.  Finally, I can be confident that when I play, something will consistently come out of the amplifier.  By the way, the old-school tweed look is a plus, too.", "id": 47}, {"review": "Elixir's Nanoweb Light Phosphor Bronze strings are the best strings I've ever used on my Alvarez acoustic -- a guitar I've now owned for over 30 years.  They certainly are the longest lasting strings that seem to be out there, they have a nice punchy tone, and are easy on the fingers.  Unlike the Elixir Extra Lights that I found to be lacking in bass and just a tad on the mushy side on a short-scale guitar, these seem like an ideal combination.  I may buy another set soon and restring the short-scale instrument with lights.  Compared with some brands and gauges of more \"old school\" strings, there may be a little less bass response, but these sound good, pretty even through the set, and the convenience of not having to change strings so often outweighs whatever minor issues that one might have with the ping of the low E string.", "id": 295}, {"review": "There are a fair number of similar tripod guitar stands out there for about the same cost.  If one of your pet peeves with some of these is that the U-shaped support falls out when you carry the assembled stand around, then you'll especially like the World Tour stand.  The way that the U-shaped piece inserts makes it far less susceptible to falling out. And, although it is, as one other reviewer put it, \"minimalistic,\" this stand has a substantial feel to it.  I'm quite happy with this purchase, and would buy another World Tour again, rather than one of the other brands that I own.  Amazon.com did a great job, too, getting this out to me.", "id": 310}, {"review": "After experiencing some frustration with the tone differences and the difference in the amount of noise between a Stevens steel bar (for lap playing) and a Dunlop 210 glass over-the-finger slide (for \"Spanish style\" playing), I decided to try the Dunlop Harris tapered brass slide.  It's probably a personal issue, but I much prefer the weight of the brass slide.  The taper seems to cover the stings of my resonator guitar more consistently than the straight glass slide.  The sustain is better and the string noise is easier to control.  This slide also seems to be well made and has a nice shine to it.  The material and the fact that it fits better than the glass slide are significant pluses.  Another practical plus for the brass slide is that I don't have to worry about what would happen if I drop it.  In short:  it's a winner.", "id": 334}, {"review": "I decided to try these open metal finger picks when I could no longer find ProPicks, which I really like.  ProPick open metal pick users will probably think that these look very familiar.  Compared with the ProPicks these are manufacturer from a heavier, stiffer metal.  They offer the user the advantage over conventional plastic and metal finger picks that you can actually feel the string with the fleshy part of your finger.  I find these (and the ProPicks, for that matter) much more natural than conventional picks.  These actually have some advantages over the old ProPicks: (1) you get three finger picks, rather than two; and (2) because the metal is a heavy gauge, they seem to be less likely to bend during playing and fall off your fingers.  It would be nice to see these packaged in a little plastic container so that they're protected in the guitar case; however, they are so heavy duty that they can probably survive quite well free-ranging around in the case.  Highly recommended for fingerpicking on acoustic guitar and resonator guitar.", "id": 404}, {"review": "Although not through Amazon.com, I recently purchased a Seagull S6 Original acoustic guitar. I compared this with a variety of other brands in the price range, as well as with the Seagull Entourage acoustic-electric which was also in the general price range.  The S6 has a nicely consistent tone which, although maybe a little too bright for some players' tastes, projects very well.  Some reviewers and guitarists with whom I've talked wonder how Seagull can produce instruments that sound as well as they do in North America for the price.  I think that I found part of the answer when I looked inside some of the Seagulls.  The braces do not look as uniform and neatly finished as they might on other guitars.  Looking at the outside of the guitar and listening to it, though, you'd never know.  I find the 1.8\" neck width at the nut to be great for fingerpicking work and left-hand fingering.  It's a compromise between a more standard acoustic neck width and a classical guitar neck width.  For me, it works.  Some players who are more used to a more traditionally narrow neck might not appreciate this attribute of the guitar.  Seagull does offer other models, by the way, that have a more traditional width.  The slightly shorter scale reminds me of the scale Gibson uses on many of its electric guitar models:  just shorter enough to better enable chord fingering, but not so short as to cause floppy strings.  I couldn't be happier with the Seagull S6, especially for the price!", "id": 432}, {"review": "The Planet Waves D'Addario Artist Capo seems like a classic case of trying to do everything and not quite getting it right as a result.  The capo has a micro-adjusting knob, but it is into as consistent with acoustic guitars, such as my Seagull that have non-standard width fretboards.  The built-in pick holder is useful, but Planet Waves offers another, less &#34;Artist&#34; model that also has one.  In fact, the other Planet Waves capo I have is much more amenable to different width necks than this one.  The Artist capo also has an adapter that allows The player to attach one of those small clip-on tuners directly too  the capo.  Assuming that you don't use the capo constantly, why would you want to clip the tuner to the capo instead of to the guitar's headstock?  Check out other offerings from Planet Waves; you can do better for less than with this one.", "id": 894}]