[{"review": "Granted this is no voodoo laps pedal power, or another isolated power supply, but it does provide clean, quiet daisy chain power for up to 8 pedals, and does so pretty dang great for $150+ cheaper.Is it silent? No.Is it reliable? Yes.Would I use it on stage or in the studio? Yes.Would I prefer something nicer if $$$ weren't an issue? Yes.Does this wok great on a budget, absolutely!!If you're tired of using batteries pick this thing up!If you're a super quiet signal chain snob, save an extra $150 and get the voodoo labs.", "id": 428}, {"review": "Holy buckets of tone batman!Let me start by saying, I'm always on the quest for great amazing tone. I think it ends here. This pedal is absolutely remarkable. Built like a tank, I'm pretty sure it will out live me. Its full of sonic options.The overdrive has a level, tone and overdrive. Almost self explanatory except the tone is more of a presence knob and less of an EQ which is a total plus in my book. it also has a mini toggle for comp cut, fm, and vintage modes. The comp cut is more of a clean boost to push your amps front end, the fm is really transparent, and the vintage mode gets you that creamy midrange bite.Yes, this may be another tube screamer clone, but it's a darn great one.The added MOSFET circuitry toggle gives it a lovely growl your low-end fattening it up, if thats your cup of tea, while the standard leaves it more transparent. You should know this switch does effect the whole signal, not just that of the boost side.On to my only negative check on this pedal, the boost ONLY works when the OD is on. It is not a boost to be run in series with the overdrive, just additional circuitry to add more gain to your OD signal.Another great feature, this pedal can be run at different volts from 9v-18v.Running at standard 9v gets you easier breakup, whereas 18v will get you more headroom.This pedal won't be leaving my board, probably ever. If you're even thinking about it, just do it!!! You'll never regret it.", "id": 441}, {"review": "I purchased this compressor pedal kind of on a whim. I was looking at some nicer ones, and decided to give it a go for only $20. It came in the mail today, and i was surprised that basic-ness of the packaging. Very little instructions at all actually.This DOES NOT ship with a 9 volt battery, and putting one in yourself is kind of a pain to change, as you have to get a philips screwdriver and unscrew 4 corner screws on the back to do so. (wish there was a plastic back, or thumb screw option)This pedal is really quiet, and not in a good way.Don't expect to boost your signal level with it, with the makeup gain/output knob all the way up and the sensitivity all the way down, it was about the same volume as the original signal, only a little noisier.Did not seem to be a tone sucker in the chain/add any noise when off. Most compressors add a little noise or hiss when on, due to the nature of raising the noise floor.It also has a SUBSTANTIAL treble boost/low cut going on. even with the sensitivity knob all the way down, it kills your low end. It is quite bright sounding.With that being said, it works wonders on single string/double stop stuff on the already trebley stuff played on the G, B, and E strings, and makes them sound tight and full.It does seem quite durable, The case isn't made of cheap plastic, which is a good thing.Though not as rugged as some of the other pedals I would own.The switch and inputs seem a little cheap though, granted it was a $20 pedal.I feel using this pedal on tour might be a bad idea, however for home/non daily-use i could see it lasting a while.The LED is really bright. Almost so bright, that when you're looking to adjust the controls, it makes it somewhat hard to see what you're doing.All in all, if you're looking for a cheap compressor to boost your  treble strings and give em some extra punch, this may be the pedal for you, especially if you only have $20.If you're looking for a warm full bodied compressor, this is not the choice for you. You should really wait and get the MXR Dyna Comp for just a few bucks more.", "id": 454}, {"review": "I bought a bunch of these when I started building my pedal board.They're very inexpensive, but seemingly quite high quality.Tons of bang for your buck.Seemingly no tone loss, no added noise, and no coloration.The right angle ends are a little big and bulky, they may not do so well on a tight and jam packed board.But for average boards they work great!I gig and record with these. Great product!Only negative check b/c the ends are too bulky.", "id": 578}, {"review": "I ordered one of these bad boys on a whim. It's definitely the best verb it's price range. You can dial in some pretty lush tones.It has a 3 way toggle, that changes it from hall, spring and room verbs.There'd is also an a/b switch that is almost a tone mode. A is bright and in your face, and B is very lush and ambient.Using these settings you can go from electro harmonix holy grail to fender spring reverb.Also has a blend knob, which controls wet and dry signal mix, and time knob that controls, you guessed it reverb time and amount.Very versatile.This pedal is built with great construction, though the first one I received was faulty. All sorts of popping and weird stuff going on.The 2nd one works flawlessly. Seems very durable, switch and jacks are quality.I highly recommend getting a 1spot or 9v adapter b/c this thing drains batter power FAST, though all modulation pedals do.This pedal does not suck tone, and is true bypass, though I wish this wasn't, as I wish reverb trails were avail after the effect was turned off.For &lt; $75 shipped I certainly can't complain.If you have any hesitations on the Biyang stuff, I definitely recommend it.", "id": 699}]