[{"review": "The good thing about the Cable Station is you can make your own cables at custom lengths so you can have a neater pedal board without the need to solder the connections in place. All you have to do is cut the cable flush, insert it into the \" plug with a twisting motion, and then turn the setscrew on the side of the plug until it is tight.As a benefit, if there is a shorting of the signal all you need to do is find the offending cable, remove the plug, cut the cable, and insert the end back into the plug.Great right?Well, not really.As far as reliability goes, nothing can really replace the connection that is properly soldered. With the money you spend, you could easily get a decent soldering iron, some old cable, and some cheap plugs from Radio Shack and practice. In the end, you can by bulk cable and connectors and make them as needed.I have used this product and had to re-cut several cables at different times but only to cables that have been constantly moved around. The other ones that are more permanent haves not given me trouble, but I have experienced problems in the past. Always have a few spares that have been tested.Another annoying thing is that they give you more cable than connectors, I would think 15 connectors would be more sufficient.Is it easier than soldering? Yes.Are they reliable? For the most part, yes.Will I continue using the product? Yes, because I usually have spares.Why do I use them then? I'm lazy.This is from the Cleartone cables website about gold connectors:Don.t waste your money if you are being asked to pay extra for gold plated connectors. The thin soft gold (5-10 microns) .flash. plating looks cool, but scrapes off easily and the brass aterial underneath stops you from seeing that the gold has worn off! The brass eventually  tarnishes and causes crackling when the plug moves or twists in the socket contacts.It is true that gold is a very good conductor of electricity when mated with a gold plated socket. But the sockets inside your guitar amplifier and guitar are not usually gold, so there can be virtually no benefit to gold plated plugs.", "id": 312}, {"review": "Do not let the size fool you. This is a very handy piece of equipment and it's so easy to set up and use. Just plug a 1/4 inch stereo cable into your sub out on your mixer and then into the HA400, then plug in up to 4 pairs of headphones and your set to track overdubs. This is perfect for a small home studio on a budget and it's built like a tank. Be forewarned that this a very basic headphone distribution system, you can only adjust volume from the HA400 and it would be wise to purchase a real long 1/4 stereo cable and extensions for the headphones if you want to isolate vocals.", "id": 376}, {"review": "The Fulltone Full Drive 2 is another incarnation of the original Fulldrive. Now with MOSFET circuitry available via toggle switch, this just makes the pedal even more flexible. Not to mention boutique quality at a working man's price.This device is built solid and sports a powder blue coat finish. The volume knob gives you lots of gain, the tone knob is a \"presence\" control, the overdrive knob adjusts the level of overdrive, and then there is the boost level. Yes, this is a 2-switch pedal, so when you are playing a chunky rhythm you can step on the \"boost: switch for a great lead tone.The toggle switch in between the tone and drive knobs affect the pedals tonal character as well as how the knobs affect each other. There is \"comp cut\" allowing for a cleaner boost, FM for \"flat mids,\" and \"vintage\" for a more Tubescreamer tone.As a bonus, the pedal is also capable of running on 18v power for cleaner headroom, which is handy for hum bucker pick-ups.If you have the scratch and are, looking for a perfect OD pedal then look at the Fulldrive 2. It may wind up having a permanent position on your pedal board.", "id": 441}, {"review": "This is another in the MXR \"Distortion\" line. The Distortion III has a more overdrive flavor than a high gain pedal like the Boss Metal Zone or the Barber Dirty Bomb but is very flexible. Not really for heavy metal (see the MXR 116 Fullbore Metal) but more for that AC/DC and classic rock sound.There is a lot of gain on tap from the output section so it is possible to hit the front of a tube amp hard without turning up the distortion. The tone knob does not have a dramatic sweep but is useable.The good thing about this pedal apart from the price is you do not get that \"fizzy\" top end that some pedals have when you crank the distortion. In addition, the pedal cleans up nice when you roll back the tone knob.Pedal is hardwired true bypass and very pedal board friendly.", "id": 460}, {"review": "One of the great surprises in the last couple of years has been the MXR Carbon Copy delay pedal. Designed by Way Huge founder Jeorge Tripps, is a great analog delay for under $175.00. Using bucket brigade circuitry, true bypass and a very simple 3 knob interface, the Carbon Copy is a very flexible unit. Utilizing the \"modulation\" switch, you can achieve a slight chorusing sound (like the flutter from old tape echoes) which can be adjusted via the internal trim pot.The unit has a small footprint (like most MXR pedals) so it is very pedal board friendly.This is truly a great sounding delay so try one out", "id": 507}]