[{"review": "Was looking for a good solution to practice guitar at night while my 1 year slept. Before I was plugging in headphones to my amp head, but it was getting kind of annoying to set everything up (take out electric plug covers, get all cords out of the cabinets, etc). Oh how life changes with a baby! :)This little product is the perfect solution.It takes two AAA batteries (some generic brand are included in the package). There are two ON settings: regular ON and \"FX\" ON. Regular on is basically like a standard lead channel. Turn down the gain and the cleans are pretty clean. Crank up the gain and you get a nice rock crunch. Nothing heavy metal, but a nice crisp crunch. FX ON turns on a little delay effect. You can not adjust the delay effect, only turn it on or off. There are also knobs for volume and tone.Plug your headphones into the side, and you can also plug in an MP3 player on the top to jam with a backing track.VOX has samples for all of their AMPlugs on their website, however they seem to be missing samples for the Joe Satriani version. I would say that the JS version is pretty close to the \"LEAD\" amplug.I have a pair of middle/lower range headphones (Audio-Technica ATH-M30 Professional Studio Monitor Closed-back Dynamic Stereo Headphones) and the amplug sounds fantastic.In the title I wrote \"wait for this to go on sale\" ... b/c of the JS branding, this particular amplug retails at a much higher price than the other amplugs. However, it frequently drops down to the same price level so keep your eyes peeled! Personally at the higher MSRP i dont think its worth it, but at the same price it is if you are looking for a nice lead tone.", "id": 720}, {"review": "I have owned two Snark headstock tuners (the blue ones). They are great products but I find one thing about them absolutely infuriating: the design of the \"ball joint\" that connects the tuner to the clip. Both of my Snarks have broken off at this joint. I am a home player - I do not put the tuners under any type of stress.This Fender tuner is a great alternative. The way the tuner connects to the clip is much more sturdy than a Snark. However, as others have mentioned, this Fender tuner display can not rotate as freely as a Snark. So, for live usage it may prove difficult depending on how it is oriented. However, for the home player, this tuner will work just fine.The tuner itself is much smaller than I thought it would be. It is smaller than a Snark (but not by much). The clip works well with a PRS headstock, which does not have a lot of free real estate compared to a Strat style headstock.The only real negative I see is to change the battery (and to put the first battery in) requires the use of a very, very small phillips head screwdriver. I build computers so I had one handy, but I would guess some people probably dont have a screwdriver small enough to do the job on hand.", "id": 799}, {"review": "This is a great guitar hanger that was recommended to me by several people. Great for people with babies/toddlers looking to get their guitars off the ground like myself.I love the unique self-locking mechanism that it has. The weight of the guitar lowers the hanger and moves the lock levers up so your guitar neck is securely fastened. I have an electric and an acoustic hanging up. The acousitc's body is about 4.5\" thick and has plenty of clearance from the wall when hung. The electric I think weights around 8 pounds and it held no problem by the Hercules hook. I believe the max weight it can hold is about 15lbs.I only installed into studs and wouldn't really want to try a drywall-only installation. The product does come with drywall anchors but many of the reviewers said the included drywall anchors are cheap and not that good. The wood screws that came with the product I found to be a little short (if you were installing on dry-wall in front of a stud). Others found this to be true too. I bought #8 Wood Screws in 2.5\" length at the hardware store and these worked perfectly for my install. The included screws I  think are about 2\" in length or a little less.", "id": 289}, {"review": "Have been a user of Jazz III picks lately (Max Grip version:Dunlop Max Grip Jazz III Carbon Fiber Guitar Picks - 6 Pack) but was having some difficulty with those picks during rhythmic sections that required lots of strumming.Was recommended to these picks by other users so I gave them a shot. A few of my notes:- This pick is very slightly bigger than the Jazz iiis i linked above. I like this a lot. The tip is almost exactly the same size, but the top grip area is ever so slightly bigger. Still, these picks are significantly smaller than your \"average\" size pick.- The rubber grip area is a joy to hold. Very comfortable, very stable, lots of grip- If you didn't know, Dava picks dont come in varying thickness. They are instead \"control\" picks. Meaning depending on where you grip the pick it will become more or less rigid. Look at the picture --- see those three horizontal lines in the middle of the pick? Those are reference markers --- choke up on the pick (lowest line near the tip) for leads and pull back for more flexible strumming. This will take me some time to get used to but it is pretty nice in theory. However, even choking up on the pick, it is not as rigid as the jazz iiis and sometimes for fast work I was wishing I was still holding the jazz iii.- These Dava Jazz come in three colors: Red (Delrin material), Yellow (Nylon material), Orange (Gel). Different materials produce different sounds/feels. Also, in my opinion, the gel is a little harder than the other two.Hope this review helped", "id": 580}, {"review": "this a great cable for practicing at home. Coiled cables keep things tidy and avoide tangles. This product measures approx. 28\" coiled, plug end to plug end. Thus it is pretty short, even when stretched out. For me, it is the perfect length for at-home use, especially when using two (amp --> pedal board --> guitar).not sure why it isnt available for order on Amazon anymore ... I just ordered mine two weeks ago.", "id": 709}]