[{"review": "Don't buy cheap cables. They just rob your tone. These are the best cables for the money. sure you'll spend a few more bucks but they sound great hold up and are guaranteed for life.  What else could you ask for. All I will use are these cables", "id": 124}, {"review": "I own over a dozen overdrive pedals.  I know that is just insane.  this is the best I have and the best i have ever heard.  I use it after a low gain overdrive to boost my leads.  It does a great job.  tons of tonal options.  If I were to buy one od pedal it would be this or a barber", "id": 453}, {"review": "Great tone and tuning stability. Was a direct drop in for my epi wildkat.  Really helped with the bigsby tuning stability", "id": 691}, {"review": "sounds great.  Love the sound of this pedal but a few quirks.  It does not work well with a daisy chain power supply.  with this set up the second channel will distort a bit.  Forget batteries. They last 5-10 minutes.  With its own power supply sounds amazing esp when one takes in to consideration the price", "id": 699}, {"review": "Been playing for 30 years and I have used tube screamers extensively. As some of the other reviewers have noted this is basically a tube screamer clone without the annoying midrange hump which some people complain about.  It is reasonably quiet and is built with reasonably good components.  Most importantly it sounds quite good especially when you take into account that it cost a bit over 30 dollars. Are there better tube screamer clones out there? Probably but for the price you  will not find a better unit.  Build sturdy, I would gig with this without hesitation.I hate to leave this review because I know the prices will go up on the joyo stuff as more people are tuned into these products. Great pedal. Great value.", "id": 728}, {"review": "This is supposedly a clone of the MI Audio Crunch Box.  I can not comment on this as I have never played this pedal.  What I can say however with 30 years playing experience is that this is a very good pedal.  When one takes into account the price it is a great pedal.  I own this the classic overdrive and the ultimate overdrive by joyo.  This has the most distortion.  It has a nice ragged edge to it and is great for classic to hard rock.  It does have a bit of noise at high gain but much less than the boss stuff I have had experience with. It is solidly built and apprears road worthy.  great pedal and great value. I would have no hesitation buying this or any other joyo product", "id": 794}, {"review": "Love joyo pedals.  Not sure yet on the new line.  They just dont feel as solid to me. That being said the pedal sounds great. great distortion no issues beyond my concerns regarding the light build and esp the switch. time will tell", "id": 832}, {"review": "very nice compressor.  I leave it on all the time and it really improves my tone/sustain.  Can be fairly subtle or can provide significant squish if you want that sort of thing.  Quiet - much quieter than other compressors in this price range.  No concerns here", "id": 834}, {"review": "Moen pedals are great.  Nice quality at an unbelievable price point. This pedal is no exception.  It is a great sounding vibe with the bonus of a nice chorus which can be engaged by the toggle switch.  to be fair I have not tried many other vibes.  Hard to when most cost over twice the cost of this pedal.  That being said I am absolutely pleased with the sound of this pedal and have had no need to look elswhere.  vibe is very Trower like. Think bridge of signs.  Chorus is on the mellower side. Very analog sounding not digital.  Replaced my BBE mind bender and fits the bill so much better.  Solid well built and should last.  I would have no problem gigging with this and have with no issues.My only issue was that after a year or so the pedal seemed a bit less strong in its effect.  I read online that a bit of electrical tape around the internal led's would fix the problem and indeed it did.  It's been fine since.  Despite this needed fix I would buy this pedal again with no hesitation if I needed to", "id": 551}, {"review": "so this is supposedly a fulltone ocd clone.  I can not comment on this as I have never owned or played one.  What I can say with over 30 years playing experience is that this is a great pedal especially when you take into account the unbelievably low price.I own this pedal, the vintage overdrive and crunch distortion. See my other reviews on these pedals. basically the vintage overdrive is a tube screamer. the crunch is a fairly high gain distortion pedal and this pedal is inbetween.It is built solidly and looks roadworthy.  It has reasonably decent components and it sounds great.  Is it of the same caliber as a $150 boutique pedal - no but it is pretty darn good esp for the asking price.  I WOULD HAVE NO ISSUE GIGGING WITH THIS UNIT.  The distortion is warm with the tone at 12 with plenty of tonal variation available and plenty of distortion variance available.  Lots of sounds in this unit.  And very very quiet.  Nice thickness to the sound with good bass and less ragged than the crunch distortion if that makes sense.  Much quieter than the other two pedals mentioned.  For classic rock  this is perfect.  maybe even metal but would go with the crunch distortion for thatOverall no concerns with this great product!", "id": 795}, {"review": "this is a solid overdrive but not really very different than a bunch of other joyo overdrive pedals out there.  I have a bunch of these pedals and they are starting to blend together.  Definitely would not consider this a low gain overdrive as advertised.  Lots more gain on tap than a low gain pedalLike many other reviewers, my gripe with the new pedals is the switch. may hold up but these new pedals seem so much less solid than the prior generation", "id": 833}]