[{"review": "While on the surface the pocket sounds great, the picks either fall out because they aren't pushed in far enough or they are impossible to grab because they are pushed in too far. There is also a tendency for the picks to fall out when you put the guitar on a stand, which is a bit annoying.The strap itself is just fine and is a good price, but the pocket idea sounded better on paper than it works in real life.", "id": 285}, {"review": "I was concerned when I bought this that my microphone stand would be prone to tipping over since there isn't a counterweight. However, not only does this thing lock in tight and not slowly tip down like other boom stands I've used in the past, but it hasn't tipped over yet after quite a bit of use.", "id": 291}, {"review": "First off, most audio racks have that annoying &#34;slide these little metal pieces over the rails and put your screws into them&#34; instead of properly sized holes. Not this one. Not only do the holes get made proper size with threads in them, but it even includes 48 screws so you don't have to try to figure out which of the 3 sizes you've collected over the years is going to fit.I loaded it up with equipment and haven't had a worry about it since. Solid construction and the mounting just works. This one is done right.", "id": 322}, {"review": "This works in some applications, but doesn't work in many others. Even when detected by the software, it will not work with Line 6 equipment. Too bad, because it would have been convenient to program my effects with my laptop instead of my desktop.", "id": 565}, {"review": "I got these for my dad for Christmas. He loved them all and won't quit playing with them. I figured he would put them into his collection of cool things he's amassed, but he uses them daily to play the Ibanez acoustic/electric I got him.", "id": 669}, {"review": "I have a bad habit of backing off of the microphone when changing chords on the guitar. This little device gives me auto-correct for that habit as well as some nice echos and reverbs which aren't overbearing, and the pitch correction sounds really natural. Now I just need 2 more so the rest of our singers have that same great sound.", "id": 849}, {"review": "I have these on 5 of my guitars now, with my acoustic and a &#34;novelty&#34; guitar being the exceptions. I can't stand the thought of not using these after seeing too many expensive guitars hit the floor after the straps let loose. Other styles have a button, which seems more convenient, but the Schaller locks are pull style which is far more secure if something bumps the end of the lock. These are the only locks I'll use now.", "id": 277}, {"review": "Having purchased many &#34;A&#34; frame and more &#34;traditional&#34; style stands, this one has quickly become my favorite. Not only is the padding much better than the rest of them, this thing is very sturdy and the casters actually work. Only thing lacking a bit is the instructions, but it's easy enough to put together that they aren't really needed. I'll probably be buying a second one for the rest of my guitars soon.", "id": 769}]