[{"review": "I use the Dunlop .60mm nylon picks as my current standard,  but decided to give the lighter .38mm a try.  Unfortunately,  the volume they produce get completely swallowed up when accompanying singing with an acoustic guitar (especially in an outdoor picnic setting),  and basically unusable for that purpose.  However, I did find these were just the ticket for personal practice, allowing me to hear a  metronome or backtrack far easier.  So although they failed my original performance intention, 5 stars for filling a need I didn't even know I had.  :)", "id": 62}, {"review": "As a vast multitude of guitar players will solemnly agree, we all have experienced the search for the personal Holy Grail of guitar picks.  I am no exception.  Dozens and dozens of makers, styles, shapes, gages,  materials,  price ranges, (oh ya, the 30 dollar picks), you name it, I've tried it (even nail picking on metal strings).  Now if you are new to the &#34;perfect pick quest&#34;, you must understand that picks are as subjective as scent, with personal grip, sound interaction, a host of music ingredients making your Grail different.  However, if you play a light metal-string acoustic (my main is an Aria AF tenor guitar), check out these Dunlops .60 Nylons.Even within the Dunlop line, I have tried the different grips and thickness gages, and after all said and done, these relatively cheap picks are all that have remained standing as my first choice.  Just heavy enough to be heard unplugged without folding the pick around my thumb, light enough to strum fluidly without yanking at my lighter strings, just the right material to keep my low strings thumping and my high strings singing.  Even the Dunlop Nylon Max grip of the same .60 gage didn't acoustically perform quite the same.Would I try another pick if the chance was presented?  Sure, most of us would since the quest for the Holy Grail never truly ends,  but until then, Dunlop's .60 Nylon is without hesitation the closest thing I have gotten to pick perfection.", "id": 64}, {"review": "I honestly really didn't find this thing useful at all. First, the wire clipper side is relatively bulky (no flush cutting) and doesn't open easily (very stiff action), so trying to get the clipper onto the wire with the very small opening and at the same time peering over the tool itself as it blocks the view - ick. And as for the winder... I suppose if you are doing some heavy initial winding, it can get rather tiring twisting the tuner. But it is a tad big for tuner pegs on anything I used it on, so no nice &#34;tight&#34; fit, more of a &#34;jiggle&#34; fit. Plus the clearance needed to actually swing the thing around means having the instrument laying flat on a table doesn't help. Didn't even know there was a bridge pin puller on this thing. Just looked at it... guess that notch in the peg winder is it.Each time I have set out to use it, I end up turning my pegs manually and grimacing over the stiff action of the wire cutters while to align it on the string. I just recently ended up buying a set of Crescent Brand Miniature Cutters & Needle-Nose Pliers Set(the pliers are JUST the thing for pulling the strings and keeping tension while winding). When I have to redo my mothers acoustic guitar, I'll try the notch bridge peg puller. But other wise, this thing gets a serious two-star &#34;meh&#34;.", "id": 94}, {"review": "Fantastic strap.  Nope, it isn't leather or tooled or all that kind of stuff...  But it is really comfortable and fitted with ease even my CC-OT banjo that has a *really* tight spacing (all the others I tried were a bit of work to fit through the brackets).  Had it on my heavy weight resonator bluegrass, once again extremely comfortable and sturdy, so had to buy another so I can just have one on each.", "id": 101}, {"review": "I just received the case today, the soonest delivery day on the estimation range (a plus there!).  Now having spent a long time pricing hard cases from all around internet, this price is extremely reasonable and a wonderful case.  Nothing fancy and differs slightly from the pictured item in that the outside rim-threading and basic locks (keys included) are gold toned (instead of silver toned pictured), but that doesn't mean diddly-squat to me.  Plush interior with a small, yet roomy, compartment located under the neck.  I am primarily a 5-string banjo player, but decided to casually play around with the mandolin, and so I figured I had better get a hard case for possible \"long-time\" storage (my first banjo lived in a padded gig bag for a few years before I started getting serious with it... and boy, not the best thing for it in small enclosed storage spaces).  This case will definitely do the trick.  Excellent value!- Additional note, there is a bit of extra play around the peg-head (I have an Rover mandolin)... I can see if someone traveled with this case and dropped it hard it enough, some peg snapping may occur.  But again, for simple storage/protection, its a non-issue.", "id": 118}, {"review": "I bought my first one from Amazon over a month ago - and simply fell in love with it.  It cleans/polishes wood, metal (although for strings, I use GHS' Fast Fret), eye-glasses, computer screens, etc with wonderful ability, easily replacing \"casual\" cleaning/polishing fluids.  I even recently bought a 2nd just because.  And yes, the first one has finally gone through the wash after a month of constant use- I knew it was time when it wasn't wiping off the smudges as quickly.  It came out with a slightly nappy texture (to be expected really), but still works as well as ever.  There is a vast amount of different \"polish\" cloth brands out there, but you won't go wrong with this one.", "id": 184}, {"review": "Just got my stand today... the QUICKEST delivery EVER with the Super Savings free shipping selected that I have ever experienced!  Go go, Amazon!  lulz  Anyhoo, I have two banjos and a mandolin that I purchased this for.  I looked about for quite a bit at various sites, reviews, prices, etc, and pretty much Hercules got the best reviews everywhere (although admittedly I hadn't really wanted to shell out over 50 dollars).  Yet this tri-stand really looked good with a solid general review, and I am rather tight for space overall (think trailer home size).  I wanted a way to hold my instruments in one place without having to work around gig-bags or hard cases taking up limited 'living space'. As it stands (figuratively and literally), the Hercules Tri-Stand does the job excellently with the two banjos.  All three instruments are varying heights, the resonator bluegrass banjo being the longest, and (naturally) the mandolin being the shortest, with a open back clawhammer banjo in the middle.The three 'back-rest' fold outs are static, attached to a center ring, and you \"can\" adjust them independently a *little up and down*, but not to compensate for such a length difference between a bluegrass banjo and a mandolin.  However, the mandolin is a really lite thing, so I suspect it will be fine just hanging there by the peg head without a 'back-rest' as long as the stand isn't jostled around.  In my own case, aside from two rather lazy cats and pending no sudden hip-smash-oops by me, that shouldn't be an issue.  And of course, considering I am looking at a possible third banjo, the mandolin may just go live in its case after all...Now a word about open back banjos, if you are considering this stand... First off, no, I was not going to rest the coordinator rod against the 'back-rest' (just seems like a bad idea).  What I ended up doing was adjusting the 'back-rests' so the resonator of the bluegrass banjo rested about an inch up from the bottom, allowing the open back to rest on the other side ON TOP of the rest, along the lip of the banjo rim, at the edge of the rest foam where it begins to curve out and down. The tail-piece nut is in between the two foam pads without touching a thing.  Seems pretty solid in this position while still engaging the weight clamps up at the top.I give it 5 stars mainly based on the excellent quality of the stand and the fact that it is the ONLY three instrument stand worth any kind of hoot I have been able to find.  Its not the absolute perfect thing for my own application (would need the three 'back-rests' to be independently adjustable in height for that), but overall I am extremely pleased with it.", "id": 301}, {"review": "I now have two of these (really wish now I had ordered more at the time before the slight price increase -kicks self-) and all I can say - you simply can't beat it.  I also have a Hercules Tri-stand (10x more expensive than this one), and between the two, gotta admit, the only major advantage my tri-stand has is saving space (which actually is a huge consideration for me).  I honestly don't know why other reviewers have had such a hard time with balance as the two Musician's Gear Tubular Guitar Stands I currently own never once have given me an issue (aside from bodily running INTO the thing), and they have held/do hold a variety: Guitars of various styles, Banjos (both open back and BG resonator), Mandolas, anything with a long neck. All in all, unless there is some specialized stand need, I would first come to Musician's Gear.", "id": 519}, {"review": "I did get 5 thumb picks in my order (a previous reviewer mentioned only getting 4), and I always really liked the classic turtle-shell look (far more purty-like than the plain, thick white of Nationals and others).  But these are large? And, yes, I double checked the packaging to ensure I was shipped large. The National mediums I was using before had a looser fit -boggle-.  But nevertheless, the Planet Waves' far tighter fit actually feel better than the National mediums, which certainly had a clunky sensation; there is probably a small weight difference between the two that would explain the overall feeling of quicker movement while having good solid interactions on the strings.  All in all, 4 stars.  Still... these were a large?  Hate to see how the mediums fit.", "id": 617}, {"review": "Just want to reiterate however what another review mentioned... the thumbpicks both came in medium, which at the time I didn't pay any attention to.  However, after about 3 weeks of using them (and the fingerpicks) on my banjo, I came to the conclusion that I needed a large size for my thumb (the mediums sat a little too high up my thumbnail for comfort). I suppose you could put them in hot water to \"stretch\" them out as I have read, but regardless, for a quick-n-dirty set for someone just starting out, its just the ticket without having to buy a bunch of sets of 12 to figure out what is comfortable.  With price/assortment in mind, I give 5 stars.", "id": 640}, {"review": "My mother \"plays\" the guitar (I am a banjo/mandolin player), and the Snark SN-2 came in the mail while I was gone for 5 days.  She opened it up, got curious and tried it out on her guitar that prolly hasn't been in tune since... I dunno... and she LOVED it!  lulz  This little thing really is my absolute favorite instrument accessory, both a vibrational and an internal mic pickup.  I was using my old Korg chromatic for those times I wanted to see if I was singing the correct note... and was actually pleasantly surprised that the Snark SN-2 had a mic.  One less accessory in the little bag now.  :DI am slightly ambivalent about the silent metronome function, however... its neat as you can play without the TICK TOCK distraction and still look up once in awhile to see if you are on beat, but as an actual instructional tool for keeping tempo... mmm, I would still highly recommend using an audible metronome.Side note, if you have friends/family that play a string instrument, be aware your Snark SN-2 *WILL* be making the rounds.", "id": 707}, {"review": "My home practice area is in a rather dark corner with limited room, and I have this clipped onto my music stand. Illuminates the music far better than the previous ones I had used, including one that used a full sized bulb (rather too much light and not very portable). Have no trouble that others have mentioned, just it loses a star because the included ac adapter cord is *short*, making it for all intents and purposes useless to me without having to string along an extension cord to my music stand (ugh, more cords).", "id": 524}, {"review": "I have been online shopping banjos quite... extensively.  Ebay, Amazon, 3 dozen+ online shops, reviews from multitude of sources, investigating manufacturer home sites, etc.  I did the same for this banjo, and although there is actually very little out there about this particular banjo, I still felt very comfortable with what little I put together information wise.  And frankly, at this price, it gets my warmest recommendation for those on a tight budget (sometimes, you just can't afford 400+ dollars for a mainstream name beginner brand).  Additionally, mine came very well setup from the seller (aside from the inevitable tuning).  And its purty too!  I would also deeply recommendSnark SN-2 All Instrument Clip-On Chromatic Tuner... absolutely the best tuner I have ever used and makes the various banjo-tuning schemes a breeze.Be aware, in order to avoid possible confusion, Jameson Guitars is actually a sub-brand of Davison Guitars, so if you order and look at your peg-head and it says Davison (like mine does) and not R.W. Jameson, its the same maker (yes, I examined Davison's home site as well as the Amazon Seller's).", "id": 649}]