[{"review": "On my mixer, I have send/returns on the same plug using a 3 wire TRS with send on the tip, return on the ring, and a common ground.  But my effects boxes like to have separate 1/4\" TR ins and outs.This is the perfect cable for just such a hookup of things like the behringer sharkBehringer Shark FBQ100 Automatic Feedback Destroyerto the 1202-vlZ3's send/returnsMackie 1202-VLZ3 12-Ch. Compact Recording/SR MixerI probably will order a second cable having seen how well the first one worked out on a send/return.", "id": 9}, {"review": "Everyone develops personal preferences over time for one reason or another.  I have a personal preference for the XLR ends with the really fine threaded plastic cap on the outside (first to slide down the cable) with a 4 legged gripper underneath that slides next down the cable and pinches down as you tighten the plastic outer cap into the metal housing with the solder contacts causing the gripper to strain relief most cable diameters.  Unfortunately that design isn't used here, but I chose to award the 5 star rating for value because you get 15' of good quality shielded cable with 2 XLR ends (M and F) for well under $1/ft.As for pinout it's straightforward, pin 1 is tied to the metal grip and shield and connects between both ends, while pins 2 and 3 are run isolated between both ends.  The end design chosen uses the single set screw connector (the tiny one that gets lost so easy if you need to take it apart) and the rubber bumper design on the back which I haven't had the best of luck making quick changes in the field with, however for interconnecting equipment on a temporary basis these cables are an important starting point of any audio engineer's kit because they will be used not if but WHEN the need arises.Another favorite of mine is the 6 pack of 3 foot male to female cables which do use my favorite XLR ends mentioned above, which amazon will rush you:GLS Audio 3ft Patch Cable Cords - XLR Male To XLR Female Black Cables - 3' Balanced Snake Cord - 6 PACK- these are very easy to open an end, change phase, lift ground, or input someone's oddball source signal.  Having 6 on hand means you won't quibble over cable costs before the show starts and that channel will be in the final mix.Back to pyle's product here, I basically took away 1 star for not using the easy to open and re-wire XLRs but gave them a star for value in the product since it's 15 feet long and will reach between my mixer and most anything else inside the booth for under a buck a foot.  It's also great when someone yells \"it's too short I need a cable stretcher at the podium!\" and quickly adds 15 feet of noise free movement to a stage snake that either wasn't planned for or got moved/quit working.  For the price they have saved many installations from being torn up or rewired which means no surprises opening the next showing.I finally equipped my cable kit with the usual XLR to  RCA, 1/4 TRS, hi-z transformers, and the above mentioned 6 pack of 3 foot cables to quickly gain access to the XLR terminals if need be, plus 2 of these 15 foot cables mainly to solve distance problems, and a roll of gaffer's tape for good measure to prevent tripping hazards.  I used to have 2ea 50 foot XLR cables but no sooner than the box was opened one became a permanent addition to the stage snake so now I have one left for my kit. With all that I had to build an emergency XLR to 2.5mm TS all metal shielded connector for a mike input on short notice so a soldering kit with misc plugs got added to my cable bin.  Even though all this was under $100 it has saved the day more than once and made the show go on, so a bit of \"what if\" thinking and judicial purchases can make you look like the miracle mixer in the black painted room and justify your existance when the owner's daugher's toy musicbox becomes a channel in the house mix thanks to some quick cable magic.My last cable advice is never deconstruct something you custom made.  It will no doubt be needed again, and since you made it you'll know why, how, and where it was used before, thus you save time not recreating a past fix rather pulling it from your magic box of tricks and solving the problem.  People think you can hook anything up where others tried and failed furthering your staff position.  My only exception goes to cables that violate every standard and didn't serve to fix the problem like that phase reversed ground lifted XLR 4 pin stereo Y splitter to dual TRS female cable I made for the harmonica duet where the performers had nose rings and lip bars pierced and kept getting static with their mics when they held the harmonica up to their jewelry.  I chalked that up to being part of the intended musical signal, wondering just how much it hurt to play with all the piercings scraping along the harmonica when I setup my monitor speakers to listen to just that (stereo) channel in rehersal at the console.", "id": 21}, {"review": "These come with a stereo holding bar and adapter for mic stand.  They do need 48 V phanom power from your board or a mic amp.  I'm using a mic amp and these are the input to a paging system which I will review in more detail later.  The 48VDC comes from the mic processor then cancels feedback and sends the paging audio to my amplifier which I will review as a set.If you do stereo recording, you can't go wrong with these - their self noise level is so low it is below that of a human ear.  It sounds great, and setup outside with 140 dB of gain it really performs well hearing birds chirp from far away, rain drops comming down, and sounds you never would hear.Note:  NEVER get these wet - you must have a cover over them for outdoor use in the rain.You will need 2 XLR cables for full stereo recording with the transfer bar, but you already know that.", "id": 328}, {"review": "Having 250 feet of xlr - xlr (m-f) cables that can be used any way I want (e.g. 2 ea 125 foot for stereo, 1 250 foot for mono, or 10 ea 25 foot for multichannel work) is very flexible.The packaging on these was also well done with a ziploc type bag and a velcro reusable wrap on each cord (white) to store them when not in use.As all of my sound equip is xlr or speakon connectors, this worked great for a recent outdoor dj job.  I ended up using all 10 of the 25' cords for mics and amplified speakers, plus another 6 of their 3 foot cables for interconnect.  You can never have enough xlr cables or adapters!", "id": 423}, {"review": "Each bx5 d2 speaker has its own amp onboard and power supply.  Want a 5 channel system - buy 5 speakers and run xlr audio to each one.  No noise or hum.  Has both trs and xlr inputs - has a knob for gain control on back.  Most importantly each speaker has an IEC connector for power to JUST that speaker.  Mine sit left and right of my mixing panel using TRS outputs which copy the XLRs - those go to my Marantz PMD 580 digital recorder w/ 32 GB of datacard memory onboard and a nice set of vu meters.  Speakers include a foam stick on bottom to prevent buzzing against hard surfaces.  There is, however, no mounting point - no captive nuts or such.You'll need to adopt a philosophy on gain.  You can crank the speaker gain to 100% and use your mixer to set the levels but ensure that your recorder gets enough signal to be in the -15 to -6 dB0 range.  It may be a tad loud - in that case you may want to set both speakers to their 12 oclock position which is 50% power approximately.You could alternately use the mixer to run near 0 dB and turn it way down on the speakers.  I like to use mine to listen to talk shows before falling asleep at night so I turn the volume way down but drive them with -6 dB0 off the mixer.Having a separate power supply and amp for each speaker makes for some great isolation.My **FIRST** nitpick is there is no grill cover on these like other maudio products have.  I will have to fabricate some protection.  My second nitpick is i owned the smaller m-audio 4\" monitors where the amps were in the left speaker and the right speaker connected with twin lead speaker wire to the left i.e. not true bi amping but smaller spkrs for my mixer.  The speaker w/ 2amps died at 15 mos after buying it.  It was not the power supply as being on made the box warm, but the led surround around the vol knob would not light and you could barely hear the audio even with -3dB0 into the trs line in.  Thats a different cheaper model by maudio but i had to trash it and buy these which are much nicer!I do like this set of speakers.  From stereo to 5.1 surround they do the job with differential audio inputs.  I may get 3 more for 5 ch as i have a sub already.", "id": 783}]