[{"review": "This pick holder works for me. It holds a number of picks well and easily discharges when needed. It fits my Jasmine well. Buy it from GO-DPS since they have one of the best customer service and quality products!", "id": 167}, {"review": "nice cover for my behringer xm8500. it is fitted snugly and well made. the color is nice and bright. i wanted to have other colors but this is only available in red and black also.", "id": 178}, {"review": "this is the best mic for its quality and its price. perhaps on par with other brands but very much affordable.i will buy another one of this.", "id": 213}, {"review": "This is a very good and stable stand. Light, strong, and very balanced. It makes my guitar feel secure. It is also ideal for travel since when folded can just be slipped into a small bag.", "id": 310}, {"review": "This string winder is adequate but not really solid. It gives me good use but seems like the materials are to soft. I had to glue the contacts on this thing since it gives way at times. This is just adequate for my use.", "id": 347}, {"review": "great sounding strings. you can hear the difference once it is used. i will try to buy another one after i have proven its performance.", "id": 349}, {"review": "this is an amazing acoustic amp for my classical guitar. i use this to play in the Church and a friend of mine approached me and said that the sound is really crisp and bold. i was happy.", "id": 398}, {"review": "I like this cable for it has an angled plug. It is not that long but no complaints. It works as it should and does well.", "id": 419}, {"review": "great tuner! it is very simple to use and the articulating head allows me to see better while tuning the guitar. i will buy another one of this.", "id": 706}, {"review": "The strap is strong and well made. The color is perfect and with the pick pocket it makes for an easy place for picks to be stored. I like it a lot.", "id": 285}, {"review": "I just needed this for my new guitar. From the looks of it, it complements the instrument well. I am happy with it.", "id": 598}, {"review": "Give good crisp and live sound to my acoustic guitar. it is affordable and the material is solid enough that it can withstand abuse.", "id": 603}, {"review": "This may be 10Watts but it can fill a big room with its sound. Not too heavy and very handy for traveling. This can't be used for concert or gigs but for use in private/family use or maybe inside a church. Built is good and the power of the sound is sufficient.", "id": 721}, {"review": "great picks. i like the feel and the control it provides. i like its texture and the size. just perfect.", "id": 773}]