[{"review": "Excellent simple product. Fits all of my guitars and stays out the way while playing. Easily holds 2 picks at at time on each end. Has grooves on ends and one can slide it down so that at least 2 strings fit into the grooves.", "id": 29}, {"review": "I use these strings on some of my acoustic guitars. good brand and good tone. 5 stars for this one.", "id": 86}, {"review": "5 stars, arrived on time and in good condition. Price is excellent. Will install to one of my acoustical guitars within the next few day.", "id": 103}, {"review": "good deep tone for my acoustic guitars. easily stretched and tuned with no problems. You can not go wrong with D'Addario strings.", "id": 130}, {"review": "Extra Light gives good action for my small guitar. Not so hard on the fingers. Tone is not bad but not same as 11 or 12 gauge.", "id": 198}, {"review": "I use these pins on some of my 3/4 size guitars. Not really sure if I can notice a difference in sound between these, plastic, or ebony pins that I have but they are attractive and certainly appear to be different.", "id": 206}, {"review": "Made of durable nylon with pick pocket. Given 5 stars, Shipped on time and at good price. I recommend this item.", "id": 285}, {"review": "I have many acoustic guitars and I use this on all of them to keep them looking good. Easy to use, wipe on and wipe off.", "id": 351}, {"review": "I love this guitar and one can not go wrong with a Yamaha, I currently have 3 acoustical Yamaha Guitars. The FG 700S is a full size dreadnought style steel string guitar. I usually do not like full size guitars as they do not fit in my lap well but this one is perfect for me and I can reach the full length of the neck with no problems. It has a deep tone and good volume. I give 5 stars to this guitar and recommend for the beginner as well as seasoned player.", "id": 360}, {"review": "I will use this cable to connect my guitars to a portable amp. The quality is great, price is right and delivered on time.", "id": 419}, {"review": "I enjoy using this strap on some of my guitars. Easy to install and remove. 5 stars to the seller and the strap itself", "id": 470}, {"review": "These picks are a good change of pace. They are easy to grip and do not slide and slip through my fingers. Good investment for the price.", "id": 686}, {"review": "I have 7 of these bad boy tuners and I love them. I keep them clipped to each of my guitar heads so they are always ready if I need a quick tuning to that guitar...Good quality, accurate and not expensive...Highly recommended and 5 Stars.", "id": 707}, {"review": "Good string action out of the box. Nice looking full size guitar with adjustable truss rod and good sound deep tone.", "id": 726}, {"review": "Love this little tuner. I have several reds and several blues and this one seem to be about the same except the displays seems to be more accurate.", "id": 811}, {"review": "good quality plastic and attractive and cheap replacement for any acoustic guitar, slotted with taper and fits well in my bridges", "id": 817}, {"review": "UPDATE: received 6 of these. 5 are ok but one has a bad weld joint at the top retainer. It was held by only one small tac weld.I got what i paid for. cheap price and cheap product. no excuse to make this kind of low quality guitar stand, putting a $500 guitar on this is asking for guitar damage when the stand falls apart. not worth the time & $ to send it back to amazon. One star only for this product. Good chance that you will get a crappy one if you order this. Less than one star for this piece of ......", "id": 841}, {"review": "I have tons of picks and these are well made and easy for me to hold in my hand without slipping around too much.", "id": 170}, {"review": "martins are no doubt, excellent strings. The light strings carry excellent deep tone and are not to hard on my fingers.", "id": 225}, {"review": "I already have one of these stands for one of my guitars and recently bought the tubular type...I should have bought another one of these instead. As someone else mentioned here, this stand does not put any unnecessary pressure on the guitar and the space needed on the floor is minimal and the guitar can be displayed near a wall. I highly recommend this guitar stand.----5 stars.", "id": 601}]