[{"review": "I love these pedals. Inexpensive to purchase - easy to mod to your liking.This pedal received the gain and JCM mod.I will purchase more of these and will mod each and every one of them.This pedal is also good stock for a lead boost. Love this pedal.", "id": 35}, {"review": "I use this at the house for pedal power or for testing new pedals.I don't use this on my pedal board and don't know if I would recommend it for heavy live use. I suppose having more than one for reliability would be the key here.It does work well and will power many pedals at one time. I do not use it for powering only one pedal though. This device puts out a lot of juice and will be noisy at times through less expensive pedals.I also like the fact that it only takes one spot on a power strip without covering up a neighboring power outlet.Easy to use - it is what it is.", "id": 191}, {"review": "This pedal adds that \"I don't know what\" to your sound.I chased a sound for years until buying this pedal - what a difference.If you have great, top quality cable, quiet amps and pedal boards, shielded guitars, fresh tubes - you know the drill - you spend thousands chasing something you hear in your head - then you plug one pedal in and WHAMO!! - there it is!It was THIS pedal for me - just turn the knobs until \"it\" comes out of your speakers.A must have - especially if you are playing clubs, bars or arenas - you have a pedal board - and you are looking for that sound that is gonna finally push your sound out front - give your notes clarity during leads - make overdriven chords ring.I like this pedal - it's on my board - and it's never coming off.", "id": 300}, {"review": "So far so good with this pedal. Nice clean boost and a good overdrive sound when the second stage is activated.I mainly play relatively clean through a tube amp and use this pedal to simply cut through on the leads.I don't use this pedal for searing leads or ultra dirty sounds - just a little dirt - and two levels of it.It makes a good single channel amp act like a three channel amp and so far it is working great!Main amps - 1960 Bassman - 2012 Fender Hot Rod Deluxe - 1957 Fender Bandmaster - these amps sound great with this pedal - I don't use all three at the same time but one of these amps is with me when I play out.This pedal is very versatile and there are lots of good sounds in there so you will probably find something you like in there - but I don't think it will metal very well by itself but it would kick the front end of a good tube amp into another level of distortion pretty good.*****************************************09/27/2013Still lovin' this pedal. You gotta run it on 18 volts to really wake it up.This pedal has a lot of various dirty sounds - and is very versatile.I would purchase another if I needed it.Worth every penny.", "id": 441}, {"review": "Sturdy - great latches - I love the handle - so comfortable to carry - nice and big so it fits your hand well.Not a lot of interior storage - but my Strat fits well - it is very secure inside.There is enough room inside for a strap and a cleaning cloth, a few picks and a set of strings - but not much else.My old case I could also fit a Boss TU-3 tuner - this ensures a thinner, lighter case.The case is also very well balanced with the guitar inside.If I purchase another Strat I will purchase this case again. Great case. Heavy duty. Rugged. Sturdy.** 10-23-2012 - still holding up well!", "id": 557}, {"review": "What a nice product. Rugged and well made. The supplied velcro makes it easy to change pedals for various gigs.I was able to build a pedal board with a tuner, delay, distortion and a two button amp channel switcher with room to spare. It looks very neat and tidy. Using George L's makes it look even better.I will buy one of these again. These things rock!** EDIT - 10-25-2012 **Still a great little board but I found Power Grip Pedal Board Velcro - this board that the new velcro make this an unstopable unit.", "id": 588}, {"review": "Look just like Schaler branded parts without the Schaler brand name stamped on them - there is a little Fender logo on the bottom - real cool.These strap locks are the greatest - they work perfectly every time and will survive years of on the road abuse. I have carried an extra set with me in my case in the event that I broke one - but this has never happened.Touring, bar bands, garage bands or bedroom heroes all need these strap locks on every guitar and strap they own. And since the guitar isn't hanging by the hole in the strap the strap lasts years longer.", "id": 607}, {"review": "Outside of a vintage Show Bud volume pedal - this is possibly the finest volume pedal on the market today.Very smooth and accurate - I like the feel of this unit - and the sound is transparent - I cannot tell if it is in or out of my signal path.I run this volume pedal AFTER my pedal board at this time - I have a dirty pedal, delay, chorus and tuner on the board at this time. But I am upgrading to a larger pedal board soon - and will place the volume after the dirty pedals and before the delay and chorus pedals at that time.The pedal is heavy - sturdy - thick rubber pad on top - nice rubber the bottom that covers the entire underneath of the pedal.Built like a tank - brushed finish - connections on the front.It is very big - I wear an 11 1/2 shoe and it fits my foot very well - so this is not for a small pedal board.There is a tension adjustment on this unit so the end user can dial the feel of the pedal in to his or her liking.If you need a volume pedal just buy this one - you won't be sorry.******************************************Just as a reference I have used an Ernie Ball - the one with the string - and the Morley volume pedal - this Dunlop Volume pedal is finer than the other two - the fit, finish, sound, feel while using it, ease of use and build quality far exceed any other pedal on the market today.", "id": 673}, {"review": "I love these cheap little pedals.I don't know if these would make a long tour with rough use - but they will be good for small club use with a careful handler.Great for around the house and rehearsal.A little noisy - but what do you expect at this price, right?So far very reliable after a few months of use. I will take this out on a little club tour and post back with problems and reliability concerns and if there are any preventative measures to address beforehand.Otherwise - great product. They look cool also - like something out of the 60's Star Trek or something.*************************************09/27/2013I still use this pedal on my main pedal board - it just sounds so good!Sound guy asked me about it the other night - and when I showed it to him he didn't believe me.$10 for some of the best analog delay sounds out there - who needs boutique pedals?", "id": 716}, {"review": "What a fantastic product! I believe I have been wishing for this for years!Only one problem. Make sure that you want that pedal there - because once it sticks - you will have a difficult time removing it from that spot.No longer are my pedals going to become disconnected after travel - they actually stay attached to the pedal board!I have ordered two more to do more pedals and boards - this stuff works and is T-U-F-F!I you are having problems with your pedals becoming unattached from your board after driving to and setting up at the club then this is the product you need!I just wish I could get paid for endorsing this product!*********************************Still holding strong - building another board and using this stuff - it's much better than regular velcro - I don't have time for pedals falling off of my board in transit - use this and that annoying issue goes away.", "id": 765}, {"review": "This is an always on pedal for me.It's at the end of my pedal board right before the BBE.It really allowed me to wake up the board - and I like the fact that I can adjust it on the fly if I don't totally agree with my tone that night.Very nice - built like a brick - every guitarist and bassist needs one of these whether you run a pedal board or not.", "id": 140}, {"review": "Works great - very good feel - we have it on carpet and it works well on the carpetMy wife loves it - if I needed two I would buy another", "id": 251}, {"review": "This thing works great!I play out live in clubs and this device is indispensable. Accurate and quick - great for between song quick tuning.It's a Boss pedal - so it is rugged and reliable.I have seen this pedal on the pedal boards of top touring pros, recording artists and session musicians in and around the Dallas and North Texas area. I play locally and regionally in North Texas and see this pedal on almost EVERY guitarist and bassist's boards every night.Great product - well made - worth every penny.** UPDATE **After using this tuner for a month I can say that I made the right decision.Fantastic product that every guitar player needs - period.** ** ** ** ** ** *EDIT 10-23-2012I have purchased another one of these tuners for an alternate pedal board.These really are the best tuners out there - you should get one today!There is no comparison to anything else out there - nothing - I have looked!", "id": 647}, {"review": "Kenny Wayne Shepherd - \"Blue On Black\"Nail the lead - use a Strat in the neck position.Gets close enough to fake it for a club band.Sounds pretty close to the more expensive models from Chicago Iron.This pedal will save you $300 or more from the CI model - and it's close enough.Some are concerned with the switches - I am running it in an FX loop pedal - so it rarely gets the button pushed anymore.I have the Joyo Ultimate OD also - nice pedal - I think I like this little company.", "id": 836}]