[{"review": "I bought this specifically for a GT-100. It fits, snuggly, almost like it was designed for it. There is enough room in the front pocket for the power supply, input and output cables and maybe a little more. I was also able to put a 3/4&#34; binder in on top of the GT-100 which sort of protects the screens and knobs a bit more, and provides a place for the stupid lead sheet binder than never fits in my other cases.This bag is a good size as just an accessory bag to carry along with a guitar and a combo amp if you have a couple pedals and cables, or some odds and ends you want to bring along.Pros--------Looks like the same basic quality as my other gator bags-GT-100 Fits like a snug glove (with just a little use it will be perfect)-Front pocket- Reasonable priceCons-------- They cost reduced their logo from a thread stiched logo to a cheap vinyl like silk screen or iron on patch. (unlike product photo) and it doesn't match all my other gator bags. Not a big deal, but worth mention.- Other similar gator bags I own have a wrap around padded handle that velcros the two handles together once the bag is closed. This does not.Overall good product, but would have liked that other padded wrap around handle and the &#34;non cost reduced&#34; logo.", "id": 165}, {"review": "SUMMARYIf you aren't using locking tuners, you're wasting time when you restring. They are just faster and easier. Overall, this is a really nice convenience upgrade on guitars and it's not very expensive to do. Fender uses these on the American Deluxe, and once I got one, I had to have these on the rest of my stratocasters. Because they save time restringing, you are more inclined to restring frequently, which means you sound better. (Fresh strings can do a lot for your sound!)I've put these on several guitars I have, and always appreciate them when changing strings. At instalation be aware these are staggered height tuners so be sure to put them in the correct holes (see below). These are drop in replacement tuners for most modern MIA and MIM Fender Stratocasters and Telecasters that use a Shaller style tuner. Fender makes these relatively cheap now in chrome, although I wish they would make them affordable and available in a gold finish. I've seen also seen nickel and black, and they make gold but hard to find and rather expensive (something like $120 a set).FUNCTION/PURPOSEI think people believe these somehow give you more stable tuning or something but that is actually not their purpose. Proper use of a traditional non-locking tuner is just as stable. Some folks don't actually understand how to properly use traditional tuners and they don't get stable tuning as a result because they use too few or too many wraps and don't string it correctly. For those folks, these will elimiate the resulting \"pings\" and such. But their intended purpose is to speed string changes. I believe that some folks confuse locking tuners with a locking nut in that respect. A locking nut quite definitely makes for more stable tuning, and that's why you always find them with Floyd Rose tremolos which are made for dive bombing. But locking tuners are not really for that purpose.FIT AND INSTALLATIONRegarding fit, these have 2 little pins on the backside. If you are considering a replacement, make sure you get tuners that are the right size and configuration for your guitar so you don't have to drill the back of the neck, the tuner bores in the headstock, or use inserts. If you want to use these but don't have the little alignment holes, Stewart Macdonald makes a small drilling jig for drilling those holes. It's expensive (about $40) but not as expensive as messing up your neck or breaking the tuners when you tighten them down on ill fitting mounts. It is nearly impossible to drill those alignment pin holes correctly without a jig, and even with the jig, easy to be slightly off. These fit most newer FENDER stratocasters and tele's, both american and MIM and will be a drop in replacement with no muss and no fuss in most of those cases.Pull one of your existing tuners out and look at it before you change. If you have a squier or a knockoff you may want to measure the headstock bore and remove a tuner to look at the back mount. Maybe buy and inspect, with the knowledge you might have to return them. There is usually an exact fit drop in replacement locking tuner that can replace your standard tuner so if this isn't it, look for one in the same brand as what is on your guitar now. Be aware different tuners also have slightly different holes bored for the main peg hole.Typical neck bores for tuners (by brand) are shown on the warmoth site at [...]These are the holes that warmoth uses on custom necks when fitting tuners of various brands:- For Fender/Shaller tuners, its a two step bore, with the main portion being 25/64\" and the rest at 11/32\".- Vintage style tuners use 11/32\"- Gotoh and Grover use a two step 13/32\" to 11/32\"- Sperzel uses 25/64\"- Planet waves uses 13/32\"Of course, if you are mechnically inclined, have the tools, and don't mind potentially drilling additional holes in your neck, you can almost fit any tuner you want on any guitar. Sometimes that means using inserts or bushings, or drilling a hole for a tiny backmount screw, or for alignment pins in different locations...but the best answer is to use a tuner that is a drop-in replacement.When installing, be sure to look at the height of the pegs on your old and these new tuners. These are not all the same length -- they have staggered heights - 3 long and 3 shorter. (I think I have also seen some sets that are 4/2 but these are 3/3.) Put the long ones in the E-A-D string holes, and the shorter ones in the G-B-HighE holes.", "id": 387}, {"review": "SummaryAcoustic sounds &#34;ok&#34;, but noisy in weird ways. I returned it. Price seems high for what it is and vs. alternatives in the marketplace.Pros- Boss case is metal, mechanical design is durable- standard 9V power, and the power jack is on the back where it belongs.- variety of acoustic sounds possible. (personally, I only thought 1 of them sounded realistic at all though)Cons- fizzy noise integrated with notes played (or chords)- generally kind of noisy in the pedal chain- While I have several Boss pedals, I think they always make the knobs too small and the font/print too small. I prefer pedals with larger and fewer knobs that can be tweaked with your toe if needed while playing.Details:The basic concept is good. I had an AC-2 (prior model) and sold it because it had a noise problem where there was a fizzy noise when you play a note. It wasn't in between the notes or when not playing, it was integrated with the sound of every note you played (or chord) and you could not filter it. It was also just noisy in the pedal chain. Adjusting your guitar volume down for higher gain pickups helps some. However, I sold that model because I didn't want the pedal in the chain with everything else and I wasn't happy with the sound. At the time, the AC-2's were selling for about $85 new. Boss since redesigned AND raised the price significantly on the AC-3.I bought the AC-3 hoping they had improved the issues of the AC-2 -- and they did, a little. But not enough to keep it. I returned it after a week because it still has the same basic issues, just not as pronounced. I think the AC-3 could work for gigging, but there are other choices that sound as good for $25 instead of $130 to $150 (with tax and/or shipping) so to me, the boss pedal is overpriced and not that great.I opted for a Behringer acoustic modeller instead. They make two -- a &#34;300&#34; and a &#34;400&#34;. The 400 has reverb on the pedal. I opted for the 300 and got it for $25. I expect the durability will be lower on the Behringer than the Boss as it has a plastic case. However, this is an effect I pull out just once in a while and since I can buy 4 or 5 or 6 Behringers for the price of a Boss....if it breaks...I'll just buy another.I also have a Boss GT-100 multi-effects unit. You can get the same or similar acoustic modelling sounds out of that, out of the Behringer or out of the Boss AC-3. The least cost effective of those choices is the AC-3 - and it has noise issues the other two don't have.I'm not saying its a bad pedal, I'm just saying it wasn't the best choice for me when considering the cost, the sounds, and my usage model. If they would fix the noise issues, I might have even kept it. I did opt to keep the Behringer for those times I'm using a discrete pedal board and want an acoustic model effect. This Boss pedal just didn't work that well for me.", "id": 411}, {"review": "SUMMARYGreat pedal, buy it, you'll probably keep it! At its price point - 5 stars. I am keeping it and it is probably going to become a permanant addition to my pedalboard. Only time will tell but I like adding some vibrato for clean sounds. It reminds me a lot of how I used to set up my Super Reverb amp. Compared to all pedals, I'd actually give it 4 stars - downgrading 1 star for the plastic case and the limited functionality of the Rise control. But I liked it so much I decided to score it \"at its price point\".PROS- dirt cheap at $25 for a new pedal- sounds great - does not add or subtract any frequencies or add any noise (I wish I could say the same for some $200 pedals I've tried.)- Latched/Unlatched mode -- the best feature on the pedal. I love that I can put this in unlatched mode and use it to vibrato in short bursts.- Small form factor - normal \"single pedal\" size- Standard power supply - 9V Center negative - runs from pedal board power or a battery- The larger foot pedal surface (compared to just a silver bullet switch) is nice for the unlatched mode useCONS- Cheap plastic case - I doubt its durability and would have preferred to pay more for a more durable case.- Latched/unlatched switch is small (hard to reach, have to bend over, can't do with a toe)- Rise control has only the most subtle impact on sound. Probably not needed on this pedal. Two larger controls for the other controls would be a better design for usability.- Like most pedals - the knobs are super small and not easily controlled with a toe, and the settings are hard to see. My favorite pedals have large knobs, well marked settings you can see from a distance, enough space between the knobs to set one without bumping another, and in the best cases, enough space, size, and durability for the knobs to be tweakable by a foot or toe bump.Suggested Redesign, \"Super Vibrato\" or \"Vibrato II\"1) Change to a metal case2) Lose the Rise control altogether3) put the latched/unlatched modes on a 2nd stomp switch so you can stomp to go between modes4) Increase the size of and space between the other two controls -- put large \"foot controllable\" knobs with high visibility knobs.Then again, at 25 bucks, I might just buy a 2nd one and put one in latched and one in unlatched mode.", "id": 429}, {"review": "COMPARISONS: I have compared, side by side, the following pedals:Fulltone mini deja vibe ($200), Dunlop Univibe (discontinued stainless steel model)($220), Dunlop Roto-vibe ($180), Voodoo Labs Micro Vibe ($150), BBE Soul Bender ($129) as well as comparing to some \"different beasts\" in the modulation family - an MXR phase 90, MXR EVH flanger, Boss chorus, Behringer Vibrato, and Behringer Time Machine.SUMMARY - just the factsA great pedal and my favorite uni-vibe of all. Doesn't take a lot of space up, standard power supply, good visibility on control knob settings. Does not add or subtract frequencies to the signal or add noise. This is the only pedal in the univibe group I can say that about and it's why it's almost certainly going to be the one I keep. Might have slightly less ability to produce as thick of a univibe effect as some of the others -- still need to play with it a little more. Overall I LOVE this pedal at under 60 bucks. Only downsides I see are the LED does not flash the speed rate, and the speed control is top left which makes it hard to \"toe tweak\" with my right foot. Quality seems ok, but time will tell on durability.PROS- Smallish form factor, although slightly larger than a \"boss\" pedal, doesn't take much more room than a standard pedal.- Standard power supply (9v Center negative), and jack on top back for easy access - not in the way for patch cables on sides.- Switchable between chorus(univibe) and vibrato.- Controls spaced well for handling and use knobs with high visibility marking - easy to see.- Best PRO is that it does not boost or cut volume and does not boost or cut bass, mids, or lows. It just applies the uni-vibe type effect as dialed in and retains the character of the guitar tone. This is the only pedal I tested that I can say that about -- and most of the others cost 2-4 times what this one cost.- LED is red, visible and NOT a weird bright laser to my retina- The PRICE at about 60 bucks - is a great deal- Quality of construction -- metal case, decent knobs, pots and switches - no complaints so far.CONS- LED does not flash speed rate- Speed control would be better placed Top right or bottom right for \"toe\" tweaking- I have just had this a day so can't tell but might be limited in getting the deepest most lush univibe sound - not sure about that and I will update this review as I get time to test further. But it sounds great to me...OVERALL - highly recommended if you want a univibe and don't want to do a lot of comparison shopping. I have done it for you. Some users report quality issues here -- I guess time will tell on that. Mine works fine so far, and for $60 you could buy 2 and still save money over most other options available.--------------------------------------NOTES ON ***OTHER*** PEDALS I COMPARED---------------------------------------- Fulltone Mini Deja vibe -- highest quality construction (as expected at $200). The large knob in the lower right corner for speed is great and allows toe tweaking -- very useful on a vibe pedal. My complaint is that this vibe colors my tone - it boosts the mid range tones while maintaining the crisp highs and slightly losing the bass. This probably helps the sound stand out in a mix, however, I'd rather that my vibe not provide EQ because when I switch it on or off, I don't want to have to compensate at my guitar tone knobs to try to get back \"my sound\". I was able to match exactly an authentic original Uni-vibe sound with some adjusting. It seems to kind of muffle the pick attack or compress it also. I have a love-hate relationship with this pedal after about a week of testing it. Some days I hate it...but I like the build quality and the speed control. I originally liked that it was one of only two pedals that didn't strip the treble off my tone -- until I realized the mids were boosted, the bass was cut and the pick attack was somehow tweaked. Mixed bag, and at $200 shouldn't be.- MXR/Dunlop M68 (new in 2014). At about $140, The new M68 Uni-Vibe is a very good vibe pedal with much to like. It is second place on my list. On pure sound I might even like it slightly better than the Jimi, and that's saying something! It's the perfect form factor (shape/size) with no significant coloration of the tone, other than perhaps a tiny boost of treble in one mode. The M68 gives the Jimi a good run...and if you are extremely tight on board space, it might be a better choice for you. They sound very similar. The M68 has a wider range of adjustment on speed/depth than the Jimi, but I'm not sure the extra range is useful. MXR/Jim Dunlop/MXR have GREAT factory customer service if you ever have an issue. They fixed one of my pedals free even though out of warranty. I really do wish MXR would move their power supply jack to the rear vertical surface instead of the right side vertical surface. It is often in the way of right angle plugs on all my other MXR's. Use of the small top left push button for switching from chorus to vibe on this pedal was the main negative issue as I'd have to leave it with the mini switch engaged, and the red LED burning all the time, looking like it is on when I was not actually engaging the circuit with the main switch. It was also a tight fit. This pedal has a level knob which I'm usually a fan of but I don't see the need for it on this effect. I didn't care for the white \"main\" LED much, and of course the power supply location. The LED on this does pulse the speed, but was annoying due to the white LED. That's a subjective thing I suppose. All said this is a great sounding option with that perfect MXR size, so a good choice. But still 2X the cost of the Jimi. I stuck with the Jimi on form, function, sound, and value.- Dunlop Uni-vibe UV1 -- Cool stainless steel construction. Knobs were hard to see settings. placement of vintage switch on the back of the pedal was easily forgotten at worst and awkward at best. Non standard 18V power supply takes double slots from my power supply brick. Sound was very good but did also color my EQ sound by boosting the bass, and muffling the mids and highs slightly. On the one hand, this sound matched a lot of recorded uni-vibe sounds I've heard. On the other hand, once you strip the treble its hard to put it back in the mix. The seller had a 3 day return policy (3 days??!!) so I returned it and they lost the sale. Othewise, I would still be thinking about this one. I was on the fence about whether it was my winner. I was able to match a true uni-vibe sample, but the treble was slightly lacking and bugged me. At $220 I'd have to love it to keep it.- Voodoo Labs Micro Vibe - Liked the form factor, the simple controls, high visibility knobs, ability to toe tweak controls, standard 9V power supply, and placement of all jacks. Can get a very lush, even excessive univibe sound except the bass is very boosted, and mids/highs are cut. The EQ effect just kills the pedal for me. Its going back. Not my pick at $150.- BBE Soul Bender - My least favorite Vibe. It had extreme muffling of mids and highs, heavy boost of bass. In a band mix, I'm pretty sure it would get totally lost. At home, might sound ok. form factor was good, controls were simple, I think it pulsed the speed. My recollection is it had an overly bright blue LED. It was the first vibe I bought, and I only compared to Fulltone and Dunlop before returning it. Had some useable sounds, but with the intensity above 50% had an annoying \"womp womp womp\" of a bass note that was not coming from my guitar -- a weird defect in the effect sound in my opinion. With intensity below 50% it was usable...kind of. But a tone muffler. I returned this one early.- Dunlop ROTO-Vibe : A good choice (perhaps the only choice) if you MUST have expression pedal controlled speed adjustment. Didn't color the tone much - and that was a problem on most other uni-vibes tested. Limited speed range and awkward controls placement were most annoying to me. Intensity range seemed less than other pedals too. Large footprint if mounted on board, but also offers the ability to take NO space on the board by not mounting it. I didn't like that when you switch the effect on, you are automatically at high speed due to the mechanical nature of the design. Some awkwardness in the placement of controls and power plug vs guitar cables when plugged in. Std power supply a plus. LED indicators good and flash the speed. Durable construction although the mechanical nature means in time something will need lubricating and you may need to replace internal gears or pots. Overpriced 1.5 to 2X in my opinion.- Other general modulation effects. Univibes are effectively a phase effect - without the swooshy space-age edge on the sound. You can probably modify a modern phaser pedal to get the univibe sound which is like a vibrato plus analog chorus combined. A modern phaser is close, a modern flanger is much too space-age sounding. Vibrato pedals can capture the vibrato aspect of a uni-vibe and I'd recommend the behringer vibrato at $25 if you like vibrato sounds. uni-vibes are normally used for their \"chorus\" setting, not the vibrato setting. Didn't care for the Behringer time machine.My gear used for testing: Fender American Deluxe stratocaster. Mesa Mini-rectifier amplifier, Mesa Rectifier 2x12 cabinet with Celestion V30's. Pedal train pedal board, voodoo labs pedal power power supplies.A NOTE ON VENDOR SELECTIONI had a very bad experience with the vendor I bought my MXR/Dunlop M68 from, and while it does not weigh at all on my review of that product, I provided a separate star rating on the vendor feedback page. I recommend if you choose to purchase that pedal (or anything else) you be careful to avoid the Amazon Marketplace vendor called MixDSPnet in San Jose, CA. In addition to charging a 15% restocking fee if you want to return the pedal (in original condition with all materials and packaging), getting them to even acknowledge the return request at all was a problem and took over a week and finally opening a claim with Amazon to get any meaningful response. Once they did communicate, they were very unprofessional. Further, when the product was shipped back signature required (as recommended by amazon), they were \"not available\" or refused to sign for it so after several weeks of attempting to return the product, it remains **unrefunded** despite their confirmation that I could return the item for an 85% refund. I expect I'll need to work further with Amazon in the end to get this resolved. A google earth view of their addressed explained it all. MixDSPnet appears to be running out of an apartment complex. Most Amazon marketplace sellers are just fine but this one is really not, at least when it comes to returns. Also, while they sell a few Dunlop/MXR guitar pedals, looking at their site reveals it's not their primary business - they seem to sell a bunch of other non-musical widgets. My recommendation is that you find a vendor who is in the musical instrument business and who will provide the typical no cost refunds for 30 to 45 days as most large musical instrument retailers do, should you need it. They have a few hundred positive transactions, so maybe can be OK but I can only comment on my experience and this was the worst online transaction I've ever had shopping on amazon.", "id": 551}, {"review": "These are a direct drop in replacement on Fender Standard (MIM) stratocasters, Fender American Standard, Fender American Deluxe.I have replaced my tuners of this style with Fenders locking version that looks just like these but has a thumbwheel on the back.Unfortunately, the locking ones are difficult to get in a gold finish. (But you can get them, ultimately.)I ordered a set of these non-locking ones - the finish is nice and is the deep dark gold that matches fender's /schaller's gold hardware. (not all gold hardware is the same color gold). The quality is good and they look and function well. However, I returned them because they are not locking...I ultimately decided a locking tuner was more important for the guitar I was building.If you just want gold tuners, don't care about the string locking feature, and are playing a fender strat or tele - you can't beat these. By comparison to a lot of the gold tuners, the price of these on amazon is quite reasonable too.", "id": 560}, {"review": "I compared this side by side with two other reverbs-1) The Boss '63 Fender reverb2) The Electro Harmonix Holy Grail.I found the EH- Holy Grail the most natural sounding and the simplest to operate with only 1 knob and one switch.The TC pedal did sound nice, but to my ears slightly sterile by comparison to the Holy Grail.I thought the Boss pedal sounded pretty bad.Pros of the pedal:- several settings and with all the knobs, highly adjustable- mono or stero (2 inputs, 2 outputs)- standard 9 volt power supply jack used by most pedals- I liked the spring reverb, and the \"mod\" reverb which was lush.Cons:- Sounded a little sterile compared to EH Holy Grail, but close and still good- I thought the number of different reverb settings was actually overkill and just there to look like it did a lot. To my ears, the rest were less distinctive.-Priced at $150, seemed a little high although I know there are other pedals that cost more.Overall a nice pedal, I can't really ding it for the cons above so I still gave it 5 stars. I had to compare a couple times to the EH holy grail to make my decision. In the end, the grail was cheaper, simpler and sounded more like a real reverb tank in my opinion.", "id": 748}, {"review": "SUMMARYAt $20 it is a great size and \"ok\" quality to round up a bunch of various stands you may carry to a band practice or gig. Other options are available slightly longer and also with a 2nd compartment inside. No padding or impact resistance is provided, but gets a bunch of stands in one bag with a handle. Also available 8\" longer or with 2 chambered configuration on different models.PROS:- Good size for speaker stands, mic stands, guitar stands, music stands other than the top shelf, and other \"what-not\" you may want to cram in there, depending on your style.- affordable at $20- availalbe on prime shippingCONS:- This model is one compartment. For speaker stands, you may want a 2 compartment model.- Lack of any impact resistance - the bag has no padding at all. it is just canvas.- It would be great if they made one of these just a little wider to be able to accomodate music stands.DETAILSIn one of my 50\" bags, I was able to put:- 4 folding mic stands- 1 music stand, other than the top piece with the shelf (that does not fit, even if the bag was empty.)- 2 folding guitar stands- and still had room for some more if I wanted to put more in.- bag was getting kind of heavy at that point.In a sconed 50\", I was able to put:- On Stage Stands OSS SS7761B Speaker Stands- They fit with extra room on the ends in this 50\" bag.- There is additional room to add mic or guitar or music stands- I am considering exchanging this one for a 2 section 50\" bag so the speaker stands are separated, but probably will just keep this one.The bag has no padding at all - it is just canvas and a zipper and handles. When laying empty it is 50\" long x about 12\" wide and lays flat. Seems strong enough to round everything up and tote it around,But for $20, serves a basic purpose with affordability.", "id": 552}, {"review": "This pedal is \"ok\" by which I mean, I provides the basic functions it says it does. Quality-wise, it feels a bit cheapish....I was afraid I was going to snap a pot off or something while playing it. The case is metal but feels like the thinnest sheet metal they could get away with building it from. The power switch and chorus/vibrato switch were clearly the cheapest switches they could find, and are not that easily accessible by a toe...you gotta bend over and flip those. They are small.On the other hand it was only sixty-nine-bucks - relatively inexpensive for a multifunction effect pedal.I don't care for the rear facing upwardly angled input, output and power jacks. That's not pedal board friendly in my opinion. Nice as a tabletop effect. The footprint is fairly huge on the board at about 7.75\" x 6.5\" (approx). The \"standard\" 9V center negative power supply is a \"postive\" (excuse my pun.)If you are looking for a way to play with signal modulation - echos, vibratos, reverbs, old style choruses...this is not a bad way to get started playing with that. You can make a lot of sounds without breaking the bank.Personally, I have other effects that make these sounds and do it in a smaller space, so for me...not a keeper. Your situation might be different than mine.Not a bad product, acceptable at it's price point, just didn't impress me much.", "id": 608}]