[{"review": "This is a fine guitar, but it isn't amazing.  My particular instrument has some issues with the finish in a couple of places around the perimeter of the guitar - they look like black splotches underneath the sunburst paint and clear-coat.  There's one near the top strap post and another near the place where the pick-guard mounts to the underside of the body.  Neither would be apparent to someone who wasn't appraising the guitar, but they are there and don't look normal to me.  Maybe I got the first one off the line after they switched from black-painted models?  My guitar also has a weird V shape on the back of the neck where the wood grain doesn't match at all - I'm guessing that it's a joint that has been glued together.  I know that the better Les Paul guitars have a one-piece neck, and since I didn't read about this one having something different, I assumed it would be the same.  Glue is stronger than wood and Les Paul guitars have a tendency to break in that area, so I guess my guitar should be more durable than some. Still, it was a disappointing and unexpected discovery.  I'm not sure that seeing these finish issues before-hand would've dissuaded me from buying the same guitar, but upon reflection it would've been much smarter to visit a music store and examine the guitar before buying.My remaining issues with the instrument have more to do with the general design of all Les Paul guitars versus my particular instrument.  The guitar is too small for me to comfortably play it without a strap, even while sitting.  The top strap peg is angled up slightly, where guitars with horns have them angled down, which means that investing in the install of a straplock system of some kind is a good idea with a Les Paul - the pegs just don't stay in the strap holes as well as on some other guitars.  It's great that this guitar has all the knobs and switches that &#34;real&#34; Les Paul guitars do, but from a practical standpoint it is rather cumbersome to have separate volume and tone knobs for each pickup.  The range of adjustment on the saddles is pretty small, and I found it impossible to setup the guitar for coated .09 strings without additional hardware.The guitar sounds decent, it looks pretty great (although not quite as pretty as the pictured one), and due to its shorter scale length it is a tad easier to play than some other guitars.  Note: the shorter scale length is characteristic of Les Paul guitars, it doesn't indicate that this is less than a &#34;full-sized&#34; guitar.  Though this is a fine guitar for the price, I'm not sure that I would make the same choice if I were in the same position again.", "id": 30}, {"review": "My new electric guitar isn't particularly comfortable to play while sitting, so I needed a strap.  I've played with straps in the past and always found them to be uncomfortable, so I hoped to find a padded strap that didn't break the bank.  This strap fits the bill just fine.  Depending on the angle that your pegs are set, however, you may find that the holes in the strap will with time enlarge to the point that the guitar is always in danger of falling.  If your pegs are set at an angle, like on a Strat, this strap will last forever.  If you're on a guitar with a horizontal peg, like a LP, you'll probably want to invest in some strap locks as well.  This will move the pressure from the strap holes to the metal locks and both extend the lifetime of the strap and its security.  The padding is OK, but not great - however, it's certainly better than a regular nylon strap and does a good job of forcing the strap to lay flat across the shoulder which is a huge bonus.", "id": 470}, {"review": "These strings are really nice.  They have a great tone, decent longevity, and the trademark Ernie Ball feel.  Some reviewers have stated that the strings have a silky feel - even comparing them to coated strings - but I don't find that to be the case.  They feel pretty much like any other guitar string, albeit much gentler than stainless strings.  If money were no option, I'd probably move to these exclusively, but at roughly three times the price of good to great nickel strings, I'm not sure that they are good enough to justify the massive price premium.  Each string did come inside its own protective sleeve, which made restringing easier and is a feature that I absolutely expect from a premium string.", "id": 825}, {"review": "I have never owned a Straplock system prior to owning these Dunlops, and boy am I amazed!  Every straplock system I've used in the past, on friends' guitars, semi-permanently mounted the strap to the guitar - often with extra ties and all manner of things that made it impractical to detach the strap on a whim.  In contrast, these locks have a mechanism that make it trivially easy to pop the strap on and off - it's great!  Better still, the hardware fit almost perfectly into my existing screw holes, making installation trivial.  And the new posts are so close in size and shape to the old ones that I think I could slap any strap onto my guitar in a pinch, using the posts like the OEM ones.  This is a great system, and I would highly recommend it for anyone who uses a strap on any electric guitar.", "id": 44}, {"review": "This is a good stand.  I've had other stands of tubular construction in the same price range before, and this one is definitely much sturdier.  It fits every guitar I've put in it just fine, and holds them rather steady even without fastening the clumsy band across the neck.  If you have ever been tempted to lean your guitar against something, then you owe it to your instrument to pick one of these up.", "id": 436}]