[{"review": "If for some reason you're looking for a pick with a specific color, this is a nice set. The bright colors make them difficult to lose.", "id": 69}, {"review": "I love this company. D'addario makes a grab product and it lasts a long time. Ever since I switched to this brand of strings, they seem to last longer and make a grab tone. I don't know if it's my guitar (Taylor 214CE) or the strings, but I can not get over how great the quality is even after months of use. I definitely recommend this product to anyone who plays the acoustic guitar.", "id": 130}, {"review": "My son has been a guitarist for seven years and loves these strings. Not a single one has broken since he started using these three weeks ago. These strings tend to repel the dirt and dust even with heavy play the strings look very good. He has been getting less callous on his fingers. The tone produced by these stings is very good especially considering the low price. My son has a very heavy hand but these strings are well made and withstand play from any style.", "id": 156}, {"review": "My kids were excited to split this pack of picks. Since there were two of each in the pack, they didn't have to argue over who got which pick. These are very unique and a nice way to personalize your playing. I think these would make a great gift for a grandparent or parent who played guitar in the 60's and 70's.", "id": 573}, {"review": "I am impressed with d'addario's electric strings. Easy to adjust to, very light on my fingers and they're built to last. With a few adjustments to my amp settings, these strings are very dynamic in their tone quality from classic to hard rock styles. Any guitarist who plays electric can enjoy these strings, and they last a long time too.", "id": 868}, {"review": "For years I used Kyser capos and the handle for them always sticks out and that can be an issue. Planet Waves' NS has a smoother handle that doesn't stick out as much and i've had no issues with gripping it on or off so far. It is easy to put on and off and it holds the strings down properly. If you're looking to buy a capo i'd recommend this over a Kyser.", "id": 894}, {"review": "I'm mainly a guitarist but I do play bass from time to time on an old Fender American. These strings are very bright in a good way with a clear, smooth sound. I love the tone you get out of these, very bluesy and the punch isn't too rough it's just right. I'm a huge fan of D'Addario, been using their strings for at least 4 years and they never disappoint. Give these a try if you're looking for some new strings.", "id": 896}, {"review": "I've used D'Addario strings for years and they never fail me. These extra light are great for playing lead as they're easy to bend and feel great on your fingers. As they are extra light strings, they serve limited purposes but as for tone quality it is very smooth and clear. For a brand as a whole i'd recommend D'Addario strings to any guitarist and for gauge it's really dependent on play-style and role if you are in a group.", "id": 897}]