[{"review": "Nice quality and love the cutter. The winder is a little awkward to use. I guess I need a little practice. But the cutters are great.", "id": 94}, {"review": "First time for a  soft wedgie......pick that is (I did have an older brother : ) ). I used it on my new ukulele and sounds and feels great. Very good price and looks like they will last awhile.I highly recommend they for you to try, if you don't like they you can give a fellow musian a &#34;soft wedgie&#34; which they just may like.", "id": 245}, {"review": "Very nice guitar strap. I bought it for my ukulele and it works fine. Good leather and believe it or not made in Canada not China! I would recommend this item for either guitars or in my case Ukuleles. Good value! Great seller and fast delivery. Thanks Amazon for a great product!", "id": 632}, {"review": "If you have a ukulele you know (or may not know) that it needs constant tuning especially with new strings. This little gadget does the trick. I was pleased to see that it is a no brainer to use and since it clips to the head it is there when you need it between songs.You will not go wrong with this purchase and I am sure you will love it better than trying the &#34;my dog has fleas&#34; tuning method.Oh yea, it does not just limit you to the basic notes for the uke but will tell you sharp and flat notes too!Now put that order in!", "id": 763}, {"review": "My wife was worried about what to get me for Christmas, I really didn't want anything (other than the Harley I have been asking for for 25 years, maybe next???) and while surfing Amazon I came across this Les Paul. I had to laugh since it looks so much like my Gibson Les Paul, kind of like a \"Mini Me\" version.Well I have never heard of a Les Paul Uke and did not think for $99 that it would be much...but the reviews were telling a different story. So I found my Christmas present at last for \"the man who has everything\" (it is true, my wife told me...still hoping for that Harley though). I ordered it a few days before Christmas so it would not be under the tree much to my wife's dismay...but I printed a photo of it and framed it then wrapped it up and placed it under the tree anyway. Well Christmas came which means it was also one day closer to getting the real thing (the Uke, not the Harley), but everyone had a laugh at my shocked expression and obvious glee when I opened up my framed photo of my soon to be baby Les Paul!I figured since I was taking my fellow Amazonian's word I better order some Aquila Ukulele Strings since everyone stated that the ones that came with the Uke are junk(and they are, shame of Epiphone) which I did, the Uke arrived about 4 days before the strings but I attempted to learn how to play it anyway.....OUCH those stock strings were rough on the fingers, and the sound left much to be desired so I waited until the new string were installed prior to this review.Wow with the new strings it is totally like a different instrument, it now sounds as good as it looks and sooooo much easier on the ole fingers. I just love it now!!!!So if you decide to get one of these Mini Me Les Paul's do yourself a favor and get.......A set if Aqila stringsAquila USA Aquila Concert Ukulele StringsA Snark Uke Tuner SN-6Snark SN-6 Ukulele TunerA nice leather guitar strapFender Plain Leather Guitar Strap With Fender Logo, BlackandA Daily Ukulele Song Book by Jumpin JimThe Daily Ukulele: 365 Songs for Better Living  [DAILY UKULELE] [Paperback]You will love all of these items I am sure.When it arrives be sure to practice \"Billie Jean\" played by Jim Hill...see it on YouTube...it is a riot![...]orJake Shimabukuro Bohemian Rhapsody[...]Enjoy!", "id": 814}, {"review": "The products work great, applied them to my new Les Paul Ukulele for protection. The strings that came with my ukulele were junk so I decided to replace them with aquila strings. Prior to doing so I decided that I would like to prep the fret board. The frets seemed a little rough and the rosewood looked a little dry to me so....I ordered this kit to see what it would do. It comes with both fret board cleaner and even a very fine grit emery cloth for the metal frets. I thought I would try the emery cloth on the frets and was very pleased with the results. The frets are now very smooth and shiny and the rosewood fret board looks like it is much happier after a little drink.The polish for the instrument brought out a deep luster...but remember a little goes a long way so the wax should last a very long time as I am sure the other products will too.The cloths are very soft and should not damage you instrument. Mine came soaked due to the 02 bottle leaking upon arrival. That is the reason I did not give this product a 5 star. It looked like the package was damaged prior to shipment since the out side package was pristine and the product was protected well inside with adequate padding.I am now going to work on my Gibson Les Paul Custom Guitar and I am sure that I will be very happy with the results!Great product which would deserve the full 5 stars if it was packaged a little better.", "id": 95}]