[{"review": "The D'Addario sets are good stuff. I got turned onto them about a decade ago by a coworker. The color coded ends are great whether you are new at changing strings or just want it more automated if you are an old veteran. With stretching, they stay in tune fine. The unknown truth about non-nylon strings (and maybe even them, too) is that there are only a handful of string makers, and D'Addario actually makes them for other companies (Gore uses them for their Elixir series, and just adds the polyweb coating). I also use the GHS standard .010 sets, and they are good too. My faves are the Ernie Ball sets, but they rarely go on sale. I don't remember who makes what strings for what companies, though. With offshore production a standard thing now, it's no telling where they actually come from anyways. I DOUBT that GFS strings are domestic production, for instance.", "id": 156}, {"review": "This was bought based on the advice of others. I had a cable with the standard Neutrik/Switchcraft-type ends fail on me, and this cable was supposed to be either strain free or simply designed for long life because of the strain of usage.It worked great for about 4-6 months, and then broke. It happened so quickly (the trad types seem to take longer) that I swore it must have been the output jack on my guitar. After confirming the guitar was okay, I tried a shorter cable, which worked fine.D'Addario does offer lifetime replacement, but it puts you in a bit of a bind - you need a backup cable while you are waiting for a replacement, and you have to pay return shipping of the defective cable out-of-pocket. You also have to get R.A. Taken altogether, this makes it a deal breaker. The extra costs essentially make this cable as expensive as something that has a track record of lasting for years. In my case, I bit the bullet and did what I should have done the first go-round and got a really nice DiMarzio cable.Again, this cable SOUNDS good while it works - capacitance with the longer cables can be an issue. The good news is that IMO high price is not a guarantee of ANY cable sounding good. The replacement DiMarzio is another example of one that was at the top of the list with cable comparisons. I don't get into the mojo or intangible aspects that will typically find someone paying much more for a cable, but I want durability and published capacitance that is within a certain range. This one meets half of those criteria, but it gets expensive because of the potential to fail sooner rather than later. Well, expensive relative to a cable with an initially higher price but longer lifespan.So the replacement that Planet Waves sent me is now the backup, and is still in the original packaging. I figure I'll use it only for short periods while replacing my main cable, so it should last a long time in that situation. If I have a few $ for the shipping and D'Addario is still honoring the lifetime warranty if/when the 2nd one breaks, I may get it replaced. More likely I will just chalk it up to a learning lesson and toss it. Even $4 shipping is a decent percentage of the cost of a more durable cable - IMO it should be set aside to fund its eventual replacement.If this cable would have last 1.5 to 2 years, I'd probably give it 5 stars given the price. And if D'Addario took away the warranty thing, it would probably re-shape the customer's perception on what something at this price should cost, because it's a wear item, plain and simple. IDK how much R&D; it's worth their trouble to put in something at this price point, but that's is what I would shoot for - a realistically acceptable period of trouble-free use w/no warranty as the trade-off. That would NOT make it a deal breaker.", "id": 168}, {"review": "For those that don't know, this pedal is a copy of the more expensive Line 6 Echo Park. The two things that make it better than the real deal are the lower price and the (IMO) better tap tempo. You have to do an odd sort of clicking sequence with the Echo Park, but with the Echo Machine you simply hold down the footswitch for 2 seconds, and then set your tap tempo. When you're satisfied, just hold again to enter regular on/off mode. Foolproof.Some folks will point to superior construction with the Echo Park, and I won't totally deny that. That said, the effects modules and the construction of the Behringer pedals are basically the same - plastic where you'd like metal, and surface mount construction (practical maintenance is really only possible by the manufacturer). But again, there is a switch in the tone dock that requires maintenance at some point - if it can't be cleaned up, the dock becomes a paperweight.As best I can tell, all the other settings are the same between this copy and the original. That makes sense, as it saves Behringer the costs of any R&D; - they just had to make it fit in the dimensions of their enclosures, and alter the tap tempo algorithm/access. That's a win for the customer because it decreases the price. For those who find a moral dilemma in buying a copy of something else, I'd submit that most of what is in your pedal collection has probably been either partly or wholly copied from something else. Unless you want to restrict yourself to the known originals and the prices they fetch, this is oftentimes the standard option. If there is a worthy improvement (IMO in a practical sense usually more than a sonic one), it would kind of behoove you to insist on the original. The tap tempo on the EM600 earns its purchase, just like the lower noise floor of the Biyang Compress X earns it as a purchase over what it copies 1:1 - the venerable MXR Dyna Comp.So why only 4 stars? Because it's a 2-way street - the cost cutting means that this pedal will potentially be something for the landfill in years to come. There's no denying this, and to get 5 stars requires unsurpassed durability at any price point. Despite what you may think, it can be done - the flipside is an ever so slightly higher cost. Behringer probably decided they preferred the increased profit per unit instead, or didn't want to go above a certain price point and risk getting beat by direct competitors.The other BIG reason to knock a star off is that with a little amp that you have to crank to get acceptable volumes from, there is quite a bit of audible hiss from this pedal. If all I used were my bigger amps, I would have never noticed, and it wouldn't have been an issue at all. But the 21st century is a time of lower playing volumes in live settings, which means the smaller amps are more popular. So the hiss could absolutely be a deal breaker. It might be slightly lower than the P.A. you're using, but I wouldn't be so sure. I'd say you'd want a (true) 30 watt amp to ensure this isn't an issue, but that may be absolute overkill for the gigs you play.But my aggravations are really small ones. Overall, this pedal works fine through any amp I've tried it with, as some are kind of picky especially with delay pedals. I've typically found digital delay to work better with drive/OD/distortion pedals as opposed to analog delay, and this pedal is no different - as much as I like my MXR Carbon Copy and BBE Two Timer, they aren't nearly as flexible. This one IMO is on par with the flexibility of the old Boss DD-2/DD-3 or Danelectro Dan Echo. But it surpasses them with all of the different types of delay effects. Many of those are something I would never use, but I could imagine how others would absolutely love them. Or - they could come in handy for something specific, or be great flexibility in the recording studio.Also worth considering is that at the EM600's price, you could buy a backup or a 2nd one for different settings.", "id": 509}, {"review": "Pretty cool knock-off of the Schaller trem or Diaz Tremodillo. This is my 2nd or 3rd Joyo pedal, and my favorite thus far. I don't care for the cheap jacks, but you get what you pay for, and I can always replace them if they break (I work on pedals all the time).I've got a scratchbuilt improved EA Trem (with two footswitchable speeds) and a cheap little Danelectro Tuna Melt. Other than the crummy bypass and plastic construction, the Tuna Melt is my favorite since it has the hard/soft switch. The improved EA has a great preamp for guaranteed unity gain (or more), and the footswitchable speeds that I added gives it extra flexibility. But I think the Joyo trumps it by just a little bit in that the core trem sound is a nice blend of the Tuna Melt's hard and soft settings.So part of this is really a subjective take on this flavor of trem, but suffice it to say if you've tried a few, this one will probably satisfy you at least a bit. No unity gain issues, and the speed and depth have a good sweep throughout their ranges.And it's just a niggle, but how hard would it be to get the word &#34;tremolo&#34; silkscreened so that it's centered on the box? At least there's no skull and flames like on the High Gain Distortion.", "id": 758}, {"review": "I have yet to install this neck, but have purchased enough necks over the years to have a really good idea of what to expect. There is little to no evidence of corners being cut, just to start. Materials and labor all look good to great. Measuring for fit and specifications is on the money. Not having the mounting screw holes drilled is actually a plus as most &#34;econo necks&#34; seem to be off by at least 1/8.&#34; I'd rather have the trouble of drilling them from scratch than having to plug them with dowels and re-drill. Frets look good, and nut looks good. Until I can install it, I can only really vouch for 4/5 stars.Long story short is this neck looks better than many I've had that cost 2X as much, or more. Unless it has a twist or hump, it actually earns the 5th star. Even if the frets need a little cleanup, it still earns the 5th star. While some may not like the flatter radius, I'd argue that it makes it easier to get the frets in so that they aren't as much of an issue. And it is clearcoated - maybe not a nice amber finish, but most more expensive necks may have no finish at all. So again, another reason for the 5th star.", "id": 838}]