[{"review": "For the money you can't find a better deal.  I am currently overseas and didn't want to bring my good guitar along.  This is a great playing guitar for the money, comes packaged extremely well and high quality all around for the price.", "id": 49}, {"review": "These are excellent strings for the price and I will buy them again.  Martin is a name that means quality.", "id": 225}, {"review": "If you just need an inexpensive strap that is perfectly functional at a low price then this is the one for you.  Works fine, no problems.", "id": 285}, {"review": "I would definitely buy these strings again.  They are high quality, great durablity and a great price.  The Martin name is synonymous with quality.", "id": 294}, {"review": "This product has turned out to be great with few exceptions.  It comes with three amplifier software packages and says you have the license to turn on any one of the three, not true.  The license included only works for one amp, the AC box combo and not the other two, you need to purchase the license for them.  Plus the instructions for getting the system installed and operational are poor.  You cannot run the output through your sound card to your PC speakers due to latency.  You must use the headphone jack on the interface.  In addition if you are in an austere environment and can't get to the internet to register your product immediately you are out of luck trying to make it work.  Once you overcome all of these obstacles it is a good little product.", "id": 418}, {"review": "I've purchased several of these in different lengths and styles and never had a problem but this one is giving me some minor difficulties with connection.  Like a loose connection.", "id": 419}, {"review": "When you purchase this product the advertisement leads you to believe a separate power supply is required but it does come with its own power supply.  There is no need to purchase a separate Behringer PSU-SB.Otherwise the time machine works fine, as described.", "id": 608}, {"review": "I really like this little tuner is is maintenance free, small light and easy to use.  Highly recommended for the price.", "id": 706}, {"review": "This bag is light, with two back pack straps, a pocket for accessories, excellent quality material and a good quality zipper.  If you just need something lightweight to protect your instrument this is it.", "id": 51}]