[{"review": "I really like this over the capo that came in my guitar bundle from Austin Bazaar, so after some research online and talking to friends, I bought this capo.It goes on easily,comes off easily and does not mar the finish of my guitar. Downside, seems like it does not put enough pressure on all the strings. I will play with it some more and see how I like it over this weekend.Let me know if I am missing something about this capo that I should know. Thanks!", "id": 116}, {"review": "The picks came before the estimated delivery date in a clearly marked package. All 12 picks were there. Saves me a trip into town therefore wear and tear on my car. They feel good in my hand while strumming the strings. Good deal and I will purchase again.", "id": 120}, {"review": "This is exactly what I was looking for to go into my case or my pocket. I will not put this on the back of my guitar but you do have the option. Perfect fit for medium picks. Ease of use, and durable. Have purchased another one! Good deal!", "id": 167}, {"review": "I really like this guitar stand, it was worth the extra money. It securely holds my acoustic guitar and leans back a bit so you can clearly see it. Very stable base. The bottom which holds the guitar can be switched over for different size bases of guitars. A good price, a good buy. Glad I invested in it. By the way, I read several reviews which said this had a \"smell\" to it...Mine does not. I just wonder what other people have encountered?", "id": 258}, {"review": "It is bright, easy to attach to my guitar but there are some problems with it being so \"fragile\" at the base.  The battery was a bit tricky to insert since it is so close to the base. I like the swivel but it is delicate since it is plastic. Be careful not to twist it around quickly or it might snap off. It is very sensitive and has been more accurate than a Planet Waves tuner I currently own. Would I buy it again? I don't know. Going to see if it durable and if it continues to be accurate. Looks ok on your guitar and it is not in the way.", "id": 707}, {"review": "I needed something so I would not have to drill a hole in my guitar to attach my strap...This is nicer than using a shoelace to attach the strap and it is an EASY, QUICK release and is very secure. I am happy with this product and will order some more in the future. Nice, inexpensive and useful solution to a guitar strap problem!", "id": 174}, {"review": "This came in the mail today in a rather large box. The blue LED light is fine, you can put about 5 medium picks in the Pick holder. More than enough to keep me and a friend in picks for a few songs. It is not bad but I don't think I would purchase another one.", "id": 265}, {"review": "10 picks medium which came in a clearly marked pack from the company. Cheaper than going into town and mailed directly to me. Good deal. Will order again!", "id": 574}]