[{"review": "I used this strap for the first time during a rehearsal last night. I typically practice sitting down without a strap when I am alone, but stand up when rehearsing or performing with a band. I had previously used a very expensive 2\" padded leather cradle type strap, which I really liked. I sold that banjo and the strap with it, but recently re-acquired another banjo and wanted a good strap, but was not willing to pay the $80 again for a premium padded leather strap. I saw all of the great reviews for this strap and the affordable price and took a chance. I am glad I did.This strap may not be as elegant as fine leather, but it is made extremely well and feels very durable and substantial in its construction. What blew me away is that my full tone ring banjo, which weighs about 14 pounds, literally felt half as heavy. It is no joke. At first, the feeling was unnerving, because the strap has some elastic give to it. You get this dual sensation of a) the banjo feeling super light and b) as if the banjo is going to sink to the floor. Paradoxical I know, but that's where the magic of this strap is. It is almost as if the banjo is floating in front of you, but in reality it remains very stable when playing.Like I said, the build quality is outstanding. My only critique of the design is that it is very modern and non-traditional, so you also have to get used to the contrast of a traditional instrument, like a 5-string bluegrass banjo and the newer style and design of this strap.This is not just a good strap for the money rather it is a great strap at any price point. I think I might try these on my electrics (though I already have literally hundreds of dollars invested in a stable of those high end padded leather straps).", "id": 101}, {"review": "This is a simple, straight forward and worthy replacement mic clip for the standard Shure SM57/58 type mic. Well made, reasonably priced as with most On Stage stuff.", "id": 179}, {"review": "This is a fine stand for the price, but I was honestly surprised at how light it is. I honestly think On Stage might have been making these progressively lighter over the years and now offer a heavier duty one at a higher price. I do use this stand, but I wish I would have sprung for the heavier duty version and probably will in the near future. It works fine, just keep in mind it is not the heavy duty all metal construction stand of the past.", "id": 279}, {"review": "I was looking for a small, high quality monitor for use in the Praise Band at church. I needed to run my Boss GT-100 and vocals through it on stage. This little speaker is more than loud enough for a good size stage with reasonable stage volume. It is built extremely well/very solid and sounds incredible. The volume and sound quality coming from this is simply amazing. I still chuckle when someone asks me to turn my guitar up and I do and all this sound comes from this little speaker sitting on the floor. There is a threaded mic stand socket on the bottom, but I place it on the floor and angle it back by putting my DI box underneath it. Between this and my GT-100 I have the ultimate direct guitar system, with inputs still available for a monitor feed from the main board. Simply fantastic piece of equipment.", "id": 410}, {"review": "I've owned a couple of Pedaltrain pedal boards. First the PT-2 and now the Pro. I use this to house a Line6 M13, M9, a Korg Pitchblack tuner, Clyde Deluxe Wah and a Boss channel switch. There's plenty of pedal board real estate for all of this and the soft case is incredibly strong and durable. You can imagine my board being VERY heavy, and it is, but the soft case does a great job. The included Velcro keeps the incredibly heavy M9 and M13 securely in place even when I store the pedal board upright/on edge between weekly gigs. There's also a lot of places to use zip ties to clean up your rig. Also comes with a great little bracket that will house the Voodoo Lab and possibly some other pedal power supplies. Pedaltrain makes a great pedal board.", "id": 489}, {"review": "I was honestly skeptical before actually trying it. The specs seemed as if it would support my very heavy, very expensive hand-made 1x12 cabinet and matching head. It seemed the only design that would allow me to tilt back the pair and it absolutely delivered. The upright support in the back extends quite a bit and the protective foam is moveable and can be positioned at just the right location. I am truly impressed and after using this weekend after weekend with a gigging band can soundly recommend this product.", "id": 653}, {"review": "In my opinion, D'Addario is the standard by which all other strings are measured. I keep trying different brands from the cheap to the boutique, and I always keep coming back to D'Addario. Extremely versatile, stable and they last as long as can be reasonably expected of any non coated string.", "id": 156}, {"review": "I primarily play live and I am a tone-o-holic. In other words, I use high end pedals, cables, amps and pickups and try to keep as little as possibel between my guitar and amp. I bought a couple of these so I could have one on both my main and backup guitar. No more need for a pedal based tuner. These work that well and are almost undetectable from the front. They also won't mark up your prized instrument.", "id": 785}]