[{"review": "I am 65 years old and have been taking violin lessons for about nine months.  As you can imagine, I need to practice a LOT!  My wife of 43 years does not enjoy my practicing...especially when I practice monotonous scales.I saw the Glaesel Violin Ultra Practice Mute demonstrated on an online violin instructor's web site.  I love it!  Easy to put on and take off. The rubber won't hurt your violin, bridge or strings. You can barely hear it in the next room.  You can actually control how much the mute actually mutes your violin by raising it a little bit above the bridge.  My violin's tone doesn't change much at all with this mute.Now I can practice all I want without fear of my wife divorcing me!", "id": 211}, {"review": "As a newbie violin student I needed a music stand.  Having purchased many things before through Amazon.com, I have learned to trust the customer reviews which get posted (remembering that there will always be a few cranks).  This music stand got good reviews and I can say that I too am very happy with it.  I would recommend this purchase to any one.", "id": 313}, {"review": "The Korg CM-100L Clip On Contact Microphone For Tuners is a great product.  I would recommend it to anyone needing to tune an instrument.  My instructor, who has been playing a violin for about 40 years, brought one to my private lesson recently.  Because it did not pick up extraneous room noises, it made tuning my violin for the lesson so much faster and easier.", "id": 474}, {"review": "Let me start off saying that you cannot go wrong buying any of the series of Mighty Bright music stand lamps.  The Orchestra lamp in particular is a fantastic product.  It provides plenty of smooth, even light and is sleek in design.  And the carrying case makes it very portable.  Fits best on flat metal, and has a tight clamp.  I have a portable stand which does not have a flat metal base...so I used a sturdy piece of foam board to clamp to...works great.  The unit uses three AA batteries. I started off using 3  batteries and they do work but light drops off within about four hours.  I prefer to use the 13 foot adapter cord.  I am an older person who has old eyes. Sometimes lower C and lower A look alike.  Mighty Bright Orchestra Light to the rescue!  The clip is also much larger than the image would let you believe; however, the base is curved to allow your music to easily lay on top.Some comments have indicated that when plugging the AC adapter into the base apparently did not disconnect the batteries as expected. The unit I purchased does disconnect the batteries upon insertion of the power cord into the clip. To confirm this on your unit: (1) DISCONNECT the AC adapter from the wall and from the light, (2) load batteries into the clip, and turn on the light, finally (3) with the AC adapter STILL DISCONNECTED from the wall outlet, plug the cable into the base. The light should go out. If it doesn't, your unit is not isolating the batteries from the AC adapter, and may present a fire hazard if the batteries are installed when the AC adapter is plugged in.", "id": 681}, {"review": "I started to play the violin a few months ago.  When I got my violin, I purchased the Korg CA1 Chromatic Tuner thinking I would not need a metronome.  The Korg CA1 also cost slight less.  However, now my instructor is having me work on scales using a metronome.  She has the Korg TM40 metronome.  I opted to purchase the newer model Korg TM50PW Instrument Tuner and Metronome.  It is great.  Based on my experience, unless you are sure you do not need a metronome, I would recommend everyone purchased the TM40 or TM50 (just in case) instead of the CA1.", "id": 851}, {"review": "I would recommend the D'Addario Prelude violin string set to anyone who want to use wire-wound strings.  They are durable and have a nice tone.", "id": 242}, {"review": "I have tried several rosins for my violin.  Of all of them, I especially like L'Opera Jade.  It leaves very little rosin dust on the violin.  Yet it gives you the tone quality you are looking for.", "id": 636}]