[{"review": "I have a Taylor GA4E.  The elixir strings that came with it had nice bass, but were very bright.  I tried some martins, ej16's which I love on my Seagull S6.  However, those strings just didn't have enough bass and too much highs.  I bought these recently and I love them.  They are much better then the original strings.  Very rich bass that really comes out.  The highs are well balanced and still shine through without being too bright.  My one complaint is that the mids sound a bit muddy to me.  Anyway, the best sounding strings with the setup I have.  Now off to buy some different bridge materials.EDIT: 9-22-12I also put these on my Seagull Mini jumbo and wow! Every time I come back to it after several weeks, I forget that I put the 600Ls on it.  Then I pick it up and wonder why it sounds so balanced and nice supporting bass and realize they are John Pearse strings.  Worth every penny.", "id": 160}, {"review": "Reduces string noise as promised.  Makes slides much easier to accomplish with ease and less noise.  I think they also do reduce some finger soreness as your fingers aren't as irritated from sliding on bare strings.  Makes them feel kinda like elixirs, but sounds a lot better and you still have the naked strings feel.  Also does make the neck a lot smoother.  I will be buying more for all my guitar cases.", "id": 173}, {"review": "These strings I put on my Taylor GA4E.  They had a very nice and balanced mids and highs.  These strings fit very nicely for a acoustic guitarist that is playing with a bassist and supporting instruments.  These strings fill and fit the acoustic spectrum nicely.  Nice mids and ringing highs.  Not a lot of bass.  But very nice balance as I said.  YMMV.", "id": 199}, {"review": "I tried these on my 2008 Talyor GA4e and the sound was just a bit to bright.  The heavier bass strings didn't really add the bassy sound I was hoping for just more of a thud.  YMMV.", "id": 294}, {"review": "Just bought this to see if it would inspire any new sounds for me.  WOW I love it.  The capo works great with no buzzing and holds the strings down well.  I am using it with a Seagull Entourage mini jumbo.  It sounds divine.  It makes chords nice and open and it is a blast to play with on the folk sound of the seagull, a nice mellow relaxed open sound.  Inspires my ears to make music.  Buy it.", "id": 345}, {"review": "I sprayed on all my guitars.  No problem with any chemical reactions.  It polished the body of the glossy guitars up like new.  Now i can see how guitar stores keep them looking so nice.  It must be from a product like this.  They seriously look brand new.  Makes nicks and scratches less noticeable.  If you want a nice looking guitar for the stage or display, this stuff works.", "id": 351}, {"review": "Bought these and they worked great with my Digitech delay, reverb, chorus and Jaman.  No noticeable noise added to my ears.  They continue to work to this day.  They are built tough enough for moderate use and do the job for cheap.  GOOD VALUE!", "id": 181}]