[{"review": "I bought this little pedal back in 1996, about a year after I got my first guitar.  I've tried other pedals, but ultimately, this one gives me the best sound.  It's very versatile and it's really easy to dial in just about any sound I want.  You might get a more dramatic effect from expensive rack units, but for cost and practicality, this pedal is your best bet!", "id": 33}, {"review": "This was the first pedal I ever bought when I started playing guitar 15 years ago.  It's still in my primary set up!  The sound it puts out is very balanced:  you can get a subtle overdrive-like sound out of it, or a high-gain hard rock/80's metal sound out of it.  For those looking for insane crunch, this isn't for you.  Anyone that wants a nice, versatile pedal, this IS the one you want!", "id": 35}, {"review": "I have a lot of pedals...  In fact, I have 2 distortion and 2 overdrive pedals (though only the MT2 and the OD3 are regularly in my rig.)  This pedal won't give you a \"cranked up tube stack\" sound.  No...  Instead, it's very edgy and smooth as can be.  It has a mid-sweep knob on it to help sculpt your tone.  I usually use it as a mid-boost for solos.  You'll find that you get amazing sustain and a huge sound that you won't be able to replicate (easily... I'm sure the huge Boss distortion box comes close, but for the price...) with any other pedal.", "id": 36}, {"review": "I picked this up in order to boost my gain on my amp a bit.  It does a wonderful job of that (Drive set low and the level set high.  Tone set to taste.)  The additional noise it produces is relatively low, so you won't have any excessive staticy buzzing sound to deal with.  As with any other Boss pedals, it's well made and reliable.", "id": 38}, {"review": "As a guitarist who's had the opportunity to work at Guitar Center (back in 1999), trying each type of string on the market was a fairly inexpensive and easy task.  While I'll chose D'Addario EXL's for electric, Martin SP are my top choice for acoustic.  The sound and reliability are unmatched for the money.  They also have a neat bronze shimmer to them...  Granted that's only aesthetic.", "id": 58}, {"review": "Yes.  The 1.0mm Tortex picks are BLUE!  I was quite surprised at the number of reviewers that complained for not getting a multi-color pack.  If anyone has ever been to ANY guitar shop, the Tortex Picks are all color coded!Anyway, I've been playing guitar for about 15 years.  I've been using the Blue Tortex picks for about 14.  At first I messed around with all the different picks I could get my hands on.  Teardrops were too small; Fender brand were too slippery; Guitar Center brand wore out too quickly; the Jim Dunlop nylon picks just felt too weird to me.  The 1.0mm Tortex give just the right sound on the attack, don't feel too flimsy in my fingers (I keep a tight grip) and the grip on them is far superior to any on the market (gator grips feel too porous for me.)  Durability wise, I'll lose the pick before it even comes close to wearing out!", "id": 61}, {"review": "I ended up settling on these as being my favorite strings years ago.  Ultimately, they're simply the best for the money.  You can get them for less than $3 per pack, if you shop around.", "id": 156}, {"review": "I picked up one of these at Guitar Center a while back.  At first, it seemed unstable, but then I tried to open it up a little more, and it kind of clicked into the position shown in the picture here.  When it's opened up all the way, it is relatively stable, and is suitable for servicing your own guitar.  As others say, it does fold up nicely, and takes up minimal space in my toolbox.  I wouldn't use this if I made a living servicing guitars, as I don't think it would last long due to the quality of materials (it does feel pretty cheap.)  But it does work well enough for an individual who does work on their guitars once in a while.I imagine one could make something a bit more sturdy for less out of wood and felt.  Over all, I'm happy with the purchase, as it suits my needs.", "id": 163}, {"review": "The DiMarzio strap lock system here is hands down the best strap lock system available.  The Dunlops tend to release if they're bumped, and the Schaller locks can be a bit too bulk for some instruments.  The DiMarzio models are extremely comfortable, easy to install, and very easy to use.", "id": 193}, {"review": "I've only recently heard of Joyo pedals, and that's because Amazon.com kept recommending them to me.  I normally stick with BOSS pedals - they sound good, and they're all the same size, so they're easy to set up/maintain.  This pedal was priced very well ($32), and had nearly a 5 star rating.  I used to have a BOSS Phaser (I don't recall which number off the top of my head.)  It was a pretty complex little pedal, and sounded great, but I needed money and sold it.  When I saw this pop up in my Amazon, I got curious, did some research, and decided it would be a wise investment.  Sure enough, it was!  It's obviously simple to use, having one knob and all.  Over all, the pedal sounds great, and seems to be very well made.  Based on this experience, I'm very much interested in checking out their chorus, flanger and overdrive pedals.I highly recommend this to anyone who wants an inexpensive, simple yet well-made and great sounding phaser!", "id": 727}, {"review": "I needed a phaser, and saw that the Joyo Vintage Phaser was rated well, and super cheap, so I bought it.  I was EXTREMELY impressed with it, and did some further research into their pedals.  This was one of their top-rated pedals, so I figured I'd give it a go.  I have to say that I am fairy impressed!  I get a wide range of tones coming out of this little box - anything from a light fuzz to a vintage-style high gain.  You won't get a modern metal crunch from it, so if that's what you're looking for, look elsewhere.  If you want a nice distortion to replicate stuff from the 70's and 80's, then this is a great bet.  This pedal is currently plugged in, and I suspect that I'll keep it as part of my rig (unless I happen to get rich and find a nicer, boutique pedal, or get around to modding my other pedals.)As a reference:  I own several Boss distortion/over drive pedals (Japanese DS-1, SD-1, OD-3 and MT-2.)  I The Joyo JF-02 and OD-3 are the two drive pedals that I have hooked up, since they are by far the best sounding and most versatile drive pedals that I currently own.A side-note for the tone-freaks:  The peddle does seem to be a bit muddy.  It's great for jamming out power chords, but not so articulate when you're arpeggiating chords. (Still noticeable when you back off the gain on the pedal but crank the volume on the amp.)", "id": 795}]