[{"review": "I wind long-scale bass strings onto my unusual super-short-scale 26\"-scale, six-stringed bass instrument, so I'm betting I get more use out of this thing than about anybody. This device is much easier on my fingers and hands and much, much faster. The cutter worked great, too. Changing strings is no longer a dreaded chore. Can't ask for more than that.", "id": 94}, {"review": "I play an amplified upright acoustic bass and an electric upright solid-body bass. I bought this Jim Dunlop MC401 MXR because I have a few bass solos that can't be heard above the other players unless I boost volume, which was hard to do by reaching for the volume knob on my preamp or amp with my hand. This stomp box lets me instantly add a pre-selected amount of volume boost only--no goofy effects, no hum, no extraneous sounds at all. Of course, when the solo is over, another click with my foot drops the boost. This thing sounds completely transparent when it's off, and completely natural when it's on. For my purposes, a boost of five decibels out of the 20 that this device permits seems to be enough. Naturally, you have to have left some head room available in your amp otherwise you won't hear any volume change or you'll get distortion or both, but that should be obvious--it's just like turning your amp up, except with your foot.The MC401 runs on a 9-volt battery, but I also separately ordered the Dunlop ECB003 AC adapter, which is also available at Amazon. I checked the Jim Dunlop website and in its FACs it specifically recommends staying with the same voltage adapter, so I did not order the ECB004, which is an 18-volt model. The ECB003 adapter works perfectly and seems completely silent.The MC401 is compacl, but it's heavily-constructed so it stays put. The stomp switch itself appears to be made of good steel, as is the case itself. Everything is solid as a rock. I don't see how it could be better. Perfect.", "id": 372}, {"review": "I feared that this stand was not big enough for my guitarr&oacute;n which is at least as big as, but much thicker than, a cello. But its design appeared amenable to some home-modification that might make it work, so at the price I took a chance and bought it. Well, the back of my guitarr&oacute;n bulges out like a blowfish, so the neck could not lay back into the upper fork, but it turned out that when this stand is fully extended, my guitarr&oacute;n's body is very gently clamped between the upper and lower forks, like they were made for that. No modifications needed, not even bending.Some reviewers have said that the slightest bump will knock this stand over, but I suspect that none of those reviewers had all three legs COMPLETELY open and therefore extended to its widest base. If you don't really LOOK closely as you open the legs, you'll think you've reached the stop before the legs are fully open. I didn't have it fully open at first, and it was a just a bit too easy to push over, in my view, but still acceptable. When I discovered that I still had to open all three legs a bit more, I retried it and it was much more steady. That last 1/4\" (6.3mm) of movement on each leg was worth 100% improvement. The stand is fully as steady as I had hoped it possibly could be, especially given the price. Amazing.Anyway, I gigged with this stand today and had no problems at all. I even like the way it appears to physically clamp down my guitarr&oacute;n since it seemed to discourage itchy fingers from trying to pick it up while I was on break.", "id": 519}, {"review": "This little jewel is so small it can hide in your hand, but it delivers decent tone at a decent volume to your headphones for practicing indoors or outdoors over traffic sounds even. Its 1/4\" TS plug goes directly into your bass's instrument cable jack, and it has one 1/8\" TRS output jack for your headphone plug. But it also has a second 1/8\" TRS input jack which allows you to connect your computer or mp3 player or cell phone so you can hear yourself playing over play-alongs or any such music source, both directly into your headphones.Its on-off switch has a third position for overdrive distortion, which I never use. It has both gain and volume output controls and both work. It also has a tone control but I cannot discern that it does anything. Could be that I just have a defective sample, but I don't care because the tone is fine just as it is.Others have described this little headphone amp as seeming somewhat fragile, and I don't argue with that--it does feel a bit thinly made and the 2xAAA battery door does seem weak. But I just take a little extra care not to drop it or bang it around in a gig bag. If the battery door eventually falls off, I'll use duct tape, and when this little thing completely wears out, I'll buy another. It's just too handy and easy to travel with not to own--and, as I said, it does the job.EDIT 2013-04-07: Still working fine.", "id": 547}, {"review": "Of course, this stand is not nearly as solid feeling as my much-heavier, solid-metal music stand I use at home. It does twist around a bit when you handle it. On the other hand, it's much lighter, collapsible, and it goes inside my practice bag instead of being a piece of furniture that takes another hand to lug. For my practices and rehearsals I want to travel light. This stand fits that bill, and its desk angle is adjustable so it works well for large fake books and for a single lead sheet. I had two pieces of thin plexiglass cut at my local hardware store to sandwich separate sheets of music so I have no problems with wind or with three-sheet-wide scores. I've never had a sturdiness problem with this stand, and I've never had it tip over, but I am careful not to tighten the knobs more than necessary, and I set the legs to their sturdiest position. I always play sitting, so height is not a consideration for me. But I have measured it and found that at its highest elevation the bottom of the sheet music is 50\" off the floor. That's plenty high for me even if I were a vocalist, and I'm 6'1\". Sure, it does not impress as would an $80-$100, stand but the quality is almost unbelievable for $13. I notice that some of the negative reviews are two or three years old, and I wonder if this stand was the same design then that it is now. It IS a lightweight stand and I take care with the knobs, but I certainly would not call it flimsy.One discrepancy that might be important to you: The stand they delivered to me this month (October 2011) was NOT a \"two section\" stand, as advertised. It's all in one section and it collapses down to a 20\" length that fits in my practice bag. I actually consider this a plus since it makes it quicker and easier to erect at rehearsals. I bought one of these Hisonic Signature stands a few years back, but they've changed it a bit. That one definitely was in two sections, and I made the top section into an excellent table-top book stand. That older one also had folding-clip-type clamps for each section instead of the turn-knob-screw-in type of clamps.", "id": 313}, {"review": "This thing is a little jewel. I have a jazz guitarr&oacute;n, i.e., a modified Mexican Mariachi guitarr&oacute;n that is custom strung down to the third E below middle C, which is E1 at 41.2 Hz. This little tuner does the job. It works clipped onto the head, and on the bridge also, but a guitarr&oacute;n bridge is a bit wide for it, so clipped directly onto the lower edge of the sound hole, i.e., near the the most treble-sounding string. There it works perfectly and consistently even on that lowest E and it's entirely out of the way since my right hand is coming at the strings from near the bass-most string.Bold_strummer mentions that it buzzed on his classical guitar, and initially I found the same problem, BUT it turned out NOT to be the tuner's fault, but mine. After tuning, I had gotten into the habit of turning it face down against the wood of my instrument. When I did that it made just enough contact with the surface of my instrument to create a buzz. It took me two weeks to figure out what was making the buzz since the noise was coming directly out of the sound hole even though I had the tuner clipped to the head at the time. When I realized it was the turner, all I had to do was NOT turn it down against the instrument when I wasn't using it. Ever since then, no buzz. Brilliant, huh?  c|:-?Another reviewer's idea about getting two of these so as to keep a spare packed in your gig bag is a great one. At this price, why not? This is a great little item.", "id": 635}]