[{"review": "Simple and compact.No clicking or buzzing.Perfect for old Van Halen solos like in &#34;You Really Got Me.&#34;Plus, you can get a swooshing bright sound you can't get with a Flange and Chorus when backing it down and playing clean.Play some old KISS or some Rob Zombie.$65 bucks is expensive but a true analog phaser isn't available in most amp emulators.&#34;You know your man is working hard... he's worth a deuce!&#34;", "id": 177}, {"review": "Fits all standard mike stands.Stays where it is supposed to.The perfect accessory for the stage or studio.Will buy some more.", "id": 210}, {"review": "Fits perfectly in sound hole.No more feedback or waking up the next room.No plastic smell either.Play an Ibanez acoustic electric.", "id": 497}, {"review": "Behringer products are good for the semi-pro.Nothing fancy about the compression; most amp emulators have good compression but lack true sustain at low gain/volume.This is good for getting that extra decibel or more of boost to carry those notes longer.Doesn't sound good playing fast.The CS400 shines with the longest lasting sustain you can get in a $25 pedal.", "id": 645}, {"review": "I actually purchased this item refurbished on eBay.It is out there for $230 to $299.No buzzing and crackling and NO MORE WIRES!No more shorts in the cables, or stepping over cords.Finally, the technology is here for inexpensive wireless.The Relay G30 has perfect frequency response because it is in the 2.4GHz band like a wireless WiFi router or cordless phone.All the soft clipping is there for every nuance.In fact I don't hear any interference at all even with a single coil.Some feedback is good, but not that screaming feedback loop from cables missing their grounds.I play directly into a Line 6 POD and can piggy back Wah pedals and other effects with the Relay G30 on front. It is just like having an adjustable length guitar cable.This is a professional wireless system.Best purchase I've made this year.You won't be disappointed; it is worth the price.", "id": 670}, {"review": "Keeps gear dry.Not for airplane travel or shipping, but perfect for spare guitars.Zipper works fine; fabric as good as gig bags three times as much.", "id": 781}, {"review": "The Seller shipped very fast and I give them 5 plus stars; this review is regarding the actual product.The Behring US600 is a basic pitch shifter, don't expect elaborate effects.Made of plastic; not as sturdy as a BOSS pedal.Goes through 9V batteries quickly, so stock up.If you use an A/C adapter, get a hum eliminator.(Curse you 60 cycle!)Also run the US600 AFTER the distortion for optimum performance.Other wise you are shifting the clean signal.Distortion, pitch shifter, chorus, then out.This pedal gives you a sweet 12-string chorus sound and that alone is worth the 45 bones. The dive bombs, reverse dive bombs, and flutter are there. Don't expect a 2 octave bottom, because it doesn't do that.You will not sound like a Thin Lizzy dual guitar lead, but you can get that Bryan May, Queensryche meets the Allman Brothers harmonies in 3rds.For those on a budget, this pedal does what it doesn't advertise.Lacks true instructions, so go to YouTube and watch demos.", "id": 505}]