[{"review": "There's nothing complicated about this purchase. It's a cable. It works. It doesn't cost a lot. It's a great deal. Get it.I use it every week, and it still sounds perfect. Then, again, I never mistreat my equipment.", "id": 16}, {"review": "I got this to install it on a podium. It is perfect. The construction is very sturdy, and it always stays in place. Get it, if you need one.", "id": 176}, {"review": "Whether you're a beginner, or have been playing for a long time, you can never go wrong with Ernie Ball strings.", "id": 227}, {"review": "I got this by mistake, confusing it with the tremolo effect. But, either way, I liked it and decided to keep it. It's a really good deal at the price. And it sounds just as good as major brands. The only problem most people find is the material that it's made of. It's like a hard plastic, not metal like most are. But, if you're not a person who abuses your gear, it should last you a good while.I cannot use it for recording, because there is some hiss from it, like all other Behringer pedals, and I record direct, not through amp. But, for live playing, it's great. It's especially perfect for garage and bar bands.", "id": 429}, {"review": "I've bought these D'Addario strings a few times because they are a great deal. They sound nice and bright, and they last a good while. They are easy on the fingers. The best part is that you save money by buying them in a 3-pack.", "id": 500}, {"review": "I've been buying these strings for a while now. They sound clean and crisp. The best part is the price.", "id": 579}, {"review": "This little tuner is very precise. It's fast, and easy to use. I got two of them. It works better than the ones with a built-in mic that capture other sounds and make it difficult to tune your instrument. Works for guitar, bass, violin, or any string instrument.", "id": 635}, {"review": "I'm not going to recommend this over the $15 capos. It's better if you spend the extra cash and get one that is well made. I decided to try this one out, but the construction of it makes it feel like it's going to break if I pull it too hard. And, because of that, it makes it difficult to put on the guitar neck and also to remove. But, once it's on, it works.", "id": 807}, {"review": "I got this because of the price. As soon as I opened it, the first thing I noticed was that it feels like it's not too sturdy. I don't know if it's going to last me a while. But, it does its job. Works fine on some guitars. The neck has to be thinner, though. I have to be careful when I put it on, as well as when I remove it. I'd pay for a better one if I had to get another.", "id": 808}]