[{"review": "these cable came super fast in the mail, They deliver the level of performance you would expect form low cost cables. they work", "id": 11}, {"review": "This capo is as good as I've ever used and its in pink which perfectly matchs my shell pink strat. Great deal.", "id": 25}, {"review": "Does the job nicely, I use these for me guitar thats set for slide playing and I've not had any problems with them. Good solid strings", "id": 97}, {"review": "look this pedal doesnt cost a arm and leg, but as far as other vibes and chorus pedals this pedal falls short. but I wasnt looking at sending alot so it gets the job done", "id": 551}, {"review": "These picks are really nice if your tastes run in the jazz pick direction. It's easy to play fast tricky lines with the smaller hard picks. give them a shot", "id": 576}, {"review": "This amp really surprized me. It's made in china but it appears to be well madeand looks great. There is a headphone jack which is why I bought it.I would suggest useing a overdrive or distortion pedal. gain here isnt great reverb isnt great ether. But over all this amp is a most welcome deal. No transistor amp I own sounds as good. but I would suggest pedals", "id": 618}, {"review": "this amp really shines in the distortion modes, I don;t really care for the clean sounds but the metal tones are as good as I've ever heard out of a low cost amp. I wish I had found this amp sooner. It blows the other brands away", "id": 619}, {"review": "Tis pedal really did for me what I wanted which was kick my little combo in the butt. Hard rock and heavy metal, classic metal is where it shines. I don't mess with the noise gate so I can't really comment on that. but everything else is first rate", "id": 638}, {"review": "I've owned many tuners through the years and I keep coming back to this one. buffer mutes when you play and the quality is great for this price point", "id": 647}, {"review": "I just got this pedal so I don't know how it will hold up over a  long period of time. But on first play it pleasantly surprized me. It does give you some of the way out sounds other pedals my give, but it does provide a gradual increase in phase as you turn the one knob. Mine came with a 9 volt in it but you can also use a adapter. Useful tones at dollar store price= good deal", "id": 727}]