[{"review": "I bought this pick holder because I hate putting a pick between my strings to hold it and because you can't play with a pick in your strings. I originally thought this thing would be kind of large and go all the way across the headstock. Boy was I wrong. The picture is misleading.  This thing is tiny and barely goes across three string. It wedges under neath two strings and you can put two picks (maybe more if they are thin) into the wedges on top. Stays in place well and is very convenient.Only negative is I don't know how long it will hold up. I think maybe a thicker rubber rather than this foam rubber would have held up better. I can see this thing eventually losing tension in the pick holder wedges and dropping picks.", "id": 29}, {"review": "I got these picks a week ago and have fell in love with them. I generally use a Dunlop 1.0m pick, but have to switch to a thinner pick for rhythm play. This, of course, can be very annoying, especially if playing rhythm and lead parts in the same song.  These Big Stubby picks have solved that problem. They are easy to hold onto, great for leads, and because of the way they are shaped don't hang on to the strings like the regular picks do.  Great picks. Definitely worth the little extra they cost.", "id": 66}, {"review": "Love these strings. I use them exclusively on my Gibson LP Studio Deluxe because it seems to corrode ordinary strings quickly. I have a washburn with a glossy, sealed looking fretboard, that doesn't have that problem, but still prefer these strings for it as well. They tend to be a little stiffer than ernie ball's, but I like the way they sound and they feel great when bending and sliding. I can keep these on my guitar for weeks of daily playing without the corrosion and deadness that I get with other brands.", "id": 106}, {"review": "I bought this compression pedal to give my leads a little extra oomph and it does just that. When playing hammer-ons and pull-offs, sometimes it can be difficult to get them to sound as loud as the rest of your picking, but not when using this pedal. It amplifies your quieter sounds and levels off the louder ones to give a smoothe sound. Works great if used correctly. Not to be used with dynamic picking sounds because you will lose that louder/softer sound.I use this with a Gibson Les Paul, and Washburn Hollowbody through a Fender Super Champ amp along with other pedals.  It can cause some major feedback if using heavy distortion.", "id": 137}, {"review": "I have a gibson les paul that I bought used. When it arrived the fretboard was in good shape, but very dry. I first tried lemon oil and it would work, but in about a week the fretboard would feel dry and have an ashy color to it (its rosewood). So I started looking for another solution and found the Gerlitz Guitar honey.I ordered it and applied it.  A few hours later I restrung my guitar and started playing and didn't care for the way the fretboard felt. I think it is because the guitar honey is a little thicker than lemon oil and it felt a little slimy because it wasn't completely dry. I decided to give it another 24 hours.The next day the guitar neck looked and played great. It is a darker color than any of my untreated rosewood fretboards and plays like a champ. Bends and slides are smoother than ever.Great product and one that I will continue to use. If you need a quick treatment before a gig or something, I would recommend lemon oil because it dries quickly. But I would use this in every other regular maintenance situation.", "id": 344}, {"review": "I use this to power a Big Muff Pi, mxr compresser, Ibanez Tube Screamer, and a Planet Waves tuner pedal. The only pedal I have that it won't power is a digitech whammy, but that was expected when I bought it.  It works great. I use the 9-volt battery adapter to power the Big Muff and it even works perfect. I get no extra hum with the 4 pedals and it only takes up one spot in my surge protector. Great little power source. I'm not sure I'd use it for professional gigs, but great for home use.", "id": 428}, {"review": "I finally purchased this in line tuner to replace my hand held cheap tuner. This thing is way more accurate than my old tuner and because it is true bypass it doesn't suck any of your tone. I haven't used the battery pack, so don't know about battery life. I use a one-spot plug to power it. Another nice feature is you can set it to turn off the volume when in use or leave volume on. It's very heavy and seems sturdy and well built. The display is a little confusing at first, but once I read the manual it makes good sense and is easy to use.", "id": 651}]