[{"review": "These strings are the bomb!  I have used D'Addario's since my earliest playing days.  Over the years I have experimented with several different brands and eventually found myself at home with Elixir Polyweb lights.  After having the frets on my guitar (a Fender grand concert) redressed I noticed it had been restrung with EXP's (which I used eight years ago and loved). Since they were on the guitar, I decided to give them another try.  I am glad I did, the tone is great.  They speak with a natural, bright and lively voice that is sweet to the ears. EXP's make my guitar sound like it should. Individual notes speak with warmth, definition and depth.  They blend together beautifully when paying chords.  They have more punch to them than Elixir's do and the coating doesn't fray after a year like Elixirs either. D'Addario EXP'16s are probably the most musical strings I have ever used.  They respond well to dynamics and the bass response is excellent when finger picking.  I was able to get eight months out of them before I noticed deterioration in tone.  I think I have found my strings and I don't see myself using anything else for a while.", "id": 130}, {"review": "D'Addario strings are awesome!  These strings speak with a bold,defined and POWERFUL voice.  The bass strings boom with thunderous lows and the treble strings glisten with sparkling highs without being too harsh.  They are very sweet to the ears and tonally balanced across the board without one frequency overpowering the other. I have tried a lot of different strings, DR's, Ernie Ball, Dean Markley, Elixir, GHS, you name it.  After putting a set of EXL110's (10-46 gauge) on my Gibson SG special faded and comparing them to Ernie Ball I noticed a huge difference, not only were they brighter but they lasted longer.  I used to change a set of Regular Slinkys every two months but with EXL's I was changing strings every five to six months. They work in a variety of applications, metal, hard rock, jazz, blues, reggae, etc. and respond great at any dynamic level.  D'Addario is \"The Player's Choice\" for a reason after using these I can't see myself using anything else!  They feel good,sound great and are exceptionally consistent from set to set. If you haven't used them yet, give 'em a try and see what you're missing.", "id": 156}, {"review": "This is an awesome capo!  It's sleek, light,easy to install (you can do it with one hand) and looks nice on the instrument.  I use the NS capo on my Gibson SG Special faded and it does exactly what it is supposed to do.  I love the dial, it's very easy to use and lets me set it to the just the right amount of pressure where I can still bend the strings but there is no fret buzz.  Awesome product, much better than using a Kyser that puts your guitar out of tune and leaves gouges in your neck.  Sounds great on my SG and my acoustic.For those of you wondering yes it does clamp on the headstock if you tighten it down enough.  I think it also depends on the width of your headstock but it works for me.", "id": 304}, {"review": "In my 13 years of playing the guitar I have settled on D&#8217;Addario as my string of choice.  When I picked up the mandolin four months ago deciding which string to buy was easy. I&#8217;m really glad I did.  The tone is great, they&#8217;re durable and smooth on the fingers.  Even though they are smaller strings they still produce the sustain and bell-like tone that mandolinists are after.  They respond great to different styles and dynamic levels.  You can play sweet classical passages, roaring bluegrass and even rock.  I have a high end Washburn F-Style and these strings coupled with Wegan picks make the Washburn sound SPECTACULAR!  They also bring out the sound of the wood too which I appreciate.  If you are in need of a smaller string that still sounds good, this is the pack to get. Thanks D&#8217;Addario for providing an awesome product!", "id": 408}, {"review": "This is a great capo!  I had been using Kyser Quik-Change capos for a good portion of my ten years of playing but they had their limits.  For one, intonation wasn't always right and my guitar (especially my electric) would go out of tune frequently.  After trying others, I settled on the Shubb and it outguns the Kyser in every aspect.  Its features surprised me.  It is small and incredibly light weight, you almost can't tell that it's there. The adjustable knob is great and allows you to dial the capo to the right pressure so that you don't get any annoying buzz.  Also my tone has greatly improved (which is an awesome bonus) making my acoustic sound much clearer and much more defined as opposed to the Kyser which I noticed muddied up the sound.  Even though you have to make some adjustments this capo is still easy to use and is one of the best investments I have ever made!", "id": 541}, {"review": "This is a good pick.  They give the strings a sweet sound and slide off the strings nicely.  However they do have a really annoying clicky sound that is not so hot.  After trying a few others I settled on Wegen Picks.  They make the Golden Gates sound bleak in comparison.  Wegens definitely click less, are easier to grip and bring out the natural woody sound and character of the instrument.  If you are looking for something that will progress with you, you may wish to look elsewhere.", "id": 771}]