[{"review": "Guitarists have become a bunch of cork-sniffers. There are so many players more concerned with the name on the headstock of their guitar and their amp and the endless \"boutique\" pedals in their collections that many seem unable or unwilling to give a listen to \"stock\" gear, or anything that doesn't cost an arm and a leg.The fact is that if you're a gigging musician, and I am, you come to realize that all those subtle, detailed nuances of tone that so many want to obsess over get lost in the band mix, and in the poor acoustics of wherever you're playing.  Yes, we want to sound good to ourselves because that's inspiring, but frankly, I don't need $200+ dollar distortion/OD pedals to be inspired.I haven't owned a DS-1 in a long time, but recently got one because I was looking for a distortion pedal on a budget.  Frankly, I'd forgotten how musical this pedal is.  With the distortion set to minimum (it never gets clean) it's a good, moderate-gain overdrive that still lets your guitar's basic tone get through.  I play a strat & and jazzmaster - those guitars still sound like themselves with this thing.  With the gain at halfway you get great AD/DC crunch.  And even with the gain maxed out you still get excellent note definition on chords.  What more could you want?  Sure, it's \"old school\" rock distortion. The usual \"may not appeal to metalheads\" caveat applies, maybe. Combine this with an eq and you could scoop the mids as much as you want.I also have a Barber LTD (great, relatively cheap \"boutique\" moderate gain OD that doesn't break the bank) and a Visual Sound Route 66, which is a tubescreamer clone (with much more gain) and a compressor in one pedal.  Both the LTD & Rt 66 have the usual TS9 midrange hump, though much less pronounced on the LTD.  What's refreshing about the DS-1 is that the strong mids are there, but the overall tone is not in the same realm as a tubescreamer, so it can sit well on a pedalboard and bring a different flavor to the party.  The tone on the DS-1 can get very bright, but as I indicated I play with single coils, and I have no problem finding sweet spots on the tone knob - I generally run it around 9-10:00.Overall this pedal is a steal - look around and find a used one for a good price. I'd considered a modtone Speedbox, but decided to go with the generally bulletproof Boss instead, for basically the same price.  I couldn't be happier.", "id": 35}, {"review": "I've been using a Crybaby for going on 30 years now.  Some guitarists claim that having them in your signal chain affects your tone in a negative way.  Well, I've never noticed.To me these always feel perfect.  Also, you can adjust which part of the sweep you're using very easily - ie if you want more treble or bass you just the little \"comb\" that moves the wheel on the pot.I've tried other wahs.  Morley doesn't do it for me, and the Vox is very good, I just have always gone with what I knew.  No complaints with the Crybaby.", "id": 41}, {"review": "I prefer nylon picks because they have a softer feel on the strings to my ear - less \"clicky\" - than a standard plastic pick.  My favorites are Snarling Dogs Brain Picks which are very similar to these.  I guess when it comes right down to it these are essentially the same, I just have more of the Brain Picks at this point, so I use them more.  But these Dunlop nylon picks are excellent.  They're almost impossible to drop, they sound and feel just right to me, and they last seemingly forever.  Hard to go wrong with these if you like nylon picks.", "id": 62}, {"review": "First, I love these picks and used them exclusively for years.  I have dozens of them, they never wear out.  I used to use them when playing in a loud rock band, and never had any issues.  They are very comfortable, and easy to control.Now the bad: the sound.  Not the sound of the plucked not itself, but the hard plastic of the pick against the string makes a very noticeable \"plinking\" sound that is audible through your amp.  If all you're playing is loud music, this may not be an issue.  But I essentially stopped using them when I started playing in a different band with more dynamics, because during quieter passages the plinking sound of the pick on the strings is VERY noticeable to me.So, too bad.  I think these are great picks, but I'd like them to be made of a softer material.", "id": 66}, {"review": "I bought some of these a few years ago just to try them out.  The \"gel\" in the name sounded intriguing.  These are OK, the colors are bright, but otherwise they're just standard plastic picks, which on an electric I prefer nylon because it's less \"clicky\" on the strings.  These are fine, and if I pull one out of my gig bag I'll use it, but overall there are other styles of pick that I'd buy before buying these again.  Nothing wrong with them, but they're just normal plastic picks, nothing special other than maybe the brightness of the colors.", "id": 69}, {"review": "I've had one of these for about 20 years, have gigged with it extensively, and I've only had to replace it once. (more on that later).I'm not really a cork-sniffer re: guitar tone.  I think most of our tone comes from our fingers, and so the trend in the last several years toward high dollar guitar cables is lost on me.  I think this Monster cable sounds fine.  Better?  Well, better than what?  I don't really notice a difference when I use different cables.  Maybe a slight difference in the high frequencies, but it's so slight as to be negligible.I look for guitar cables that will last.  That's what I really care about, and so far this Monster cable does the trick.  I use other brands, too - this is my most expensive cable but I think it was worth the $40 I spent all those years ago.Oh, and the return process.  This was maybe 10 years ago.  I called Monster, they gave me their address and I had to pay about $3 to ship it back to them.  About 2 weeks later I had a new cable.  I consider that to be excellent customer service.", "id": 126}, {"review": "I've used D'Addario strings for many, many years without problems - both acoustic & electric.  I've tried these coated strings in the past, and I actually prefer them to Elixir because they feel more like regular strings - the wrap is coated, rather than a sheathe being placed over the entire string, like on Elixirs.Do they last longer?  Probably.  Even when I'm in situations where I'm gigging regularly I rarely change strings more than every few months, just because I don't see the need.  I think the main benefit to coated strings is if you have guitars that you can't play regularly the strings won't corrode.  But these sound great and feel fine, and the're the least expensive coated strings I've found.  I've always found D'Addario quality to be great.", "id": 130}, {"review": "I ran across this thing a few weeks ago and decided to give it a try.  I'd been looking for a boom attachment for a non-boom stand because I play guitar and sing.  This seemed perfect, and it is.  Regular booms have always been a necessary evil, in my book.  They can be helpful, but also take up too much \"air space\" on cramped stages or in small rehearsal spaces.  This thing gives you plenty of room to get the stand out of the way without making an annoyance of itself.  The other thing I like is that the elbow where it adjusts has teeth that interlock, so you're not just tightening a joint and relying on friction - as those are the kind of things that eventually fail once the tightening bolt gets tired.Anyway - no reservations about this one.  A dead-simple idea that works great.", "id": 142}, {"review": "We live in an age of endless boutique guitar effect pedals.  One could make a very expensive hobby of collecting only high dollar dirt pedals.  It's not unusual to see an online review and think a pedal sounds good then find out that it costs $150, $200, $250, $350...whatever.  There are a LOT of really expensive distortion/OD pedals out there.I've had my Bad Monkey for about 7 years, after hearing good things I took a chance and gigged with it for many years.  I rarely use a lot of gain on most pedals, just because those fuzzier tones can easily get lost in the mix.  I generally use the Bad Monkey for mid-gain crunch tones, and for that it's just fantastic.Having two tone controls makes all the difference.  This pedal is Tubescreamer-esque, but not as midrange-heavy as a TS.  Anyway, this thing sounds great.  Excellent classic rock and lead tones.The things it WON'T do: 1) a clean boost.  It has plenty of output, but there's always a little bit of dirt in the signal, so it can't be used as a pure clean boost.  2)  it won't clean up when you turn your guitar down...or at least not much.  No dialing in a crunch tone then turning down your guitar volume for a clean rhythm tone.  I have a Barber LTD which does that beautifully.But, despite those limitations, the Bad Monkey is awesome.  At the very least it can be a great \"throw in your case to take to a jam\" pedal, but it's worth having on your pedalboard, as well.", "id": 145}, {"review": "For years I've used the super-cheap \"rake hangers\" you can get at hardware stores - the metal \"U\" coated in rubber, with the heavy-duty screw end.  These are fine, except that some guitars don't want to fit, and recently when trying to widen the mouth of one the weld failed and so the \"U\" detached from the screw part.Well, that got me to thinking that I should find a better solution for hanging my guitars.  The thing is, I hate overpaying for things.  To me, $15-20 is way too much for a guitar hanger.  Sure, it's important to have something solid to hold our \"babies\", but I want to feel like I'm getting some value.I bought 2 of these hangers, and they're rock-solid.  As others have said - put some good screws into a stud, don't bother with the hassle of the drywall anchors provided.  I just used some 2\" drywall screws.  I like the simplicity of the metal plate that the yoke is attached to.  The U is easy to adjust for width, the retainer rings slide on very easily, and I've tried both acoustic and electric guitars and all hang away from the wall.No complaints - these are great, the quality seems excellent and $9 seems just about right to me.", "id": 154}, {"review": "There are a ton of phaser options out there - even from MXR themselves - which makes this issue a bit confusing.  I'd owned a Phase 90 back in the 80s and wanted another one.  A few years ago I didn't have the budget to consider the more expensive MXR versions, so I just got this one.I think it sounds fine.  I gigged with it for years without issue.  Yes, there's a slight volume bump, but I think this is really mostly a midrange hump that will alter your tone and give you some distortion, depending on how your amp is set up.  I always use it with a clean tone, and I'm used to it so it's not a big deal.If I were to shop for a phaser today I'd consider some of the other MXR models, as well as versions from other manufacturers which offer a mix knob.  A phaser is a very specific sound, but I love it in small doses.  For my needs this one works.", "id": 177}, {"review": "I've owned this pedal for about 8 years.  It's good overall, but the reverbs fall short of ideal for me.  They just sound a bit inauthentic, and this is noticeable at times, but in a band setting probably wouldn't be noticable.  I think it's the way they trail off.  The tails tend to have a little unnatural decay, or something.I've been using the Boss Fender reverb pedal for about 3 years now as my main reverb (neither of my amps have reverb) and what I've done in the last year is that I use this Digitech with a wetter setting (usually church or hall) if I want reverb on a solo.  For that application it works fine and sounds great.  As a \"leave it on all the time\" reverb I find it a bit lacking.But if you want a bunch of decent sounds you could do much worse.  Plus this thing is obviously rugged, I've abused it (not really, just regular gigging abuse) for all this time and it's never failed to work.  But that's been my overall experience with Digitech stuff for a long time.", "id": 185}, {"review": "I've tried all 3 types of these, and they're pretty much as-advertised.  I don't really find a huge difference in tone between the relative hardnesses of the rubber, but it is there to a small degree.  To me these are too dull sounding for an acoustic.  Well, they don't sound bad, but if you then switch to a normal pick you'll notice the upper and upper-mid harmonics that are being de-emphasized by the duller attack.  It doesn't sound bad, and in certain applications it would be fine. I wouldn't want it to be my everyday acoustic tone, though.THey fare much better with electric guitar, where the difference in attack can be less notable, but you'll still notice the loss of some \"sparkle\".  But for the most part I found the sound very agreeable and useable.  The pick tends to catch on the strings a bit - there's more friction, of course - but it's just something to get used to.The bottom line:  I like these, and they'll probably last me almost forever, but I don't really see them becoming my go-to picks.  I like the thickness and the feel (they won't slip out of your hand while playing) but the loss in high end is just enough that I don't think I want to limit myself in that way, except for certain situations.  I tend to switch back and forth between a pick and fingers anyway, so I already get a sound similar to this by using my fingers.  Worth a try, though, and you just might find a keeper if you need to tame an amp or guitar that's just a bit too bright.  You know, at higher volumes, too, it's easy for the high frequencies to be emphasized, and these might work better in a live setting where you've got your amp cranked up.", "id": 245}, {"review": "I've been using this for roughly a year now, and it works fine.  It feels a bit cheap, but then it IS cheap.  It's not as easy to move as a spring-loaded capo, but it's also much lower profile.  Overall, I like it and it's certainly worth the (minimal) price.", "id": 346}, {"review": "I've been using a One Spot to power a Gator small pedalboard for about 8 years now.  In that time I've done probably over 200 gigs and I've never had a problem.  Is it super quiet?  No, but when you have pedals and amps with gain and single coil pickups, there will be noise.  It's a fact of life.  I've never found it to be excessive.  Turn the volume on your guitar all the way down when you're not playing.I would recommend this to anyone looking for an affordable solution to powering their pedalboard.", "id": 428}, {"review": "Dunlop slides are nice and smooth with rounded edges, they sound great, they're indestructable (so far) and they're supremely affordable.  I own a few of them.  I prefer a shorter one most of the time, but I use this one often, as well.Sure, you can spend more on a slide, but I see no reason to.", "id": 456}, {"review": "I have another cheap clip on tuner from guitarfetish.com which works well.  The Snark is a bit larger (only an issue, really, if you don't like having something clipped to your headstock) but it's much easier to read, and it's very sensitive and accurate (according to my ear, anyway).  Easy to use, picks up the note very quickly, and the colored visual indicators are so easy to see, even in bright light, which can be an issue with my other one.Also, someone made this point in another review - this thing can be a great training tool to learn the notes all over the neck. It picks up the note very quickly, and so it can be used very easily for that purpose, as well.", "id": 706}, {"review": "This is a pretty nifty item and it does just what it says very easily.  Get one of these and you'll soon have guitar picks coming out of your ears.  My only issue is that a pick punched from, say, an old credit card isn't going to replace my favorite picks.  It's a great idea, it's executed very well, no issues with the product itself, but I find that it's not incredibly useful to me.If you're not particularly picky (no pun intended) then one of these will supply you with picks for a lifetime.", "id": 784}, {"review": "I think many/most guitarists are always on the lookout for new things and picks are and easy and cheap thing to try.  My favorite picks for the last ~8 years are Snarling Dogs Brain Picks - they're nylon picks that have a raspy \"cat's tongue\" surface that makes it super easy to grip.I've also had a few of these Gator Grip picks for a few years now and I like them quite a bit, but they're not my favorite.  I tend to use something around or just under 1 mm for electric and a bit less than that for acoustic.  These picks have a matte finish which makes it easy to retain your grip on them.  Sound-wise I don't find that they're significantly different from any other pick.  If they ever stop making Brain Picks these could very well become my #1.", "id": 65}, {"review": "I owned a Boss graphic eq many years ago and never really took to it.  Ah, the folly of youth.  First, this pedal is dirt cheap, but the build quality actually seems very solid. The sliders have a nice feel to them, as does the on/off switch.  If you have any tonal issues with your amp then a graphic eq is an easy solution. No, it won't make you love an amp you hate, but if you're ALMOST THERE, or even just want to add some sonic variety, you won't really realize how useful and vital a graphic eq is.My rig right now is a strat and jazzmaster into a Pro Jr.  I love the amp, but as the volume goes up the treble gets a bit piercing.  I've been able to tame that issue with this pedal.  It's a subtle thing. It takes some time to play around with the sliders and figure out what will really hit your amp's sweet spot - at least in my application, where I'm leaving it on all the time.  This pedal would also be good for a solo boost, as it has plenty of output to make your leads punch through.Overall, for this price, you can't go wrong.  This is one of those pedals that has a million applications and will always have a use in my setup.  I'm thinking of getting a second one and building a pedalboard specific to my acoustic rig (comp, eq, chorus, reverb).", "id": 84}, {"review": "I play guitar.  I bought one each of the various thicknesses of these picks a few years ago.  They're very interesting.  These are soft rubber with a little bit of give, so they really soften your attack and cut higher frequencies, similar to using your thumb, but not exactly.  I still pull one of these out every once in awhile.  In certain applications, getting a particular sound for a song, say, these could be exactly what you're looking for.  Overall these are well made, and the ones I bought will probably last me forever, but these would never work for me as a main pick.  I'm glad I tried them though, as I have nothing else remotely like them.", "id": 243}, {"review": "I got this for one of my guitar students whose mom just wanted a cheap case for her acoustic guitar.  Now, let's be clear - this is easily worth $16, but it is a very bare-bones gig bag.  It will protect your instrument to a degree - it only has minimal padding - and is probably good enough for any beginner instrument.  ONe of my students has one of those Esteban infomercial guitars, which is pretty low quality (but not terrible and not unplayable), and the gig bag for that instrument has no padding whatsoever.I only give 3 stars because for a little more money it's possible to get something which I feel is noticably better.  I have a Musician's Friend acoustic gig bag that I paid ~$20 for a few years ago, and it's well made and probably has twice the padding of this thing.So, this isn't bad, it's worth the price, it's put together just fine, but it only just barely serves its purpose of protecting your instrument, and I'd never trust this with an instrument of any value.  Gig bags can be a good alternative to a hard case if space or weight are a concern.  This isnt' a bad choice, but just be aware of what you're getting.", "id": 539}, {"review": "A friend gave me a few of these and overall I like them.  I'd give them 3.5 stars if I could.  Having said that, I don't like them as much as a regular nylon pick.  The star hole just feels a bit weird to me, though I could probably get used to it.  I'm glad I got to try these, but these won't replace my favorite nylon picks.", "id": 549}, {"review": "This is my first fatso-flex cable.  I think I've had Spectraflex cables before, and they've been fine, but I've owned, lost, lent, etc. so many over the years I can't recall.  The look and feel of this cable is excellent.  Seems very solid, but it's always difficult to tell with cables.  I like the flexibility much better than my Monster cable, which is much stiffer and tends to want to coil back onto itself.  The fatso is nice and flexible, and it looks fantastic.  It sounds fine, no issues.  I'm not one of those who believes all the snakeoil about high-end cables being necessary.  Get something decent that isn't noisy, and the tone comes from you and your equipment.  No issues in that regard with the fatso.One last thing - you've gotta love Amazon.  I got a 10' red and a 14' violet for ~$15 each, while other colors in the same lengths were twice the price or more.  So, I wasn't choosey about the colors I got.  THey look great, though.  Oh, and one thing I'm a bit iffy about is Spectraflex's lifetime warranty.  The fine print requires a sales receipt (BS IMO) and says something to the affect of \"we will decide if we will replace it\".  So, way what you will about Monster, but they'll replace anything with no receipt, which is more reasonable, I think.  But I'll worry about that when it's time to worry about it, but it's worth considering, as the return process might not be exactly hassle-free.", "id": 587}, {"review": "THis is a 5 star stand, considering the price. Sure, it's not as sturdy as one costing a lot more, but it does what it's supposed to do without any problems.  I don't forsee any mechanical issues because the construction seems solid enough.  It's a music stand, so I don't see how it would take a lot of abuse.", "id": 696}]