[{"review": "it hold my picks well, but some are to big for it and the tape/foam on the bottom looses the stick quickly. im neutral on this one.", "id": 167}, {"review": "I got a pair of these strings in early august, i still have them, but being as doubtful as i am, i just bought an extra pair from this seller ( who shipped amazingly fast, it got here in about 3 days!)any ways, the strings stay bright for a long time, don't/have not lost there color yet/rusted (after a little more than four months)and they are everything a guitar player looks for in strings. i do a lot of string bends and these have just held up to it. I have a B.C Rich SOB Avenge, so i can't tell you what its like with a tremolo, but i just like them. I have tried out GHS, First act, Dunlop, and D'addario's and these are the only ones that have last for so long with out showing any signs of significant wear.", "id": 238}, {"review": "these picks are nice. They're great for metal, if you like a durable pick. The paint fade away after a while, but don't let that stop you. It leave no residue on your guitar and these have never broken on me. the only reason i would buy more is if i lost some over time.", "id": 373}, {"review": "they work well. For me, the instalition wasn't that hard, it took me maybe four or five minutes. The screws provided were a bit bigger than my BC Rich Avenge Beast's stock strap system, BUT when you read the directions and lube the screws up with a small amount of bar soap (or wax- i used the bar soap though) the installation becomes easier.Once you put your strap in, its NOT comming out unless you try hard to undo the system, lol.If you need to clean your guitar strap, take off the locking pin and use a flat head screw drive to pop off the retainer clip. Its a quick and harmless way to do it and it may take about a minute or two to undo both strap locks. Its not that hard though and the reward is worth it.", "id": 44}, {"review": "This stuff will lube up your strings pretty well! The only downside is that it leaves tiny pieces of fuzz on my strings after a few times of use- but it comes with a little cloth that I assume is meant for this little inconvenience.", "id": 72}]