[{"review": "I have been playing for about 7 years now and have a Tak Jasmine Acoustic and a Jay Turser Strat knockoff.  I really love the Les Paul sound but my pocket book is not large enough for the Les Paul price.  I've read just about everything I can on these Epi's and finally went to my local Music store to try one out.  My initial impression was somewhat mixed.  The sound was good but the action seemed \"off\"  After playing a few scales and a couple easy chords I began to get a feel fro the action on this guitar.  Then I switched from the rear pickup to the front and BANG there was that sound I was looking for.  Classic Gibson Les Paul sound (in all fairness the amp was setup for a strat).  After playing around a bit more I asked to try one in the cherry finish.  They unboxed a new one for me and WOW this guitar looks AMAZING!  I sat down plugged it in and played a bit. Instantly I was in love.  The action was perfect (despite the some what heavier strings than what I'm used to).  The sound off both humbuckers was classic and playability of this guitar has to be tried to be appreciated.  Tuning is a breeze, and is held as well as any other guitar I own (I always retune before every session anyway).  Epiphone really did everything to capture that Les Paul sound in a economy guitar.  Yes I know you puriest will point to the bolt on neck, the cheaper humbuckers, the flat top construction, and the basswood body.  I point to the angled headstock, mahagony neck, rosewood fret board, and Gibson electronics.  I love the simple volume and tone controls (yea a little more knob spinning when switching between pickups) and the tun-o-matic bridge and tail piece is gonna make string changes a breeze (so much better than having the try to thread thru the body).  Even with my somewhat limited practice amp this guitar still sounds amazing, oh and the sustain from it well lets just say I hit a low E last night before I went to bed, and I think it is still reviberating in the amp this morning (lol  If your looking for a Les Paul sound at a discount price- consider this your answer. Oh and my local shop was able to give me this guitar at $20 less than any place else, AND they will do a FREE setup for me after I've played it for a while (so far it's been perfect out of the box).", "id": 31}, {"review": "I have been asking for this for 3 years now, and someone finally got me one.  Nicely built and very handy to have when changing guitar strings.", "id": 94}, {"review": "Hard to believe that I need to review a Pick but I really like these picks.  I got a half dozen for Christmas and was thrilled.  I also got one of those Pick Punches (Super cool item if you ever get a chance to get one- it is the 351 style and a standard credit card is dang close to the Medium Fender Pick)  Only thing I don't like about these picks is that they seem to wander away on their own so keep an eye on them.", "id": 120}, {"review": "This was my first guitar.  I've had it for about 5 or 6 years now.  My wife bought it at a local \"center\" from the recommendation of one of the teachers.  I taught myself to play on this.  First the good:  This instrument is a good beginner piece. It has a nice full sound and does not take steel fingers to make acceptable sounds.  The tone is very rich and will having even simple chords sounding great.  The fit and finish of the piece is amazing for the price. It looks great and had no rough or unfinished areas.  The frets are smooth and finished and the fingerboard feels good.  Tuning is a breeze and this will hold tune very well.  Often only a tweak or 2 before a practice session is all that is needed.  I have never had it go out of tune while playing (even when stringbending!)  As you get better the true beauty of this guitar starts to shine.  It is amazingly playable.  From simple melodies to serious chord jams this instrument handles it all!  The only real compliant I had (and the reason for the 4 stars) is the stock strings aren't the best (IMHO) for a beginner.  I'm pretty sure they use heavy strings as stock and sure they produce a nice deep rich sound, and WON'T break, they are BRUTAL on new fingers!  I would invest in a lighter set and switch them out pretty early on.  The only other minor quibble is the bridge seems a bit light duty and their is a tendency to get some string slap on the lower strings.  All in all this is a great deal for the beginner- or even advanced players that just want an extra guitar around to jam on when they don't feel like dragging out the expensive units (like playing around a campfire, or outdoors)  If your a beginner just starting out- this is a great route to go as the guitar will continue to give great sounds as you advance!", "id": 148}, {"review": "Nice Polish/cleaner  Really works very well on the finishes I have (cheap glossy chinese electrics, and a matte finish acoustic).  handy to have when your changing strings (to clean that nasty fretboard- wow do those things get dirty!) Pleasant scent (lemon oil), and no residue.  Lasts a long time (2 or 3 squirts will do an entire guitar.", "id": 351}, {"review": "I am not a giging muscian or even a serious player.  I play for fun and relaxation.  I have been playing for about 10 years but only in the past 2 years have I taken up the electric gutiar.  I have a very simple amp setup with a Fender Starcaster 15 G as my practice/ backup amp and a Fender Mustang 1 20watt as my main amp.  I love the Mustang, but have always found the Starcaster kinda weak (well duh it is a simple practice amp).  I have 2 very basic Guitars (a Jay Turser M300 Series and an Epi LP Special II).  I normally only use the Mustang but latly have found myself really appreciating the simple clean sound that the Starcaster can give, But it is a one hit wonder.  I am constantly switch amps and is was getting tiresome.  I order this pedal on a whim thinking that it might add a little depth the the starcaster and I might be more inclined to use this amp more.  Boy did I hit a home run with that!  The pedal arrived and I spent an hour playing with it on the starcaster.  The depth and fullness it adds to this little amp is amazing. It truely gives it a tube crunch but yet retains the nice clean sound when the levels are backed off.  Flip the overdrive button on the starcaster and this amp become a distortion MONSTER.  Yea I know I can't imagine what this pedal would do on a &#34;real&#34; amp!  I also found that I'm getting better response with my guitar tone knob too.  THat was always an issue with this small amp- the tone knob made very little difference.  Not anymore.  I can spin the knob and go from clean to dirty and back again.  Yup this is a winner for all you practice amp only people.  Just for S and G's I plugged this into the Mustang (set on Brittish 60's Red) and turned the levels way down.  Amazingly it backed the crunch and distortion way off from this setting (so now I can go clean without having to touch the amp!)  All the reviews have stated how nicely this pedal works on the upper settings but it was great to find out that it can be used effectively to clean up a dirty channel!  I look forward to playing with this some more on both amps.No for the nuts and bolts of the thing.  Yup plastic.  Well I'm very gentle on my gear (this sits on a table next to me and is activated with my hand) so I don't expect issues, but if I was a thrash metal rocker I would probably look elsewhere for durability.  Don't drop it or jump on it and it should last a lifetime.  The switch activation is very positive and easy to manipulate.  No issues there.  The dials are easy to read and turn smoothly.  The LED is a nice level of brightness and does not flicker.  I'm using the AC adaptor so no ideas on battery life or replacement.  THe box is heavy enough to stay in place, but lite enough that I could easily toss it in a gig bag and not worry about it damaging a guitar.  Cable plugs are rugged and seem like they will last a lifetime.  I left the unit plugged in overnight and there was no desernable heat in either the adaptor or the pedal.  after palying for an hour the pedal was still cool to the touch as was the adaptor.My biggest complaint has to do with Amazon itself.  I got this for twenty bucks shipped.  Amazon gave an estimate of 10 days to arrive!!! 10 Days!  Yea it was coming from Vegas to NY but 10 DAYS!!  15 Days later it finally arrived.  15 DAYS!!!!  More than 2 weeks.  Half a Month!! I'm pretty sure UPS SurePost had a guy walk it to NY.  I don't know what the big delay was all about but I was horribly bummed about shipping times.  I ordered a few other items with this (AC adaptor and 5 ft insutment cable to use with this) and they arrived 4 days later.All in all this is a great pedal.  Outstanding for those of us with simple equipment and on a tighter budget.  If you have a simple practice amp and want more out of it, then grab one of these pedals and be prepared for amazment that so much sound can come from a little package.", "id": 381}, {"review": "My wife got this for me as I tend to play the guitar in less than ideal lighting conditions.  THis is the neatest little light I have ever seen.  It takes 3 AAA batteries (included- but I did not find them until I was tossing the package out). And has 2 nice LEDs.  The lights are bright enough for my 40 something eyes but not so bright as to introduce glare on the sheep music.  The clip is plenty strong enough and even hold to my rolled edge music stand.  Battery life so far has been at least 8 hours (actually probably 12 hours as my daughter has been using the light also).  I love the ease at which the lights are adjustable.  A real needed item is you play in darker rooms.", "id": 388}, {"review": "I bought this used off a friend when I got my first Electric.  It's a great little practice amp that is plenty loud enough for a small room.  The destortion works well enough.  Bass and treble are adjustable and seem just fine.  Input jack has held up real well so far (amp is about 4 years old now)and the speaker is pretty clean.  My only problem is that the volume just does not go low enough.  I can't practice while everyone else is in the room watching tv.  I suppose a set of headphones would solve this problem- but then its something else I gotta plug in and worry about.  I find that I like the sound of the overdrive better (especially thru my Epi LP) but just can't play it low enough.  I end up having to turn the overdrive off, and then turning the amp up loud and turning the guitar down real low.  If you have issues with volume control in your house- then make sure to get a set of headphones- or else you could suffer the dirty looks, and the banishment I have suffered.  All in all a real nice practice amp at a good price point.", "id": 467}, {"review": "I got 2 of these for my Electric guitars.  They do indeed work, and the stand legs are decent.  DO be careful when un-folding as pinching of skin would be very easy.  The guitar body cradle is very loose and spins around real easy.  The guitar does fit on it well and the neck cradle works well.  I have had no problem with the foam cushion so far (I have modern finishes on my guitars  I don't think I can put my guitars in their gig bags on these stands which is a bit disappointing.  My Epiphone LP seems a bit more tippy on the stand than the Turser Strat knockoff, but that is more the design of the guitar than the stands fault.  I also like the little rubber grommet keepers they include. All in all these aren't bad.  Not quite perfect- but a good value for the money.", "id": 519}, {"review": "Yea how could a music stand be amazing?  Well compared to those worthless folding portable pieces of junk- this is a godsent.  It actually hold by 500 song fake book (you know the one- that weighs about 10 pounds!). It stays where you set it and works wonderfully.  NO complaints!", "id": 696}, {"review": "I got this on sale from GC for $80 shipped (plus $7 tax arrrgh). First and foremost this amp is AMAZING.  All the hype and positive reviews you read are all true.  My playing style varies from horrible attemps at sounding like a real player to half way decent renditions of actual songs (lol) and this amp does it all.  The tube amp models sound like real tubes and have a tone and sound that just can't be described, they have to be heard.  The modulations, and del/reverbs are well done also.  There are a few of the effects that sound a little vanilla or digital but those can be tweaked with the Fuse software (or taken out completely).  All the controls are pretty easy to understand and adjust, and it does not take a brilliant mind to figure out how to make the amp sound good (even with my substandard playing ability!  Both of my cheap guitars sound great thru this amp.  The tuner is pretty accurate and easy to use.  Headphones work well also.  About my only real complaints are so minor- no place to store the Power cord or USB cord (included!).  Printed documentation is pretty lame but the included DVD is more through.  The Fuse software has to be downloaded and as I have limited online speed this took over an hour.  The headphone jack is a 3.5mm and most good headphones are still using the 1/4\".  Not a big deal but the 3.5mm to 1/4\" adaptors are somewhat weak and can be very touchy.  The amp gives an audiable POP when powered down.  No corner protectors on this.  All in all if you are looking for a great small amp this will give you $1000's of dollars worth of effects and amp models all for under 100 clams!", "id": 718}, {"review": "I've had one of these for about 2 years now.  I've made 100's of picks out of old credit cards, gift cards, club cards, plastic sheets, plastic packaging well you get the idea.  THis is fun and easy to do.  I have even sold the picks at garage sales (25 cents each).  My favorite cards to use are the iTunes gift cards (careful cause some of the iTunes cards are cardstock).  They most replicate a Fender Med. pick.  Most credit cards are a bit thicker (somewhere between a Fender Med. and Heavy).  THey work well also (the edges do come out a little rough but I use an old emery board to clean them up quickly and easily).  I use the picks on both accostic and electric guitars with good results.  The best part is I am NEVER without a pick (even when people accidentally walk off with one.)  I do get funny looks at the stores when I ask for the used gift cards back (until I explain what I do with them- then the clerks are like &#34;wow thats so cool&#34;).  On average I can get 5 picks from a credit card (unless I'm going for a particular part of the card with a design on it).  It takes a little thought to get the most out of the cards- but seeing as they are basically free I don't mind &#34;wasting&#34; parts if I want a particular image.  Just a word of caution on things like DVDs or CDs- they are really too thick and tend to shatter- not worth the effort (I tried an old aol cd and only got one usable pick out of 8 punches)", "id": 784}, {"review": "I got this product to clean and condition my guitar fretboards (well duh!)  Does it work?  Yes and no.  First it did not appear that anything was coming out.  After a bit of rubbing I did notice a &#34;slight&#34; bit of solution (turns out its mineral oil)on the fretboard by the frets.  I tried to spread it out with the included cloth and discovered that the cloth was useless (a paper towel would hold up better- seriously!)  I used an old tee shirt square and spread some of the oil around- but honestly it took me 10 to 15 mins and I noticed NO difference in the appearence or the playability of the guitar.  It says to use it before and after each session- thats about 30 mins of my time per guitar (I general play 2 guitars durning the course of a session).  I do still use this occasionally, but I would not spend money to purchase it again.  Just not what I was looking for in a fret board cleaner.", "id": 72}, {"review": "Love these strings.  Great for bending and awesome sound.  I don't change strings nearly often enough but with a three pack I can rest assure that I always have a back up set just in case.", "id": 156}, {"review": "I order 2 of these for my electric guitars.  They are cheap enough and have a pretty good adjustment range.  The end tabs are either leather or some kind of stiff \"pleather\" knock off. They were VERY difficult to get on my guitar pegs (not a bad thing as my old strap popped off with the slightest pressure).  These are not coming off anytime soon.  They are wide enough but do not have any kind of shoulder pad (I play sitting down so no big deal to me- but if you play standing up these won't be the most comfortable straps) All in all they are a decent strap for the price.", "id": 285}, {"review": "I got this because I was adding a Pedal to my practice amp.  This runs from my Guitar to the pedal.  Works perfect and the length is just right to reach from the guitar to the pedal.  This is actually my best cable and I think I will soon be upgrading my cheaper cables to these", "id": 419}, {"review": "This works great with the Mustang I amp.  Switches between to preset channels with just a tap of the foot.  A great addition to an already great amp.  At this price it's kinda like the amp itself-  a no brainer!", "id": 563}]