[{"review": "These are shred picks, they are very accurate. Pinch harmonics come easily. The point is made to scream over wound strings, gallops, are a breeze. I gave one to the other guitarist in my band now he only uses them.", "id": 67}, {"review": "Very nice leather strap, I will like it better when it is worn in, and softer, but excellent for holding the weight of a five string bass.I very much recommend it, along with some Dunlop straploks.", "id": 253}, {"review": "I really like it!!!!!  You have to have a Levy's strap to use this but since they are the most durable and comfortable I already own two of them. I never have to worry about the transmitter hitting the floor. I check the battery level when I am not playing, the strap goes over the leds, but that is a minor issue. Most good wireless transmitters only use one or two batteries. I always use new ones so I know I have way more juice then I need for my practice or whatever.This is very ruggedly made I think it will last for ever.", "id": 264}, {"review": "Besides looking cool they are for sure not going to malfunction, you have to pull up on the tab to get the strap to release. they spin nice. Good locks, I like them better then the dunlops.", "id": 386}, {"review": "I already liked the Jazz 3 picks by Dunlop, these made from the Ultex material sound so much better, and the surface of the pick is nice,even with sweaty fingers,they stay put. I do pick scrapes alot and there is no sign of wear on the edges of the pick. Sweet !!!!! These are clear yellow picks I would love to see them in red, that would be brutal!!!!", "id": 413}, {"review": "I got this for my Line6 Pocket Pod. It works great so far. and was way cheaper then the line6 adapter!!!!", "id": 521}, {"review": "I have always loved line 6. This product sounded great for about an hour then total gave up. It went dead. I changed channels and it worked for like a minute then went dead. I am sorry to say that I returned it. My AKG wireless guitar bug has lasted years with no drop outs.I am really disappointed.", "id": 670}, {"review": "I bought the wrong gauge. I read a review that said that you should get a size less then you really want but they are wrong. I bought the .90 gauge at Guitar Center and love them. These were made for that Dave Mustain muted crunch sound. I don't know if I will use these forever but for right now I love them. Just hard enough for speed picking but light enough to stay in your hand without moving around like 1 mils do.Dunlop Ultex sound awesome and so far they still look like new.Buy em!!!!", "id": 54}, {"review": "I purchased these picks, because I play bass in an alternate punk metal band. We play drop tuning and playing with a plastic or nylon pick creates alot of noise. I was hoping that these picks would stop the pick noise. They don't make that annoying plastic to metal sound, but they are very flexible. I need to have alot of pick speed. These slow me down way to much. The other reviews I read stated that these were like rigid picks, but no they are not. Too bad as i had high hopes.Good picks if you don't have to tremolo pick, not very good if do have to.", "id": 244}]