[{"review": "Martin makes a variety of good sounding strings, and these are toward the light end.  The sound is bright, but lacks a fullness found with some of the heavier strings such asMartin MSP4150 SP Phosphor Bronze Acoustic Guitar Strings, Light-Medium.The custom light are easier to play and have a bright tone to them, but can make a guitar sound like a cheaper model compared to the Light-Medium. Some disadvantages to the thinner strings are that they can limit your dynamics. If you strum harder, they are more stretchy and the tuning will be less consistent, changing the tone for the same reason a \"bend\" would. If you play at a fairly consistent sound level you can expect more of a bright sound than a resonant one.On the other hand, compared to some other brands with more of a dampened sound, the brightness can make an instrument sound quite good.Depending on your style, these might be a good choice. If you are used to playing a solid body electric with a lighter feel to the strings that make medium strings uncomfortable, these might seem more at home.  If you are used to Martin medium strings, but want something that you can play for a few extra hours a day without feeling as if you are overdoing things, you might like these too, but when you pick up a guitar with the Martin Medium strings, you may find that even a cheaper guitar sounds better in comparison to these on a more upscale one.I wouldn't say I dislike these, and I wouldn't quite say that those who gave it five stars oversold them, because they may deserve five stars for your particular needs. But as an all around choice, there are better sounding ones from Martin. But it's a moot point if you don't feel comfortable playing them. Make sure to read a variety of reviews before deciding because there are other equally valid viewpoints just as each player is unique.", "id": 58}, {"review": "I'm not sure how much I can say about a mute. It's easy to put on and take off, and it does its job. It mutes the violin to a reasonable level.  I used an SPL meter at a distance where a sustained open G string gave a reading of about +2db. With the mute, it dropped to -6db. I then tried a Yamaha silent electric violin (unplugged) and from the same distance, it barely registered. I recalibrated the meter so the muted acoustic violin read about 1db, and the Yamaha read about -6db at that distance and setting.So it won't make your instrument completely silent, and from a purely subjective perspective, it seemed to bring things closer to the silent violin, perhaps seeming about 10 to 20% louder had I not measured it.With accessories, tonal quality is typically important. But with a mute, you expect it to deteriorate. Surprisingly, there was still a lot of tone left, especially compared to the unplugged electric, yet there were no buzzes or other horrible artifacts introduced.You can't expect this to give great sound or complete silence, but it won't disturb the neighbors or their dogs, and it won't make the instrument sound dead. This is about 15 times cheaper than the cheapest silent violin, and the latter will probably sound worse. It's not the ultimate solution for quietness but it lets you stick to your instrument of choice.", "id": 211}, {"review": "By definition, medium is an in between size. But when it comes to guitar strings, most of the range goes from extra light to medium. On that scale, these strings would be above a literal medium. For me, the guitar is not an everyday instrument. I don't typically spend five hours a day with one, and sometimes go weeks without picking one up. But I do have periods where I will spend many hours a day playing and don't want something that will kill me.Medium in the guitar string sense of the word is too much for me. Light and custom light are easier to play, but can make a higher end Martin guitar sound like one closer to the bottom of the line. For me, these light-medium are exactly where I want my strings to be.If you like Martin's medium, find them a bit much at times, but find that you give up too much when you play much lighter ones, you may find that these are a great choice. I don't feel I am missing anything compared to the Medium. If I had two identical guitars with new strings of each type, I would probably find differences in a side by side comparison. But without that, I don't think I'd notice the difference with normal listening. With the lighter varieties, that would be far from true.If Martin extra light and light were the skim milk and 1% milk of strings, these light-medium would be the 2% that came along for people who wanted something lighter but still came close to the whole milk taste.", "id": 294}, {"review": "I don't have experience with toy instruments, but have lots of experience with better quality ones including professional and semi professional ones. I'm not a ukulele player, and this one is for my daughter, whose high school ukulele club features players with a variety of instruments for me to compare this one to.I found this one to be made well enough that it plays well. The frets are properly aligned, and the instrument stays in tune. Notes played on alternate frets are in tune as well as I would expect relative to each other. The tuning issues others have mentioned relative to break in periods are no different from what you would expect on violins or guitars, and are perfectly normal.Although this plays well, I was disappointed with the workmanship. Since I did not see similar comments from others, perhaps mine is not representative. But the workmanship is somewhere closer to the level of lower quality instruments I've seen of other types.The finishing quality is not out of line for the price range, but does not approach what other reviewers have led me to believe. The wood is not properly finished where the neck meets the body, and there are clear sanding marks in the wrong direction. It looks as if it had been finished in a hurry by somebody who had no intention of doing a quality job.A less important issue has to do with the grain. Normally, instrument makers will try to line up the grain with the direction of the body. On mine, the grain is at a slant, giving the impression that the neck is slightly bent. It's an optical illusion, but not a sign of higher quality instrument making.The workmanship issues are cosmetic, and I'm still quite satisfied with the way the instrument plays. The finishing issues will not be visible when being played, and the tonal quality is about what I'd expect from an instrument with such a small resonating chamber. Perhaps there are better sounding soprano models out there, but at this price point it's what I expect. If you are disappointed and want something better, expect to pay at least double.", "id": 536}, {"review": "This is a good quality microphone. The sound quality is good in the various modes, although I have used it primarily in cardioid and stereo modes. It's easy to set up. Under Windows 7, all I had to do is plug it in. The instruction manual hasn't been updated in years and gives instructions for Windows Vista and XP. The instructions for Vista are mostly accurate for Windows 7, but I found that the default settings are better than the recommended settings in the instructions. Also there is no driver supplied by the company. The Microsoft driver will work fine, and there might not be a sonic advantage to making their own driver. But it means that there is no custom control panel and you have to use the more obscure Windows ones. Also the icon for the microphone doesn't match the product, which isn't really a big deal. It's just a matter of attention to detail. The instruction manual is in English and French, but the warranty information is in French in both places. They both say there is a two year warranty and give a phone number in the Los Angeles area. There's a copy of the actual warranty on their website, although it does have terms that violate US law so I have no idea how they handle actual warranty issues.The only real negative I experienced when setting up was that it interfered with my keyboard. I'm using a fairly standard Logitech wireless keyboard, and it experienced a lag, and not all letters showed up when I typed. I unplugged the USB cable for the microphone and things went back to normal. Repeating the process yielded identical results. After rebooting the computer, the problem went away. Hopefully there won't be long term issues.The bottom line is that not a single problem related to the quality of the microphone itself, which works well, is very clear, and is extremely sensitive. It will pick up a whisper from 15 feet away with the same clarity as if I were sitting two feet in front of it. That's with volume settings that work clearly when I really am two feet in front of it. The down side is that it will pick up every stray sound from letting your hand rub your shirt to letting your feet rub the carpet. But those are practical considerations rather than limitations or faults of the microphone itself.", "id": 644}, {"review": "There are lots of ways to tune a guitar ranging from using a tuning fork to sitting next to a properly tuned piano. I've also used a variety of electronic tuners over the years with everything from rows of flashing lights to meters with a needle. There are some excellent tuners out there with tone generators, metronomes, etc. built in. But this device is simple, portable, easy to use, and just plain works. It's also cheap enough that even if you have other types of tuners, it's worth the money to get one of these for each guitar case. Aside from its simplicity, it's also less bothered by background noise, as other units with microphones might be.", "id": 861}, {"review": "My pegs have been giving me difficulty for a while, and have been temperamental and subject to slipping for as long as I can remember. I'd guess they have about 100 years of wear on them.I used to be able to deal with it. Violin teachers and techs I knew never suggested that the pegs were a problem. More recently, I tried adding fine tuners on G D and A to make it easier to tune, but the resultant shortening of the strings affected the sound too much. I figured I'd give the drops a try.  The change was immediate. I was able to work with the pegs more easily, and slippage went away immediately. I decided to give it 24 hours before changing strings. When I did, I also removed three fine tuners and still had the control I needed.After changing one string, things worked well, but then I had the peg slip suddenly. I figured I'd try retuning and that perhaps it was my fault, but it ended up slipping loose again. I tried reapplying peg drops, and that seemed to fix the problem. After that, I had no more slippage, but I now have one peg that is binding.The instructions are clear but minimal and open ended. I don't expect them to tell exactly how often to use the drops but they could have given a bit more info on what to expect, what symptoms indicate, and so forth. I tried contacting the manufacturer with a few brief questions, but never heard back.Suffice to say the drops made an incredible difference, but did not provide me with a foolproof instant cure. I'd definitely recommend them, but I hope to get some comments from users with more experience so I can have a better idea what makes people know it's time to reapply and what they experience when they do it.The advantage of good peg control is that you can get high quality gut or synthetic (not metal core) strings and be able to tune them precisely without tonal problems being introduced by fine tuners.  The effort I had without the drops made me avoid playing and I was using a Yamaha SV-120 most of the time. That can be fun, but I didn't realize how much I missed the richness of an old acoustic violin that stayed in tune.", "id": 359}, {"review": "This bag was nicer than I expected for the price. Considering that many soprano ukuleles are in the $20 t0 $100 range, a lot of people won't want to buy a hard case for three times the price of this gig bag or for more money than their instrument cost.The case is better padded than I might have expected for the price. Since soprano ukuleles are small and lightweight instruments, it's not clear to me why a hard case would be as important to most people as it might be to somebody evaluating guitar cases, or cases for other larger instruments.If you have a small child who is likely to sit on the instrument or drop it down the stairs constantly, you might want to consider something better. But this should provide adequate protection in general, even from minor falls. For a soft bag, this offers all I would ever need.", "id": 593}]