[{"review": "What do you expect for two dollars. I use this on a mic stand i got for my rockband mics. It took a little bit to shove the mic in and its just plastic, but seriously what do you want for two dollars. Its solid and it holds a mic, the seller had it to me in a few days  before amazon got me my mic stand  if your not a serious on stage rockin mother ...... you cant go wrong here.", "id": 135}, {"review": "Im sure these strings are fine, I like the cobalt ones a lot they sound good on my Jackson Rose. These however or the high E the Jackson because of how you have to string it would not grab hold of it... Because with a Jackson you have to cut the ball or whatever off the strings I was left with worthless strings my mistake, Just not for one of my electrics my mistake but I do love  the other strings they offer. So im out four bucks oh well.", "id": 226}, {"review": "I cant play real guitars ....... but i did buy this for Rock Band. This is perfect with the boom i can sing and play without the stand getting in the way. This has so many adjustment spots no one will have a problem getting a good position with it. I even use it when im drumming. I highly recommend this for real players or even plastic players.  Well this one is actually better than most of the ones my wifes band has.  Oh its almost impossible to knock down too, believe me the cats have tried.", "id": 279}, {"review": "I've tried other strings with the Jackson with no luck ( what a stupid guitar to string ) anyway I like the sound they do seem to carry better, if only a little. The texture seems to be a bit rougher but I'm sure they will be fine to play once broken in. Pulse there Rocksmith endorsed LOL.", "id": 825}, {"review": "I use this for my rockband microphones but be careful , if you have cats the hair will get stuck in it. Other than that it really works well in taking away some of the echo from loud speakers while playing rockband.", "id": 178}, {"review": "For the price they are awesome strings.... I like the sound(I like a little heavier sound), and I'm hoping the high E will hold up a little longer than the lower gauge &#34;its always the first to go&#34;. You cant beat the price on amazon I paid 9.50 at my music store but I needed strings ASAP, I will order back ups at this price.", "id": 238}]