[{"review": "Although this capo is marked as correct for a mandolin, it only works correctly above the 3rd or 4th fret on my mandolin. Any lower on the fretboard than that and this capo doesn't have enough pressure to work on the 1st or 2nd fret position on my mandolin, even though my mandolin has a fairly low action.I have a number of Kyser capos and very much like the style (I own at least six Kyser guitar capos and use them on all of my guitars from a Taylor 12-String to a Fender American Strat without any problems), but in this case the banjo capo didn't work for what I need. Perhaps the capo sent to me was defective, although I have enough decades of experience with stringed instruments to know that it didn't seem broken, just not up to the task.From feedback others have sent to me it is possible this capo may work for you if you wish to take a chance on it, but I know that I don't have time while on stage to take 20 seconds to set a fussy capo 'just right' to make sure it is holding just right and then hope it doesn't start to buzz on me in the middle of a song. I went with another brand after talking to some bluegrass guys who had better luck with another style of mandolin capo.", "id": 43}, {"review": "I have always been a thin or medium 351 style pick person, but when a fellow musician had one of these on stage I was quite surprised at how well it worked. I have used it on guitar and also on bass and it really works well with a good solid grip to it.", "id": 68}, {"review": "I own several of these cables in various lengths and am very pleased with the quality and performance of them. I use this particular length cable for patching various pieces of audio gear in a rehearsal space or for plugging into a direct box on stage.The ends are solid when connected and the cable material itself is very 'slinky', i.e. not stiff or difficult to work with like some other cables tend to be.And a lifetime warranty on the cables is a great addition at this price.", "id": 168}, {"review": "This unit works great for taking a line level from something like an audio mixer or even an old cassette deck and converting it into a USB audio input. I have not used the headphone monitoring section (doubt I ever would) so I cannot comment on that feature, but this unit is so simple to use that I was pleasantly surprised.For anyone in a band out there - I used this device to take a line out from our PA system into an old laptop running (free) Audacity software and was blown away by the quality of the recording. This even helped us to figure out better vocal balance technique for some parts that were not quite perfect on stage.", "id": 384}, {"review": "I own a JamHub Greenroom system for use in a rehearsal space. This cable set colour coordinates perfectly with the JamHub colour coding system!The cables are of a pretty good quality, with solid connectors and well constructed. The cable itself is a bit 'rubbery' and not 'slinky' like some of the higher grade microphone cables, but so far they have held up fine. The cables add no noise or colouration to the signal and the colour coding makes life in the rehearsal space so much easier.", "id": 424}, {"review": "I have large hands (I wear an XXL glove) but I guess not thick fingers (Ring Size 12/13). If you want to use this one on your ring finger, consider getting a smaller size.As for the tone of the slide, it is very warm and has great sustain due to the very heavy glass!", "id": 457}, {"review": "This capo isn't quite wide enough for my regular steel string acoustic guitar. If I position it just so it will work as long as I don't bump it or a string will pop out of one side.", "id": 541}, {"review": "These cables are excellent quality cables, however, if you are trying to patch your pedals together in a closely spaced setup, these cables are rather bulky and stiff.The large size of the right angle connectors requires you to space your pedals out more than you might prefer, especially compared to some of the other pedal patch cables that are available from companies such as Hosa.", "id": 578}, {"review": "Like many others here have pointed out, this is a very good leather strap at a very good price and it is made in Canada. It is a simple design, but it is plenty long enough for a taller than average player, is solidly made, and did you notice how low the price is?I have looked at leather straps for some time, and could never pull the trigger on ordering one because of sticker shock on the price. Most straps I have seen in guitar stores of this quality start in the $30+ price category. I just cannot justify spending $30 or $50 or more for an overpriced version of this same guitar strap which has some fancy brand name label on it and is of no better quality. This strap was barely more expensive than a cheap nylon strap! (A nylon strap may work adequately but lacks any real sense of style)Also, most of the name brand straps are two inch or three inch wide, and this 2-1/2 inch wide strap is just right for me.I like this strap so much I am now placing an order for one in every colour I can find them in for use with my other guitars!", "id": 659}, {"review": "If you like thick/heavy gauge picks, but find they wear too fast for you, this is the pick for you. They have a very solid grip to them and are very stiff, but also wear (as in don't wear down) like nothing else. These were a very nice find!", "id": 686}, {"review": "This cable is an amazing find. It simply works! I am not sure if some of the cables others have reviewed have had loose wiring in them, but the cable I received is perfect.I plugged the cable into my Windows laptop, waited 30 seconds while it recognized the cable and installed drivers, and I was good to go. I plugged in a dynamic microphone, opened the Audacity software program, hit record and it was amazing sound quality. I had previously used a variety of input devices from a JamHub to a Behringer USB line input device to an Art audio preamp to even going low-budget with just a cable directly into the microphone input of the (ThinkPad) laptop. This cable provides as high quality of an audio signal as any other reasonably priced device I have used.There are, however, a few limitations...- This cable is mono only, i.e. not for stereo recording. This seems obvious, but is worth mentioning for those who have less experience with this type of stuff.- This cable only works with Dynamic Microphones. If your microphone is a Condenser microphone, you either need a battery powered microphone or some type of 'phantom' power source to power the condenser microphone.The really good things?- This cable works excellent at providing a good signal level to the Audacity software. Some input devices are either very hot (too much level) or have hardly any gain at all, so this cable works very well by providing just the right level.- This cable works amazingly well with a direct box to record a bass guitar, acoustic/electric guitar, keyboard, etc. I have a lot of direct boxes and this works well on all of them. I was able to record a bass guitar track with about the least amount of fuss ever (think three minutes setup time from thinking of the idea to hitting record) using just this cable and a Hosa www.amazon.com/gp/product/B000WS1Q4E/ direct box I purchased from Amazon as well.", "id": 768}, {"review": "Although this is a very solid feeling pedal and the output and sustain knobs worked, the attack knob (the control for how much compression you want to apply) did absolutely nothing. I even checked it in my recording software by looking at the waveforms and there was no change at all regardless of the attack setting.Perhaps my pedal was a rare defective one, but none-the-less I returned the pedal back to Amazon and will search for another compression solution for my pedal board.", "id": 834}, {"review": "This is a perfect strap sized just right for mandolin.I would have given it five stars except mine arrived with a paper label glued to the back of the strap, which when peeled off left a sticky spot on the strap where it would press against the mandolin finish.", "id": 189}, {"review": "I have used a variety of these types of adapters in the past, and these are an excellent newer version.  In this case I bought just one quick release to use for mounting a kick drum microphone that has the stand adapter permanently attached to the microphone.  With this quick release installed on the stand and the microphone, the kick drum microphone now mounts to the stand in mere seconds and stays in place very well.I don't quite know why the locking ring is silver on an adapter that is black everywhere else, but at least the ring is good quality and the threads are clean and precise.", "id": 271}]