[{"review": "I can't believe I never thought of buying colored cables before. I often move all my microphones from one drum set to another depending on what I'm recording and now I don't have to use masking tape and write what each microphone is for, I can just look at the color and I'm all set.", "id": 424}, {"review": "I bought three of these at the same time to replace some older straps that were starting to rip and fall apart. They are decent cheap guitar straps with a tight fit over the strap buttons. Two out of the three I bought are still performing well but one of them quickly cracked around the hole where that the strap button goes through and will occasionally slip off. Not a huge deal because that seems to happen with almost every guitar strap I've ever bought a one point or another but it happened quicker with this particular strap. I suppose, unless I have strap locks, there is no way around this.", "id": 776}, {"review": "Not only do they seem to last a little longer with less wear but they sound good with my cheap no-name Japanese knock-off. I play mostly hard-rock these days with some mild distortion but on occasion crank it up for some tech-metal and prog-rock for solo projects where I'm playing pretty fast and sometimes hard. They also handle de-tuning well and even when using pretty loose open tuning like DADAAD, they are clear with good sustain.", "id": 823}, {"review": "I switched over to using an Android tablet for notation when playing music. All of my 7&#34; tablets fit and even my larger HP Touchpad fits. I ended up using an Ainol Fire as my regular tablet. It would be nice if there was just a tiny bit more tilt up but it does what it is supposed to and it fits securely on the mic stand.", "id": 831}, {"review": "I like tweed jacket cables because they are hard to get tangled up and are easier to identify than having a bunch of standard black cables everywhere. I use the right angle side to go into my effects pedal board and the other side to go into my guitar. The right angle is nice because it's low profile and fits perfectly on my board, even when I put it in it's travel case. Everything seems well built here and has been working for months without any problem.", "id": 492}]