[{"review": "This guitarist tool is a real gem; it's well designed to pull string pegs, wind strings, and cut the strings - all in a small package. I find it handy, useful, and I recommend it.", "id": 94}, {"review": "With musical instruments standing about on my office floor, I determined to find a better way to keep them available, and so I decided to hang them on the walls. This hanger was very easy to install. It comes with screws and anchors so that it can be attached to drywall itself, or through drywall and into wall studs. I used the pre-drilled holes as a template to mark my wall and the hanger went in easily. But a word of warning: use a level to align the hanger to a vertical position on your wall. If you don't, your guitar will hang a bit cock-eyed.", "id": 166}, {"review": "These strings are well packaged, and easy to unroll and string on my guitar. I've had them on two guitars for a couple of months and they hold their tone well.", "id": 409}, {"review": "I play a Cordoba Classical, and these strings are the best I've found for it. The bass strings really resound, all strings stretch and hold within three days, and they last longer than I've expected for classical strings. I've not yet had a broken string with them.", "id": 500}, {"review": "This is the first guitar I've bought without playing it first, so I was apprehensive. But it's a fine guitar. It's plain to look at - no decoration or embellishments, but the sound is rich and full, as if it were at least ten years old. I like the nut width and the action is perfect for my playing. The tuners are geared low, which allows precise tuning. It came with Savarez strings - not the best I've used, but good. And I was pleasantly surprised with the gig bag. It's strong and durable, and well designed. All in all, I doubt I could have found a better quality product for such a low price.", "id": 566}, {"review": "This is the best invention since the wheel, as far as I'm concerned. It's easy to clamp onto my guitar head, and the frequency/not readings are quite accurate. It's incredibly easy to use and very handy when re-stringing a guitar.", "id": 706}, {"review": "I use a variety of guitars, from an old '50s gibson acoustic to a new nylon string acoustic. I expected the capo to work well on the narrower neck Gibson, but I was pleasantly surprised to find that it worked well on the 2-inch nut width guitars as well. It has a spring-loaded clamping arm that can have the clamping strength increased or decreased, and this works well. Above the adjustable clamping device is a narrow slit to hold a guitar pick, and there's also a holder for a tuner. I use neither of these, so I have no comment on their usability. But for my use the capo is thoughtfully engineered, and is an excellent product.", "id": 843}]