[{"review": "Some things just don't need to change. Some Wah pedals try to tempt you with built in fuzz, eq, or other wacky add-ons but WHY? I'd rather have one pedal that does its job perfectly than a pedal that does a bunch of stuff but sounds less than great. The Crybaby is a great effect to have for any style; everyone from Jack White to Jimmy Hendrix have used some incarnation of this pedal. It's a must have and that's really all there is to say.", "id": 41}, {"review": "To my ears, this is a SM58. It sounds identical. Someone with super human ears will tell you otherwise and they may be right, but I have been recording music for years and this mic is as good as any shure mic I have had and it's only half (or less) of the cost.", "id": 425}, {"review": "I mix and master all my own music on these guys. Before the audiophiles try to stone me to death, listen! I cant have giant KRK monitors blasting in my small apartment, but what I can have is a solid pair of affordable headphones that present my music in a very true light. These are not Beats by Dre, they will not make all your songs have super bass, and they aren't a great fashion statement; however, they ARE work horses and will show you how your music REALLY sounds. Nicer headphones exist, true, but these are the best in their price range in my opinion.", "id": 458}, {"review": "I have had the Shure version of this mic (not naming any names haha) and this mic is just as good! Actually, I take it back, it's better than the shure mic because this one isn't overpriced!!", "id": 594}, {"review": "Throw this bad boy in anything and it will make a world of difference, particularly if the tube being replaced was a cheap tube.", "id": 228}, {"review": "Is the the best pedal ever? Not even close. Does it do EXACTLY what you want a simple slap-back echo/reverb to do? Absolutely! I almost always have it on just to add a little depth to my synth or guitar sound. It can give you a decently wet surf-ish sound or a fast delay, rockabilly sound. It's not super versatile but if you're looking for a little depth and color for under $20 then this is what you need.I mean, COME ON! It works, it's cheap, and it doesn't take up much room on your pedal board!", "id": 315}]