[{"review": "I've been using Sennheiser's for years and while I am very pleased with them I decided to try the ATH-M50Ss on a whim.  I spent a little more ($50) than what I've been paying for the Sennies but it was well worth it.  I get more of a flat response which is exactly what I needed for monitoring my audio mixes.And a trivial bonus ... a straight cord.  I hate coiled cords.", "id": 458}, {"review": "It does the job but it is a little low on the quality side.  Surprisingly it is not that stiff; not surprisingly I think that has to do with the quality/thickness of the leather.  I don't know if I'm slower than the usual folk but it took awhile for me to learn to adjust it; you have to remove the &#34;buckle&#34; strap to readjust the strap to length.Bottom line?  It works and I feel comfortable with it supporting my axe.", "id": 632}, {"review": "For the price it is mostly comfortable and of sturdy build.  It matches my Epiphone Sheraton II well although it doesn't &#34;twist&#34; easily (my neck strap pin is on the backside of the guitar).", "id": 660}, {"review": "A terribly easy install and good quality straplock.  I am pleased that they match my Telecaster.  Straplocks are a must for any electric guitar and these exceed that need.", "id": 682}, {"review": "This is my first strobe tuner.  So far it has been wonderful for intonation/initial setups.  It may be a little bit of overkill for average string tuning but one thing is for sure; it is accurate!  The only thing I don't like is that the housing feels \"cheap.\"  Like plasticy cheap.  It was packaged in an attractive tin (which is not good for fitting in the guitar case) and I wouldn't take it on the road but it most definitely will be on my bench as the go-to tuner.It is easy to use, though the precision requires very gentle turns of your tuner.UPDATE:The battery life is short as noted by another reviewer. Since I only use it for initial setups and intonations I remove the battery when I place it back in its tin. There's a little storage slot for an extra battery in the the case which is useful.", "id": 711}, {"review": "The only solid white leather strap I could find that didn't have any ornamentation.  It is of average quality but for the price I wasn't expecting much.  It looks nice and is mostly comfortable on my black Ibanez RG550XX.", "id": 661}]