[{"review": "This item works well for keeping the mic away from the stand allowing room for guitars. I tried a flexible goose neck but it was way too loose and would not hold the mic steady. The locking teeth on the adjuster firmly hold the stand in 1 position. The short extension in the picture is not on the unit I received but it really is not needed it works fine as delivered. I would purchase this unit again and again. It is a good piece and a good deal!", "id": 142}, {"review": "It is exactly as represented. It does a fine job. I have used it in recording live band practice sessions. I would if necessary purchase this item again.", "id": 248}, {"review": "I am well pleased with the quality and performance of these cables. I have used them with my bands PA system and they work nicely. I would and do recommend them to anyone looking for quality at an affordable price.", "id": 435}, {"review": "I purchased 4 of these, of the four 1 was no good on arrival another failed after 2 short time uses. I will not buy more. The first one was returned after some resistance from the seller the second one had passed the warranty time before it had failed. Suggest thoroughly testing these upon arrival if you purchase these. For the $$$ should be more dependable.", "id": 534}, {"review": "The music stand is quite sturdy and well made in my humble opinion. I needed a music stand that could support a note book of music I have assembled over the years. This was great. I added a clip on LED light as well. PERFECT :-)", "id": 604}, {"review": "I purchased 2 of these items to use with my band for the guitarists. I was disapointed when I mounted a Shure sm 58 mic on it and found that the goose neck would not stay erect. These are made far too loose and flexible for most professional mics. They may work on very small and light weight units but for my needs they are totally unuseable. It would have been helpful to include the suggested weight that this goose neck would support in the sales description. I wasted my money. Don't waste yours. Perhaps viagra would be helpful ;-)", "id": 176}, {"review": "I bought 5 of these for live recording of my band. They adjust easil for most any amplifier height yet stable enough for on stage recoding. I recomend these for anyone that needs a low cost means to place mics on a live stage. Features: Stable base; good extension; easy hand grip to lock/unlock for adjusting. For me it was a good perchase.", "id": 224}, {"review": "This is thus far a good bargain. I have used it to hang a 12 heavy string. The arms of it adjust to neck size but when the weight of the guitar pull downward the grip tightlt. No chance of falling. There are likely better units out there but for the money this one is a steal.", "id": 810}]