[{"review": "I'm updating a previous negative review. I had some issues with this guitar when it arrived. I couldn't get it setup, the action was very high and I couldn't set the intonation. Notes at the 12th fret were very sharp, and I couldn't lower them with saddle adjustments. I missed one vital checkpoint, the bridge needed to be lowered. Setup is finished, and I can now agree with most reviewers. For the price, this guitar is far better than any others in the price range. I know my grandson will enjoy it, at least for awhile. If it ends up as a dust collector, I'm not out much on the purchase price. I'll add it back to my own collection, and upgrade the electronics.", "id": 31}, {"review": "This gigbag is a very tight fit for my Epiphone Les Paul. Their is minimal padding, so it is little more than a dust cover. I tossed it aside, and bought a Fender gigbag. The Fender is heavily padded, and gives me some serious protection.", "id": 51}, {"review": "What you gain in string life with these strings you loose in tone. I'm not saying the tone is bad, but it's not as good as quality strings with no coat. That having been said, I'm pleased with them as a string for guitar practice. They last for months without a change in tone. I don;t play much in public venues, so it is not a problem for me to change strings when I do.", "id": 99}, {"review": "I've had no problem with this guitar stand. I've had it for about 3 month's now, and when I'm not playing my Fender Strat; it is on this stand. I recommend it as a well functioning stand, at a very economical price.", "id": 258}, {"review": "The FAB overdrive pedal does not work well for me. In fairness to the product, I was aware from reviews that it gives varying results based on guitar and amp. I have a Epiphone Les Paul Special II, with a Fender Frontman 25R amp. No matter how I adjust it, it has a muddy sound. I've heard it used with higher end guitars and amps with very good results. I took a chance based on the low cost, and I do plan to do some upgrades to my guitar. The guitar is new, and has the strings that came with it. I plan to get a better grade immediately, and that may be all I need to get the expected sound. There are several reviews of this product on You Tube. You can do a search there, and hear what it is capable of.", "id": 355}, {"review": "This is a well built, and high quality product. It provides great sustain and distortion. If you're on a budget, but still want professional sound; this product is what you're looking for.", "id": 448}, {"review": "I bought this strap for my new American Deluxe Plus Stratocaster. The &#34;Strat&#34; is Mystic Ice Blue, with a maple neck and fretboard. With the light metallic blue, and the natural maple neck and fretboard, the white strap looks great! I'm very pleased with it.", "id": 661}, {"review": "I've used my HDE pickup for about a month now. I use it with a Fender Frontman amp. The sound quality is as good as pickups of twice the cost. I highly recommend this product. I'll probably get a second one for a backup, while I can get it at the present price.", "id": 789}, {"review": "I just got my Snark tuner, and I'm very impressed with it. It attaches easily to the headstock of my guitar. The digital readout is easy to see, and it gets me in perfect tune quickly. It is far superior to previous tuners I've used.", "id": 820}, {"review": "I don't travel often with my guitars, but needed good protection for those times when I do. This product meets all my expectations. My Les Paul and Fat Strat, both fit well in the case. It provides good support and cushioning, with a roomy accessories compartment. The corners of the case are well reinforced. The hardware is mid-grade. I believe it will hold up well for my use, and for someone playing weekend gigs. Overall it is a bargain for the price.", "id": 864}, {"review": "The Cry Baby has proven itself since the 60's. It is a very well made pedal that is a must have, if you play any classic rock. It takes a bit of practice to master, but when you have mastered it; you can take your music to a different level.", "id": 41}, {"review": "The Dunlop system has everything you need to keep your guitar in good condition, and looking great. It also had two soft cloths that are needed for application, removing excess and polishing. I couldn't be happier!", "id": 95}, {"review": "I am very pleased with my Frontman 25R. I purchased as a practice amp. The sound quality is very clear, and it has all the volume you will ever need. With the gain and drive cranked up to 10, I set the volume at 3. That is all the volume I need for practicing in my home. You could actually use it on an outdoor stage at level 10. I cranked it up to test it, and the sound quality was still clear at 10. I would recommend it as a good economical all around amp.", "id": 223}, {"review": "These are good quality cables at an economical price. The difference between Hosa, and my high end cables are barely noticeable. The cable shipped fast, and I couldn't be more pleased.", "id": 419}]