[{"review": "Not sure that title is good grammar, but anyway: I have gotten so much use out of my H2!  I'm a music teacher, and I have recorded music classes and performing groups.  Being able to so easily record a class and then have them listen to themselves has been really eye (and ear-) opening for those kids!It is very easy to use.  The various recording quality settings are useful, so you can do anything from a high quality record to a more space-saving mp3 setting.You can record stereo from just in front of the unit, or you can turn on 4-way, all-around recording.I've used mine a lot also just recording myself on various instruments.  I often record one part of a duet, then play along with it.You can do some editing on the unit, but it's easier to download the track and use some software to do it.  I have gone direct to disk, though, just by cutting off a little noise at beginning or end, which is some of the editing you can do on the H2.There is little to fault with it.  It takes a while to rename a track, for instance, but there again you could do it on your desktop after you download.Prior to this I had a Sony minidisc recorder, which was all right but really was already obsolete by the time I bought it. I finally got tired of messing with discs.I am very glad I got the H2.", "id": 463}, {"review": "I doubt you can beat this for $25! The uke is a solid little guy.  I shimmed the bridge a little because I can play hard, but it wasn't bad. Pretty well in tune up the neck.  Strings are ok but I do have some Aquilas to put on; will see if it matters much.The tuners ARE geared, not friction like in the one picture --- at least, mine are.The carrying bag is just that, with no padding or other protection, but keeps the rain off.", "id": 589}, {"review": "As a classical guitarist, I have never touched a pick to my nylon strings.  As a recent ukulele enthusiast, however, I have a little different approach.  In a group, if all are acoustic, a lead line of some sort has to push through the strummers.  I tried these.  Nothing against them.  They are good for strumming.  For lead, I needed to use something harder.  I went to a soft plastic or nylon pick.  It will still not be too good for the strings, but it does the sonic job I need.For a nice strum, these are fine.", "id": 775}, {"review": "I got 2 of these for grandkids.  They are all right.  I felt as if the uke was well worth the low price.  Like any uke, strings take a long time to set --- sometimes feels as if they never will.  probably would be improved with a set of Aguilas.  Buy a clipon tuner, too.  Snarf makes a great one that has both the vibration-sensing mode and a microphone, can be set for various instruments or chromatic, AND has a metronome function --- and they are so inexpensive!", "id": 840}, {"review": "These are great little tuners!  You can leave them clamped on your instrument and make spot adjustments on the fly, which is especially helpful when you're breaking in strings or any time.  I've played guitar a long time and ukulele is fairly recent, and it seems that maybe their shorter strings are somehow more susceptible to influences like temperature fluctuation or just vigorous strumming.SO, these are perfect accompanists for your virtuosic efforts.", "id": 763}]