[{"review": "I don't believe there is such a thing as a perfect capo, but this one is quite good.  For those with reasonably strong hands it is pretty easy to use.  It does a very good job of compressing the strings to the frets and is definitely well built.  It is as with all capos,  important to take it off when not in use so the \"rubber\" does not get grooved.  This is just good common sense.  If this lasts a couple of years I will definitely purchase another.", "id": 26}, {"review": "This tool does exactly what it is supposed to do and is a reasonably priced product.  As with any tool there is a small learning curve just to become familiar with the way it functions.  After using it a couple of times I can only give it high marks.", "id": 94}, {"review": "I have been using the Behringer ACX450 for six months now.  I was impressed early, and still am very satisfied with the performance.  It is a straight forward 2 channel acoustic amp with some modest effects.  One would have to be filling a large venue to need more than this quality amp can provide.  I'm running preamps from Gibson J45 and a Taylor 114 ce and they both sound amazing and I don't even know what to do with the rest of the gain.  The music from these instruments is clear, bright, deep and the sound is a great reproduction of the instruments themselves.  Behringer's mission statement is to provide quality amplification to musicians at a reasonable price.  I say, \"mission accomplished\".  Amazon was seamless to work with and with free fast shipping the whole experience has been great. Man, how did we get by before things were so cool and easy.  Push a couple of buttons and magic appears at your doorstep.", "id": 389}, {"review": "Excellent tuner.  I appreciate it's compact size and often leave it attached to the headstock.  It performs as it should and appears to be quite durable.  Being able to angle the unit is great.  The back light works well in dim light and of course the piezo mode makes tuning in noisey invironments quite easy.  They do mean it when they say to replace the battery when you get it.  Mine lasted for a couple of weeks.  It was insightful of them to tell you of this need upfront.  All in all well worth the money and the transaction went flawlessly.", "id": 595}, {"review": "Easy to see, Easy to use, Easy to get used to.  The display is bright and very intuitive to the way we visualize sound, that is what makes it so useful.  You can't beat the price for such a great little tuner.  Amazon as usual makes ordering, paying and receiving a simple a and pleasant experience.  I will be buying one for every guitar case I own.", "id": 707}]