[{"review": "Glaesel Violin Ultra Practice Mute is good tool for your violin. If you are afraid to disturb your neighbors, when you are practicing violin - just buy it. It will put the sound down. It really works.", "id": 211}, {"review": "Pedal is not working, it just making noise. Poor quality control.Actually it looks like used pedal, not like new.Don't recommend this product.", "id": 212}, {"review": "Ernie Ball 2223 Super Slinky Electric Strings -.009-.042 set is very good opportunity to replace the original strings on your new guitar.Recommend it.", "id": 227}, {"review": "D'Addario Prelude Violin String Set, 4/4 Scale, Medium Tension is good deal for beginners. It's good enough, not expensive. Try it till you ready to by more expensive string.", "id": 242}, {"review": "On Stage XCG4 Tubular Guitar Stand with Velveteen Padding and Security is very helpful tool for any guitarist.I got a lot of them for my guitar collection and have no complain.Recommend it.", "id": 258}, {"review": "Behringer US600 Ultra Harmonist/Shifter Pedal is pretty good.You need a little time to learn, then it will rock you.Just try it.", "id": 505}, {"review": "Korg GA1 Guitar and Bass Tuner is a very good and helpful tool to any guitar player.Buy it, you will never regret.", "id": 624}, {"review": "Everest EZ Series Shoulder Rest for 4/4 Violin is very good deal, if you are learning to play a violin.It helps you to keep the violin in right position all the time.", "id": 637}, {"review": "Planet Waves Classic Leather Guitar Strap Black is good product.It's soft and pretty, and looks nice with my Strat.Recommend it.", "id": 659}, {"review": "Fender Accessories 073-3150-406 Pure Nickel Electric Guitar Strings, Custom are very good!I got it for my Strat guitar and they sound much better then Ernie Ball or D'Addario (at least on my taste).Recommend it.", "id": 667}, {"review": "Rogue G10 10W Guitar Combo Amp Black is good small amp for practicing.Actually, it's loud enoucht for home.Recommend it.", "id": 721}, {"review": "Don't Fret Position Indicator for 4/4 Violin or 14&#34; Viola is very helpful tool, especially for beginners. If you start to learn violin - buy it, it will make your study much prettier.", "id": 770}, {"review": "Fender 1A-SX2S-JTXK 10-Feet Performance Series Guitar Cable ig good Stereo cable for guitar or keybord.It's long enought. I recommend it", "id": 803}, {"review": "Musician's Gear Tubular Guitar Stand Black Pair is a good deal for musician. Buy it, if you would like to have your guitars ready to play anytime you want to.", "id": 813}]