[{"review": "There isn't much to say about this product, except it works as advertised.  If you don't have one of these and you are a live performer, I highly recommend you pony up the few dollars and pick one up (pun intended).", "id": 70}, {"review": "I recommend this pedal to anyone considering a volume pedal.  It is super sturdy, transparent and I fully expect to have this for a very long time.  The tuner out is a nice feature, but the serious selling point is the quality.  Go no further for your volume pedal needs.", "id": 187}, {"review": "This device is the best you can buy.  There is nothing negative to write about it if you put the slightly high price aside.  Zero noise.  Indestructible casing.  If you are reading this review, you are considering investing in the best you can buy for your rig.  Do it!", "id": 209}, {"review": "I needed a cheap mic stand that didn't break the bank.  This little guy fit the bill.  I don't know if it could stand up next to the Hercules stands that I have used for years in terms of long-term durability, but for a simple, home-use stand, it is perfect.  It is sturdy, the knobs feel tight and is balanced.  Great entry-level stand!", "id": 279}, {"review": "Yes, it costs considerably more than the SM58 and I'm not sure if I could pass a comparison test between the two, but I love this mic!  To me, it sounds slightly brighter and clearer than the 58s I have used in the past.  If you are a musician who is strapped for cash or trying to make ends meet, get the 58.  If you have the extra dough and want a confidence boost, go for the Beta.  I would buy this again.", "id": 23}, {"review": "There are some things in this life that you don't want to have to think about, and your tuner is one of them.  You have enough to think about on stage without worrying about your tuner.  It is fast, reliable and looks great on the pedal board.  It is true bypass and doesn't add a bit of noise nor suck any tone at all.  Your brand preference will guide your decision, but don't shy away from this well-made piece of equipment.  I would buy it again.", "id": 504}]