[{"review": "If I didn't think that purchasing these items from Amazon I wouldn't do it, plus and more important I have worked as a Purchasing Coordinator for over 25 years now I know how to save money and if purchasing that are great and believe me or not I can find even cables that I can't find in RadioShack, Best Buys no where else, I have done a lot of Purchasing not just for myself, but for business. These Ladies and Gentlemen know what they are doing and they know how to take care of business in the right way, I would like to apply for a position with them.Regards,ffsalsa", "id": 13}, {"review": "Again these microphones are made for studio I use it live, again you have to have a good PA System for these to work great. Great microphone if you want to really sound like a real singer, this is the top of the top. Thank you Amazon.", "id": 159}, {"review": "These microphones were made for the studio, I used it for live performance, you better have a good PA System to enjoy the sound, there everything that the video showed, it's a great microphone period. Top of the line and it works great, thank you Marshall Electronics and Amazon.", "id": 268}, {"review": "I only needed one, I haven't use it, but I'm sure it's going to work well. This is going to be use for a piano amp which will help with the sound of the amp when put on top.ffsalsa", "id": 329}, {"review": "I feel that every microphone is great compare to nothing. It works great thank you, Nady and Amazon. It's compact and great to use.", "id": 422}, {"review": "I always like to carry extra cable when performing, you don't know when one of the one you have breaks and you don't have extras what do you do then, it works and it's great to have extra.", "id": 692}, {"review": "I used it once, will only use it when I'm in front of it, so that, no one takes it, it works great when you're using your tablet and I use it for playing Pandora when playing in clubs, It not Djing it's DJ sound without the DJ, no offends DJ your job isn't easy, but when their isn't a DJ this helps. Remember to have Wifi in order to connect to Panadora.", "id": 831}]