[{"review": "I'd bought this thing several years ago-forget where-as an alternative to the Electro-Harmonics Stone Phaser. The EH Stone is great, but a) couldn't afford it 2)the adapter input is proprietary, differnt than was on my Boss pedal board3)wasn't gigging out. So I figured, \"What the heck?\".I've had fun with it. With a wah and a proper guitar sound, one can easily emulate the Hendrixish-Univibe sound. Remeber, guitar, touch, pickups, signal, etc all play into that factor. Also its a 'Vintage Style', not a mid 80's mosquito tone killing device. Not a huge range here. No swooshing jet sounds. Just good 'ol wobble.I'll agree with the other guy here and say the durability is questionable, and the size of the thing is annoying by comparison to the standard pedal housing. And, it does make some noise in my chain. Lately have been trying different cables, adapters, and batteries.A tinkerer/hobbyist/modder may enjoy getting a sturdy pedal housing box and putting this things guts into it, and, getting a sturdy switch. Paint it all weird and call it a 'boutique pedal'.", "id": 377}, {"review": "IDK why GC does not carry these. Annoying. Great pick! Worth buying a baggie. If you like the ultex feel but hate the in store larger only ones, get these.", "id": 413}, {"review": "Rugged pedal by a little known company. Took a shot in the dark, hit a bullseye! Great univibeish/old chorus device. Would like to see stereo output options in future models. Solid. If you have a Strat, have studied Jimi, then it will suit you well if you've got the right physical approach to the guitar itself.", "id": 551}, {"review": "I've gotten a number of these Joyo and Artec pedals now, most from Earth City Sound(TX, mostly on eBay these days) though I recommend this seller on prompt delivery but don't happen to know much about them otherwise.I got this one on a whim just to have a second delay. I've had the DigiTech X-Series multi-delay for many years. The fun thing this Joyo does besides standard adjustable delay is that it makes crazy UFO, sci-fi-ish sounds. All one has to do is get a note or feed back going and simply experiment with noise by tweaking the knobs. Guitarists who are fans of Yo La Tengo and similar groups, spacey stuff will dig this box. Solid hardware, side mount ac power. Goofy graphics of an eagle though I imagine by now they've updated it's look.", "id": 731}, {"review": "JF-15:again, OMFG! The MK type sounds take awhile to get, so tweak & consider your amp settings, guitar type, etc). The other pedals like it in the series I'm intrigued by, but I can get any sound I want so far with my stuff. I tried both the Joyo JF-02 Ultimate Drive OCD clone pedals individually on Strats, an LP, & a Harrington, through my slightly modded VC5212(Webber speakers)tube amp; clean channel. As with any pedal, it won't make you a better player. Only practicing, gear research & use, and your hands' touch/grip(whatever you kids call it these days)will have the final say of what comes out of the amp. I intentionally got the JF-02 after reading positive reviews all over the net. The JF-15 was a curiosity purchase. I was able to dial in sounds of Anthrax, Stryper, stratty Buddy Guy blues(remember he uses a metal finger tip clip at times-works with Pickboy metal picks), the 'dad friendly' radio rock sounds of Nickelback, Daughtry; Foo Fighters....to get your Marshall sounds takes a bit of work, but I use their Blues Breaker II reissue, Reflector and sometimes the crushing JackHammer(a BBII with more options and gain). I also use a digitech valve Hardwire for vintage 70's rock or switched to 'saturation' and mid scooped for the Pantera sounds. So, in closing, this pedal can do a lot to change the character of your amp to a Boogieish sound if you know what you're doing for the sound your leaning to.", "id": 797}, {"review": "Definitely worth the $40. If you are looking for a literal octave pedal this ain't it. This is a good old school fuzz monster, and when combinations of notes are played, most notably an interval of a 4th on the lower strings it creates an overtone series that has a subtle octving effect. I've used this pedal to put some growl in my bass, kind of an E.H. Bass Balls sound.", "id": 836}, {"review": "I've ordered 9 of these, and only one has been defective. Not worth shipping it back, no big deal. Great tuner for my guitar class! The Snark may have a few more features, but if all you need this to do is help you tune, you're good to go.", "id": 846}, {"review": "JF-02:OMFG! No need to get all OCD about emptying your Full wallet to get the Tone needed! I tried this on Strats, an LP, & a Harrington, through my slightly modded VC5212(Webber speakers)tube amp; clean channel. No hum, noisiness,,built solid. The English instructions aren't really useful as the pedal itself is self-explanatory.I'm possibly half deaf but have been doing this for 20+ years. I'll be experimenting with a tube pre and running through a solid state to see what happens. There are many factors that make tone and this is only a small part of it. Your attitude and hands create the sound in the end. A pedal does not make you play better, practice does. If you are familiar with the OCD or can get one and a/b side by side it, you'll be amazed. Cool looking pedal box to boot.", "id": 795}]