[{"review": "This is a decent pop filter. It gets the job done but it has a few flaws. It attracts a good amount of dust, the screen tends to mess up (which caused me to tear the first screen), & the goose neck tends to unwrap it's self out of place. It also gets shakey so I tend to have to screw it back in. Other than that, it's a decent pop filter but not for the price. Under $10 would've been better. I should have went with something cheaper than $20 *cough cough* the Auphonix pop filter *cough cough* but, I will in the future.", "id": 46}, {"review": "These MoPads are pretty amazing. I recently just purchased the Atlantic 33935701 Gaming Desk so I had a feeling that I would need these pads.These pads are a must for an amateur recording studio setup with little or no acoustic treatment. Sitting your monitors or speakers on these pads will produce an even better quality sound experience and they also will get rid of unwanted bass vibrations from your desk. I love that you can use the extra pads to angle them any way you want for your set up. These pads make my bookshelf speakers sound AMAZING. It's like I'm using actual studio monitors. At $40, you can't go wrong with these pads for you studio. It is a MUST to have these.", "id": 57}, {"review": "This mic has amazing quality. I was recording my music on a USB condenser mic for about 2 years. Feels great to finally have professional sounding music. Check out my soundcloud @ soundcloud.com/ljaymusic. Really dope mic!", "id": 268}, {"review": "This keyboard is pretty dope. I bought this a while back when I bought my Samson 49 key midi keyboard. It's been a little over 2 years and I've used it ever since. I recommend this to anyone buying a keyboard in the future or currently. You can't go wrong with this stand.", "id": 272}, {"review": "This mixer is just what I've been looking for. The 8 inputs makes it very versatile for different projects. This mixer is a little too much for me (considering that I only record with one XLR track & use the outputs for my UCA202 Interface) but it's good to have these extra inputs just in case I want to stretch my &#34;creativity.&#34; Anyways, this is an amazing mixer for the price! Anyone just getting into making music and recording needs one! Guaranteed amazing'ness!", "id": 368}, {"review": "I bought aBehringer 802 Premium 8 Input Preampsback in July and I didn't know that I needed this. So now that I have it, I can finally record to my laptop! Great product!", "id": 384}, {"review": "I purchased these cables for my Behringer 802 mixer & MXL 770 mic and these cables are perfect! Finally get to have quality sounding tracks knowing I have the professional cables to back me up! The best XLR cables you can find. Hands down.", "id": 439}, {"review": "This mic stand is a great value! This stand is very sturdy and it can to adjust to any length needed. I bought a few years back and it's still working amazing till this day. If you're purchasing a mic soon, you will need one of these stands. Just make sure that your mic comes with a shock mount because the stand tends to move a little but other than that, it's a great buy!", "id": 515}]