[{"review": "I bought these to go from my board to the amp. We use them for a mobile church so they take a beating. They are still going strong.", "id": 5}, {"review": "These are great cables. The only con I could give is if they go bad...no opening up the ends to fix them, but in my experience they are durable. Most people are using these on a pedal board so there's not a lot of movement to wear them down.", "id": 11}, {"review": "These things are terrible. One wouldn't fit in my soundboard, another wouldn't lock in my mic. Plain and simple....if your looking for crap that doesn't work....buy this.", "id": 21}, {"review": "I bought this because after I rebuilt a guitar that was very special to me it wouldn't stay in tune. I took it to a number of guys thinking I did something wrong in the build and was just overlooking it. I use a capo a lot so when someone recommended this...I thought they were crazy. I'm not paying that much for a capo and I doubt that is the problem. Well....I broke down and I'm glad I did. This thing is amazing. It solved the problem because I can set the tension and the design make it sit just right on my strat. Spend the money...it's worth it. Only con is that it takes some practice to change it quickly.", "id": 266}, {"review": "This thing is awesome. It doesn't take up a lot of room and has a tone of options for connections....and it's way cheaper than a power box", "id": 428}, {"review": "This cable is built to last. Overall it is a great quality cable and it came quickly. What more could you ask for", "id": 494}, {"review": "While this is not a $300 tape delay...it's a solid pedal that gets it done. It's way better built than other pedals in this price range. I'm sold. I've purchased several JoYo pedals and all of them are built extremely well and perform as good as if not better than top name pedals.", "id": 731}, {"review": "This is my favorite pedal...and I have a ton. Lots of high end pedal and this a cheap (only in price) pedal! Great bluesy tones....sweet and warm when the drive is down...mean and nasty when the drive is cranked up. Like a cranked tube amp. If you play the blues...this is your pedal. I'm sold. I've purchased several JoYo pedals and all of them are built extremely well and perform as good as if not better than top name pedals.", "id": 833}, {"review": "I'm sold. I've purchased several JoYo pedals and all of them are built extremely well and perform as good as if not better than top name pedals.", "id": 834}, {"review": "The string are easy to play and sound great. There is a reason they are used by so many professionals.", "id": 239}, {"review": "Depends on what your looking for. Is this a POG...nope, but it has some tricks up it's leave for the price. The only con I can give is when playing chords when dropping down (like a drop D) it doesn't always sound grant. Bar chords work a little better", "id": 850}]