[{"review": "For this review, I used the services of my super-musician friend, Mike. Thanks for the very thorough review, Mike!******************D'Addario XL Nickel WoundRegular Light Gauge EXL110Bright Round Wound.010-.046I installed these strings on a Schecter Diamond Serier Acoustic - Electric HybridC-1 E/A in order to test the sound using both acoustic and electric settings. The strings were easy to work with on installation.In particular, I liked the color coding of the strings vs the traditional individuallywrapped strings. The color coding makes it hard to accidentally mix similar strings and ismore environmentally friendly in terms of packaging. Also, the sealed packet wouldappear to keep the strings from oxidizing longer.The strings tuned up quickly and reached stable tuning within a very short time frame.After only about an hour they needed only slight tuning adjustment and were ready to go.First, I tried the Hybrid using a clean acoustic setting and the string produced a surprisingly nice range of sound, especially in the lower registers. This was a bit unexpected because of the \"bright\" label on the package. I actually prefer a widerrange of frequencies so this was a nice bonus. The highs were clean and bright.Using the Bernard Butler setting on the Line 6 Amp I tried the electric side of the Hybrid.The action of the strings was light and fast and notes could be comfortably bent. The sound produced was very similar to that of the more expensive strings that previously were on the guitar, which leads me to my closing point.Overall, I was very pleased with the performance of these strings and when you consider the fact that they only cost around $3,  D'Addario EXL110's will be put in my \"Best Buy\" category for future purchases.", "id": 156}, {"review": "This tuner is tiny and accurate. Initially, the instructions were somewhat puzzling to me because there were no diagrams next to the instructions. For example, the instructions read, \"Press the tuner's release lever to open the tuners ratchet clamp.\" Uh, ok. I had to play around with the tuner to figure out how the lever and ratchet clamp worked. After I figured it out, I'd have to say that I don't like this mechanism. I prefer the ease of the spring loaded clamp. But I do like the rotation of the display. As for tuning, I had difficulty tuning the low E string on my travel-sized guitar. As a previous reviewer mentioned, the display jumps around a lot even with the \"tip\" of plucking the string with a light to moderate stroke. For my full-sized guitar, the tuning was easier, but I had some difficulty on the low E string. Tuning my concert ukulele was relatively easy except for tuning the E string again proved to be more effort. Just for fun, I tuned a full-sized cello with great results, but there was no easy way to clamp the tuner on. Another experiment I ran was checking out the tuner in a room with another instrument playing. After tuning the instruments, I checked the tuning against another tuner and the mini tuner was spot on. Although concealing the tuner from my audience isn't a concern of mine, I would definitely recommend this tuner to someone with that concern. Otherwise, the clamping mechanism is more of an issue for me.", "id": 785}, {"review": "This is the best capo we have (out of three). We were not unhappy with the others until we received this one.Pros:Easy to use tension adjuster that helps tune out buzz and also helps keep the guitar in tune.Easy to put on the guitar. Although the tension is good enough to press the strings down so they don't buzz, it is not so tough as to keep the fingers from compressing the string onto the fret.Nice pick holder feature.The micro adjuster is easy to adjust. It turns smoothly and is kept in place by the spring.Cons:None!This is the capo to get!", "id": 894}, {"review": "As a musician, you wonder how accessories like a capo, which have been around for centuries, can be improved. Sure enough, the Planet Waves' Capo has a feature where you can manually adjust the tension. When a capo doesn't have enough tension, it will slide around on the neck when your hand bumps into it which will result in buzzing. Initially, the Planet Waves' Capo required me to play around with the tension and placement on my instrument which caused me some concern at first. I mean shouldn't it just immediately work? After I figured out what worked best for my instrument, the capo worked like a charm. An additional feature of the Planet Waves' Capo is that there is a clip for a pick which is handy if you don't already have an attached pick holder.I like it and recommend it for those who might move their capo around to different instruments that have varying neck dimensions.", "id": 843}, {"review": "These have a nice bright sound and are easy on the fingers with a light action. Pretty deluxe strings for the price here on Amazon. I have them on my travel acoustic six string (Martin) and am happy, especially since I am not a &#34;pro&#34; guitarist and my fingers can get sore.I say, get 'em!", "id": 897}]