[{"review": "yes, i think you should try these.  if you're looking at them, then get them.  they are thin and flexible so i purchased them to develop my pick skills as i was a finger type guy w/o any pick experience.  i don't drop these and get a feel for where the sting is located w/o looking.", "id": 62}, {"review": "i purchased the .38mm and these (.46mm).  after using the .38mm and learning how to use the pick now i feel better using these.  i like the small amount of texture provided in the grip area.  not too much, but at least something.", "id": 63}, {"review": "the winder works really well and same with the cutter, but using the cutter can be a bit cumbersome.  i guess for taking w/ you on gig bag would be great as you only have one tool, but if using at home, then i think is more convenient to have a separate cutter.  that's what i do anyway.  still i think is a good tool to have.", "id": 94}, {"review": "i love these strings.  i had limited experience selecting strings for my acoustic but as soon as i tried these, i really enjoyed them.  after reading reviews realized i actually made a good purchase.  no desire to test other strings.  especially after this bundle/value.", "id": 198}, {"review": "i use thin picks, (.38, .46 and .50)  so this pack gets you thicker ones too which i don't use.  i actually like the dunlop brand/material so once i get used to thicker ones, i'll try these.  the pack only have .50 and thicker in case you're looking for very thin ones.  if so, then don't buy this sample pack.  go and buy the Dunlop Nylon .38 or .46", "id": 773}, {"review": "it holds about 6 to 7 picks.  pressure is just right and overall size is very nice and adequate.  would recommend.", "id": 167}, {"review": "I purchased these as well as the Jim Dunlop 7000 locks.  I recommend the 7000 model.  They both work the same way and are made pretty much the same way, but these are just to big and clumsy.  The 7000 model does the same and doesn't take as much space.  You will need the straps to either be thin at the ends or your strap buttons/pegs to have enough room for the strap and then these units.  This is true for either one of the models.  I have a regular nylon 2&#34; Levy strap and these two models (7000 and 7007SI) work well, but I prefer the smaller, rounder model (7000).", "id": 261}]