[{"review": "A must have for anyone to make changing strings on any guitar especially an acoustic. Really like the clippers and bridge pin puller a lot. Would make a great gift for any musician playing a stringed instrument.", "id": 94}, {"review": "Works with any strap. For a quick detach system of so you don't have to drill for a strap button to hold your guitar.", "id": 174}, {"review": "Nice to use to muse your violin. A must need to prevent from annoying people while your practicing. Great buy.", "id": 211}, {"review": "Great quality, nice interior, and fits my Yamaha F335 perfectly. Solid and steardy case that will last a very long time.", "id": 320}, {"review": "I bought to use for my squire strat. It also fit my tele to. A real good quality case to protect your axe from damage when carrying from gig to gig.", "id": 324}, {"review": "I bought these to try them out. I have used remo a little then I used to have some Aquarian heads and wanted to try Evans to see how they are. Amazing. I practically beat the crap out of them and the held up. My next acoustic drumset will have Evans on them.", "id": 395}, {"review": "A good tool for study and applying to your music. Keep on hand to help understand theory. Also great for those starting out learning an instrument.", "id": 531}, {"review": "Nice foot switch for the mustang amp. Able to switch from clean to distortion quickly within a song easily. Great quality.", "id": 563}, {"review": "A good modeling amp. My only complaint is I didn't like the clean sounds not to my liking. Other than that an awesome amp.", "id": 619}, {"review": "I didn't use this a lot because it was a little uncomfortable. But is a well made product if you use it for what it's for.", "id": 637}, {"review": "Takes you hours to play around with all the sounds. Built in tuner and added foot switch makes it good for stage. Nice and loud in a small package.", "id": 718}, {"review": "Good little instrument to pass the time with while setting on a porch or at a campfire with friends. Buy this.", "id": 826}, {"review": "I bought this as a cheap way to amplify my acoustic. Learned my lesson. Should of just forked over the money for an a/e. I have a Yamaha F335 I really like. I say someone take a piezo transducer to amplify his guitar so I thought I'd try it. I first picked up a transducer for about $3 and experimented. I like it, sounded good then I saw this from Axl and I thought I'd try it. Installing it wasn't bad except I bought a set of drill bits I didn't need for $10. So I got it installed and plugged it in and from the start the sound was alright. I just wanted it for playing around at home so I didn't need real great sound quality. But sound was ok except it picks up every bang and knock especially my planet waves I think quick connect strap connector. My other complaint is I couldn't turn it up too loud without the feedback screeching. Overall product quality is good. Setup was ok. Price was good. Sound in my opinion needs some tweaking.", "id": 611}]