[{"review": "The tips of my fingers often get pretty dry and cracked, especially when I've been playing a lot.  The problem, at least for me, is that pieces of the dead skins sometimes catch on guitar strings making slides, bends, and pull-offs less fluid.  A few strokes of GHS makes the fretboard give me a much smoother playing experience.  An alternative would be using Vaseline on my fingers, but that would probably be terrible for my fretboard.  Also, I sometimes use an Emory board to smooth my fingertips which helps, but I'd rather do that as little as possible to keep callouses strong.  GHS allows me to minimize that.", "id": 72}, {"review": "I installed these on my 2000-ish Epiphone Les Paul.  They provide a VERY noticeable upgrade and provide a true vintage look.  I can tune with much finer precision, and they hold that tuning with even the nastiest of bending.  The ability to accurately tune and keep that tuning allows to play and sound better.  I should note that I had to drill new holes or, more precisely, enlarge the holes on my guitar.  I used a 3/8 drill bit and just went very slowly and carefully.  I'm sure the idea of drilling your guitar might sound scary, but it was actually quite easy.  Now they are in there nice and snug since I made the holes a bit tight.", "id": 420}, {"review": "I'm a guitarist with a passion for blues, so it was only a matter of time before I was going to pick up the harmonica.  I almost went with some of the cheaper options, but I am extremely pleased with my decision.  It sounds gorgeous (very full and clear), and I've already been able to start bending some notes--which I understand I notoriously hard for beginners on cheap harmonicas.As a blues guitarist I was tempted to buy a harmonica in D or A that, when played in second-position, would allow me to play along with blues songs in A or E (two of the most common blues keys; especially among the songs I like to play).  The second-position for the harp in C is G (not terribly common).  However, I think it is good practice to begin with a harmonica in C, since many of the beginner songs are in C, and the C major scale should be very familiar to most musicians.  In other words, as I'm exploring the notes, they make a lot of sense to me.  At this price, I won't mind buying a D or A when the time comes--it's not like I'm already at a level where I'm dying to play those songs anyway.  And, if I need to, there are a couple of songs I've found in G (e.g., Work Song by Butterfield).  That song along should keep my practicing for a long time.  If you are still reading this review, then you clearly are the type of person that would love this harp, add it to your cart.", "id": 421}, {"review": "Great for the price.  Not for guitars with nitro finish.  But I cut up a t-shirt into several long strips and wrapped them around the padding and then tied it nice and tight.  The result was a pretty cool looking stand that will protect my nitro guitars.", "id": 258}, {"review": "This strap has a fantastic old-school look and vibe, and I've never had it slip off while playing.  The only downside is that it's a bit rough on any loose skin.  I could never play with this strap without a shirt and sometimes if it rides up I can feel it on my neck (but that is very rare and only if playing with a loose t-shirt).  For 99% of situations these strap rocks.", "id": 657}]