[{"review": "Long time Shubb user, but decided to try something different.I think I've found how lazy I am. I ended up using the Kyser more often than the Shubb because of the fact that you can put the Kyser on the peghead.Reaching my hand to an always available position on guitars (i.e. the peghead) for the Kyser turns out to be much more convenient than reaching to something that is not on the guitar and that could change according to situations, e.g. maybe just by my side on the sofa in my living room, maybe a table or the floor in some other places, for the Shubb.", "id": 26}, {"review": "I replaced a bone non-compensated saddle of my parlor sized guitar with this.This is a convenient product as the thing is already close to final thickness you need, you don't need to change the compensation much if at all,  the material sands easier than bone, polishes well, and the tone is really good.A little careful sanding/polishing and the guitar was ready to play. I like the product.", "id": 414}, {"review": "The main advantage of this recorder to me is that I can get a good result without knowing much.I've made some surprisingly good recordings of choir concerts in various venues without any special knowledge, though I'm sure knowing more would make my recording sound better.About the only thing you should absolutely learn is to set the mic gain correctly so you don't overpower the mic. I don't use auto gain.If anything I try to err on the side of low. Excellent low noise property of the unit means that, except some rare cases, I can just boost the sound later on PC and the result is still more than passable for my purpose.", "id": 463}, {"review": "I ordered this bench for last Christmas (2005). I'm satisfied so far. Good value for money.The seat is generously padded and is 2.5 inches thick. Padding material is not too soft, and that is good in my opinion.All-steel frame construction feels sturdy.Contrary to one of the reviews, my bench came with height adjustment (it is not on-the-fly kind of thing, though). Each of the legs has 3 holes (low, middle, high). A fixing bolt goes through one of the holes for both of the legs, and the bolt becomes the crossing point of \"X\". Three positions roughly correspond to 18, 19 and 20 inches.For changing height, all you have to do is to loosen and remove the fixing bolt, insert it into whichever hole you like and then tighten it. Don't worry, you don't need any tool to do the job,  thanks to a large plastic knob. See the picture and you'll understand how it works.Mine initially came with middle position. I also tried high and low, but set it back to middle. It seems to be a good compromise for my family, as the bench is used daily by me, my wife and my kids. Sure it's nicer if you can change the height quickly and easily. However, with this price, I wouldn't complain at all.", "id": 464}, {"review": "When you need a no-nonsense leather strap that is not long, consider this. If you need something fancy, or want to sling your guitar low, or if you are a tall person, probably you want to skip this.I'm 5ft 8\" and I'm already using the longest setting with my acoustic that has a strap button on the heel of the neck as well as the end pin, and it's not like I'm trying to hold my guitar particularly low. If you are a tall person, or if you want to mimic Jimmy Page's posture or something, this is not for you.Apart from that, I have to say that the cost performance of this thing is really impressive (it's more so if I believe the \"made in Canada\" sticker on it). Hard to beat it as far as leather straps go. At 2.5 inches wide, it's comfortable, one-ply leather is reasonably pliable yet seems to be thick enough, and the looks of it is not that bad either. Sure, there should be nicer/better product, but you cannot buy them for 12 bucks.The only complaint I have is that a sticker that left some sticky residue was on the back side of the strap. Though it was not a big deal to remove the residue using rubbing alcohol and some  elbow grease, it would have been nice if I was able to use it without any extra work without worrying about some gummy sticky thing rubbed on the guitar.", "id": 656}, {"review": "We've been only using it for two days, and so far so good. I cannot say anything about durability for now, but I'll update this review if it breaks.====One of my kids has been borrowing my trusty old BOSS TU-12 chromatic tuner forever for her violin, and I finally bought this for her.There are many clip-on tuners, but I liked the following about this tuner:1. LCD mimicing an analog needle so you know how much you're off (as opposed to just flat or sharp).2. You can switch between vibration sensor and an internal mic. Most of the time you want to use vibration sensor anyway, but a mic sometimes comes in handy.3. Can set different pitch than A=440.4. Not expensive (was less than [...]$ including shipping).Upon delivery I tried it on my guitars (both acoustic and electric) using vibration sensor before giving it to my kid, and was impressed.It is quick to track the note even for low E. It's not picky about where on the peghead it is clipped on. No stress whatsoever, indeed it's just as quick and smooth as my BOSS. LCD is bright and clear, and needle-ish display works as expected.It worked very well on violin too. And I saw kids singing to internal mic to check the pitch of their voices just for fun.And a note about the looks. From the picture I expected it to be ugly, but actually it was not that bad. It's tiny and doesn't look like a Fisher-Price product.====First update, Nov 24 2010: I've tried it on an electric bass (4 string), and it worked equally well. Still 5 stars.====Second update, Oct 20 2011: It's still working happily for my daughter, and I bought a second unit for myself. Fantastic product.", "id": 707}]