[{"review": "I use this to run a single, mono XLR shotgun mic line to two audio channels on my Tascam DR-40, which saves me a step in post-production.  The quality is fine and it does what it's supposed to do.  Good price for a good product.", "id": 13}, {"review": "I like mic stands with folding legs (like this) as opposed to weighted bases, since they're easier to travel with.  Quality-wise, this stand feels solid, but not amazing &#8211; it's a mixture of plastic and metal construction.  For the price I paid (around $25), it's a nice piece of kit and everything holds as it should.  It also folds down pretty well.  Note that it does not include any kind of microphone clip or mount, so you'll need to provide your own.  The cable clips are a nice touch.", "id": 279}, {"review": "I picked these up on impulse &#8211; they were on a good sale and I was dissatisfied with my older, cheaper set of Panasonic over-the-ears.  I'm glad I did &#8211; these are excellent headphones and they've exceeded my expectations on just about every level.  The sound quality is exceptional and they do a very solid job of blocking external noise.  They feel extremely sturdy and well-made, from the cans themselves to the nice, thick coiled cord (although a removable cord would be a nice bonus).  Finally, and this is important, they're incredibly comfortable.  As a video editor, I often wind up wearing headphones for hours at a time.  The cans rotate on two axis, so they conform to the shape of your head and the headband is thick and well-padded.  They grip your head snugly, without that horrible &#34;vice grip&#34; feeling.I've heard several reviewers say that these are the best headphones to be found for under $200.  I haven't tried enough pairs to make that judgement, but I will say that I highly recommend them.  It's one of the best purchases I've made in a long time.", "id": 458}, {"review": "I just did a quick mic test with this cable and everything sounded good.  It coils nicely and has good connectors.", "id": 692}, {"review": "I debated between picking up this and the Zoom H4N and went with the Tascam &#8211; I just couldn't justify the extra $100 or so for the Zoom.  The unit is simple to use and the built-in microphones do a great job.  I picked it up because I wanted a portable unit that would let me use 1/8 inch, 1/4 inch, and XLR microphones with my DSLR, or capture great audio on its own.  This accomplishes all of that &#8211; although I need to use an adapter for 1/8 inch mics (for the 1/4 inch ports &#8211; there is no 1/8 inch mic port, which seems an odd omission.)The unit is almost entirely plastic, which can feel a bit inexpensive &#8211; I know that one selling point of the H4N is its sturdy construction.  Still, it seems well made and I think it's a fantastic recorder for the price.", "id": 800}]