[{"review": "I bought these to replace the stock machine heads that came on my Hondo II \"The Paul\", which I bought in 1980. The stock ones were loose, lots of backlash in the worm gears, and the guitar kept going out of tune even after the strings were fairly stretched out but still new.They went in easily, if you follow this hint( if your machine head holes do not need to be enlarged, disregard this hint)- The holes for the old machine heads on the Hondo II were 0.305\" in diameter, and these new Grovers need a 0.390\" diameter hole. So I had to find an accurate and clean way of enlarging the holes. It's almost impossible to use a drill, even in a drill press, without splintering the wood on both surfaces of the headstock. I read online suggestions about using a round wood file, and reamer, etc.. So what I did was first use a threading tap( for metal screw threads) which at the bottom had a 0.290\" diameter, and at the top had a 0.375\" diameter. This is a standard 3/8\"-24 threading tap. I chucked the tap into my battery-powered hand drill, set to low speed, and used the threading tap to cleanly and carefully enlarge the headstock holes to 0.375\" in diameter. Then I used a tapered reamer, from both sides, to enlarge the holes to the required diameter. Quick, clean, easy. If you have a different size enlargement to make, use the appropriately sized taps and a tapered reamer to get the holes to 0.390\" diameter.Another hint which you should follow is to replace only one machine head at a time, like when changing strings. You don't want to take the tension off the neck and mess around with the truss rod. At least I don't want to!Now the guitar stays in tune, and is easier and more accurate to tune.A very worthwhile upgrade! Zero backlash in the worm gears on the Grovers, beautifully chromed and smooth as silk.", "id": 270}, {"review": "I bought this product for only one reason: I have several amps that are not guitar amps, but stereo or PA-type, clean, high powered , two channels, that I want to use as guitar amps, either as the primary or backup. This tube modeler acts first as a pre-amp, and then adds gain, volume control, \"crunch\", whatever, to the non-guitar amps to make them sound like guitar amps. I don't really care what tube amps it models, or what mic placement, I just want the guitar amp sound and style. I also use it in front of a Behringer Ultra-G DI box, so that the DI box splits the signal coming from the TM300 and sends half to my non-guitar amps and guitar speakers on stage, and the other half to the house PA. I don't think that many people would do this.The sound you get out of this box is affected by what amp, and kind of amp you are driving with it, and also what kind of speakers that amp is driving. The acoustics of the space you are playing in also affects the sound, but I've used this box with all of its settings driving PA amps, home stereo amps, bass amps, and guitar amps, all of which drove PA speakers, bass speakers and Eminence Commonwealth 12 guitar speakers, all in the same acoustic space. Each combination of amp and speaker with all settings on the box held constant, sound different: some more like guitar  amps and speakers, some not. As I said, I don't really care about what tube amp is being modeled, only that I get an authentic guitar and speaker sound out of the box. It works for me.I read reviews that say that this is a digital knockoff of the analog Sansamp GT2, and based on its performance so far, it has served as kind of like a cheap preview of what the Sansamp can do. I would consider getting the GT2 in the future, but for now this product is, for me, the poor man's tube amp.", "id": 471}, {"review": "As accurate and easy to use as the excellent Korg DT-10, I plugged in the battery, hooked up my guitar( which I had just tuned using a Korg DT-10 that I already own) and it came up in meter mode and verified exactly the tuning that the DT-10 gave me! I love it! Nice footprint, very easy to see the indicators in a bright room or on a darkened stage, one input 1/4&#34; jack on the right, one output 1/4&#34; jack on the left. Simple to use. I probably will never use the other three display modes, but it's nice tht they are there if I want to play with them. The perfect tuner.", "id": 504}, {"review": "I have the PT2, which is not backlit, so I bought this one for use in dimly-lit venues. It worked great right out of the box: put in the battery, clipped it onto a standard acoustic guitar headstock, turned it on, and began tuning. The display is big ( 1-1/4\" X 1-1/4 \"), bright even in a bright room, and when the string is in-tune, the backlit background turns from red to green( like Christmas!). I put on a brand new set of strings, and used it to bring each one up to pitch. I found that plucking the string with your finger and then adjusting makes the tuner \"waver\" less, probably because fewer overtones are being produced. All of these type of tuners have some degree of hesitancy when reading the string pitch, moreso on some of the strings than others, but I found that this unit locked in on the signal quickly and gave a very accurate reading. I can use a pick to pluck the string as well and this device, after a very brief pause( less than a 10th of a second), gives me a reading or gives me the green. I don't use any of the other features. I also did not use it to tune any other stringed instrument.The only other comment I have about it is that the on button should have been placed on the top of the unit as you clip it onto the headstock, but I just mount the unit over towards one side, and turn it on and off from the bottom.I would highly recommend this for a anyone looking to quickly tune-up a guitar in a noisy, dimly-lit room.Update-August 2012: Replaced the battery after 2 years, with a good quality Sony lithium, and the tuner is still going strong!", "id": 627}, {"review": "I agree with all the other 5 star reviews, the quality of these strings is excellent.They last with great tone for a reasonable time, and don't break.I just have a helpful hint for those people with little experience in re-stringing an acoustic guitar that has removable bridge pins. Put a crimp or bend in each string about 3/4 of an inch or so from the ball at the end, about 45 degrees from the straight portion of the string, fairly sharp. Just beyond or just on the wound portion that holds the ball on. Then push the ball into the hole and make sure the crimped portion of the string is slid up against the wall of the hole closest to the neck of the guitar, out of the way of the pin. Then slide in the pin and make sure the ball is not resting on the bottom of the pin! The pin should fit tightly into the hole, and the crimp you made in the string keeps the ball on the side of the pin, not below it. Each pin has a groove in it where the string passes into the hole on the side of the pin. After pushing in the pin, you can pull on the string in the direction of the nut, and the ball should be pressing the pin sideways in the hole, keeping it tight. It may be under or on the side of the bridge inside the guitar, but I can't see in there to verify this is so, but I know that the ball is pressing sideways on the pin! Not upward.Hope this helps some novices, I had to learn it this way myself.", "id": 198}, {"review": "Let me preface this review by saying that I am not a professional musician, but I have some experience with guitar amplifiers and sound reinforcement equipment. I bought this amp for a couple of reasons- I wanted a combo that was light in weight, easy to move,store, and carry, and also was clean sounding and slightly loud. I can get the sound level I want out of this amp without turning the volume knob up more than 1/4, but if I ever want more, there's plenty of headroom there. It is definitely a clean, noise-free amp at moderate sound levels, and I can add effects through my Line6 Pod Pro if I want to, like more drive, reverb, etc.. As far as durability goes, I've only had it for a day, so I can't say. It has a year warranty period. Price through Musiciansfriend was good, I buy everything for music through them( no offense to Amazon). It's solidly built . All in all, a beautifully designed and executed product. Thanks, ZT!Update- 3/1/12 So far, so good! I've played through the amp for a couple weeks now, and it's great. Clean, low noise, I'm used to the controls and love the sound of it. No need to even use my Pod Pro. I'm now thinking of adding an extension speaker cab of my own design, using Eminence Designer software and an Eminence Commonwealth 12\" guitar speaker. Also considering the Lunchbox extension cab. I don't really need more volume but a 12\" speaker might change the sound enough to where I like it, although I like the sound through the 6.5\" speaker it comes with. Always experimenting with my sound. To think some people buy $2000 tube amps, wow I'm not that kind of expert!Update- 3/10/12 I hooked the amp up to a JBL PA cab, and it really rocked! The JBL 15\" woofer in the cab had a lot more bass, so I adjusted the ZT tone to give the signal more treble to compensate. Hooking up an external speaker is definitely a way to get more volume if so desired. Now thinking about an Eminence Deltalite 12\" neodymium speaker in a 1 cu. ft. As an extension speaker.", "id": 685}]