[{"review": "This capo is expensive. The first time I (and everybody else) saw one, I said, \"Wow. I can get a Kyser or something for fifteen bucks. Get out of here.\"Five capos later, I realize that I could probably have just shelled out the money, instead of purchasing every other capo on the market, one at a time, over the last fifteen years.The first and last thing that really needs to be said about the G7th is this -- it doesn't put my guitar out of tune. Virtually at all. I can capo all the way up to the seventh or eighth fret and my micro-sensitive tuner shows that I'm still within one glowing light of being perfectly on. That's it. Yes, the G7th is sleek and beautiful, like a tiny sculpture, and glorious to look at, and sometimes I just want to stare at it. Yes, it's easy to put on, just a mere squeeze of the hand away from being perfectly in place. Yes, it appears to be sturdy enough to outlive me and my descendants. But the tuning thing is all that really sets one capo apart from another, at the end of the day, and this one kills it.I own three Shubbs, a Kyser, a Dunlop, and one of those rolling capos. They're all good. I don't hate any of them. But this capo takes away all the uncertainty and irritation of being a fraction out of tune with the rest of the band, or with myself. It makes playing guitar with a capo effortless and a joy.", "id": 266}, {"review": "I used to have a regular guitar strap on my bass, but when I got a regular weekly bass gig and was using it more often, it started to feel like the strap was digging into my shoulder. Your mileage may vary on that, but I decided it was time to check out a wider strap that was actually intended for a bass.I read a lot of reviews and decided on this one -- some of the cheaper leather straps were described as stiff and uncomfortable, but this one was usually reviewed well. It was the perfect choice. This strap needs no wearing-in -- it's supple and soft right out of the box. The leather on top is smooth and classy looking, and the suede underneath is comfortable and soft, with good friction that helps it stay put on your shoulder. The wider strap distributes the weight of a bass better, and there is some cushioning between the two layers of leather that also helps. All of this adds up to a great deal of comfort.I use Dunlop strap locks on my instruments, and with a thicker strap like this, I had some concerns about getting them on there, but with a flat head screwdriver and a little bit of encouragement you can put strap locks on this strap, no problem.I would highly recommend this strap for any bass player, or even someone with an especially heavy guitar.", "id": 480}, {"review": "I was so excited to discover that you can buy these on their own. I am a huge devotee of Dunlop strap locks -- having dropped both my electric guitar and my bass on stage at one time or another, I have now installed these on all my main performing guitars.So it was a given that when I started gigging with a new bass, I would put strap locks on it. But I already have my fancy bass strap decked out with the lock mechanisms, so I really only needed these buttons. I was on the verge of resigning myself to buying the whole set again and throwing the extra strap lock parts into a drawer when I found these. Buying the buttons alone cost less than half what the whole set would have, and now I can just shuttle my one bass strap between both instruments.I did have some major difficulty getting one of the two screws all the way tightened, but since I have attached strap lock buttons at least four other times and it was easy as pie, I'm more inclined to blame my instrument for that.Great product. I'm elated to know I can now get these buttons separately.", "id": 630}, {"review": "I couldn't believe that a hardshell mandolin case even existed for this price. Especially given what I paid for it, this case is unbelievable... velvety cushioning inside, heavy-duty outside, and a little compartment for picks or capos (I can't fit much else in there but I don't really need to). A few other reviewers have mentioned that it can be a squeeze -- at first, I didn't think my Ibanez mandolin fit in here, but when I finally applied some pressure, it went right in. Now that I've been using the case for a while it seems broken in, and I don't have to fight it so much to get it to close.The only downside is that after a few uses, the outer black layer of the case started peeling off at the edge. I used some electrical tape to stick it back on there and since it's on the bottom, it's not very noticeable, but that was the one place where the low price kind of showed through. I didn't take a star away for that as it's purely cosmetic, and as long as this thing is protecting my mandolin, I can forgive some tape on the edge. In this case, I still got more than my money's worth.", "id": 752}, {"review": "DI bass is the worst. Just really, really awful. Every ordinary DI box I've tried yields this thin, cheap treble sound that does not present my bass in its most flattering light. So when I started playing live weekly, I just hauled my bass amp around to each gig, because it was out of the question that I would rely on a weird sounding DI box to carry the day.I live in Phoenix. I made it through about two months of lugging a monstrous bass amp across town in 115 degree weather before I decided there had to be another way.When I first got this pedal, I would run it parallel with the amp, terrified to rely entirely on this little box for my sound. After a few performances, I let go and left the amp at home. The Bass Attack pedal did not disappoint. Ever since, I just bring a bass and this pedal. Running straight into the board through this thing delivers a magnificently huge bass sound. I don't miss the amp at all.I did spend an entire evening the night this pedal arrived, just tweaking knobs until it was perfect. You'll want to dial in exactly the right sound for your bass, and some of the settings I tried were less than ideal for my instrument. But once I got it locked in, I've never touched the knobs again. I just plug in and everything sounds magical.", "id": 236}]