[{"review": "Whatever good things you've heard about the at2020 is probably true! Well.. unless if you've heard it will sprout wings and save you if you falling from the sky... but it sounds great when your recording songs! Haha! I record with fl studio and it's even great so far! I recommend you get this!!", "id": 254}, {"review": "(This review is legit)I bought this mixer back in august or september, cant really remember, but i had a horrible experience with this unit, but that's my fault, i bought this mixer without looking at reviews or anything, so i didnt know how to use it.I hooked this up to my desktop through the pink microphone input, and got a horrible, terrible mix, the hiss from the fan ruined it (i nearly had a panic attack), so i took like 9 months to do research, and found out that behringer made the uca202/uca222 for this unit and the 802 mixer, to remove the hiss and unwanted noise.So buy this with the uca202/uca222 to clear up your recordings, do not buy a \"rca to 3.5mm cable\" if your using this for a studio setting like me, and if your beginning like me, do not let these wealthy people fool you, you dont need thousand dollar equiptment, the podcaststudio usb (from behringer) would be fine.So all in all, with my cheap microphone from radio shack and this mixer, the quality was good, but the hiss ruined it!!!!! Use a usb audio interface with this from behringer, do it, if you want 5 star audio quality! Their website has asio drivers to assist you, ohhh and go on YouTube and search up \"uca202 studio\", you'll get videos to help.Please, please, please, please do research before you buy anything! Good day everyone! ;D", "id": 367}, {"review": "Ordered this and two cables! This came and it is so sleek and pretty and the xlr cables fit in it well but the button to turn on the phantom power is a little loose but other than that it is a wonderful little unit! I recommend!", "id": 485}, {"review": "It connected well in the nady smps-x1 phantom power unit I bought! I'll update how I hook it up! Check!", "id": 556}, {"review": "Shipping was fast! Got to me in two days! And it's a great midi controller! I use it for fl studio to make beats, I just plugged it in and I set a timer to get good timing ratios for it and it installed in 8.6 seconds flat and when I went in fl studio and selected it and tried it out with some sound kits but it was slow recognizing like I'd press the keys and it wouldn't recognize right away, then I remembered the asio drivers weren't activated, then I activated them and every key I'd press it would recognize immediately! Great buy! I hope if y'all get one! It's great and making beats is so much easier now then pressing the keys on the regular computer keyboard!", "id": 722}]