[{"review": "I think they did it right splitting the light and medium gauges. What resulted for me was the perfect gauge string. They almost sound as good as mediums but feature the playability of lights. I also think these strings last a decent amount of time, particularly if you wipe your strings after playing (which I need to get better at doing). Bottom line: I highly recommend these; they are the strings that I use and have been using for several years now.", "id": 90}, {"review": "I was using slinkys for several years but decided to give these a shot because the slinkys kept corroding so quickly. Anyway, these seem to hold up a little better. Both sound good, but these last a couple weeks longer. So stock up!", "id": 156}, {"review": "Honestly, the strings are great. They sound great and they are (relatively) inexpensive for bass strings. I love them, and they will be what I buy the next time I change out as well. Highly recommended.", "id": 197}, {"review": "I was an Ernie Ball guy for a long time. But I was getting pissed because the Ernies kept corroding so quickly. So I tried these, and they seem to hold up better. There are coated strings that will last longer, but I don't like spending so much on strings. And of course, they sound excellent too. Stock up!!", "id": 198}, {"review": "Great guitar strings, and affordable. I have used these for quite a while, and I have always liked them. Recently, I moved to Boston though, and here they seem to rust really quickly. They never used too. Its not that humid here, so I don't know if I got some bunk strings, or if the quality has gone down in the last year, or if really its the Boston weather. Historically, I have sworn by these though!!", "id": 226}, {"review": "Great strings. I use these on a Deering Goodtime II and they work well. Deering recommends (as I imagine most entry level banjo manufacturers) sticking with only the light gauge, not light pluses or mediums. So stock up. Good strings, and not overly prone to corrosion.", "id": 255}, {"review": "This daisy chain worked very well for me - no problems yet. I'm powering about six pedals currently, and I am able to use more than one without any problems or change in sound. I think this is a great way to power some basic effects without breaking the bank, and it should work with any single spot A/C adapter you might already have, so no need to buy another.", "id": 486}, {"review": "Made of leather or high-quality pleather, so it seems built-to-last. I use it on my Seagull and it totally works great. I would definitely recommend, but it's kind of expensive for what it is.", "id": 568}, {"review": "I liked these a lot. For the price they work very well, and I am very happy that I bought them. I got a couple of those straight-coupler things, but really their use is quite limited because input jack heights on different effects pedals are rarely the same height so you can't use the straight-couplers. You don't run into that problem with these - they can connect any pedal to any other pedal.", "id": 578}, {"review": "Nice thumbpicks for banjo. They are size large, so if you generally have a very large hand they will be tight on you. I have a larger hand and they work well, but they are about a micrometer away from being too snug. But I like them a lot. Would also work fine with acoustic guitar picking if that's whay you're into (though I always preferred acoustic picking without a thumbpick).", "id": 617}]