[{"review": "So good that I bought another one.  Love the heavy cord and gold connectors.  Bass sounds great.  I just learned last night how to coil them up.  I guess I should read instructions more carefully.  But no harm done, still works great!", "id": 1}, {"review": "I had to actually follow the instructions and drill holes as specified, then it worked like a charm!  Glad I got them, much less hassle tuning up for a gig.", "id": 44}, {"review": "So good that I bought another one.  Love the heavy cord and gold connectors.  Guitar sounds great.  I just learned last night how to coil them up.  I guess I should read instructions more carefully.  But no harm done, still works great!", "id": 124}, {"review": "it is a good purchase.  I expected a bit more heftiness but it does the job.  I would like the plate to be heavier, seems a little flexy", "id": 155}, {"review": "This tiny little amp is great for practicing outside or in a canoe or while hang gliding.  But it is not very good at parties.  it cannot compete with the noise level that 20 people in conversation can make.  It is cheap, so you should just get one.  I am having great fun experimenting around with different settings, instruments, and power feed voltage levels.  (see the danelectro power supply for this thing, really cool!)", "id": 302}, {"review": "light construction but  you get what you pay for.  so far it has functioned well and I do use it a lot.  it would be nice if it remembered what channel it was last on so when you power cycle it doesnt switch on you.  I mostly use it to feed one amp from two different instruments.  I have not noticed any sound degradation from using it.  the volume knobs are handy for sure!!", "id": 375}, {"review": "Neither delighted nor disappointed.  I have not found it to be intuitive to use and the battery compartment is a joke, but otherwise the construction is good.  I dont use it very much because I havent really figured out what I want to do with it, and it is too big to fit in my briefcase full of blues harps, so I have the behringer A/B switch doing the job there.", "id": 412}, {"review": "i use this cable to patch a preamp to an amp.  it works really well.  having the two different style of ends gives you good options when putting a system together.", "id": 419}, {"review": "This delay pedal was so cheap that I could not pass it up.  and let me tell you, it is easy and fun to use!  I stopped messign with the reverb in my amp and now only use this for a much nice sounds from my guitar.  I actually bought it to try some experiments with my harmonica, but those were dismal failures.  Big win for the guitar though!", "id": 506}, {"review": "I found that these were OK but the heads were bigger than I could stand to use on my cramped for space pedal board.  So, they sit in a drawer as spare parts for other cables.", "id": 578}, {"review": "Is this guraunteed for life or something?  it should be for the price.  it is very basic, tube construction with very little for wire and cable guidance and clean up.  I would not buy another one at the prices they charge, but then, I am handy enough to make my own if I wanted to.  The carry bag is very nice, the extra pocket for cables and things holds a lot of stuff.  They show a lot more pedals than I could fit on it, they must be smaller pedals than the ones I can find and the perhaps have those magical patch cables that take no space in between.  If you look at the picture there appears to room for 6 pedals but 5 is all you will get.  I have a Boss RX-20 double pedal looper, and 2 other Boss pedal on board and that is all than can fit with patch cables.", "id": 588}, {"review": "I love thes, I keep buying them for every instrument I have, so I am never with out it...", "id": 635}, {"review": "This is a cool gadget.  I love experimenting with adjusting the power level on various pedals.  It can do some strange things and get unique sounds.", "id": 760}, {"review": "compact heads allow more pedals to be loaded onto your overpriced pedal board.  the quality is good. I like how they are easy to take apart and modify and put together again.  very handy for making it all just right.  I will buy these again for sure.", "id": 207}, {"review": "nice cable, could be a little heavier.  I managed to pull the wires apart on the straight plug, probably stepped on the cord when I was playing guitar while standing.  I had to take it apart and resolder but it has been really good since.", "id": 492}]