[{"review": "It is a fun little practice amp, and I agree with the praise it gets. The positives have been covered so I'll point out a few (minor) things I don't like.First of all the power button is on the back, which is annoying. The rest of the controls are on top, why do I have to grope around the back to find the most important button. Plus I keep it in a cabinet so I have to pull it out to turn it on and off.Next! I wish they'd just name the settings &#34;clean&#34;, &#34;overdrive&#34;, &#34;distortion&#34;, and so on. JC Clean, Black Panel, Brit combo and R-Fier mean nothing to me.Then there's another minor annoyance that the input is recessed. A 90 degree angle plug won't fit unless you run it around the back.Lastly, the amp is solid and rugged but that means it's heavy. Not heavy like I can't pick it up, just heavy for something called a micro amp.None of these are deal breakers, just things I find annoying. Overall I have to say I prefer my VOX mini 3.", "id": 48}, {"review": "This is a fun little practice amp about the size of a large sandwich. Three knobs, volume, tone and gain give it a little versatility. Runs forever on a nine-volt battery. I keep mine next to the couch so I can always plug in and have some fun. It's small but it can also be quite loud of you want it to be.Overall a great little deal for the price. Stop waiting and grab one, you can't go wrong.", "id": 303}, {"review": "It works as advertised but be aware it's not for anything freshly painted or any guitar with a nitro finish. It will mess up the finish. Nitro is usually used on your more expensive guitars like my Gibson Les Paul for example. It's amazing how many guitar stands can mess up your finish, that's a pretty major design flaw. But they just keep making them.Anyway, it is a nice little stand but be careful. If you have a nice guitar you'll want to cover the padding with some cloth to avoid possible damage.", "id": 769}, {"review": "This Orange Micro Crush amp lives up to it's name. It's little bitty, about a third the size of the Roland Micro Cube, but it's plenty loud. Surprisingly loud really, it's amazing that much sound comes out of that thing. Of course it doesn't have all the bells and whistles of the Micro Cube, it's basically got a clean channel, an overdrive channel and a tuner. Then a volume knob a tone knob and that's it. The over drive gives a good sound but I like to run pedals through it anyway. It's missing reverb, which I would like to have, but it's far from a deal breaker.I have no issues with the build quality, it feels solid as a rock. Of course it's size and trademark Orange color make it look like a toy, it's definitely a capable little amp. Definitely a keeper!", "id": 528}, {"review": "I really like this cable! Maybe it's not top quality but it feels solid to me and works just fine. I keep it attached to my little practice amp and play a few feet away. It probably stretches 10-12 feet if you really need it too. What I really like is that it's compact and I don't have cables laying all over the floor.Overall it's a solid cable for practice. I'll buy more.", "id": 709}]