[{"review": "I have a guitar and several ukes of all sizes. This works very well for all of them. It's very easy to take on and off, and it stays right where you put it. The rubber is tough but molds to the instrument, I haven't seen and marks or damage from using it.", "id": 116}, {"review": "Material is similar to my messenger bag's strap. Reasonably comfortable, but I don't want it cutting into my neck. Does not go short enough for one of my smaller ukes, a rubber band or spare capo is enough to fix that.", "id": 208}, {"review": "I am not a sound guy - I just wanted something to plug in and record my practice sessions. This is vastly better than any webcam or communications microphone for recording instruments.The four direction settings are fun, though I find myself using the stereo or cardioid settings the most. The no-delay headphone jack is great. I was impressed the first time I plugged everything in and tried it out - it's nice to hear how my playing sounds from an outside standpoint.Setup was easy, and quick. I have experienced a few times when plugging it in registered it as a recording device, but failed to actually use it. This may be a windows problem, and fixed itself eventually.I am quite happy with the build quality. The base is hefty and wide, planting the mic firmly. The body and buttons are plastic, but solid, they don't feel or look cheap.", "id": 644}, {"review": "This tuner clips on easily to all the instruments I have, shows pitch quickly and accurately. The screen is bright, and the battery lasts a very long time. It actually just dims the display as the battery is dying, and can last like that for months. I've banged mine around a bit, and it's stayed in one piece. The plastic is solid but not unbreakable. The size of the tuner is a bit large, it's not the smallest on the market, but it is small and light enough that when I leave it on my uke's headstock I can't feel the extra weight. Easy to operate, easy to read. I like it so much I got another one right away when I thought I'd lost the first. Now I have two, and am considering getting a third to keep in the travel bag.", "id": 706}, {"review": "I enjoy playing this thing so much. It's reasonably quiet acoustically, but it shines when plugged in. Plus is looks good - the actual color and finish are quite rich and shiny, respectively.It stays in tune (after string break-in) and the intonation is ok - not spot on but definitely good enough. The tuners are basic, but they work well. It is thinner than a normal uke, about half the body depth. I find holding it without a strap to be harder than a normal sized uke, but with a strap it's very comfortable.Mine came with the pick guard in the bag pocket. The bag itself is also pretty basic, but good enough for what it is - a bag to hold your uke and some misc. items", "id": 814}, {"review": "Couldn't be happier than playing with a variety of picks - each one has a different feel and sound. The dura picks have more variety, there's only one in each thickness. The celluloid ones come two per size. As a pick, I liked using all of them, from the super floppy thinnest dura to the hard plastic thickest celluloid. Worth getting even if just to experiment - some of the picks were easier to use for certain songs than others, and the different thicknesses definitely have a different sound. Similar thickness picks of both material sounded the same but felt different to the fingers.", "id": 879}]