[{"review": "This is a cheap piece of junk that does what it says, it distorts, You want something to make your guitar sound like junk, this will do it. Why pedals that make your guitar sound like a piece of junk are the most popular is beyond me. This is not a boutique Distortion pedal like Hendrix would use. Boutique and distortion are an oxymoron.These things are built with heavy metal, it should last, I kinda hope it doesn't(just kidding), you want distortion, you got distortion", "id": 35}, {"review": "I got this several years ago, and I was pleasantly surprised by it, really was nice with my acoustic to raise some volume on my soundhole pickup before the direct box. I gave it to some one after I used it for a couple of years.", "id": 382}, {"review": "After trying about every comp out there for years, I came across this, I have a Wampler Ego Compressor too, it is the same quality as the Ego Compressor.Better than the Script Reissue, it was too noisey for me.", "id": 671}, {"review": "I love these clip on ,vibration reading tuners, This was the second one I tried , The first was a Barcus Berry, which worked equally well, They both have lots of features, such as tap tempo, up and down tuning adjustments. With the Barcus Berry, it was the first one, after trying the Snark, which is a cool name and a lot more colorful, I tuned up a brand new guitar in a store , out of the box in less than 2 minutes, never came close to doing that before. That convinced me, the Quicktunes I had been using were accurate, but these seemed to be better, and get you perfect, I have heard that they work better on acoustic instruments, which makes sense, they put out a lot more vibrations than a solid body electric.From the literature it, seems that the snark could have been made by the quicktune company and the company that makes the cool cats pedals, that have been raved about.Hello, Raving bout this. I seen on Amazon they are cheaper, I bought a blue guitar only one at my local store for 19.99, here they are around 10 to 12 bucks. These type of tuners, especially the intellitouch are popular wih Bluegrass folk like me, The grapics on this are great , no more shaky needle, just a dead on still reading when you are perfect.", "id": 706}, {"review": "I honestly was not impressed. It looked Cheap, sounded cheap, what else is there to say, you get what you pay for!!! Another Chinese copy of a tubescreamer,", "id": 728}, {"review": "I was having some problems with my Ego Compressor comp getting noisey, sent it back and found out that It Had been using a slightly drained battery, so I got one of these and it is great, nice and quiet again, half the price of the boss one.", "id": 40}, {"review": "This is a upgraded version of the guitar humdifier, The first one had that green stuff that florists use in it and you used a plastic syringe to ad water to it. This has a replaceable sponge, you take it out, soak it and squeeze out excess then put it back in container, would say it gets more humidity out.", "id": 71}]