[{"review": "I bought the .73 mm picks & I would consider them medium thickness. If you like lighter get the smaller thickness or if you like heavy go for the larger thickness. The .73 mm is right for me, I really like them.", "id": 61}, {"review": "Great guitar string at a reasonable price. I highly recommend these acoustic strings, they are also available in light or heavy guageif you prefer. I like the EJ 17 medium string for my rhythm acoustic guitar.", "id": 198}, {"review": "I have owned my G7th Capo over a year now & as far as I'm concerned it beats all the others I've owned in the past hands down!! So easy to use & can clamp right on my guitar nut for ease of moving when needed.", "id": 266}, {"review": "I have owned this product for a while now & it has some awesome features. This little Recorder is absolutely amazing for it's size. Takes some practice to appreciate all the features. I recommended this Recorder to a fellow musician friend & he bought one also from Amazon & he loves it & records all his gigs with it now instead of the old huge unit he was using & told me it does a much better job than his old unit. He even used his on a tripod to record a gravesite funeral service that his family can keep for memories of a loved one.", "id": 463}, {"review": "I really love this little tuner, I just keep it on the headstock of my guitar when playing & just touch up tuning if needed. Best tunerI have owned for the price.R. Joyner", "id": 811}, {"review": "I love this tuner. It is accurate & very reasonably priced. I have ordered this tuner for  fellow musician friends & all of them love them. Best clip on tuner I have ever purchased.", "id": 820}, {"review": "Use it every time I restring my guitar, works really good. I recommend this to any musician that plays regulary.", "id": 94}, {"review": "I already owned two of these Tuners previously & purchased these for friends. They are great for jamming with friends & are so user friendly & accurate. What is really impressive is that they can stay attached to the headstock of my guitar whileplaying making touch up tuning a breeze. I love mine & so do my friends. In my opinion for the price they are hard to beat.", "id": 635}, {"review": "Although this light is a little pricey in my opinion, it really gets the job done. I do like the fact that you can use batteries or a/cadapter to power the light. The nine led's really light up my music stand. The carrying case that comes with it is well made & makestransportation & keeping it stored easy.R. Joyner", "id": 681}]