[{"review": "Looked like the chrome was cheesey and they ended up breaking but they worked while they were used in a guitar with the proper pinhole next to the screw position", "id": 115}, {"review": "good deal. quite the steal. if it sounds at all like the pinstripe bass pedal. im sure it will be amazing. and its cool that i got a snare head with the deal. those are pretty crucial to a drumset. :)", "id": 180}, {"review": "I am a tone freak. I bought this pedal a while back under the impression that it would sound equal to a big muff. At the time i had never owned a big muff. I thought the sound it produced was big muff sound. I later took it to my friends house and matched settings with a real big muff. The difference was huge. The big muff sounded fuller where the little one sounded like you just took the sound and trapped it in a little box. I later bought a big muff and its been one of my go to pedals for at least three years of gigging. I am currently loving it still but i am curious about the nano big muff because i am looking to clear out space on my board but i will probably not use it if it sounds anything less than the real deal. I would only use the little big muff if my concerns for sound were out shined by the need to minimize board space", "id": 448}, {"review": "Cost efficient. perfect for a guitarist who loses or wears out picks easily. like it alot. will probably buy more next year ;)", "id": 455}, {"review": "Sounded good. Warmer sounding than stock tubes in my ac15. I rocked all night and loved the sound. Next day i turned it on, my amp was crackling out and wiping out the signal i checked the tubes and one of them was making violent purple flashes before the signal burnt out. I then noticed that one of my fuses blew out as well. I changed out the fuse and checked again and the tube was still doing the same thing so i just swapped the tubes back for atock. Id like to see a real set of jjs, im sure one of them was a dud.", "id": 687}, {"review": "Its a very nice way to ensure all your pedals are powered properly. And ive noticed it helps cut down on excessive noise generated by pedals with when cheaper power sources are in use. I wish the power cable for the supply was longer but its nothing an extension cable cant fix. Weird thing was that the switches for voltage options were installed upside down. I lt didnt bother me really but if you get the same situation and you cant stand it, im sure you coukd just open it up and flip the little switch box around.", "id": 713}]