[{"review": "The only reason I'm not giving this one star is that I didn't expect much for such a low cost pedal. I got this for one of my guitar players so he could use it to switch between clean tones and distortion at our rental practice space before he gets the money to buy a halfstack and decent sounding pedals. We have a punk ska band (think suicide machines, sublime) and need to switch a lot in all our songs. I thought this pedal would get us by someway in the meanwhile. NOPE. This pedal sucks your guitar's tone, and you have to turn the knobs all the way to get anything going, and its not a pleasant sound either way. AVOID.", "id": 280}, {"review": "The main reason I bought this tuner and not similar offerings from boss or tc electronics, is because I had read prior to making the purchase that this is the most accurate at low tunings, and me being a bass player and sometimes playing drop A that is a must. I have to say that after owning it for a while I must agree. I've used other tuners when I happened to not bring this one along and  thats been my experience. Also its easy to read which note you're on when you're on a dimly lit stage.", "id": 504}, {"review": "Bought this for a friend. Cheap plastic enclosure. Affects noticeably your guitars tone and is not exactly a useable delay. He tried to use it for his cleans for our punk ska band but there was no messing with the controls to get a suitable delay. Stay away from this one and get a better used pedal.", "id": 716}, {"review": "What else can be said that isn't implied in the title of this review? Not a single second wasted in this performance and this bundle is perfect for those of us who don't want to purchase the items separately. My only issue was how long this took to come out considering the show was 5 years ago. That and the fact they didn't play more songs but who can blame them, their catalog is  almost endless (one of the few bands who matched quantity with quality).", "id": 855}, {"review": "I got these for a custom les paul 5 string bass I had built and one of the locks broke off after a month and a couple of uses. Also the locks were quite uncomfortable to use. I had never used strap locks before and don't think I will again.", "id": 277}, {"review": "Like my title says, this gets the job done, and is well built. Don't waste your money spending on premium brands like monster cable and get this instead. I challenge anyone to a blind test who can say they can tell a difference.", "id": 554}]