[{"review": "Finally decided in getting the 1.00mm picks because I don't like them too thin or too thick, this was the perfect gauge I was looking and hoping for. The logo will wear out in a few uses but I don't much about that. Been using it on a daily basis to practice and so far it's not wearing out too fast. Recommended!", "id": 61}, {"review": "I hope there had been a closer picture of the product.I was a little surprised when I got it because it doesn't look as great as I imagined.The white lightning is stamped on the black strap, the same goes for the GIBSON name on the end of it.Maybe it will get better looking in the long run.", "id": 79}, {"review": "been using these cables for three months now. I use them with aZoom G1N Guitar Multi Effects Pedaland they sound great. decided to get this one over the cheaper ones because after doing a little online research I found out that these are suppuosed to take abuse and hold their own better over time. they have a good lenght, of course this being taken in consideration what type of venues you'll be playing. so far I've only used them in rehearsal studios but will be using them live for the first time in a couple of halloween gig I've got coming up the end of the month.", "id": 195}, {"review": "This straplock set doesn't come with any instructions, that's because it's so easy you don't need them! Took the original screws off my Fender Strat, set the button, screws and felt washer together and quickly screwed it in. Afterwards screwed the lock into myGibson Lightning Bolt Style 2 Inch Safety Guitar Strap, Jet Blackwithout any problem whatsoever and it was ready!It is a quite simple mechanism but it shows that the button and lock won't come loose by accident by any chance. Still haven't given it a real gig test but by hanging it for a couple minutes I can tell I made the right purchase. Way recommended!", "id": 607}, {"review": "After lots of researching I finally decided to buy this Zoom pedal, so far it has worked great, has all the features mentioned, lots of great options, also a great guitar tuner. For those doubting, you actually can just plug your headphones in the output jack and practice without an amp, which was an amazing bonus for me since I've yet to buy my amp. 5 starts, totally recommend it for a begginers guitar effects pedal!", "id": 631}]