[{"review": "I deal with quite a bit of electronic musical instrument gear from guitars, basses, amps, FX, MIDI gear, etc.  Over time most of it starts suffering from scratchy / noisy pots (knobs), input and output jacks that are crackly, etc.In the past I've tried some Locktite electronics cleaner, which is provided in a similar can. It would rarely work.In contrast this has cleaned every piece of gear I've used it on saving me from having to physically replace the pots and jacks. It's really like magic in a can.", "id": 14}, {"review": "Rugged, robust, flexible. Couldn't ask for more in a momentary switch. Like all Boss products it will probably last longer than me.", "id": 52}, {"review": "I needed a solid throne to replace my IKEA computer stool I've been saddled with for the past year. The stool is heavy, easy to assemble, and works as it should. I don't have any long term usage to report but I've seen reviews complaining the stool eventually loosens and will rotate which would be annoying if true. But at this fairly low price point you can't complain about much, and it's better than the real cheap thrones.", "id": 139}, {"review": "Very nice metronome with just enough features. In particular I love the name based tempos displayed on the face, many metronomes do not have that feature.  Sits on a standard music stand fine without falling off.", "id": 390}, {"review": "I tried with with my Macbook Pro with both Mountain Lion and Mavericks. Also with my Win7 x64 machine. I tried it with a variety of MIDI capable gear including trying to update firmware on FX hardware, sending and receiving MIDI PC and MIDI CC, as well as transmitting MIDI Clock in and out. I simply couldn't get this to work most of the time. Active Sense used on most Roland products seems to kill it completely.In contrast I purchased the -MU's Xmidi 1x1 Tab and it works flawlessly and without issue every time I use it.I should have totally returned this product. Instead it's in a landfill.", "id": 565}, {"review": "I'm a 4 string rock bass player that has purchased a LOT of overdrive and fuzz pedals. Most of the overdrive pedals work very poorly on bass. They typically lose the low end or otherwise suck the punch and power out of the tone, are too fizzy and clanky in the top end, don't provide enough dynamics, or don't provide enough gain variation and are really more fuzz than overdrive.This incredible inexpensive box really nails it. You get everything from barely there overdrive to serious overdrive approaching fuzz, all with a great bass tone, with lots of your original dynamics without requiring a clean blend, and a usable tone knob to tweak to your liking.The downside is you have to live with yourself knowing that Joyo blatantly copies other designers circuits. The whole wheat side of me dislikes knowing this is an OCD ripoff. The frosted side of me loves that I saved a LOT of money buying this ripoff.", "id": 795}]