[{"review": "Nice windscreen protects my MXL mic and prevents pops. Only thing is that the gooseneck is only marginally able to hold the screen in position and requires careful positioning of the clamp to avoid sagging.", "id": 0}, {"review": "Nice looking gooseneck, threads are clean, fits well.  However, the gooseneck is too flexible and will not hold up a mic (Shure SM58) without collapsing.  Better try another brand, or spend a buck or two more to get a better product.", "id": 176}, {"review": "I bought this to &#34;daisy-chain&#34; two small Kustom powered PA cabinets.  Virtually all of the XLR cables available were way too long for my application. This cable filled the bill perfectly.", "id": 554}, {"review": "Very simple device to connect a quality dynamic microphone (or instrument using a direct box) to the USB input of a computer. I plugged in my mic and plugged the cable into my PC. Win 7 automatically searched for and found the drivers in about three minutes. I then recorded some vocals using Audacity, a free open source download. Recording was whisper quiet with no background hiss or noise at all. Recording level was great, not sure why some reviewers said it was too low. Note that this will not provide phantom power, nor does the item description imply that it will. USB only provides 5VDC and phantom power usually requires 18-48VDC. Unless there is some kind of power converter (which would be much too large to fit in this compact package) it is impossible for this or any similar sized cable to provide the higher voltage that phantom power requires. Use this with a dynamic mic or direct box and if you use it correctly you will be very happy!", "id": 768}, {"review": "Very nice classical guitar strap. I have used this style of strap for over forty years with traditional style classicals that do not have strap buttons.  Don't expect it to work like a strap on a standard acoustic or electric guitar. This is designed to only hold the guitar in position while you are playing it. It will not hold the guitar if your hands are not on it. This is the way this type of strap is made to work, and is certainly not a design flaw as some reviewers have suggested. Holds my Cordoba in position perfectly.", "id": 824}]