[{"review": "Behringer products have a kind of shoddy reputation and I was skeptical about paying even [...] bucks for an 8-input mixer. My intention for this product was simple yet unorthodox: I wanted to use it for recording a drum set. I wanted to do it through my M-Audio ProFire 610. I had 4 mics, 4 stands and a 5 piece drum set. I love my ProFire610 it is reliable and the preamp is clean and strong. I have no gripe with it it's just that the preamp only works on two of the 6 inputs, so I figure if I get a mixer I can use ITS preamped channels and run them through the 1/4\" inputs on my interface. Well, it worked. It worked GREAT. Not only did it sound great but I was able to have more control over the sound of each individual mic. Low noise, great sound and I still had 4 1/4\" inputs on my mixer to play around with.  With my drum set experiment over I now had an 8 input mixer at my disposal. Add two monitors and you've got yourself a nice little PA. There are no BUS outputs so if you're serious about getting a descent mixer I wouldn't bother, but as a starter mixer for the price offered, I couldn't be happier. It works fantastic for small gigs or (God forbid) house parties.It may not be the prettiest looking mixer but its a very simple, self explanatory and effective mixer. I didn't need all the flash and the input/output jacks on the top is WAY better than running them out the back of the unit (I hate that!). The EQ setup for each channel is basic: Hi, Mid, Low, FX , Pan and Level. Having an FX send is awesome when using it live. I didn't think a tiny little mixer like this would accommodate that. (the thing is only 9\"x7\") It's also got a control room output with volume which you can use for more monitors if need be ;) The Xenyx 802 is a great buy. Had I known I would like it this much I would have paid the extra $[...] and gotten the 12 channel one.", "id": 368}, {"review": "When you get it, it looks so simple, so basic that you can't believe that it doesn't come with the mic, but companies got to make their money right? I use it with my Samson CL8 condenser and it is perfect. Works great for podcasting, vocals or anything else you want to record. The adjustment knob is a little tight but whatever, it does its job well.", "id": 393}, {"review": "Hey, it's a fun little toy, but I've seen this thing going in most places for an even $100 which is ridiculous. I was lucky enough to get it on Amazon for $80. Once you get over the novelty of it it will sit on top of your amp to collect dust.  I've made some cool effects and written a many a great riff with this but it's not one of those tools you'll use every song... unless you're so amazing you can make it work every song! Learning how to use it properly and finding the nuances of making it work is half the fun, but once you get it, and you're over it, you wonder why you wasted $100 on something that shouldn't have cost more than $50. It's essentially a 9V battery covered by plastic with a pretty blue light. This was one of those impulse buys that grabbed a hold of me when I had nothing better to use my money on.", "id": 401}, {"review": "My first wah was a Morley Steve Vai Bad Horsie. I loved it. It's a switchless pedal that I put through hell. I had it for 3 months before I had to send it back cause it broke. It's still an ok pedal but I wanted the ability to leave the pedal \"open\" to achieve a certain warm sound. That's when I went looking at the cry baby.At the local retailer they had several different kinds of cry babies set up. I put this one against the Hendrix, Classic, and 95-Q cry baby pedals and this basic one sounded by far the best. The only one that sounded better was the 535Q but at over $200 it was out of my price range. I paid $97+tax for my GCB-95 cry baby and it was worth every penny. I don't even touch my Morley anymore. It's cry baby all the way", "id": 41}, {"review": "It's a pop filter. In case one wasn't good enough, they double it up! Works great. No complaints whatsoever. No need for a fancy pansy $50 metal mesh screen. This works just as good.", "id": 533}]