[{"review": "The thing about picks or plectrums if you prefer is that they are really a matter of preference and once you pick one (no pun intended) you should try to stick to it and get used to it through practice.  I've used many different types of picks over the years and I've not found the ideal one for me until recently when I decided to use a SilverPick which is basically a standard triangle thin design but made of silver which I find fits my needs the best and so far it's just a case of getting used to it.  This particular Dunlop pick is as described being fat, stubby and sturdy with a nice grippable centre and if you are the kind of lead guitarist who uses a lot of pinch harmonics this pick will be good for you as the maximum grip and most comfortable holding position exposes very little of the pick face.  The hardness will make it good for fast playing but the thickness also makes it difficult to get a firm grip too and the very small size makes it easy to lose your grip if you hit the strings too hard.  This makes it unfit for bass players and for strumming although you could get used to this for lead guitar playing.  For me though, I'll keep this among my collection of picks for use but it's not my default or preferred choice for play.", "id": 66}, {"review": "I discovered this string lubricant many years ago and I concur with what most of the reviewers here have said about it although I wouldn't call it a string cleaner although you indirectly clean the strings if you use the cloth and like another reviewer stated you should also use the cloth to clean the undersides of your strings as well.  I unfortunately live in a very humid climate being only a little above the equator and so strings have a very short life here and so anything that can prolong their life is a real boon for a musician here.  I agree that the only downside is the inability to tell in advance that you are running low on lubricant until it actually turns dry but I guess given the price and the overall usefulness of this accessory, one cannot complain too much.  Now that mine has just run dry I'm going to delay a replacement purchase while I try out something new that I've just discovered called \"The Swipe\" which enables me to clean both the undersides and the topsides of my strings without chemicals.  If this works as well as advertised, I may still get Fast-Fret but for its lubricating properties which really helps make playing a lot more comfortable.Recommended!", "id": 72}, {"review": "As it is with most things in life, you get what you pay for and while this Hosa effects-connecting cable isn't the best quality cable that is out there e.g. Zaolla, Evidence etc it certainly does the job it's supposed to at a reasonable price.  Too few guitarists, and I was one of them for many years until recently, pay enough attention to the quality of their cables and hence spend too much time on the amps, the pick ups, strings etc.  I discovered way too late how important investing in high quality cables is to your sound but I guess better late than never.  However, if you are on a budget and you are looking for effects-connecting cables that do a job for a good price then these Hosa ones will do a good enough job.  For me, after much experimentation I have foundZaolla ZGTR-110 Guitar Cableto be the best for my sound and while they are not cheap they are certainly quality and worth the money for the improved sound they provide.These Hosa however are still good value for money and hence come recommended.", "id": 494}, {"review": "This is by far the best delay effects box I've ever used and it has so much potential that it'll take you hours to get through ever possible sound this baby offers.  It's also true bypass which is very useful for gigging musicians who want to keep their rack as noiseless as possible and their signal as strong as possible from beginning to end.  It is built like a tank and doesn't take up much space on your pedal board making this overall a very user-friendly pedal.  Wish all pedals were built this way.  Highly recommended!", "id": 742}, {"review": "I've seen and used many different types of capos over the years and they range from the very cumbersome and difficult to use to the easily breakable but I've never used one as convenient and as well constructed as this Kyser one.  It is by far the best I've ever seen and I've been using it for years now and it still works fine.  It makes moving the capo quickly a cinch and the gold doesn't corrode or tarnish making it look like new even after all these years.Very highly recommended!", "id": 25}, {"review": "I've been playing guitar for over twenty years now and I've tried just about every guitar string in existance and even these Elixir coated strings.  I've come to realise that the benefits for a slightly longer life barely makes sense given the much higher price you have to pay for it.  Eventually, all strings corrode and lose their lustre and if you are a professional playing gigs, you change your strings so often anyway that to pay much more for polycoating doesn't make any sense.  If you are the kind that occasionally takes out the axe then maybe this would make a difference but what I do is I get the least expensive ones and make sure I wipe down and clean them, even using products like string cleaners and Fast Fret to reduce finger squeak if necessary and my strings last for quite some time as well except at a much lower cost.Few people know this but only a few guitar stringmakers exist in the U.S. and many of them that are retailed are actually the same strings with different brand names.  Granted Elixir probably isn't one of these as they try to make hay with the time they have left on their patent of this polycoating technology but my thing is why pay so much more for strings when the benefit you get is really not so substantial as to justify the price?  I myself use generic Kyser stings for my classical and acoustic guitars and Memphis Electrics for my electric just because they are the cheapest I could find on the web and my sound has not been detrimentally affected in any way.  In fact, you are much more likely to improve upon your sound by using better amps and guitar cables than you are with strings; at least most people would be able to hear the difference.  Don't get me wrong these Elixir strings are not bad but you are much more likely to get a better sound by improving your technique (practice), getting better cables, pickups, amps, guitars etc than from just using these strings.  For better string life, just wipe down and clean the strings before and after use.  This discipline once a habit is good enough.Peace!", "id": 100}]