[{"review": "I love the Tortex .50mm picks (red).  I have one that's over 4 years old and still going strong!  Yes, the turtle and writing eventually get rubbed off, but they never leave black residue on the pick or the strings.  I use the red, yellow, and orange Tortex's exclusively for practice and performance (I'm a church worship leader).  My highest recommendation.", "id": 61}, {"review": "I have a black composite acoustic guitar and this little pickholder stays stuck right where the neck meets the body.  People watching me can't really see it, and it's right where I need it, full of picks, if I drop one.  Wonderful little invention.  Buy it, if you don't want to carry a mess of picks in your guitar case or pocket.", "id": 167}, {"review": "This is my second black suede leather strap I've bought from Levy's.  I love them.  The 2.5&#34; is wide and comfy.  The strap is soft.  I have had no issues with any residue or the straps falling apart.  They're high quality.  And they offer plenty of length adjustments, without any buckles or metal of any kind.", "id": 481}, {"review": "Yes!  I finally have a tuner that fits right on my guitar headstock!  It never needs to be removed!  It's accurate.  It's easy to use.  It's low-profile.  Highly recommended.", "id": 785}, {"review": "I love these string swings!  My guitars are now out of their cases and up for display.  I have 3 in my home:  2 for guitars and 1 for a ukulele...and I'm planning on buying 25 of them for my school ukulele program.  They look great up on the wall.", "id": 154}, {"review": "This is a great little tuner.  Used it for more than a year with no issues.  Fantastic for positioning it anywhere on the guitar.  It also has an excellent display for showing you how sharp or flat you are.  The only reason I didn't make this a five star rating is that I discovered the Planet Waves PW-CT-12 NS Mini Headstock Tuner.  If it was a choice between the 2, the Planet Waves wins, hands down.  But this is excellent for what it is:  an easy-to-clip-on tuner that can be used on any instrument.  I've even set it down on my elementary classroom autoharp and it tuned it to perfection.", "id": 706}]