[{"review": "The Hosa XLR cables are affordable and very heavily made.I have a large mixer and rack and cables everywhere.I decided to purchase shorter cables and the Hosa cables 5ft measurement worked perfectly.You really will not be disappointed with these.", "id": 5}, {"review": "For keeping your guitar picks where you can quickly grab them the Dunlop mic stand pick holder is EXTREMELY efficient and useful ESPECIALLY when performing live.Always great products and always dependable.I also own the guitar maintenance kits and the capo.Not one product has let me down yet.My capo is 8 years old.", "id": 70}, {"review": "Cleans your strings and makes your fingers go across the strings a little faster.This is a good long lasting product and a little goes a long way.It is VERY safe for guitar finishes.", "id": 72}, {"review": "Ernie Ball makes extremely durable products and has a very reputable name in the musician community.These strings are affordable and last a VERY long time on someones guitar during normal use.You will not be disappointed in this product.They sound VERY clean and bright and if you use a product like GHS Fast Fret after playing the strings last twice as long and stay clear and bright longer.They do have a coating that will wear a small amount and turn black under the strings if you fail to clean them properly.", "id": 237}, {"review": "These tuning machines are great.They are a little heavier than the stock tuners on my guitars but they help keep your guitar in tune as intended.I needed the tuners replaced on an Applause (Ovation copy) guitar (the bushings fell out of one of the tuners and it became really floppy and refused to stay in tune)and a Washburn guitar. They fit on my Washburn and my Applause perfectly with zero need to ream or drill.The tuner hole size is .391 or 25/64 and of course if your hole size is smaller you must either use a drill or tuner reamer (yes a tuner reamer is a real tool just look at a place like Stewart MacDonald). You may be required to pre-drill for the screws that go through the back of the tuner.It is only one hole and very small.The vendor was quick in sending these tuners but there was no way to trace the package and it became difficult to receive it due to the fact it had to be signed for.The run around at the post office of getting it re-sent was ridiculous.The vendor should try to provide a tracking number so customers can avoid all of the back and forth and have an estimate as to when the package will arrive.", "id": 270}, {"review": "This is a good working dependable power adapter and works flawlessly with my tc electronic guitar ditto looper.No complaints with this.", "id": 521}, {"review": "This pedal sort of let me down a bit.I really cannot find a musical sounding adjustment,I can hear a small amount of octave when I adjust it but it is mostly a fuzz pedal with a mid range cut switch.If this was more of an octave pedal I would have been entirely more into the way it sounds.I kept it because to be honest it is very cheap.Why bother sending it back? It is a very good paper weight and I have even used it as a hammer and pounded nails in with it.Lets face it,If someone breaks into my house I can whack them on the head with it and knock them out.I just cannot get any octave sounds idk am I missing something? Joyo I like your other pedal but this one makes me want to punch your entire company in the mouth.", "id": 836}, {"review": "I can become VERY creative with this pedal and do a good many things in a great many settings.I have other musicians online who jam with me and I can really do more than a handful of things in showing them where I am going with a song.So many things I have developed.Great tool and good quality product.", "id": 869}, {"review": "Everything from the string cleaner to the polish works very well.You have to be very careful with the fretboard cleaner because it will dry out the fretboard but the conditioner is included and can be applied after.The string cleaner does not really leave much residue and really does help with string noise.You wont be let down.Dunlop makes good quality products.", "id": 95}, {"review": "Very good reliable product to help keep track of your guitar picks.Only thing I can see negative about it is that you cannot fit very many picks inside of it.It does help to have a few stowed away for when you need them.I was not satisfied with the extent of time it took them to ship this product to me.It seemed to take forever although it has nothing to do with the product and only the vendor I ordered the product from.Dunlop has always created some very top quality products for guitar players.They have a great reputation and they uphold a high level of quality no matter what the product usually.This product AS ADVERTISED DID NOT come with any picks.If you order this and need picks MAKE SURE YOU ORDER PICKS SEPARATELY.", "id": 233}]