[{"review": "This is an original Gibson Gear replacement part. Don't change your knobs or any kind of part in your Gibson (Les Paul, SG or any other) if not for the real deal. I have a Les Paul and I definetely intend to maintain its value in the long term by using original parts. Besides, they look great and will perform their job for many, many years!", "id": 80}, {"review": "This is a very good pickholder by Dunlop and looks much nicer than the regular Dunlop 5000 or 5005 - It does what it should and looks more esthetical than the Dunlop 5000 or 5005 versions. It does not hold more picks than its predecessors 5000 and 5005. It actually holds a couple of picks less. It holds some 4 or maybe 5 picks while the 5005 holds around 7 (if you use 0.60. gauge picks or lower). I did the test just for the heck of it with several picks. Since I use the Planet Waves Chrome Dome stainless steel picks (Joe Satriani), I only need to keep a couple on the holder plus the one I am playing with, so for me it does the job perfectly. I have a nice 2013 Paul Reed Smith Custom 24 with a beautiful and very stylish carved maple top, so I needed the pickholder to look better to better match to it. The adhesive works perfect and will not damage your guitar's top if placed as instructed. Place it gently, no need to press it too hard. Alean the surface very well before placing but do not use carnauba or any polishing material or gel before installing - Just regular guitar top cleaner (I use the PRS cleaner for example). Cheers!", "id": 167}, {"review": "This is a great effect. Awesome engineering as Jim Dunlop's MXR products has always presented. The true bypass feature and the high-end quality materials make it very reliable and dependable. Phasing is very sensitive and delivers as it should. No need for the EVH red logo version (unless you're a super fan or something) - I actually believe this unit will exceed all your expectations. Ships fast. Highly recommended.", "id": 177}, {"review": "This is a great effect. Awesome engineering as Jim Dunlop's MXR products has always presented. The true bypass feature and the high-end quality materials make it very reliable and dependable. EQ is very sensitive and delivers as it should. I actually believe this will exceed all your expectations. Ships fast. Highly recommended.", "id": 182}, {"review": "This is a great effect. Awesome engineering as Jim Dunlop's MXR products has always presented. The true bypass feature and the high-end quality materials make it very reliable and dependable. This CAE boost pedal is very sensitive and delivers as it should. I actually believe this will exceed all your expectations. You will not be dissappointed at all. Ships fast. Highly recommended.", "id": 372}, {"review": "Best straplocks I have ever had! In almost 30 years of guitar playing, I have tried many straplocks: cheap, expensive, nickel, steel, gold... youn name it, I have tried it. These are the best, topping any other by far. More secure than all competitors, never wear out at all, locking system never fails and these always maintain their fantastic looks and for a very long time. I have them in Chrome in every guitar I own. Highly recommended. Cheers!", "id": 386}, {"review": "I have 2 of these combo packs and they are simply great! I have 15 pedals connected to these 2 Visual Sound 1 Spot units on my Pedaltrain Pro, and have all the wiring underneath. Looks pretty neat along with the George L's cables that are almost invisible. The 1 Spot works wonderfully and generates no noise, hiss or buzz. Connects and powers great. No need for something fancy to effectively power up to 8 of 9V pedals with one combo pack. The adaptors work great with other than the regular AC connections like those found on MXR or Boss pedals. Highly recommended.", "id": 428}, {"review": "This is simply one of the best pedal boards out there. It is very well made, resistant, tough and very flexible as you can adapt a wide variety of power suplies and keep your pedals in great shape. Looks good too. I would recommend to get a few roles of power-grip pedalboard velcro as it definetely holds your pedals much better than the 'industrial' velcro included, especially if you have a combination of both regular size (MXR or Boss) and bigger pedals like a Cry Baby or a VOX Satchurator or Time-Machine Reverb. If thinking of purchasing one of these, you would probably have a few thousand dollares invested in pedals, so this would be great for you to keep them protected and organized. Now, if you are on the road for long, I would suggest to get the hard case instead of the soft case. For eventual gigging the soft case is more than ok.", "id": 489}, {"review": "This is a great effect. I am very happy with it. Awesome engineering as Jim Dunlop's MXR products has always presented. The true bypass feature and the high-end quality materials make it very reliable and dependable. This delay device is (on my humble opinion) probably the best delay out there. It is very sensitive and delivers as it should, with a delay rate from 0 to 600 miliseconds. Most units offer a max of around the 400 mark and are normally quite large in size and take a lot of space on the pedal boards. This pedal is just another little pedal on your board that will deliver. I am actually sure this will exceed all your expectations. Ships fast. Highly recommended.", "id": 507}, {"review": "This is a very useful and quite educational musician's piece. I especially like the way it is presented and how easy it is to use. It easily helps remember all possible scales and shows many tricks for your musical compositions. Highly recommended. Cheers!", "id": 531}, {"review": "This is a very useful little device. I use this cleaner on my strings after any use of my guitar. It removes anything on the strings and dries them immediately. This will increase the life of your strings. Don't expect miracles, but this helps quite a bit. I have bought this for me and several guitar-playing friends that have found this much useful. Highly recommended. Cheers!", "id": 543}, {"review": "This is just another cable out there - There is nothing special in particular about it. It does what it should. Cheers!", "id": 663}, {"review": "I have tried many picks in my 25+ years of guitar playing and this one is by far the best. I have been using Dunlop for the most recent years, but these are the best. The Carbon Fiber of these Dunlop Jazz III make them as long lasting as you want - when playing rock (slides and picking) they are better than any other material, and still very comfortable for softer rythms and styles like blues or jazz. Their grip is excellent and they feel awesome. Gotta try them! Highly recommended. Cheers!", "id": 686}, {"review": "This is simply one of the best velcro tapes out there. It is very well made and resistant to hold every pedal imagined. I would recommend to get a few roles of power-grip pedalboard velcro as it definetely holds your pedals much better than the 'industrial' velcros included in most pedal boards and a one-meter roll (around 3 feet) wont last long, especially if you have a combination of both regular size (MXR or Boss) and bigger pedals like a Cry Baby Wah or a VOX Satchurator or Time-Machine Reverb or similar. You probably have a few thousand dollars invested in great pedals, even rare ones, so this would be great for you to keep them well-attached to your board and properly organized. Maybe the tape could be made a bit wider, perhaps 1/2 an inch more would be great. It would actually increase a bit the sticking surface. Still a great product/concept. A must buy!", "id": 765}, {"review": "This is a great effect! Awesome engineering as Jim Dunlop's MXR products have always presented. The true bypass feature and the high-end quality materials make it very reliable and dependable. This Analog Chorus pedal is very sensitive and delivers as it should. It's great to add low and high end cut to make it even more versatile. It is also very small and will not take a lot of space in your board. I actually believe this pedal will exceed all your expectations. You will not be dissappointed at all. Ships fast. Highly recommended.", "id": 767}, {"review": "This is another great product by D'Addario - I have used several tuners like the regular Snark (several versions), the Snark S1 Mini Clip (also known as 'Son of a Snark'), the Planet Waves Headstock Tuner, the Peterson SC-1 Strobo Tuner, the Korg HTB-1 and the Q7 Chromatic Headstock Tuner. This D'Addario Micro NS Tuner tops all those with ease. It is super easy to use and more precise than all the others (compared using several tuning computer softwares and the Korg Pitchblack floor pedal on my tests). The rotation feature is great and the visual metronome feature comes very handy, like when programming a delay pedal with more precision. The clip that holds the tuner to the guitar is very good, holds very well to your guitar headstock (doesn't matther the brand) and with stay snug there without damaging your guitar's finish. It is very light and you will hardly know it's there once playing - Highly recommended. Cheers!", "id": 785}, {"review": "This is a great effect. Awesome engineering as Jim Dunlop's MXR products has always presented. The true bypass feature and the high-end quality materials make it very reliable and dependable. This is very sensitive boost pedal that will deliver as it should. I actually believe this will exceed all your expectations. Ships fast. Highly recommended.", "id": 262}, {"review": "This is a very well-built stand. Looks good too. It does its job well and you can definitely be sure that it will last quite long. Highly recommended. Cheers!", "id": 519}, {"review": "Earnie Ball's guitar strap locks are great. in my opinion, the best there way over other brands like Dunlop, Schaller and many others. I have them installed on my Les Paul Axcess and my Jackson Dinky and they are very secure both when rehearsing and gigging. You can definetely trust them to do their job. They also look great. Highly recommended.", "id": 523}]