[{"review": "This case it built really well, it has really nice plush interior... storage area for picks-strings-tuning fork-etc in the neck, it DOES have a lock on one of the latches. The case actually kind of stuck the first few days after i got; so much so that i thought it was locked with the key inside when i first got it. Turns out thats actually impossible to do with this case unless you have an extra key... so dont worry. Just dont be an idiot like me and give it a good tug when you get it.Above all it fits my Epi LP perfectly... as it should! hehe.", "id": 50}, {"review": "This guitar stand does NOT find hidden treasure. It does NOT hypnotize beautiful women. It does NOT fix your transmission. It does NOT tell your boss to give you a raise.It just holds onto your guitar when you don't see any reason to put into a case. It's sturdy, reliable and to the point. No gimmicks, nothing flashy. Just a guitar stand that is reasonably priced. If you need one, might as well be this one.", "id": 310}, {"review": "It's a cool pedal, especially considering it's price, but don't be fooled. All this pedal does is perform volume swells. Any other sound you are able to create with this pedal, you wouldn't JUST be using this pedal. Think of it as a supplumentary effect. If you want to really get cool sounds with this pedal, you need to use it in combination with other effects; Reverse delay, wah, distortion, etc.It's convenient too, if you are playing and you want use volume swells, but you also want to use other effects like wah, whammy, something else that requires the attention of your feet. If you get the settings right you can just click this effect on and it will take care of the swells. I would say thats probably the best part about the pedal and the biggest reason to get it. Pure convenience.It has it's quirks though, If you set the sensitivity all the way at minimum it drastically cuts down your sustain. To the point where its non-existent. But the purpose of having the dial set like that is so that you can play loud and fast and still have the effect behave properly. If sensitivity is increased to say halfway and you try to play loud and fast, the volume effect will only occur on the first note struck... the rest will just play as if the effect was off.Other than that, its built well, doesnt add any hiss. no noticeable signal loss, other than if the sensitivity is at min. The battery compartment is a pain to get to thats for sure. power adapters are your friend.It's cheap, its convenient. But i wouldn't recommend it for someone who is more into metal or fast and loud styles of play because that pretty much renders this pedal useless... especially since that style usually results in moments where you want to hit and sustain a note in the middle of playing hard and fast... that type of thing will make this pedal a useless hunk of plastic and circuitry. Oh that reminds me, the casing is plastic...:-/", "id": 449}, {"review": "I bought these as a solution to obtain feedback while recording my guitar through my computer. That solution was successful. These speakers put out enough power that I can maintain the clarity of my guitar tone fairly well and achieve feedback almost as easily as i do with my amp. I have a 75Watt amp that powers a 12\" celestion speaker. These monitors have 70Watts powering a 5\" Woofer and a 1\" Tweeter, 40W/30W respectively. Slight drop in the power output, but they are beefy enough that I don't really notice.The isolation pads they come with are paper thin, almost pointless. If you really need some, get some more substantial pads. The back panels do get kind of hot after a few hours... not really concerned about that, but it's worth mentioning.They have great sound, excellent low end, lots of clarity throughout. They are pricey, but if you are priced pretty reasonably here on amazon. I would really recommend not going to a retailer... even when they are on sale they are more expensive in store than online. Only go to a store just to hear them and compare them with other monitors.", "id": 502}, {"review": "I literally just took this pedal out of the box an hour and a half ago and it has already blown me away. I've only begun to scratch the surface of what this pedal can do, and i've made funky/weird loops of sound, bizarre cricket noises, long delays that instead of fading out actually get LOUDER with time. I dont know how else to say it, If you are looking for a delay pedal, you just found it. This thing can do anything.It feels like the iPhone of delay pedals to me so far... like it can do all this crazy cool stuff... but oh yeah, it can also just do an echo too. (Wait, you can call people with an iPhone?)I could have waited a week or so to really learn everything this pedal can do and write a detailed review of it's performance, but i dont feel i have to. It's the latest BOSS delay pedal... what else is there to say?Also with the price range of 130-160 dollars its a huge bargin compared to other BOSS pedals that might pull off a similar effect such as the RC-2($180-200), or RC-20XL($240-300). Granted i know very little about the FULL capabilities of those pedals, but the DD-7 has up to 40 seconds worth of loop play in \"Hold\" mode. And the hold mode is so much more sophisticated that what I am familiar with... since previous to this pedal i have only tampered with the DD-3.Sorry if I'm rambling, but seriously I'm in love with this pedal. Perhaps i will post a video demo of some of the weird junk you can do with it at some point.", "id": 511}]