[{"review": "Sweet chorus, I have the CE5, the CE20, a CE3 and this one. This chorus is my favorite, it sounds just right, the analog CE3 is awesome but too weak, Boss should include a level knob instead of a stereo control, anyway this one is a keeper!", "id": 33}, {"review": "The Boss CS3 is right for me, I have been using it with excellent results, I have many compressors, Line6, MXR, Behringer, Digitech, and although I alternate their use the Boss stands out on many rig configurations, it can feel a little bit overcompressed sometimes but in general a very good product, I highly recommended it as your main compressor, if you dont like it probably you dont know how to configure it, good luck.", "id": 34}, {"review": "This pedal is OK, it has all you need in a reverb, the controls are simple and the sound is good, there are other much more expensive units, but this pedal can be compared to those expensive units, the sound is digital clear and the features are basic, it is worth to have one to have fun with, I recommend this product, DigiTech quality is top of the line so you dont have to worry about it, in general a very good unit.", "id": 185}, {"review": "Good and transparent compressor with low noise operation, very tough construction, although not the best it sounds good to me, it depends on the situation, the sustain is good.", "id": 186}, {"review": "This selector is very basic but does the job, if you need an A/B box for simple set ups give this one a try, it works for me and I dont see anything wrong with it, is simple, affordable and functional, what else can you ask for?", "id": 375}, {"review": "This pedal works well in my rig, I have two Boss EQ20's advanced EQ's and sometimes they are complicated due to the 10 bands they have, this little toy does the trick, and does it very well, I think that people who writes negative reviews don't know how to use it, it can require some time and experience but having much more expensive equipment to compare this pedal is a very good eq and for the price is unbeatable, highly recommended... or you can go for the overpriced $100+ Boss original unit, at the end is the same, maybe a little quieter but essentially the same if you know what you are doing.", "id": 380}, {"review": "Not bad at all, this unit tunes really well, same as the Boss original, the only difference is that this one takes like 1 sec to respond after the pedal is activated, the Boss is instantaneous, other than that both units behave exactly the same. Some criticize this brand for making cheap clones but the truth is that they are making musicians on a budget a great favor, for those of you who do not want to spend $100 on a tuner this one is just perfect; since I am a collector I have other brands to compare (Boss, Korg, Fender...) and it is the same thing, it is as accurate as the Boss , at least mine is, and is a good mute switch also, I am happy with mine....", "id": 443}]