[{"review": "Since I bought these little gadgets everybody playing guitar around want them.I use to misplace my picks all the time when playing and now I do not have to look around for them any longer as I know where to find them.  I like to use different gage picks therefore.  I have ordered more for Christmas stocking stuffers whicdh will be enjoyed by my friends.", "id": 29}, {"review": "I have purchased and used many various types of Guitar String Winders and I must admit that the Planet Waves Pro Winder is the very best I have used to date.  It is an all in one and there is no need to carry extra equipment to cut the strings....pull pegs..etc.  It is sturdy and should last  many moons and cut many strings before needing replacement.  Because of the affordable price on Amazon I will be buying some for my friends as Christmas Stocking Stuffers.  The Planet Waves Pro Winder is well worth the cost and I recommend it to anyone.  Also, with the string winder I also purchased accoustic guitar strings and requested regular shipping (free shipping) which promised that the items would be shipped within 5 to 7 days. The items were ordered on the Thursday and received on the Saturday....THREE SHORT DAYS...Treat yourself!  Thank you Amazon!", "id": 94}, {"review": "Lately I have been experimenting with various make of acoustic guitar strings.....to the less and also most expensive strings.  I find the Elixir excellent. My testing is ongoing and cannot give the Elixir a top rating yet. That may change along the way.However, I believe that guitar strings are a bit like food and wine.  What may appeal to my palate may not appeal to someone else's palate.  Therefore, strings that may sound good to my ear may not sound good to someone else's ear.My ears remain attentive to future string sounds.  I also love the d'Addario make.  Which I purchase through Amazon...always.", "id": 103}, {"review": "This is a needed tool when changing strings on guitars especially if you change your stringws often as I do.  I've tried other types including those that I made myself but I much prefer this one.  I find it ight and solid and cradels well the nect of any of my guitars...from Fender, Takamine, Ovations...etc. For the cost it is worth it and can easily take it with you in your guitar case when travelling. Highly recommended.", "id": 163}, {"review": "....to have when used outside where there is a lot of wind noise.  I sometimes play in a park or outside around the BBQ.  A must have.", "id": 178}, {"review": "Always buy D'Addario strings for my 7 guitars.  Those strings stay tuned longer and will last me a little longer than others I have tried and believe me when I say that I tried many other types.  They have a great rating from other musicians. ....and the price is very affordable.  Highly recommended by this writer.  It is difficult to discuss taste in guitar strings....it is a bit like discussing our likes in food, musicians, movies....etc.  We all have our likes and dislikes.....For my taste D'Addario EJ16-3D is usually the strings I drift back to whenever I buy strings.  I like their full sound and their lasting tones.", "id": 198}, {"review": "I always love to D'Addario strings on my 6 string guitars so I decided to order these for my new 12 string Ovation 245.  They sound great.  Of course guitar strings can be a personal preference.  Over the years I have been experimenting with various makes and  I always seem to return to these.  This does not mean I will not try others.  I surely will continue to experiment.  I am one to change the strings on my guitars on a very regular basis.  I spend my Summer in Canada and Winters in Florida and I can assure you that the climate is much drier in Canada than Florida.  Strings on my guitars left behind in Florida for the Summer will deteriorate quickly even if they are in a humidity controlled environment.  I  find the D'Addario strings will stay in better condition than others.", "id": 274}, {"review": "I am totally satisfied with the stand.  I had some misgivings after reading some negative reviews on Amazon but this stand serves me well.  The misgivings I had was with the extra weight I intended to place on it with my tablet stand equipment and the Samsung tablet.  However, I am very happy to report that it handles the extra weight very well and does topple over even when the boom is extended with the mic and space needed for the tablet and guitar playing.  I easily reommend this Item.", "id": 279}, {"review": "I love my Levy's Jacquard Straps.  They are colourful.  I have purchase 2 to see how they were.  This one to match with my black Ovation 1861- Balladeer and another to match with my Ovation Maple top CC44.  I now have another one for my new Ovation 12 String CC245 just ordered this week from Amazon.The straps were chosen to match with the guitar colours and my wife thinks that they are awesome and will certainly be talked about by the ladies around when I play my guitars.They tightly fit around the guitar buttons and the shoulders.  I have no regrets with the purchases and I truly recommend those straps to anyone.", "id": 286}, {"review": "You cannnot go wrong with Elixir accoustic guitar strings.  Taste in strings is difficult to discuss as what appeals to one may not appeal to another.  However, you cannot go wrong with those strings.  I highly recommend them.  I like their mellow sound which will last longer than other strings I have tried.", "id": 295}, {"review": "This item was received well packed and on time.  Provides a great sound for my needs and would recommend it to all my friendks.", "id": 405}, {"review": "Would not hesitate to purchase this item.  I like the flexibility of this microphone cable.  An easy item to recommend for the price paid.", "id": 465}, {"review": "This chromatic clip-on tuner is the best of the best.  One cannot go without having one for the price.  I've tuned violins, guitars and ukelele's with it.  This is an electronic gadget you just cannot do without.  You can use the vibration setting to tune with a room full of people talking or playing other instruments.  If you have it on the MIC than you can tune many instruments all at once if you wish.This little instrument tuner does everything.  FOR THE COST ...YOU JUST CANNOT BE WITHOUT ONE.", "id": 707}, {"review": "This is a must have for musicians or even speech givers that may want to use a table for their music/speeches.  It is easily mounted on the Mic stand and can be adjusted to your needs. I would not do without it now as it easily replaced my cumbersome music sheet stand. I am using it with my Samsung tablet and can also be used with my wife's Toshiba tablet.  Highly recommended.", "id": 831}, {"review": "This is my 6th Kyser capo.  This one for my new Ovation 12 String CC245 is what I needed.  I always recommend all Kyser Capos.They last forever and do not lose the strong holds.", "id": 42}, {"review": "D'Addario guitar strings are favourite strings.  They last a little longer and always sound good on my Ovation guitars and also or my other acoustic guitars.  I usually buy them for and recommend them to others also.  You can not go very wrong with these strings if you play often.  You will notice a longer life and your guitar will certainly remained tuned.", "id": 130}]