[{"review": "Could not get to fit small sound hole. Once in sound hole pickup did not work at all. Would not buy it.", "id": 129}, {"review": "Easy install and great price. Shopped these for awhile and had to get all my guitars off the floor, bed, corners of room etc Installed in two minutes. Holds neck lightly - easy up easy down. Padded so does not scratch finish on neck. Will buy again.", "id": 779}, {"review": "Small amazing good quality interface. This is not the PreSonus board but the controls are easy set up is quick and it is so portable. I especially like the dual inputs on front. Back light on knobs shows clipping on volume (green and red) and connected (green).USB powered and plug and play. My Ableton Suite detected and connected in seconds.", "id": 801}, {"review": "Good all around mike. If you are looking for a solid mike to start your studio, I recommend this one. Best used for guitar and mid range instrument recording but not bad on vocals. Best mike for the price and purpose.", "id": 19}, {"review": "Ok I understand it now - I use Abelton Live 8 and thought this would be and easy, read cheap, interface to record some instruments with. WRONG! I am returning it. It does not work, has no drivers and is not detected on my Mac (my Mac finds everything). Bought the Focusrite unit instead. Got it to work on garage band but latency was miserable and so was hiss on recordings. Save your money and time. Buy the Focusrite interface or one of the others. Yes over $100 but you either want feedback, hiss and frustration or you want a smooth interface connection with good resonance. It also lacks 1/4 plug, one rca input, you need an addapter. Not what I thought I was getting - dumb me.", "id": 384}, {"review": "Should have paid the extra $40 and bought the Mustang - oh well. The amp has light sound and not much control. Good for my small space though.", "id": 564}, {"review": "This little amp gives a warm and gritty sound. Arrived in days and free ship (heavy little bugger). Small footprint allows me to place in my studio and get that deep sound like a big tube amp. Use a Shure mike at 2 feet and the sound is amazing. Recommend this amp for a small space or miked in small venue. Really happy with sound.", "id": 618}]