[{"review": "Small size, easy to transport, and more than enough power to annoy a small venue with my lousy (but improving) guitar playing :-p", "id": 467}, {"review": "This is my second, after breaking the last one's neck! The plastic socket around the ball & socket joint couldn't take the stress in the gig bag... I'll keep this one by the music stand,", "id": 707}, {"review": "I thought to try this tuner after my gig bag decided to break my Snark SN-2's neck (fragile plastic socket of the ball & socket joint bent with stress). Functionally, I prefer the SN-2, which seems to do slightly more sample averaging while remaining responsive, displaying less &#34;bounciness.&#34; I also prefer the SN-2 display. However, there's *a lot* to be said about the small form factor, which I can leave on the headstock without risk of damage. Now I keep an NS on each of the mandolins that travel with me and I keep a Snark clipped to the music stand at home.", "id": 785}, {"review": "I purchased this model for home use--not for a kid's backpack. It's solid and sturdy, easily holding a song book open--not just a few pieces of sheet music. It adjusts tall enough for standing as well as low enough to sit next to my easy chair in the evening. I often clip on a digital recorder for practice and have no threat of the top flipping down. Works for me!", "id": 155}, {"review": "Recently acquired an Ovation mandolin, which itself is hardly &#34;standard&#34; in appearance, materials, etc., so I thought it would bea good opportunity to try a &#34;non-standard&#34; strap. I'm impressed! I'm thinking of picking up another for a more classical mandolin...", "id": 352}, {"review": "I was looking for picks comparable to the three that came with my Fender beginner's mandolin set, worried I'd permanently lend them out or otherwise lose them. Having a dozen similar--a few for me and a few to share--meets the need! He heavy feel and very rounded edges make for a very mellow sound and allow for a quiet practice, especially when compared to lighter weight and pointer guitar picks.", "id": 771}, {"review": "I purchased two Fender instruments, a mandolin and an acoustic guitar, each of which came with a Fender clamp-on tuner with similar functionality, but I thought to give the Snark a try. I haven't used the sound versus vibration mode much, nor have I done much with the metronome function much--I can't speak to them; however, I am very pleased with the vibration tuning. Compared to the Fender, both will get your strings tuned well; what I like better about the Snark is there is a almost no dwell from the last note stuck before the next note registers. With the Fender, I feel I have to wait a few seconds for the screen to clear before striking again, and that adds up when moving from string to string.  The Snark is bulkier in the soft gig bag; the trade-off is any easy-to-read display. Lately, it's become my go-to tuner.", "id": 818}]