[{"review": "These stands are just what I wanted for my studio. I like them so much, that I own five. I like the easy access to my guitars for recording sessions, and I like being able to look at them too. The multiple guitar stands are probably safer for the stage and more economical with space, but these stands are perfect for me as I don't gig much anymore. I'm very happy with the solid build. Good, solid guitar stand.", "id": 132}, {"review": "It's a very solidly made stand. Simple to assemble. Perfect for my home studio, holding my 88 key midi controller keyboard. I'm very happy with the purchase and the price was right.", "id": 272}, {"review": "These speakers worked great for 14 months. Last week (4/8/13), one of them wouldn't power up all the way. The problem is getting worse every time I try to use them, and it's just a matter of time before it stops working.  It seems there is a problem with the capacitors that I did read about in a few reviews. I took a chance on the monitors anyway, and it was a huge mistake. I only use them between 2 and 4 hours per week. I contacted M-Audio's online support system and was given addresses to two electronics repair shops. One on the East coast and one on be west coast. I've since found many complaints about this same issue all over the Internet and on the M-Audio support site. M-Audio doesn't stand behind their products, and I'll never purchase anything from them again.", "id": 502}, {"review": "I've tried so many other strings over the years just to see if I was missing something. I wasn't. There's something about the feel and tone of Ernie Ball Regular Slinkys that I absolutely love. My local music store has 3 for the price of 2 deal on strings, which is a nice deal; however, this deal is a little sweeter. If you can wait for the delivery, it's a no brainer.", "id": 812}, {"review": "I've been buying gear from Alto Music since 1980. I've trusted them with my guitars, and they've helped me make the right decisions for my needs and budget. Last year, I bought a set of Fender Custom Shop Texas Specials directly from Alto's web site. Over the past year, I received a bunch of Amazon gift certificates and wanted to get myself a Shure SM7b. When I saw that I could get the mic from Alto Music, it was a no brainer. I was purchasing from my local music store through Amazon. As for the mic, it's an SM7b, and it's everything I was looking for, despite it being a low output mic. It's smooth, has a sexy low end color, has no harshness, brittleness, or high frequency unpleasantness that can occur with some condensers. I'm recording in an untreated basement, and this mic is perfect for when I'm singing loud rock stuff; it only picks up what's right in front of it and none of the room. I'm using a Focusrite 2i2, which is great for loud singing, but I'm picking up a Cloudlifter for some more clean quiet gain to use this mic on acoustic guitars and softer vocals as well. For me the mic has been all it's cracked up to be.", "id": 136}]