[{"review": "It is a basic music stand, but it is sturdy enough to hold sheet music or books, does not wable and there is no play between the folding elements. You can expect to pay three times as much for a similar product at a local music store, great value", "id": 257}, {"review": "The U-30 is a decent starter's ukulele, no matter what color you get, but it is not without its flaws. The tuners feel cheap, but they are functional, much better than friction tuners on \"toy\" ukuleles. The body paint is of good quality and resists scratches with ease, but the paint on the fretboard comes off easily unto your fingers. The string action is low, making it perfect for fast strum patterns. Even for a soprano ukulele, this one has a higher pitched sound with little sustain, which is actually quite authentic for those desiring a more \"Hawaiian\" sound, but the tiny sound and low sustain make playing along with other instruments problematic, unless using a microphone. The worst aspect of this ukulele are the strings, it takes forever to stretch them or \"break them in.\" This means that you must tune your ukulele virtually after every song, so beginning ukulele players should remember to get a chromatic tuner. Chords that use the first fret, such as F and A sound distorted for some reason. Replacing the included strings with Aquila strings makes this ukulele much better, but the added cost puts it in the price range of what I would consider a true starter's ukulele, the Lanikai LU-11. The included gig bag is almost useless, it has absolutely no padding and is very tight. In conclusion, its low price and distinctive high pitch \"Hawaiian\" sound make up for its shortcomings. I would not recommend this as your only ukulele, or even a starter, since the problems with first fret chords will train your ear in a wrong way. I would recommend the U-30 as a backup or \"disposable\" ukulele that you can take anywhere, without fear of damaging or losing it, but for a little more money, you can get better.", "id": 589}, {"review": "The picks work well with bass, but they are just too thick to use with ukulele. The pics also shed easily, making your instrument dusty in no time.", "id": 695}, {"review": "What else can be said about Aquila? High priced Ukuleles have them standard for a reason, they are simply the best. Even if you have a very cheap ukulele, adding these strings can turn a toy uke into something that wont embarrass you. I use Aquila and Martin strings in my ukuleles, the Aquila for most performances, and the Martins for those songs that require a faster strum pattern or a more traditional &#34;Hawaiian&#34; sound, as the Aquilas are a tad heavier than Martin. Even if this if you only have one ukulele, and you won't for long, you can't go wrong with these strings.", "id": 698}, {"review": "There is almost no difference between this and the Snark SN-1, and by that I mean the design flaws. You have to constantly adjust the neck to get a reading, and they eat batteries like crazy. The Snark SN-8 is far superior.", "id": 763}, {"review": "For a Fender licensed product, the build seems a bit on the cheap side, the plastic is kinda dollar store quality, but this tuner tunes very well, comparable to more expensive Korgs or Snarks. The screen is bright, and while it does not change color, the dial is easy to read. Buy a couple and leave one in your guitar case and another one in your car, so you can always tune up for those unexpected performances.", "id": 799}, {"review": "Being very disappointing by the sensitivity of the Snark SN 1, I purchased this bargain priced tuner, I could not be more pleased. It has settings for chromatic, bass, guitar, and ukulele. Not only does it have tone dial indicator, but the screen changes color, red for flat, green for just right, yellow for sharp. The screen is also very bright and easy to read. It is very sensitive, no need to constantly move it around like with the Snark SN 1. It is tiny, perfect for carrying in your pocket or purse. I use mine for when I go to the music store and test out ukuleles. This makes a perfect main tuner, or a nice inexpensive backup to more expensive tuners. My main tuner is a Snark SN 8, but this one is just as accurate. The only negatives I can find is that the hinge seems kinda delicate, so you don't want to force it, and the power button is very tiny, but for the size and performance of the unit, those low points are almost irrelevant. Buy a couple, you can get two or three of these for the price of a single Snark or Korg.", "id": 846}, {"review": "This tuner really delivers, its inexpensive and accurate , much better than the SN1. Do not be fooled by the broader gradients on the SN 8, if you are in the green , you are in tune. SN 8 is also far more reliable, no notorious having to adjust the neck to get a reading as in the SN 1 and 2. I use mine with ukulele and guitars, and both get tuned accurately with it.", "id": 811}]