[{"review": "USB Condenser mics and more specifically this one are great for doing Podcasts and for portability. The reason being is that they are condensers for one, and the other is that this mic has a built in interface. An interface is a glorified sound card with both a microphone preamp and (Analogue to digital, and digital to analogue) AD/DA converters. Of course most any standalone interface is going to give you way more desirable results than just plugging a microphone into the mic jack on your computer; way, way better. So this MXL Studio 24 USB even with the built in interface is going to give you quality far exceeding your computers potential. So instead of having to carry a separate interface around with you having this all in one MXL Studio 24 USB all you need is a laptop with a USB input and you.There are limitations though with a USB mic with the main one being that you can only record the microphone without being able to plug in any instruments. (Although you could record instruments using this microphone and that way be able to layer more tracks in your DAW.) Recording multiple tracks at the same time is not possible with this mic unless you are recording the same thing in multiple tracks.The really good thing about this mic is that you are getting some pretty decent quality for the money. So for anything that you need to do using a microphone as your one and only sound device it is ideal, quick, easy, and affordable.One of the problems with using it in Pro Tools, or any DAW is that you can only use one interface at a time. Since the mic has a built in interface you can't use any other. Even in Garage Band for MAC, although they have the ability to use more than one interface because you can toggle between the two but not be able to use two simultaneously. So in plain words if you are planning studio capabilities a USB mic is not what you need. I have a couple of MXL condenser mics that I bought for my studio. I have the MXL V57M which was their early offering but is no longer made and I have found the MXL V250 to be comparable to that one. Some other MXL's like the 990 are muddy in the bottom end. When bottom fishing for a good/decent condenser mic some of the CAD offerings are also top sellers.When using the MXL 24 USB in Win 7 no driver download is necessary. If your mic comes without the included CD you can download the free MXL Studio Control app which includes input controls for microphone gain and an adjustable high pass filter. It also has a nose gate with adjustable threshold. There are also output adjustments as well.One other thing that is unique about USB mics working with your PC is that they are dependent of course on your PC. So I had the hardest time trying to figure out what was wrong when I couldn't get the output from my PC or into the free Reaper DAW recording software (free 60 day trial) also downloadable from MXL. So I finally gave up after trying various input options etc and discovered through the troubleshooter in Windows 7 accessible via Control panel, and then \"Sound\" and then type \"Troubleshooter\" into the search box in the upper right corner. The answer was that my mic input volume inside of Windows was down to zero. I moved the slider up and bang it worked.So for sound quality you are getting decent quality for the price and it has a built in interface and even an output jack you can plug your headphones into; it's a mini jack like you have on your computer. So with just your laptop and this mic you are set for pod-casting, or any other function that requires only one microphone and no other channels. This mic comes with a desktop stand which is an indication of its intended purpose as opposed to a studio vocal or instrument mic.", "id": 712}, {"review": "I have been playing guitar for longer than I care to admit. Back in 1966 I went into the music store with my Dad and cherry picked the finest Fender Telecaster in the whole store. Back then they were all handmade, so there were variations, and by spending some time, would yield you an incredible find. So I am not a newbie to playing, or working on guitars. I didn't use this capo on my 66 because I have it apart in order to make exact vintage reproductions of the body.Today's modern guitars use medium jumbo frets. My 66 had thin frets. With the medium jumbo frets they are sufficiently high, that if you check them once fretting a note with something as accurate as the Snark SN 2 All Instrument Clip on Chromatic Tuner you will see that the note moves up one or two bars on the tuner once you fret it. (That is one or two bar above the note you are then fretting) So I must admit my quest for the perfect capo would enable me to adjust it so that the guitar doesn't go out of tune when using a capo.I compared the G7 Performance Capo the Six String Silver, with the Schubb S1 Stainless Steel Guitar Capo for Steel String Guitars, and this Planet Waves NS-Tri-action capo. Although the G7 was substantially built and looked rather impressive, I found it to be too bulky, so it kept getting in the way while trying to play chords. So I sent it back. So now it comes down to the Shubb 1 Deluxe and the Planet Waves. I went back and forth with these two tuners a whole lot of times. I would perfectly tune the guitar with the Snark and then apply the capo. I tried to discern the difference between which one of these would make the guitar go out of tune more than the other. I finally concluded that there was no difference.The Schubb S1 had the ability to be adjusted so fine that it would barely be holding on to the neck. If you set that one at its gentlest setting you could get it to be almost perfectly in tune even with the capo on, but set it that softly, and it would just about fall off the guitar. So that is the last thing that you want to happen in the middle of a performance. The Planet Waves Capo in contrast, even at the lightest setting, was still a solid grip on the neck. I also noticed that the planet waves had a wider spread across the strings and therefore was less critical of the positioning in order to get it right.The Schubb S1 is a well-made product, it has nicely finished metal components, but with its roller ball system of fastening, when you loosen it, for sure you're going to occasionally be dropping it in on the floor. You could say that requires two hands in order to remove it. The Planet Wave on the other hand is a true one-handed tool that makes it easy to remove and to put back on. I tried both of these on one of my other Fender telecasters, as well as on one of my acoustics. I got the same tuning results on all of them. I am very critical and exact so when I say that the tuning results would change when you put on the capo you must understand, that the tuner was only moving one line. Most people wouldn't even bother with that much of an adjustment but I know that there is nothing to compare to a guitar with good strings on it, and to hear the tone and the blend of those strings in perfect tune; perfect harmony rules. You know that feeling when you come to the end of a great song, and you hit your last note and finish with a full chord that is perfectly in tune; there is nothing to compare to it.The planet wave is a little bit bulkier and if I had to get critical of it I would say it does get in the way a tiny bit more than the Schubb S1; although this factor is not such a great difference, as to preclude me choosing one over the other. The way each of them mount and dismount to the guitar does make me lean more strongly to the Planet Waves.I saw other reviews that commented that one type of capo provided a better tone than another type of capo. Tried as I might I could not reproduce the differences that they spoke of. There are so many factors affecting the tone, such as after changing the capo was a guitar body leaning a little bit more one way, then it was the last time. For example was the face of the guitar a little closer to the ear range as compared to the last capo you tested that might've been projecting more from the side of the guitar. I also felt that once the capo squeezes the string down the only thing that is creating tone is the fret line between it and the bridge. So at least between these two I found no total differences.I wanted to say that if you are using medium sized jumbo frets and high action you are really bending the string in order to fret it thereby changing the pitch. I love low action with no buzzing on lighter gauge strings. I'd rather dance across the top like a ballet dancer then scrub heavy gauge strings. To each his own they say. I just consider it important to let you know that I'm conducting this experiment with 8 gauge strings on the Tele electric and 9 gauge on the acoustic. So if you're running a much heavier gauge string with lower action, you would of course have less tuning shift going on, because you could adjust the capo (and both of these have a round adjusting knob for fine-tuning) and be able to adjust it to the point where you are pressing just beyond the level of the frets and not really squeezing it all the way down on the fret board and therefore have less of a challenge in trying to keep it in tune while using a capo. (Although I doubt many are setting it that way but rather squeezing it down to the fret board instead.) Although it is possible with heavy gauge strings that you can fine tune the pressure sufficiently that it will yield a tuned instrument while under the load of the heavier gauge strings creating a strong enough grip at this finer setting so it won't slide off of the guitar like the Shubb does at its lighter setting.Of course all this is predicated upon you not re-tuning the guitar when you change the capo position. That really is the only way to create a perfectly tuned instrument and that is to do a little tweaking when you change the capo position. I'm sure most people ignore that and consider the ever so slightly out of tune instrument is something that is not objectionable and doesn't impede the overall quality of their performance. I find on the other hand, that a guitar which is perfectly in tune takes the music to a level that is not possible no matter how little or much it is out of tune.So I conclusion I find the planet waves easier-to-use and with its longer arm capable of a wider fret board, while at the same time capable of the thinner fret boards as well, as being the one that I highly recommend. Notwithstanding the Shubb places a very close second, and with its slightly smaller size, it does in fact get in the way a little less than the Planet Waves. All in all they both are the best of all the ones I've tried.", "id": 843}, {"review": "Everything keeps improving, and getting better, faster, and cheaper, but at this price point their isn't one available that isn't a compromise in one way or another. First off if you are planning on buying the US-322 don't. Buy its bigger brother the US-366. Getting an optical connection and additional ins and outs for such a little bit more money, as well as 192k makes it a no-brainer. To get optical (on the 366 only) at this price is great, but the A/D D/A converters leave a bit to be desired. On the other hand the mic pres are pretty good, have distortion ratings, THD of only 0.0045% and with 24 Bit/192KHz recording make these the best sounding interfaces put out by Tascam to date.What I meant by a compromise is that even with interfaces that cost 3 to 5 times this price most of them have either good mic pres, and weak clocks, or vice versa, and some work with Windows but not so well with MAC and once again vice versa, etc. I researched interfaces for a long, long time, and considering non-crash reliability and a dozen other factors I finally sprung for anRME Fireface UFX USB 2.0 or Firewire High Performance audio interface 30 in, 30 out. Now that's an interface. I have been running it with Pro Tools 9 since 2011.Pro Tools 10- Professional audio recording and music creation softwareis out and Pro Tools 11 is now being released.So if you are looking for an inexpensive interface expect some compromises in one area or another. Rather than slam it out with performance specs under a microscope, I would rather provide a review helping those who are interested in setting up this Tascam US-322 or 366 so you can save a lot of time trying to figure it out. Sometimes a little help makes a huge difference in the amount of time saved. So what I did was load, and register the free and included Cubase LE6 complete with activation and eLicense registration and installation as well as installing the Tascam driver, and doing updates for both. I know a lot of the reviews here just downloaded a driver and used their existing DAW in order to test out the interface, and therefore they didn't need to spend much time with it. I don't blame them; the shortest distance between two points is a straight line. So get out a cup of coffee because installing this complete package doesn't happen in just one hour. So here goes...If you have Windows Vista you are probably out of luck because the system requirements list Windows XP, 7, and 8. I am sure the omission of Vista is not a mistake. I know myLogitech AudioHub Notebook Speakersare non-functional in my Vista laptop if you are running Windows Media Center in it as well. It works in Win 7 just fine. So I installed it in my desktop running Windows 7 64 bit and it gives you the option of installing in 32 or 64. In addition to Cubase LE 6 it also installed AI Elements 6 as well as Agent One Content, Groove Agent One, Vintage Beat Boxes, Steinberg Drum Loop Expansion 01 which took a good amount of time to load, as well as Steinberg Halion Sonic SE 64 bit for AI Elements. I then had to activate and register Cubase LE6 which involves installing the latest eLcc, creating a Steinberg account (which is free and they don't ask you for a credit card). They provide you with an activation code after you register.I have an iLok for Pro Tools which is a USB device that enables you to run the program. Cubase does not require that you have one, although they have an equivalent looking device, but fortunately they have a software based equivalent. They do this with an eLicense which you will then update to version 6.5.4.1122. There is an eLicense control setup and you have a Soft eLicenser number that you will use in order to generate the Activation Code generated at the Steinberg site. What came on my disc was version 6.05 which they instruct you to immediately do an update, which I did to version 6.07.So we install the Tascam interface next which comes on a separate DVD. Included with the interface is a 5 foot USB printer style cable. You will need to install the driver disc before connecting it to your computer. Windows 7 recognizes it but fails to automatically load a driver. So install the driver off of the disc first, and then do the update. It took at least 15 minutes to do that update. What flashed on the screen was 154 megabytes and then all you see is an install screen with a scrolling series of round objects moving. At first it says, \"This is going to take a long time\", and they were exactly right. It almost tempts you to think something is wrong, because nothing is happening other than the scrolling, and then finally after ten minutes or so a dialogue box comes up and says, \"Do you want to install?\" and you click continue, and then it comes up again in another minute, and this happens a few times, and then finally it changes over to an installation finished box. (I have Verizon FIOS and usually download huge amount of data in a flash). Then you reboot.Now this is important. Plug the US-322 directly into an available USB 2.0 port and not into a hub, even if it is a powered hub. It simply won't work. I tried it and the light wouldn't even come on indicating USB. When I went direct the interface lit up and it worked. The manuals also warn you not to use it with USB 1.1. The US-322 comes with a printed Quick Start Guide. There is also an owner's manual for both the Interface, and Cubase that are available either on the DVD, or by Googling the same and they come up as a PDF download. If you are new to setting up interfaces be prepared to do a good deal of reading. There is a driver to choose, input and output settings, as well as going into Windows Control Panel/Sound in order to choose the interface for playback, and recording. If you're new to these kinds of setups just take your time, and don't be dismayed if something doesn't work. All it takes is for one button to get pushed and Wahlah you have sound. For example in Cubase there is a monitoring button without it you won't get any sound from the headphones. If all else fails you can go to the Tascam web site by Googling Tascam US-322 and then click on the support tab, and they have a \"you pay for it\" phone call number in order to help you. Hope this helps.PS: The real killer deal right now is Avid Pro Tools 9 bundle with the MBox Mini which is another limited interface but you are getting Pro Tools 9. Plus purchases of this bundle made after 10/2011 that has pro tools 9 will be able to have a free upgrade to pro tools 10 if you register your product with Avid. Considering what Pro Tools goes for by itself, and what the MBox sells for individually, and the bundle even comes with the iLok you can sell it used for what you are paying for it, and even more than you are paying for it if you take advantage of the discounts I have seen pop up as much as 20% off the already low price. Then you have Pro Tools 9, and 10 full blown versions, none of this LE stuff, and an interface, and can grow from there. This Tascam interface works great with Pro Tools. These Pro Tools 9 bundles are discounted to make way for 11, and I am seeing music stores running out of them. They are clearing the shelves preparing for 11, but it has bugs. I rarely purchase totally new versions until they have time to season some, and get feedback from users. After some time, and more updates, I will be browsing the shelves for discounts on the upgrade to 11; maybe in another year. PT 9 is all I need.", "id": 874}, {"review": "I have been playing guitar for more years than I care to admit. Okay I bought a 1966 Telecaster brand new back then. Still have it and love it. I have a lot of different guitars, mostly electric, and 4 acoustics. On my electrics I love extra light 8 gauge strings. (Only about 5% of us do) I can fly on those and do things at a pace this is a lot more difficult with heavier gauge strings. Anyhow I digress, but for a reason. Light gauge strings are subject to tuning problems if you have big fat frets like the .050&#34; found on Gibons and ESP-LTD's. When you squeeze the string to fret it, with light gauge strings it is all too easy to squeeze it all the way to the fret board. With X-Large jumbo frets that can be quite a distance making the guitar go out of tune. The cure for that is using heavier gauge strings such as 10's or more so it makes it possible to determine quite easily just where the top of the fret is without doing the full squeeze all the way to the fret board. So most capo's work with 10's and on up because there is a lot more tension on the strings. So a lot of capos can create a comfortable fit fully fretting the strings without them going into the sharp note zone.So since I use lighter gauge strings, and even 9's are subject to the same limitation, I have had a hard time finding a capo that would sit comfortably at the top of the range between the fret and the board, and still squeeze the string sufficiently so as to not create any buzz and do so without making the string too sharp. Guess what? Now I found it. I have several capos and none of them make the grade for light gauge strings except this one. To be honest with you I was surprised when it worked.Okay so here is how I put it to the test. I used the Snark headstock tuner which is a great little tuner if you know the secret to using it. I also have the Peterson HD tuner bench model which is fodder for another post with its one tenth of one cent tuning accuracy. Okay back to the explanation.With the Snark you tune the open string until the line stays in the center without wavering off to one side. The only problem is that most any headstock tuner I have seen they aren't superbly accurate. (The Peterson headstock tuner I sent back because it was acting crazy. Anyhow...) So the secret to using the Snark which I like best out of the headstock tuners I have tried is to tune the open string first, and then fret the string on let's say the 5th fret. You will occasionally find that a string in the open position registers as being in tune, even though it may be a little sharp, or a little flat, so when you strum the whole chord you will get a desire to tune it, so your ears can hear it, in order to get it spot on. There is nothing more beautiful than a perfectly tuned guitar, and nothing worse than one that is well out of tune.So by tuning the open string, and then tuning the fretted string, once both are in tune it is right on. So in the open position if by chance it is a tiny bit sharp, not enough to register on the tuner, when you fret that string, for example on the 5th fret that naturally stretches the string a little bit, making it sharper, which will now show on the Snark as a note that is too sharp. Once you balance the open string, and the fretted string you really have a wonderfully tuned instrument. You don't even need to hear it. So your audience is not listening to you tune up, yet you get it right in the sweet spot that we all love and know so well.So with that being said you can more fully understand why this D'Addario NS Artist Capo is the cat&#8217;s meow. It is the first tuner that I ever used that kept the guitar perfectly in tune after clamping it on the neck. (It is adjustable like the others are, but this one is sensitive for light gauge strings as well)You often see artists trimming up their tuning after putting on the capo; not with this one even with light gauge strings. I must admit I was surprised taking it right out of the wrapper, after going through the above tuning procedure to get the guitar spot on, that it immediately did the job just right. It wasn't even a little bit sharp.To be super critical here is another tip. When using this capo put it closer to the fret, rather than in the middle between two frets. For some reason it stretches the string less in doing so. It has to do with the tension resistance at a steeper angle right alongside of a fret, rather than farther way like in the middle between the two frets. I did get a tiny bit of sharpness when positioned between the two frets. (With 8 gauge strings)Since the two most important factors are that it is comfortable to use, not getting in the way when playing open chords and keeping the guitar in tune. The best way to use this capo is to simply clamp the strings right above the second fret for example, rather than right below the third one. Right below the third one gives you that perfect tune also, just like right above the second one does, but it keeps the capo way out of your way. As a matter of fact I am so accustomed to using the capo position to know where to finger the chords, that I sometimes make a mistake and fret them one lower than they belong. With a little practice, or not even looking at the guitar instantly corrects that. To say this quite simply is to say use this capo farther away from your hand. You just slide it down to being right above the fret below it, rather than right below the fret above it.So there it is. This Capo does the job perfectly and is light and easy to clamp. Of course if it can accurately handle 8's it will breeze through anything thicker. Out of the box it is set at its lightest setting, and that is perfect for 8's on the Telecaster I tried it on. Teles and Strats really have the same neck just with different head stocks. So it will work the same with both.So I guess I can't recommend this capo high enough since it is the ONLY one that works perfectly with super light gauge strings. My only problem is being sure to remember which guitar case it is in so I can switch it over when using a different guitar. I might get another one for a backup.", "id": 894}, {"review": "Notice in the name guitar INPUT. This is not to be confused with the Amplitube iRig which achieves input and output through the iPad/iOS devices headphone jack. Headphone connections can be noisy and have reliable connection problems. They also depend on the built in AD/DA converters in the iPad/iOS device. This Apogee Jam 96k is a professional quality INPUT device that has dedicated A/D analogue to digital converter, but depends on the built in hardware of the iPad/iOS device for playback. On the other hand &#34;Apogee One&#34; has both AD and DA convertors for both input and output.Amplitube iRig from IK Multimedia has a simple stereo headphone in and out jack plug that plugs into your iPad. The built in hardware in the iPad is something that I love for doing something like watching a movie cozying up to the 10 inch screen, but for audio-phile quality you need a dedicated a dedicated pre and AD convertor and that is what this Apogee Jam 96k has. Mind you it has that for audio recording input, but playback is handled via your headphone jack on your iPad. You can of course just use that for monitoring your mix, and then save the file in a digital format internally, and send to a playback device with pristine digital audio quality; e.g. saving as a .Wav file. This makes the Apogee 96k Jam a very usable device to achieve high quality recordings at a very nice price.So here it the continuum. Amplitube iRig for headphone jack input and output quality built into your iPad etc. The Apogee Jam 96k for digital quality conversion on input only with playback being handled by headphone jack on iPad. The Apogee One on the other hand at roughly 3 times the price gives you both AD/DA conversions so it has its own audio output jack plus 2 tracks of recording either 1/4&#34; instrument and/or a balanced external microphone jack. It also comes with a built in condenser mic that is pretty amazing. It also has 48 volt phantom power for using your favorite condenser mic. When you get into the Apogee Duet and Quartet you get more connections, plus the all too important option of MIDI connectivity.", "id": 895}, {"review": "I have preferred Ernie Ball Extra Lights which is a nickel string. They have a smooth depth of tone which is my preference. The NYXL's have a brighter tone, good playing ease, and stay in tune better when making new string changes. If you have a mahogany body guitar such as the Les Paul junior specials then the added top end would make a very nice match, or if you like a brighter tone on any guitar the same applies.These are not coated strings which a lot of strings in this price range are. Pertaining to output I am a firm believer that although you can notice a difference quite readily between certain types of stings in &#34;acoustic/unamplified&#34; output, but once you plug them into an amp with a volume knob the difference disappears.These do stay in tune better than my usual Ernie Balls nickels when you first put them on. The nickel takes a day to stretch into the tension of proper pitch. These have their tension adjust better on the first day of use. After the nickels set in you may not notice much of a difference. I find that by lightly sanding the nut with 1000 grit paper, and using Big Ben's Nut Sauce on all of the contact points of the string does more for keeping a guitar in tune than any other. Having these NYXL's on there is just one more added benefit.I would say if you are looking for a brighter tone, with better tuning stability, these are the ones to have. You can tell from the wall to wall 5 star reviews these are the one to have.", "id": 897}]