[{"review": "Great idea, well made, nice heavy webbingFit probly 6 or more picks. No need to glue/screw junk on your axe, maybe good with slide, or capo, haven't tried. But good product and price.", "id": 285}, {"review": "-1 star for plastic...otherwise excellent , YouTube has many reviews on these,The FAB pedals are great values,For what a flanger is for me, this is perfect, great sounds great price.", "id": 316}, {"review": "It's plastic that's 1 star deduction, but in this case, very pleased overall. The effect here isn't to take off to another planet of sound but all set at middle 12 o'clock this pedal is awesome, and really appealing.Several other combinations are excellent too.  Check YouTube there's plenty on this, great price pedal.", "id": 319}, {"review": "For the multi guitar owners, I think this is great.All I was looking for, something to patch guitars to amp without drastic tone/volume changes.Set up single coil, and another line humbucker, or p90 guitar and have the same volumes. Excellent... And space saver.  Sure there's a lot more options, but not likely ill use, just to make guitar switching easy good deal.", "id": 367}, {"review": "Good price and sound. Classic behringer plastic housing I haven't had a problem with ever but I don't dog my stuff... Favor this over built in analog drives, nicer crunch and dirt that's flexible. Fair to say real tube is the best, but for analog and practice amps this does put some life in the tone.  Can't say for metal as I'm not so into, but everything else find this fits the bill.", "id": 471}, {"review": "First saw on YouTube video, how genius? A pick that stays in hand... Makes me wonder how ever played without them...Small price for big help!", "id": 549}, {"review": "I like these, nice tortoise look with planet wave logo is nice, they have more flex than most which I also find suits me.They ride a little higher for me, which I also like, but if you like low, let's say midway across cuticle, may find a bit pinchy?  But I find the gauge suits me great and overall comfort is good, for my average thumb size.", "id": 617}, {"review": "More likely known as a guitar compensation device, the effect itself it widely used in everything. I have couple few behringer pedals, some complain about plastic housings but a) I don't beat my gear and b) plastic doesn't get rust and corrosion. The build on behringer are tough and fine to me, and the prices make them attainable to all players. The only thing I say negative is all that battery junk inherent to all pedals, gotta spring for power supply plug, if not now, eventually because it'll drive you nuts.Compressor is inherent to quack and pop of chickinpickin and country stuff you just can't not have if that's your thing. The sustainer is just that adds sustain to any guitar regardless of build, so even a cheap one can ring like the best.So you got both in one, tailoring will add life to even a dull axe.  Some put down effects for whatever reason but this one likely adds tones that you can't do without once you find em.", "id": 645}, {"review": "My go to strap, be it brown or black,Just plain tool leather, can't beat itTakes sweat and breaks in great, always well made.", "id": 656}, {"review": "Good leather good build, made to last  and age nicely.  I like leather best of all things it feels proper, and I like simple let the guitar stand out, keep the strap simple but elegant.", "id": 659}, {"review": "Honest for cost it's 5 star, but I got 2, and 1 handle was slightly mismolded, rubber groove is a little off... But in no way matters.  Just kinda ok really now I can tell them apart by feel.This is a nice heavy Cordura (like military spec heavy) with self repairing zippers (standard kind) and totally adequate pad, soft nylon lined, and bonus pockets... 3.  Nice build, PVC piping on pocket edges, adequate pad backpack straps for any acoustic weight.  Heavy rubber feet for standing it up, give a 1/2\" of  wet ground protection if needed.For the price of 1 many other brands, I got 2,And for what most folks expect they are great.", "id": 863}, {"review": "I got one of these a while back and being like I am with guitars took it apart to see just what it's made of.Mahogany ply maybe or capped with real, but it's plywood body inside.Kinda shocked in competitive guitar market that epi would go there...Otherwise decent build, basic original lp design bolt on, surprisingly good electronics w/ full size pots and open back 3 way toggle, good neck but bad tuners.... Note: any 45% mount tuners, meaning mount hole at 8 and 4 o'clock position respectively... Will fit with the bottom hole of the 2 screw junk tuners mine had.  So add 10$ to get more than 30 minute in tune play here.And you can fill the other little holes with nail polish like it was made right to begin with.I like the style, and though there's plywood involved still good fit and finish, though many disagree it makes no real difference what electric guitar body woods are, only in looks.  Electric guitars don't resonate, that's why pickups are important.I don't like the idea of this as beginners choice for the simple fact of cheap tuning keys.You lose interest learning on something that can't hold good tuning.  So that bugs me that big player choice like epi would do that.It's likely they'll keep this style but revise it some... to be hardwood body and real tuners as I  think the price point demands it.  Otherwise a decent piece good wiring, decent pickups... But...", "id": 31}, {"review": "Haven't got to far into this thing yet but I do like it.  Same classic behringer plastic housing that I personally never had problems with. Definitely get some odd tone change to work with here, I'd say check your YouTube channel to hear for yourself, if not familiar with the tones.", "id": 505}, {"review": "I acquired this recently, I did not need another strat style, or copy of, but it's white....just gotta love that vibe? Anyhow lots of reviews justifiably good, here's a few add ons in case... It's routed hsh under the hood but looks tight.. Think it's bucker size upgradable; top and bottom didn't measure, I like single coils...the white is a poly finish (love poly durable and crack/fade resist) and exquisite nicely done, alder body but it's hefty alder, like 8lb or so. Not so keen on headstock shape but the neck is nice, too nice to change like I was thinking till I got it... Nice quality control on these, really smooth rosewood board with med-jumbo (that's what I call anyway) frets good fretting. Standard hardware indicative of price but decent and well installed, no missed screw holes etc. Was set up with standard action etc, out of box was clean set up no buzz or uneven saddle stuff etc. great fit and finish, best I can tell its a standard f type plate, if interested looks to be easy changer.Overall it's a solid piece, assembled well, for me the body and neck is what seals the deal, better then most out there this range... It is alder and hefty, but durable. I look to change most hardware in time so won't comment on that, what's there... is installed well...2 things I forgot tuners wanna say 15:1? 10mm standard import style... Seem good, not legendary and tremelo/whammy standard zinc block (there's the must upgrade part...) it's standard 10.5 string space import, I got one pet peave; it's steel or brass blocks... A shame all these guitars nowadays with the zinc thin low sustain blocks, my advice get a fender mim standard lefty trem, the whole thing with steel saddles and all maybe 50$ best money ever spent... I can't afford the gotoh or Callahan stuff, On this a standard mim import space fender with steel block and saddles is easy direct replacement and with the hefty alder you'll get tons of sustain and tone and keep tuned way better. Also the neck I say nice but I mean it's nicer than most in the shape, it's slightly chunky c shape? Not baseball bat chunky but you feel it on frets 1-3 it's beefier? I have avg. size hands, I find it's a good fit.In all... If your looking in this price range it's nice, and upgradable as you can or learn more.", "id": 754}]