[{"review": "I've been using these cables for more than 4 months and they are holding up pretty well.  For years I used seemingly indestructable guitar cables that were made for me by an electrician friend.  When they finally gave out, I got in the habit of using the no-name cables that are always on display near the register at Guitar Center- really more of an impulse buy than something I put any thought into.  After the third or fourth Guitar Center cable failed from light use I decided to try these cables.  Not only are they cheaper but they seem to be holding up better.  I am not terribly hard on my gear but my cables tend to get twisted as I move around and the cheaper ones  eventually fail mid-cable.  I don't mind spending a few extra dollars if the cable is a little more durable.  This cable is actually cheaper- $12 or so shipped- and it's holding up pretty well.  These are actually very reasonably priced for 18' cables.  There is some kind of limited life warantee on this product but I haven't needed it.  Five stars for a nicely made 18 foot guitar cable that costs $12 shipped!Incidentally- these cables are shielded and are meant to connect your instrument to your amp's input.  Do not use these to connect an amplifier to a speaker cab.  You want to use unshielded cables for that purpose.Edit-  More than 6 months has passed and this cable is functioning without any issues.  The price on these things has gone up significantly and although the cable is highly recommended, there are probably better values from Hosa, Monster or Planet Waves-", "id": 3}, {"review": "Before you pay some tech to fix the knobs and switches on your guitar, stomp box or amp, try this.  95% of the time, this will take care of the problem.  If your amp cuts in and out, also try spraying the effects loop and pushing a 1/4&#34; jack in and out of the socket a dozen times.  The very first can I bought probably paid for itself a hundred times over.  Good stuff !", "id": 14}, {"review": "Let me start by saying that I am a huge fan of Dano stomp boxes.  I probably own close to a dozen of from the various lines they make.  This pedal does a decent job covering your tremolo needs, but IMHO the tremolo from Dano's Cool Cat line is a much more durable pedal for only $4 more (at the time of this review).  The switches and knobs on this pedal are the weak link.  I don't think it's true bypass either.  The Cool Cat has a metal enclosure, true bypass, sturdier inputs and knobs, and a much better on/off switch.  The features and sound are the same.  Spend the extra $4 and you will have a much more bullet-proof pedal with the Cool Cat trem.", "id": 24}, {"review": "I first discovered Elixir strings when I purchased my Taylor and I've been a convert ever since.  They cost roughly two or three times as much as uncoated strings but are well worth it.  If your hands perspire when you play, this product will keep your strings sounding new and fresh.  They sound great on my Martin too !", "id": 109}, {"review": "This is a very good TS type pedal at a great price.  The ability to adjust treb and bass is nice.  The enclosure is metal, the knobs feel sturdy, and the switch has a durable feel.  This is an analog pedal an the only Digitech pedal I've ever contemplated keeping.  I ordered this pedal through Amazon and had it for a few days but ultimately sent it back because it was redundant in my arsenal.  If you don't have a TS type pedal this is a good, cheap choice. Personally, I didn't think it sounded any better (or worse) than my other TS type pedals (Behringer TO800,Joyo Vintage Overdrive,Deltalab TO-1,TS808 and TS7).  As I indicated, I have the tubescreamer sound well covered lol.  I opted instead for the Dano Cool Cat transparent overdrive and I am very happy.  If you don't have a TS type overdrive and are thinking about dropping a bunch of cash on a TS808, you may want to check this out first.", "id": 145}, {"review": "Comes with a capacitor, so that's a bonus.  These pots are CTS and have a nice tight feel compared to Alpha pots.  Alpha are a little cheaper, have basically the same tolerance, are slightly looser in feel as you turn, and get the job done pretty much the same.  What it really boils down to is whether you prefer a slightly tighter feel, or a slightly looser turning knob.", "id": 216}, {"review": "What more can you ask for in a pedal that runs you twelve clams and ships for free?  This is not the highest quality pedal in terms of construction or tones, but it gets the job done nicely for cheap.  If you are just starting to experement with stomp boxes (or you are addicted to collecting stompboxes like yours truely), you can't go wrong with the FAB line.  I find the placement of the knobs just slightly annoying, but it's a nitpick at this price point.  If you are looking for something like the Boss DS-1, this will pretty much cover the bases at less than a quarter of the price of the Boss pedal.  If you are looking for more of a light breakup kind of box on the cheap, get the dano overdrive instead (the silver one).  I also find that for about ten bucks more, Behringer makes some great clone pedals.", "id": 280}, {"review": "It's hard to really describe what this pedal does-  It doesn't distort, flange, echo, or produce a chorus.  I'd heard it described as making your amp sound like someone had thrown a blanket off of it.  And because words don't do an accurate job in describing it, I would have probably never pulled the trigger on one (even though they are pretty cheap as pedals go).  As luck would have it, I acquired one on trade, and I have to admit that I agree with the whole blanket euphemism.  This stompbox helps correct the boxy sound of my Blues Jr. when placed at the end of my pedaltrain- right before I run into the amp. I don't feel it needs to be run on a dedicated effects loop to improve an amp's tone, though I do believe it works even better in a loop.  I placed it in the effects loop of both a Palomino V8 (USA/Ampeg made) and a Crate VC508 (a 5 watt USA made EL84 tube amp with Celestian speaker) and it was transformative to both amps' tone (in a great way). It does very well with single coils.  It's a pedal that I would leave on all the time once my tone is dialed in.  I don't think it works as well when I run my LP into a Jet City combo - particularly when trying to coax out subtle textures / harmonics. That amp also lacks an effects loop and I imagine it would have a different effect if placed after the preamp phase.  I guess it's rig dependent, but it's a keeper for what it does to the sound of my Fender.", "id": 300}, {"review": "Great slap echo sound.  Do not buy this with the expectation that it will act like a digital delay- it's closer to a reverb.  It provides an echo sound similar to if you were playing in a room covered in tile (an old engineering trick!).  Great for old school rock and roll, rockabilly, chicken pickin etc.  This will fatten up the sound of a dry amp.  As with all FAB pedals, I find the knob placement slightly annoying, but at this price point you can't really make a justifiable complaint.  Construction quality is somewhat cheap but the knobs feel solid and it has not failed me in more than a year.", "id": 315}, {"review": "Yes, this pedal is plastic, the switch is not the most durable feeling, and the knob placement is annoying.  At less than $15, you need to be able to look past these things.  I've had a higher failure rate with the Dunlop Cry Baby and that thing is built like a cinder block.  This pedal actually sounds pretty good when used as intended. Which is to say, this pedal does a nice job in overdriving the preamp tubes in your valve amplifier.  No brutalz here unless you already have a good amount of gain going.  No overdrive pedal lives up to it's potential running into a solid state (even modeling) amplifier.  It's just not what they are really intended to do and they end up sounding buzzy. Some have complained about RF interference with the use of the FAB pedals (getting radio signals through your amp).  I have had that happen with pedals costing 5x the price of the FAB- particularly when running a long pedal chain.  Based on tone alone, this pedal can overdrive your tube preamp as well as most anything out there under $100.  Check out the YouTube review of this pedal by a guy that goes by 'intheblues'.  I believe he uses a DRRI with a strat, and this pedal sounds GREAT.  If you did a blind test between this pedal and an overdrive costing north of $100 you may be surprised- particularly if your other gear (amp and guitar) are halfway decent.  What I did note though, was that this pedal has a wee bit more gain and a little less treble than my other TS type pedals.  That doesn't make it worse or better- just different.  The 'mid-hump' is actually less pronounced than in a tubescreamer, which is a good thing IMHO.  There are already enough tubescreamer clones on the market!  It will not perform miracles on lousy sounding guitars and amplifiers.  Incidentally, the pedal plays well with other dirt boxes.  Since it isn't true bypass, you will likely get some tone suck if you run a bunch of these in your chain, but if the rest of your pedals have decent bypass you will be fine.  Lest you mistake me for a novice fanboy with no point of reference for my review- I've been playing guitar since 1979 and have used 'vintage' dirt boxes since before they were vintage and overpriced.  I am years past caring about the brand and all about getting good sounds from simple gear.  YMMV-", "id": 355}, {"review": "Great pedal- very lush and usable tones. Think \"Lightning Crashes\" by the band \"Live\". Ok, I was going to initially give it 4 stars because of the following reasons:  plastic knobs, foot switch does not 'click', very miniscule volume drop with engagement (actually, I moved the pedal to a different spot in my signal chain and I *think* that resolved the volume issue, but I can't tell-  I guess if it is too close to tell, then it's a non issue !). Then I performed a reality check on myself and looked at the price again.  Metal enclosure.  Works like a charm.  Twenty four tax free bucks and free shipping.  It gets 5 stars because there is nothing even close at this price.", "id": 377}, {"review": "The knobs are a little sketchy - they feel like they will break off if you step on them wrong- but the sound is just great.  This little guy has been on my pedalboard since it arrived in the mail.  I may buy a second one as a backup.  Behringer hit a home run with this one.  Not just a 'great sounding pedal for the price\", but an honest to goodness great sounding OD pedal.  No true bypass, but if your pedal train is short or you have decent bypass on your other pedals you won't detect any 'tone suck'.  It sounds good enough that I don't mind the lack of true bypass!", "id": 381}, {"review": "I don't put these on every guitar but on the right guitar they are perfect.  What's the right guitar?  Longer scales- like a strat.  I would not put these on a shorter scale (22\") because it would get too flubby.  If you hit the power chords hard you may also want to stear clear-  these require a bit more subtlety in your attack or you will vibrate in and out of tune on the low E when you are pulling off windmills like Townshend.  They do allow super  easy string bends for when I feel lazy or for when my fingers are torn up from playing.  YMMV.", "id": 396}, {"review": "I've owned a TS808 since I purchased it used in the 80s for around $20.  Yes, this is a great overdrive.  This pedal has many famous users and it has been used on many iconic recordings.  Pair this with a strat and run it into an amp on the verge of breakup - now you're in tone heaven.  But the plain truth is this:  there are tons of pedals out there now that do what this does - and they do it for a fraction of the cost of the 808 reissue.  This was the original but by no means the last word in overdrives.  I own a boatload of other dirt boxes and while this one is iconic it's not the most transparent or versatile. There is a 'mid hump' in the EQ of this pedal that either sits well with what you are playing or it doesn't.  I'm glad I own mine but I don't think I'd shell out what they are charging these days for the reissue.  If I am not mistaken both the TS9 and the TS7 can be modded to this circuit with less than 25 cents in parts and about 15 minutes of your time.  If this pedal came in under the $100 mark it would be more deserving of five stars.  I really hate to burst anyone's bubble but SRV's tone was really in his fingers.  And so is yours ;)", "id": 447}, {"review": "In case you were wondering, this is a clone of the Boss compressor/sustainer.  It does a very good job reproducing the original at a fraction of the cost.  You add noise to your chain with any compressor because that's what they do- they elevate quiet signal and minimize volume spikes to even it all out.  When it is off, this thing had pretty decent bypass but I would not string an entire board together with pedals that are not true bypass because it would suck tone.  The box is plastic, but it is solid ABS plastic and is perfectly adequate.  I've not yet heard of a Behringer stomp box failing because the plastic box crushed when someone stepped on it.  People do like to complain about the battery cover being annoying and I have to say- aren't they all??? Seriously- when you can hook up a daisy chain and not ever have to deal with a dead battery ever again in your life, what are you complaining about?  The knobs are solid, and work just fine.  I own like a dozen of these cheap Behringer pedals and I have never had a problem with any of them.  You get more than the asking price worth of function out of this box.", "id": 645}, {"review": "I bought five of these when they were being blown out for like $3 apiece, but even at the normal price they are a bargain.  They are comfortable when used for an extended period of time- even with a heavy Les Paul.  If you play an SG, these will help counter the dreaded 'neck dive' that you get when using a nylon strap with those guitars.  Incidentally, Amazon is selling these straps at about 1/3 the price you would pay at GC.  Highly recommended !", "id": 656}, {"review": "Replaced the stock tubes (Groove Tubes) in my Blues Junior with a matched pair of JJs.  Much better tone IMHO.  The sound is exactly what you want in an EL84 and the tubes have held up very well.  I am coming up on needing a complete retube of my Palomino V32 and I will also be using JJs.", "id": 687}, {"review": "This is a lot of overdrive goodness for not a lot of money.  Mine has the older paintjob with the monkey on it, which makes it sound infinitely better IMHO lol.  This is intended to be used with a tube amp to achieve breakup and it does that job very nicely. Those seeking brutalzz should look elsewhere.  You can't blame a chicken for not quacking properly.  It plays nicely with other pedals and can be used to boost another dirtbox for when you've reached the part of Freebird that we've all been waiting for. The build quality is decent for the price and it claims true bypass thought I haven't looked under the hood.  Regardless of whether it's 'TRUE' or 'buffered', it doesn't color my sound when it's off.  Truth be told, I kind of prefer my Behringer TO800 tonewise- more of a personal preferance in the way I prefer Pepsi to Coke but still drink both - but the TO800 pedal isn't true bypass and the build is much more flimsy on that one. I think that if you are addicted to OD/FUZZ boxes like I am you should grab one of these for your toolbox.  If you aren't a hoarder of dirtboxes but you are just looking for a very nice tubescreamer on the cheap you can't go wrong with this one.  You can handpaint the cover with an owl or whatnot and tell your cork-sniffer bandmates that you spent an arm and a leg on it.  They will be none the wiser.  I think enough of this pedal/company that I just ordered the JF-02 OCD clone and will probably grab the Octive Fuzz when my wife isn't looking - though if one more pedal comes into the house this month I may be strangled in my sleep !", "id": 728}, {"review": "Great clone of a much more expensive Crunch Box pedal.  True bypass.  Knobs and switch are sturdy.  Great for amps that have only a master volume and no gain knob because you can dial in the dirt at bedroom levels.  This is a Marshall type distortion (more mids, less scooped).  No Brutalzzz - there are better pedals to cop the scooped 5150 or triple rectofier kachunky palm muting downtuned type thing, but you can get close with the right amp EQ and this thing dimed.  I agree with another reviewer- this thing has a very high output- so be forewarned the first time you plug in.  Unity is around 8 o'clock on the level knob.  It gets thumbs up for the sound/price ratio.  If you don't mind a longer shipping time, these pedals can be found more cheaply by searching the web.  This was my fourth Joyo pedal and I believe Joyo and the Dano Cool Cat line are some of the better deals going these days in terms of price/quality.", "id": 794}, {"review": "At this price, these cables are a bargain.  The jury is still out on how durable they are, but they all arrived in working order and have held up well despite several months of plugging and unplugging.  The length is great for when you have a bunch of pedals with inputs that vary from top to side.  I hate it when the patch isn't long enough and I have to mis-allign my pedals !  Anyway, thumbs up.  Will revisit my review if they begin to fail soon-", "id": 805}, {"review": "I am a confessed and unrepentant hoarder of dirtboxes and I like this pedal a lot.  This is my 5th Joyo pedal- I already own the Ultimate Drive, Vintage Overdrive, Crunch Distortion, and Octive Fuzz pedals.  I consider Joyo and the Dano Cool Cat line to be some of the best values in stomp-boxes these days.  You've already heard the particulars about this pedal, so I won't go into the features.  The build quality does appear to be a hair shoddier than all my other Joyo pedals (which are earlier versions).  The switch seems a little less heavy-duty, and the case seems to be thinner metal.  That said, the case is still metal and isn't going to fail in any way.  The switch- well, we will have to wait and see.  For $35 or so, I'm not going to complain.  Soundwise, this product offers excellent gain for this price level.  It's not particularly suited for Pantera, but you can do modern mid-gain up to Metallica without any problems.  This is not an overdrive, so it doesn't do the 'just on the verge of breakup' thing like a tubescreamer does.  That's not what it was designed to do.  I run it into a cleanish tube amp and it sounds very good.  I've also boosted it with the following with a good result:  SD Pickup Booster, Cool Cat Transparent Overdrive, Tubescreamer (TS9,Joyo Vintage OD, Behringer TO800), Tech 21 Comptortion.  If you play rock/ hard rock through a single channel amp (like a Blues Jr, Valve Jr or Pro Jr) and you want to make it a two channel amp, this will get you there. Most people compare this pedal to the Suhr Riot.  I do not own that pedal, so I can not fairly make a comparison.  I have seen several videos comparing the two and as far as that is concerned, I hear enough similarity that I am not compelled to shell out $200 for the Riot. Another comparison that gets made is that the US Dream is close to a ProCo RAT.  I own an original 80s RAT and I don't think they are all that similar.  The US Dream has a tighter low end and more treble.  Not better or worse- just different enough that they don't completely cover the same sonic territory.  Admitedly, I don't own a newer RAT-  maybe that one is closer to the US Dream.  For what they are charging, this is another home run for Joyo-", "id": 832}, {"review": "This is my 6th Joyo pedal and like the others, it does not dissapoint.  I think these and the Dano Cool Cat line are some of the best bang for your buck in pedals these days.  Like many have mentioned, this pedal is like a TS but without the mid-hump.  This pedal is really about getting touch sensitive low gain responsiveness and texture.  When you run it into a cleanish tube amp and you dig it, it breaks up.  When you play lightly, it gets cleaner- which is why it is so similar to the $200 Sweet Honey pedal (the controls are also identical but I haven't compared the internals).  That touch sensitivity is lost IMHO if you stack this with another dirt box or if you are running it into an amp that is already raging with gain.  When you do that, it acts more like a traditional OD would- which is totally cool, but you are losing the touch sensitivity thing that sets this pedal apart.  If I could only bring one dirt box to the gig it would probably be something more mid-gain (like the Joyo Ultimate Drive or the Dano Transparent OD)  but if you are in the market for a sweet honey pedal and don't have that kind of bankroll, you should definately check this out-Edit:  Having owned this pedal for a while, I realize I was incorrect in saying you lose touch sensitivity running into another dirtbox.  This pedal actually plays well with mid-gain types of overdrives like the Joyo Ultimate Drive, the OCD, or the Dano Drive.  When you dig in, you CAN get more breakup so long as the other overdrive isn't dimed.  This pedal has become an essential, 'always on' pedal for me !", "id": 833}, {"review": "I am a fan of Joyo-  I own the vintage OD, the Ultimate Drive, the Sweet Baby, the US Dream,  the Crunchbox clone, and this one.  This is probably my least favorite Joyo pedal.  I'm giving it 3 stars for the fuzz it delivers on the cheap, but the octive leaves much to be desired.  I have read that there is a simple mod that will correct the octive issue.  Apparently, one of the components is installed in a reversed positon, which results in the lackluster octive.  I haven't taken mine apart for the fix, but I read that it's just unsolder, flip, and resolder the same component.  You can google it for better instructions.  Still, this ain't bad for the pocket change they charge.  The reason I haven't fixed it yet is I have the feeling that once I mod it, it will sound just like my Dano French Toast- albiet with a sturdier case and true bypass-", "id": 836}, {"review": "This thing is incredibly cool.  Double the record time of the closest competitor- the TC Ditto- and about twenty bucks cheaper.  Your loop can be as long as 10 minutes, with unlimited over-dubbing.  This pedal sold out in about a day on most of the big retailers- likely due to pre-order obligations and a delayed release.  It was worth the wait.  You can add layer after layer of sound to build a wall of music.  It's a really cool tool for jamming, performing, or composing.  Operation is simple- press once to record.  Press again and it begins playback.  Press a third time to dub on top of your last layer.  If you make a mistake, press and hold- it will erase your last dub.  Tap twice to stop play of the loop.  Press and hold while stopped and you will erase the whole thing.  Switch is a soft switch, so there is no click.  It is very responsive to pressure.  There is a single knob to control the volume of the loop.  Nicely done, Digitech ;)", "id": 891}, {"review": "Think of this as an artist's tool.  And for every job there is the 'right' tool.  Is this the best distortion pedal?  That really depends on what sound you are trying to get and what other gear/technique you are using with it.  If you are using bad gear or poor technique it will not perform miracles.  It will not make your 15 watt solid state Ibanez Soundblaster amp sound like a raging Orange Rockerverb and it will not make single coils sound like EMG 81/85s.  But arguing over what pedal is 'best' is like two painters arguing over what color is best used to paint a sunrise.  This pedal is good for a tight kind of distortion- but not so heavy that you can do modern metal if running into a clean amp - if that makes any sense. It it doesn't make sense, there are ample Youtube reviews you can check out before pulling the trigger.  It has been used by professional players like Steve Vai, Joe Satriani, and Kurt Cobain. It is a professional pedal used by professional musicians.  It's built like a brick and durable as all get-out.  I found mine used for $20, but the new asking price is fair. I would like to see Boss start using true bypass instead of the buffered bypass they use, but admittedly I don't detect any tonesuck with it.  I've run mine into a tube amp on the verge of breakup and it can really get things cooking.  It also takes an overdrive or sustainer pretty well to bump the gain and get some singing leads.  With the exception of 'modeler' type pedals from companies like Tech 21, I do not think that any dirtboxes- this included- perform optimally when run into a solid state amp.  So if you are not happy with the way it is distorting your Marshall MG, the problem is in your amp.", "id": 35}, {"review": "For the money, I have no complaints.  The enclosure, dials, and footswitch are all durable.  Not true bypass, but none of the BOSS pedals are.  It doesn't suck tone.  This pedal isn't the end-all be-all overdrive, but with asymmetrical clipping it fills a niche that TS pedals don't. You lose a little low end when it is engaged, but that actually works pretty well for leads- especially with humbuckers or amps with a looser kind of 'classic' distortion encountered with EL84s.  As a stand alone overdrive, I prefer other pedals.  But where this pedal really works for me is as a boost to other dirtboxes or an already overdriven amp.  You get singing, harmonic leads when it is dialed in right.  Like any overdrive, you introduce noise when the pedal is engaged and things can get hissy while you are palm muting if you crank it too far.  I am a dirtbox hoarder and I like to rotate the pedals and try different combinations.  Lately, I am running this into either the V1 Cool Cat transparent overdrive (Timmy Clone - very, very nice) or the Behringer BO-100 (which is a dead ringer for the Boss Blues Driver) then into a tube amp that is dialed in on mild crunch (Jet City Combo or Palomino Combo).  As with any overdrive, this thing will not sound very good (IMHO) running into a solid state amp.  That's just not what it was intended to do. It was intended to drive preamp tubes into saturation but YMMV. Because I'm a cheapskate (and because these things are durable like bricks) I bought it used for $20, but it is well worth the new asking price.", "id": 38}, {"review": "I've been useing this pedal for several years and it does the job.  Yes, it could be metal, and I wish the button gave a satisfying 'click' when I step on it.  For under thirty clams I can look past these things.  I have not had any issues with noise (crackling or oscillation).  I really have no complaints at all with it's performance so I am glad I didn't shell out 3-4X more money so I can feel more secure when I unlatch my pedal board in front of gear-snobs.  I don't think I need to run this pedal with every amp I own but it does a great job 'opening up the sound' of boxy or dark sounding amps.  When I run it in the effects loop of my Palomino V8 (great little practice amp btw) that little amp sounds HUGE.  Also great in front of my Blues Jr.  If you own an amp with a single tone knob (Pro Jr, Valve Jr etc) or if you find your tone stack lacking responsiveness you owe it to yourself to buy one of these. Even if you are satisfied with the responsiveness of your amp's controls, this pedal can double as a volume boost when playing lead.  Once my sound is dialed in, I leave typically leave it on and forget about it.  It's also pretty indespensible for shaping the sound of your amplified acoustic guitar-", "id": 84}, {"review": "This is an iconic fuzz pedal.  Yes, Smashing Pumpkins used this pedal but Corgan also used a Fender Blender (which is similar to the Big Muff but has an octive thing going on too).  This is not a subtle pedal.  It's cuts through the mix well if you are running into a cleanish amp.  I find that it gets a little muddy if I run it into an amp that's already breaking up.  I can say the same thing about most fuzz pedals though.  This is not a wooly, splattery vintage tone like the Dunlop Fuzz Face.  It really has it's own thing going on.  It's not the kind of pedal that I keep on all the time, but it's a cool tool for the sonic toolbox.  If I had it to do all over again I would likely buy the Big Muff with the tone wicker switch.  It's about ten bucks more and has a little more tweekability.", "id": 308}, {"review": "I picked one of these up when they were being blown out cheaply at a big box store.  Who doesn't need another pocket tuner to throw in the guitar bag, right?  The price was less than ten bucks, but unfortunately it doesn't work very well.  The microphone inside the unit is simply not very accurate.  It gets you in the ballpark, but just barely.  Strike a note once, and it's sharp.  Play the same note with the same force again and it says you are in tune.  I think the Korg tuner is in roughly the same price range and it performs the job much better.", "id": 394}, {"review": "I scored a virtually unused pre-owned unit for $50.  It is packed with features and there is a little bit of a learning curve if you want to really make use of the features, but simple plug and play operation is possible.  My original thought was to use the unit as an interface for recording on my PC.  My only gripe- and it is considerable - is that the unit sounds too digital to me- particularly as the chord or note starts to decay and fade.  I probably would have loved this thing when I started playing (more years ago than I care to admit).  I prefer a genuine tube driven amp with analog pedals.  Does that make me a 'gear snob'?  Not when you consider that low watt tube amps and cheaply manufactured pedals can be had for peanuts these days ;)  I've also owned a Tech 21 Trademark 60 analog modeling amp (not bad but traded) and still have a Tech 21 TRI AC analog preamp(great pedal and a keeper)- both are 'modelers' and both sounded better to my ears than digital modelers.  I just prefer analog all the way around.  I eventually gave the unit away to someone who has just taken up the guitar.  He likes it fine-  I gave 3 stars because it's a good way for junior to experement with effects and to practice without annoying the neighbors.", "id": 427}, {"review": "Nice features on a pedal this cheap.  I like the capacity to independently control treble and bass.  Switch actually works and makes a marked difference in the pedal.  Not the bulletproof construction of a Boss pedal, but I have quite a few Behringer pedals and I've yet to have a malfunction in more than a year.  I have an EH Big Muff, and this pedal is closer to that than to a Dunlop Fuzz face.  For this price, it's another great tool for your arsenal.  One thing to keep in mind with any pedal that is not true bypass - if you string a bunch of them together, you are going to experience the dreaded 'tone suck'.  If most of your pedals are true bypass or have a high quality buffered bypass, you will be fine.", "id": 450}, {"review": "Great bang for the buck clone of a Tech 21 GT-2. This pedal does not have the build quality of the GT-2 but the controls are identical and it sounds darn good (especially for the pocket change they charge).  I have not done a gut-shot comparison of the two pedals so I can not comment on how close the actual circuits and components are.  The TM300 is more than just a distortion box.  It's more like a preamp.  I find that it does a very convincing mid scooped Twin type of clean as well as a decent Marshall type growl.  I find the Mesa to be the least authentic though it is not an unpleasant distortion by any means- it just doesn't sound like a Mesa imho.  If you are looking for triple rec distortion there are probably better dirt boxes for that.  I actually have the same criticism of my Tech 21 Tri-AC (really excellent pedal!)  The TM300 works well running into an amp and because it can simulate a mic'd cab it can also be run directly into a PA or mixer and bypass the amp completely. This thing actually takes other pedals reasonably well.  It can really breath new life into a mediocre practice amp (or any solid state). It can also be stowed in a bag easily enough so that you don't have to lug a backup amp to gigs.  I find it much more realistic sounding than digital modelers but it doesn't quite 100% replicate the sound and touch sensativity of a tube amp being pushed (they haven't invented that yet in my opinion). It doesn't replace a tube amp for me personally but if you are contemplating running straight into the PA because lugging your amp is impractical this is a no-brainer. Five stars for what it does at this price.  If you are a hobbyist or weekend warrior this pedal will cover the bases.  If you make your living doing live performances (or if price is not factored into your decision making) I would advise you to pony up the extra money for the Tech 21 product because their overall build quality is much higher (with regards to the enclosure, switch, knobs, jacks), their customer service is top-shelf and they are engineered/manufactured right in NYC.  I own three Tech 21 pedals and previously owned their Trademark 60 amp and I can attest to the difference in overall build quality between their products and Behringer's.  Sound-wise they are very very similar though and I DO have much love for these inexpensive Behringer pedals.  I own close to a dozen of them and I have not encountered a single malfunction in more than 2 years.", "id": 471}, {"review": "Folks that like the original Ibanez Tube King will love this pedal.  Sturdier construction than most of Behrenger's other pedals-  The housing is metal and the knobs seem a bit more solid.  Folks talk about how bad the stock tube is, but that has not been my experience.  I may experement with a low gain JJ in the future, but the stock tube is staying put for now.  Maybe I got lucky and they 'hand selected' the right one?  This unit sounds really incredible when it's running into the front end of my EL84 powered tube amp.  The sound is really organic and gritty, with great harmonics and smooth sustain. Sounds decent but not nearly as good going into a solid state amp (no suprise there).  Still, an improvement from the sterile solid state tone.  Be forewarned - this pedal is gigantic in dimension.  Who cares, so long as it sounds this good??  I'd wanted a vintage Chandler/Butler Tube Driver forever, but now I honestly don't need one.  This pedal gets me there on the cheap!", "id": 472}, {"review": "Pretty much a straight up clone of the Boss pedal- and a decent one at that. Not the bulletproof construction of the boss to be sure, but all the functions are the same. This is not true bypass but neither is the Boss. I have not experienced the tone-suck or buzzing that others have complained about. Mine worked flawlessly out of the box and does a great job thickening up my leads in a Gilmour or EJ way. Is this the best digital delay on the market? Surely not, but it's the best cheap one. The pedal features up to 2 seconds of delay and a tap tempo function, however the instructions do not tell you how to engage the tap function(hold the pedal down). Believe me, you figure it out at this price point. If you want to spend double the price ($70- still cheap for a delay~), I would suggest the Ibanez DE7. Incidentally- this pedal- like any other digital delay or digital reverb- will EAT batteries. It's what they do, and is not a flaw related to this specific pedal. Invest in a daisy chain (SPOT or the like...) If you have a pedal train with multiple stomp boxes and you are running them via 9 volt it's a no-brainer.", "id": 488}, {"review": "I've had one of these for several years and it has proven to be cheap, durable, and reasonably accurate.  I own several different tuners and what I like about this one is that the microphone works well and is accurate for tuning an acoustic guitar.  Batteries last a long time if you turn the tuner off after you use it.  At ten dollars, I think it's a no-brainer.  It's the perfect size and price to throw one in every gig bag you own.", "id": 624}, {"review": "This pedal lives up to the hype. Distortion-wise, it delivers something in between a tubescreamer type OD and a full on distortion (like a Crunchbox or Rat).  I checked out several Youtube demonstrations before I took the plunge on this one.  I think the tone is actually much better in person than it appeared in the videos - more transparent and organic sounding. I have owned the Fulltone OCD in the past and this pedal is nearly identical sounding if my memory serves me correctly.  I also own a V1 Dano Cool Cat OD - which is an excellent OCD-ish pedal- but this one is getting more action these days.  I am running this into the front of either a Palomino V32 or a Jet City 20 watt combo with the amps set up just on the verge of breakup.  The pedal also plays well with others-  I am getting nice lead tones by running a TS type of OD into the front of this one.  The JF-02 is a really nice dirtbox - and not just for the price.  The fact that you can own it for 40 clams or less makes it a no-brainer for those of you who (like myself) are addicted to dirtboxes.  I have noticed some price gouging with  a few vendors on here.  Shop around.  I knew the build quality was decent because I own the Joyo Vintage Overdrive and they are both built like bricks.", "id": 795}]