[{"review": "I have used the Extra Heavy picks for many years but am still searching for that perfect pick. Its strong enough to play metal and some blues style rifts but not so strong it cracks and brakes. I do like the fact it wont turn to powder or fray while playing either but it does wear out fast when playing on heavy gauge strings.", "id": 69}, {"review": "like the title says, ive been using these for years. used a hand full of other brands and this is what i always end up with. i either use the 9's or the 10's and detune them.", "id": 227}, {"review": "Dang that's metal. Were the first words I said when plugging this thing in to the line. With a wide range of sound and versatility with just one pedal and two buttons is awesome. The only issue was with some manufacturing detail. The input and out put jacks are screwed up and nearly broke my cables when trying to set it up for the first time. The buttons were way to stiff and made a horrid crunch the first time I used it and after talking to amazon it turns out that just seems to be how it is. Be sides that its metal, nothing more nothing less. Razor sharp high ends or some butt draggin muddy slop of sound either way your covered with this pedal.", "id": 399}, {"review": "Well long story short this is my fourth Vox wah. Others have come and gone, some have been around longer than others but this one is the newest so im still working with it. sounds like the classic v847 but has the ac plug on it, that will come in handy. not as versatile as the JS big bad wah but far less complex and less likely to have issues with dust and dirt. it has a wide sweep and killer tone but im still looking for that sweet spot that gives that wah'o sound when doing solo work. so far so good not perfect but good.", "id": 451}, {"review": "I like the fact is foldable and can be put away or carried easily. The biggest down side is the angle that the guitar sits, the lean is to far back so you'll need to keep it further from walls than usual. Other wise good deal.", "id": 883}]