[{"review": "If you need some 6\" cables to connect your pedals, look no farther. These cables are perfect. They deliver good sound, are very small, and very cheap. What more could you ask for?!", "id": 11}, {"review": "I needed a new strap but I didn't want to pay $20 for one. I saw the ernie ball ones and decided to give it a shot. I'm glad I did. The strap is awesome. It's very very comfortable and can expand longer than any strap I've ever had. It totally deserves 5 stars!", "id": 74}, {"review": "I have tried nearly every kind of popular strings out there. I've used ernie ball, fender, prs, just all kinds. When I bought my first real fender guitar it came with fender strings and I loved them. So when I needed more strings I just got fenders. I am happy to say that I will prolly never buy different kind of strings again. They are so clean sounding and have a pure vibe to them. GREAT strings.", "id": 88}, {"review": "This acoustic pickup is the most amazing thing ever. It has a very warm and soft tone and picks up notes very well. I couldn't be happier with the purchase. It's a very good investment if you play guitar but don't have an electric acoustic. I don't think I'll ever even buy an electric acoustic now since I have this thing. Prolly sounds better anyway!!", "id": 129}, {"review": "This is a heavy duty strap. I use these on my fender guitars to make sure my guitar doesn't fall. It is a very comfy strap and prolly wouldn't break if you had a knife to it. It's the best strap money can buy.", "id": 172}, {"review": "These cables are awesome. They do what they are suppose to do and do it well. I personally like that they are smaller in the middle and are easier to fold than regular cable. If you are looking to connect your pedals and dont want to break your wallet look no farther than HOSA 6inch cable!", "id": 181}, {"review": "I hate winding strings. I got this to help with that. It does it job very well. You can string your guitar in a fraction of the time. It could be a little tougher but as long you don't give it hell it will be fine. Great and cheap product!", "id": 347}, {"review": "To be honest I'm not metal guitarist but I do love metal music and as far as playing goes I love bluesy solos with lots of distortion. I decided to get this pedal because it was electro harmonix, one of the best names in the business. And for the fact it was cheaper than most. I'm VERY pleased with the pedal and couldn't be happier.", "id": 397}, {"review": "I usually use fender .73 picks but they seemed to fall out of my fingers while I was playing and it was very irratating. So I picked these up. I no longer have to worry about them falling out of my hand. The star in the middle allows your fingers to connect in the star and you are able to get a good and stable grip on it. Hands down the best pick I've used.", "id": 549}, {"review": "I wanted a noise reducer because I have like 10 pedals and the loud feedback I was getting back through them was insane. I got this one because it wa cheaper and basically thinking why not? It's like $25. It was a great choice. The pedal stops nearly all unwanted feedback and doesn't alter your tone. It does take some time to figure it out but after that its golden. It's great.", "id": 615}, {"review": "What can I say? It's a cable. It works very well on a pedalboard. I personally use it to cable my pedal together from the first row to second row. That requires a cable longer than 6\" or 1 foot. The 3 foot is perfect and it works great!", "id": 663}, {"review": "The jam man solo is an AMAZING pedal. Yes it is a looper and an amazing one at that. The one thing that i thought was so awesome was that after you have played something you can save it to the pedal. It is a very handy tool. Another thing that is awesome is the pedals ability insert drum beats. If would %100 recommend this pedal to anyone. It is a looper that will loop all day and does way more than just loop. What more could you possibly ask for??", "id": 668}, {"review": "I've had the same tuner for years. I decided to upgrade. I got this because it had alot of good reviews and it was fairly cheap. It tunes better than any tuner I've ever used. Worth every penny!", "id": 706}, {"review": "When I bought this pedal I was thinking a heavy distortion. But when I got it and played with it I figured out it was alot different that advertised. It is a acdc, Steve Vaughn kind of pedal. It's got an attitude but it soft at the same time. It's truly a one of a kind product. I would recommend this if you are looking for just a basic distortion pedal. Make a note it is not a metal pedal. Not by any means actually. But for what it is it is fantastic.", "id": 757}, {"review": "The Joyo pedal looks kool and has some kool features but those are the main pros. Ive never been a big fuzz kind of player but i figured its only $40 so why not? The first thing i learned about this pedal is It does what it's suppose to do but with some drawbacks. There is veryyy loud feedback through the pedal. If you go this pedal and didnt have a noise suppresser you'd be up the creek. Although it is a fuzz pedal is it does \"fuzz\" things then that's why I give it 4 stars. I deduct 1 star because the loud feedback. But in the long run I would just check other pedal out and look for a better alternative.", "id": 836}, {"review": "These are the best acoustic money can buy in my opinion. They play extremely well and last a Long time. There's nothing better than these strings.", "id": 60}, {"review": "I'm not a metal player in any means but sometimes I do get the urge. If your gonna play metal you need bigger strings than just 46-9. So I got these and they are awesome. They are not too big or too small. Very happy with these strings. If you want GREAT strings get fender strings. They are the best out there. But for metal (big strings) I stick with ernie ball.", "id": 98}, {"review": "I had always wanted a phase shifter but I never wanted to pay alot of money for one because its not something I had to have but I just wanted one. The reason I bought this one was because it was cheap. I got it and hooked it up and wow this thing is kool. You can get some insane sounds out of it. I mean some are so insane I asked myself what could someone possibly use this with in a song. But it's great. It does what it is suppose to do and it is a sturdy stomp box. Couldn't ask for more.", "id": 377}, {"review": "First things first. If you have one or many expensive guitars BUY THESE. They keep you guitar safe from falling. To take it off all you do is hold down a button in the side and your strap and the lock with pop off. It's very handy. Very very easy to install and protects. Be warned they are bigger than they look but to do what they do so well they must be big.", "id": 523}, {"review": "I wanted something to keep my guitars from falling after I change guitars. I bought this because it looked pretty good and it was cheap. It has served it's purpose and I use it nearly everyday. Very happy with purchase!", "id": 746}]