[{"review": "all joking aside, these heads really are great. tune em right and you'll get a nice, warm tone from them that's unmatched with other brands", "id": 141}, {"review": "wow haha!! this china...really packs a punch haha!! I got this china and was blown away by it. my band loves it, the crowds love it, and most importantly it is very loud and trashy. great for hardcore drummers", "id": 144}, {"review": "it's amazingly helpful during double pedal licks haha!! while you're goin all out on pedals, you can just use the drop-clutch to make it sound like the hat is open OR closed...depends on what you want. it's really useful and I recommend it if you double pedal a lot", "id": 150}, {"review": "I bought these heads almost a year ago and after countless band practices and gigs, the same heads I bought over a year ago are still sounding great and haven't torn. these heads are amazing and a very good investment. make your kit sound very professional and I just love em to death. definitely recommend these heads to people looking for new heads", "id": 180}, {"review": "These pedals are great!! A friend of mine said I should buy other pedals because these pedals aren't manufactured by a very known brand name but I went with my own judgement and I was not disappointed with them. I have increased my speed a lot since I've gotten em and I can pedal songs like \"All Nightmare Long\" and \"Beast and the Harlot\" now  =]  great pedals. BUT, it takes time to develop speed so don't think the pedals suck just because you barely get em and you can't go all Jason Costa on em", "id": 445}, {"review": "this is honestly my favorite cymbal out of all 9 cymbals that I possess and use. very brilliant and resonant, definitely sounds like it costs a lot more than the actual price. trust this cymbal once and you won't be disappointed. it lasts a pretty long while too. it's a thin splash so it does tend to break after about 8 months of use er so, but to replace it is dirt cheap so not really a big issue there. all in all I definitely recommend trying this product", "id": 292}]