[{"review": "I've played guitar for 5 years. Seen many different capos, but none that quite satisfies me as the Kyser.You really can't go wrong with this capo. It is very mobile, easily adjustable, sturdy, and durable.What's good about this capo is that you can use it as a regular 6 String capo and still turn it around to use it asa Cut capo. The transparent rubber piece does the same job.It comes in different colors also.I own the black, silver, gold, and camo Kyser capos.I also own the Cut Capo for other styles.I recommend it!All the capos I've had from Kyser are still in great conditions.Use them all the time at church and at home", "id": 25}, {"review": "I bought this guitar humidifier for my Taylor.I received exactly what I purchased and works as it should.This product has been recommended to me by many other guitar players around me.It is a simple design that fits perfectly between the strings.Easy to use because really all you have to do is moisturize the sponge and keep it in the plastic container.Price is good.", "id": 71}, {"review": "Just got this stand today.First impressions are always important, and this stand gave me a good impression.It seems to be made solid enough, not like some cheap off brand crap.The base is solid and heavy to keep the stand from falling over.The telescope mechanism is quite well made.Comes with a cable clip and an adjustment piece for smaller mic adapters.I got mine set up to extend up to 3ft tall. It's quite the perfect height for when I'm seated on my stool.One thing I did not quite like about the construction is the crew on rod to the base place. It unscrews easily when the mic stand is moved. Maybe adding something to keep it screwed in?Would recommend to others.Probably will be buying a few more to mic my amps and cabs.", "id": 77}, {"review": "Bought it to replace strings for my Taylor.Does all the job that I need it to perform.Winds the strings fastPulls the pegs smoothlycuts the excess wireDOES NOT SCRATCH MY GUITAR!!!the only issue really is that it squeaks a lot. can be fixed with some oil.", "id": 94}, {"review": "No complaints whatsoever.Product is a solid build and prices right.Knobs work well and the stand doesn't slip.Legs hold up pretty well also.", "id": 604}, {"review": "I bought this one after using the SN-2 for 5 months.The tuner works like a Champ!I can't really tell the difference between the SN1 and the SN2. They both work really well with my Taylor guitar, and my Fender Strat.", "id": 706}, {"review": "Tuner works great. Both by vibration and mic.Only real problem is the fact that the joint between the tuner and the clip is really weak. Mine broke off... not even a year old.", "id": 707}, {"review": "I bought this strap for my Taylor guitar.It's a fine strap that feels really comfortable and soft.As it says, it is made to fit well on Taylor guitars but can fit in any other guitar as well.The color is pretty much the same as the picture posted.Highly recommended", "id": 612}]