[{"review": "I know, I know, many people hate on this pedal, calling it &#34;stale&#34;, and &#34;generic&#34;. The problem that they have is that they simply haven't found the right settings on the pedal and the amp, because, after all, the settings on both the amp, and the pedal do make a difference. One thing to note is that it is a bit on the quiet side in my opinion. I have a Digitech Bad Monkey, and I set the level on that to 2 so it matches up with the amp. With this pedal, I have to crank the level to make the clean tone the same level as the distorted tone.", "id": 35}, {"review": "Do as the manual says, lube them up every so often, and these will work like a charm. I got these after an unfortunate incident with my strap slipping off of the strap button, and taking a chip out of the binding. The black ones work well with most finishes, and it works with most straps, as long as the ends aren't ridiculously thick. Inside of the box, it came with 2 screw sizes. One thing to note however is that these make the strap protrude much farther out of the guitar than normal. No biggie however, as most straps are adjustable, so just adjust for the change in strap position, and you're golden!", "id": 44}, {"review": "These strings are great sounding, and great looking on the fretboard, because they are bronze. One issue I had, was the 5th and 6th strings were too big to route more than once through the tuning head, but it still wound up very nicely. I would actually say that you might want to get the Extra Light gauge, but it's probably just my tuning machines, they kind of suck.", "id": 59}, {"review": "I absolutely love the feel of these guitar picks! They are so grippy, I haven't broken a single one yet, they stand out from all of the other junk in my studio, so it's hard to loose them, but I still do. If you have like a child, nephew, niece, sibling, or parent that plays guitar or bass you can't go wrong with getting these for them, or if you are a guitarist just playing the cheap little Fender picks that break if you strum a chord, and if you are lucky enough not to break them, they just slip out of your hands while you're playing. They are a little thin for rhythm playing however, and I recommend the .88 mm picks for that.", "id": 61}, {"review": "I've tried leather straps, I've tried Rocksteady straps, I still keep coming back to this strap. It's steady, Highly adjustable. And it works very nicely with the Dunlop Dual Design Straplok system. Good job Ernie Ball! I even prefer this to a nice Levy's strap that I own because the Ernie Ball strap is a bit slipperier", "id": 74}, {"review": "I wouldn't recommend tuning these strings to E however, because the intense amount of tension it takes to tune these to E can cause permanent damage to the neck that not even the truss rod can fix. The highest I feel comfortable tuning these to is E flat. If you are doing anything at or below Drop C sharp, these strings will work out great for you.", "id": 98}, {"review": "I haven't had an issue with this cable yet, and the guage of the wire connecting the plugs is very thick and high quality, but it takes a while for them to stop coiling up. Like the title says, the timeless combo of Neutrik & Mogami is better. If you're wondering how to get Neutrik/Mogami cables cheap, make them yourself. It saves you so much money!", "id": 127}, {"review": "Through my Ampeg bass amp, the low E string gets distorted when you push the bass control above 7, and the upper 3 strings sound kind of plain.", "id": 197}, {"review": "These strings honestly aren't for rhythm. They bend too easily, making rhythm playing impossible. On the plus side, for soloing, you can't go wrong with these. Honestly, I would get the Hybrid Slinkys over these.", "id": 227}, {"review": "These strings have a powerful tone for lead work, however they're not on the bendy side, which is great for rhythm work. The tone you get from these is punchy, powerful, and great for rhythm. If you need an overall great set of strings, get these. You won't regret it.", "id": 239}, {"review": "When you extend it out all the way, it sometimes topples over due to little weight on the bottom, but other than that, this stand is perfect.", "id": 279}, {"review": "Weak sounding, and break very easily. I would not recommend these to anyone other than those who literally have no callus developed.", "id": 396}, {"review": "Wow! This tuner is currently the absolute best value in my home studio. It gets used daily! If you know anybody who has even the slightest use for this, get it! They won't be disappointed unless they tune below drop D.", "id": 624}, {"review": "This keyboard sounds good, but the inability to go below that low E is just killing me. The speakers are good. Buy a good sustain pedal.M-Audio SP-2 Sustain Pedal with Piano Style Action for Keyboards", "id": 688}, {"review": "The Snark SN-1 is sometimes dissed because of it being slightly inaccurate. I beg to differ. This is the most accurate headstock tuner that I have ever used, and it also has a built in metronome, which I never use, but could come in handy. Another thing is the price point, which is simply amazing. The blue color is a bit annoying however, and I'd like it if they came out with a black SN-1. The visibility of the screen is amazing, and I can see it even with the sun reflecting off of it, or in a completely dark room.", "id": 706}, {"review": "This cable was very affordable, but you get what you pay for. It sounded brilliant while it wasn't broken, for about the 4 hours of runtime. It works if it isn't abused at all, but if you abuse it in any way at all, your out an XLR cable. I do not recommend this product at all for heavy usage.", "id": 768}, {"review": "I have spent a good month with my new guitar, and I am impressed. The pickups don't suck, the potentiometers are surprisingly good, the tuners are not very good, but I can live with them. The fretwork was second to none, absolutely the best fretwork I've seen in a guitar under $500. The 60's neck profile is very fast and comfortable, and it's a satin finished neck and body (unfinished fretboard). It's also not a very heavy guitar (considering that it's a mahogany body and neck). My main issue with this guitar is that the wraparound bridge/tailpiece breaks wound strings easily. I have gone through 4 6th, and 2 5th strings in the single month I have owned this guitar. Upgrade it to something better. Your strings will thank you. Oh, and (this goes without saying) UPGRADE THE STOCK STRINGS!", "id": 816}, {"review": "This microphone is the best microphone I have ever owned. It is very dense, a little quiet, but the sound is absolutely brilliant quality. It is very clear sounding, and very well built. Get this mic. You will not regret it.", "id": 75}, {"review": "This pedal is beyond loud. It's to the point where if you crank this pedal with a 15 watt amp with an 8&#34; speaker, you will get noise complaints from the end of your neighborhood. To match it up with the clean tone that I get out of my amp, I have to set the level in between 1 and 2.", "id": 145}, {"review": "These sticks are solid hickory, which is insanely durable, and sounds great for classic rock, and punk rock drums. These sticks are weight, and sound matched, so each pair will sound and feel almost identical.", "id": 151}, {"review": "At one point I had a strong hatred for these strings on my strat, but then I smartened up, worked my calluses to the point where I could probably play 13-62's tuned to E with no trouble, and realized that these strings worked great for my strat, because of the strong tone that these provide, and ease of bending on the upper frets. These strings also are good for Les Pauls, where the scale length is shorter than the Fender guitars, making bending like velvet.", "id": 238}, {"review": "There isn't much to say other than if you are a keyboardist, and are in need of a durable, high quality sustain pedal, BUY THIS PEDAL!", "id": 251}, {"review": "It might just be my pickups or my strings, but if you set the bass above seven or so, the bass gets fairly fizzy on the E string. The effects loop is useless, and it removes a lot of the character from the pedals, but that's good news because with this amp you don't need an effects loop because there is no built in overdrive. So if you ever do use a driven/distorted tone, you should just put a pedal in between your bass and this amp.", "id": 736}]