[{"review": "Lemon has been known for quite some generations to be a good cleaning solvent because of its acidic nature and this certainly does the job. As the label warns: do NOT to use on Maple-wood frets (mostly Fender strats) due to the softer & lighter quality. It is only for the harder, darker woods like mahogany (which I have) or ebony (high quality - i.e. expensive - used best for fretless). The solution is perfect, but the applicator (attached to the neck of the bottle) could be better. I would rather take the neck applicator out and apply lightly using a 100% cotton cloth.This solution has been made specifically for use on guitars, though I think you could find a similar lemon oil cleaner cheaper at local stores. It's only 4-oz, but what little is used each time, this bottle should last the guitar owner his/her life.", "id": 234}, {"review": "You can use a standard eye-glass cleaning cloth (about 2 quid) with this instead of buying a micro-fibre cloth (at 5 quid) they both do the same, imo. You could also use eye-glass cleaning solution instead (which I have in the past) but this special solution works better on the wood and laminate surface of guitars - but not on eye-glasses (smiles). This really does shine up your wood quite well. I recommend.", "id": 351}, {"review": "Great little amp to mess around with. The various sound changes and the range of sound mimics is amazing. The software that came with it is a little limited for true professionals but has more than you need for home use. Don't be fooled by the small size, this baby pumps out the noise quite well. I'd rarely turn my master volume above level 4 (of 10) for home use and at small local taverns I'd set it at around level 8. For a regular venue I have an extra Marshall 500-watt speaker system.You will need time to read the manual and learn the settings making it fun to see what kind of effects you can get. No pedals needed with this thing. I only gave it 4-stars because I later bought the Mustang III which has a bunch more features for an extra $200 and a blow-out 100-watt speaker. (The Mustang IV is the same as the III but with 150-watts. Again, you can but an extra 100-watt speaker for $40, making the extra $200 for a Mustang IV a waste.) The Mustang II is the same as this one but with a 40-watt speaker and $100 more.If you need something to play with at home and want to try different effects and sounds this is a good one at a cheap price. If you want the extra 20-watts (of the Mustang II) just buy this one and an extra 20-watt speaker (around $30) and jury rig it. Otherwise I recommend plunking the extra $200 and get the Mustang III with a digital display readout and more effects.", "id": 718}, {"review": "Clear sounding slider works pretty good in the studio. I did drop it a couple times (ok, maybe more than a couple) on the wood floors of stages without a problem. Then one day, in the frigidly cold outdoors, I dropped it on a concrete floor and it completely shattered, oops.", "id": 281}, {"review": "Great sounding slider for my electric AND it won't shatter when you drop it on the floor like the more expensive glass ones do. Plus the medium weight of it is perfect for my smaller hands to control the slide action. It has a great sound for the modern electric guitars, but is not really meant for lighter acoustic performances. I recommend.", "id": 340}, {"review": "It doesn't twist up like my standard black cable does, but it will twist a bit over time. Love the angle connection for my guitar side as it doesn't just stick right out there. If you really want to avoid on-stage kinks, then you MUST go wireless, it is the ONLY way to avoids twisted cables - no matter what type you buy. This cable sends sounds to my amp perfectly without distortion. It's worth spending a Jackson, IMO.", "id": 492}]