[{"review": "Dunlop capos are functional and inexpensive.  Come on, capos don't have &#34;tone.&#34;  Just get one that doesn't get in your way.  Also, the people who work at Dunlop seem like nice guys.  Thank you, Dunlop, for keeping it real up in Benicia.", "id": 116}, {"review": "I like to hit things. I use drums so nobody else gets hurt. I need the sticks to most effectively channel my aggression into the drums and not, say, local wildlife. These have the sweetest tone for battery-based abuse. Thanks Vic! Also, flammable!", "id": 151}, {"review": "Hey jerks, do you play guitar?  Well, if you do, you need strings.  Well, you could be an experimental guitarist playing a stringless guitar.  If so, you can stop reading.  If you use strings, you should buy them your damn self.  While you're at it, buy ten sets.  Seriously, are you a child?  Always have extra strings.  D'Addarios last a long time for me, and they sound good.  Also, they're on the bottom end of the price range.  Buy some strings, douchnozzle.", "id": 156}, {"review": "Soume times you just need a transformer-based, low amperage power supply for pedal where the switchmode-based, modern supplies are just too noisy.  This was the cheapest.  So it goes.", "id": 521}, {"review": "Bwarrrrngarooroorooroorooroororooro beoooooooooooghreaeaughneneeeneeeneeeneeeneeneeneneneee.Meedlemeedlemeedlemeedleleelelelelemememememe wee weee weee weeeweeeweeeweeeeweeee.Doooobleeedooobleeedoobleddoo dszchewieeeeenrarraaarraararrraararara derrroughroo roor orroo roo roo roo roo rooroo.Juh juh juh juh juh juh juhj uh sqweeeeeeeeeeeeeeeeeoooooorrrgh. Du Du .Duh Duh!Hendrix, bro.This arm fit my Mexican Strat perfectly.  I then sold it to a beginner guitarist for a great price.  I firmly believe that this small investment of vibrato arm greatly increased my return.  The only problems is that I'm not sure I can afford to pay the capital gains tax for all the profit that I made on my guitar investment.  I might have to sell one of my Lexuses.. Lexi.. what the hell is the plural of Lexus?", "id": 558}, {"review": "I bought this to tote my POD HD500 around.  It fits snugly, but well.  The accessory pocket can fit the power supply and the plastic Line 6 expression pedal.  The shoulder strap makes me feel important.  it respects my arm's desire for freedom of movement.  My only qualm is that it's Gator brand, and gators remind me Florida.  I'd rather just pretend that Florida didn't exist.", "id": 165}, {"review": "These sound great and last a long time for me.  Plus, they're reasonably priced.  Put 'em in your case and don't be unprepared.  I like squirrels.", "id": 198}, {"review": "I have many heavy guitars.  Yet wide guitar straps are for old men and blues posers.  I'm neither.  However, my back was still hurting, and I'm definitely a weakling.  So I bought this shoulder pad.  Now I only look like a weakling to the more eagle-eyed people who see me play guitar.  Thanks Planet Waves!Really, though, it's quite good.", "id": 452}]