[{"review": "Wasn't expecting much for this price. But I was surprised. Have been using mine now for about 3 months with no problems. Workmanship seems good. Does a good job not great of putting equal pressure on the strings but overall it has been a good product. I also have a more expensive Capo just like this one. They look as though they come from the same factory. More expensive is not always better.", "id": 116}, {"review": "I gave it 4 stars because it is well made and it does the job it is designed to do. But I personally do not like how it looks of it when installed. But that is only a personal opinion. You may see it differently. Don't use my opinion on how it looks to influence your purchase. It does what it was made to do. I purchased it to add an extension to a short guitar strap.", "id": 174}, {"review": "Well made. Enjoyable to play. Stay in tune well. The sound is clear and warm on my Yamaha and my Martin. Right now I am experimenting with different strings so I cant say if they are better than others. I personally like the sound better than the Martin ESs I have tried but that is a personal choice. Let your guitar be the judge.", "id": 198}, {"review": "This is my go to favorite pick especially for strumming. I Love the added level of control the grip surface gives me.", "id": 680}, {"review": "Easy to use, Seems to be well made. I only gave it 4 stars because I wish the built in Metronome made a noise you could hear as you play. Having to look at the beating heart while you play is very difficult.", "id": 706}, {"review": "Well made Capo. Works as designed on my acoustic. Easy to usel and it is nice that you can adjust the pressure on the strings. Just wish it had a spring so It could stay attached to the head of the guitar when not in use. I am always setting it down and forgetting where I left it.", "id": 761}, {"review": "Bought these as an extra set just in case I made a mistake when I was trying to cut down my nut and bridge. They are real bone and fit well on my Yamaha. Did not end up using them but will one day. Great product for the price.", "id": 860}, {"review": "Clean and clear sound. Great for strumming and using a pick but a little soft for finger picking. I prefer a string with a little more volume.  They tune well and hold a tune well.", "id": 294}]