[{"review": "I got this when I was just learning how to play guitar.  I was using a borrowed First Act guitar without any amp and I wanted to see what kind of sounds I could make.  It was inexpensive and fun to use.  The sound quality isn't the greatest, but that's to be expected.  You can dial in quite a few different sounds and it comes with a sheet showing you how to make different sounds.  It's very light so make sure you set it on the floor because you will be pulling it over with the guitar cable.  I pulled it off the table a couple of times with no ill effects, but I wouldn't want to take any chances.", "id": 303}, {"review": "I write and record my own music.  I stink at writing drums.  I don't play drums, I don't really have room for a drumset, and I really don't want to spend the money on a drumset to see if I can figure it out.  This is a great program for non-drumming, one man bands like me.  MIDI drums and the drum sounds from my Yamaha keyboard just wasn't cutting it.  It works with Ableton Live 9 with no problems.  Tons of different grooves.  It sounds like a real drummer on a real drumset.  Very easy to use.", "id": 385}, {"review": "I write and record my own music.  When I upgraded to a new computer with Windows 8 it wouldn't support my M-Audio Fast Track Pro so I had to upgrade.  The Focusrite Scarlett worked right out of the box.  I replaced the stock cable with a Monster cable and my recordings sound great.  Very easy to use.  Just plug in a microphone or guitar, set your levels, and start rocking.", "id": 801}, {"review": "I got this to power my Danelectro Honeytone amp since it eats batteries like candy.  It's a power adaptor, so it isn't too exciting, but it works fine.", "id": 40}, {"review": "I write and record my own music.  I use this microphone for vocals and acoustic guitar.  I replaced the cable that came with it with a Mogami and it sounds great.  Crystal clear and it doesn't color the recordings.  It will pick up ambient noise from the front, but that's to be expected.  It does a pretty good job of blocking ambient noise from the back.  Be sure to get a pop filter to go with it.", "id": 642}]