[{"review": "At first, I wasn't sure what to expect from these D'Addario \"Balanced Tension\" strings. D'Addario makes some pretty strong claims for these strings, including \"greater dynamic control and a more consistent feel between strings for evenly balanced bending, strumming, fretting, picking, plucking and slapping\".I can't really speak to those claims; all I can tell you is these are darn good strings, sound great, feel great. I recommend them highly.", "id": 868}, {"review": "At about twice the price of their standard strings, These D'Addario NYXL strings make lots of enticing claims about tuning stability, higher breaking point, and something called &#34;fusion twist&#34; (which I swear is a rare Chubby Checker B-side).Having just put a set of these on one of my guitars, I can't speak to any of the claims of superiority over other strings, but I can say they are solid, dependable strings with lots of &#34;punch and crunch&#34;.", "id": 897}, {"review": "Keeping in mind the difference types of guitars and pickups, these D'Addario strings are good strings for all around use. They are suitable for rock, punk, country, and funk. Sure, you could spend more on \"boutique\" specialty strings to give you that exact \"vintage\" sound, but these strings are just fine whether you play in the bedroom, garage or club.I like the light guage .010's because they are easy on the fingers, but are still beefy sounding compared to thin sounding .009's and .008's.", "id": 156}, {"review": "This Planet Waves Tri-Action Capo is easy to use, and features a micrometer adjustment knob to custom fit the capo to your specific guitar neck, a feature I've never seen on a capo before. It worked excellently on several guitars I tried it on (all with light/extra light guage strings), with no fret buzz or noticeable detuning after removal. The pick holder on the end of the clamp is a nice feature too.I recommend this capo without reservation.", "id": 843}, {"review": "While the Tascam US-322 Audio Interface appears to be a powerful tool for home based recording, it also appears that it is designed to work only in tandem with the included Cubase LE software. I am not a novice at home recording, as I have used many devices from 4 track cassettes to ProTools setups over the years. Here is a rundown of my disappointing experience:1) plugged into my iPad using the camera kit USB connector - got \"device not compatible with iPad\" message. Too bad, but I can still use my ART USB interface which works quite well with Garageband.2) installed driver on my old, G4 Mac running 10.5.8; opened Garageband, got  \"no input\" message.Could not evaluate the Cubase software, as it requires Mac OS 10.6.8. If I get a new computer, I will update my review. Until then, I'm disappointed.", "id": 874}]