[{"review": "The ends of the midi cable look and feel like quality. Connection is secure, no worries about uneven connections, it also detaches without a hitch. Highly recommended.", "id": 4}, {"review": "Same kind that come on all guitars from the Fender factory. Classic sound. I have switched to D'Addarios to capture that Frusciante sound.", "id": 89}, {"review": "If you're a Froosh fan like me, than look no further. These are the strings used by John Frusciante (formerly of the Red Hot Chili Peppers). These strings really are special. They help nail his tone and are slick, light, feel and handle bends perfectly. I use these on my 1962 Strat Reissue and they really compliment the stratocaster well. Highly recommended for those playing blues/funk/rock.Plus, I mean, come on, John mother *&%$#$% Frusciante uses them! :p", "id": 156}, {"review": "If you're always dropping picks, losing picks, breaking picks, this is perfect to have. Fits about 5-8 guitar picks or so. Stickies onto your guitar, wherever. There seems to be enough sticky-ness to move it around a few times and still have ti grip like new.", "id": 167}, {"review": "I use this for my home recording studio. This stand is versatile enough to be used at almost any angle. From playing and singing piano, recording guitar and vocals, and other various positions. Sometimes hard to keep the mic firmly in place but that may be a function of my shock mount.Cheap and highly recommended.", "id": 279}, {"review": "Really a nice mic. I did a lot of research before purchasing this for my home studio. I record acoustic guitar and vocals through this mic and they sound wonderful. Plenty of low end while still capturing the clear mids and highs. Makes my voice sound fantastic. I read a lot of reviews saying that this mic with the right voice works wonders, and it certainly does for mine.Worth a shot if you're on a budget like me!", "id": 371}, {"review": "I admit I bought this only because John Frusciante uses a very similar style strap. But he has good taste. This strap is strong and sturdy. Even without strap locks I'm comfortable going crazy on stage. High quality, does not fray, stays on the guitar. Does what you want and need and looks great!", "id": 479}, {"review": "These are high quality thick guitar picks. The colors are great. Unfortunately I would have expected a little better packaging. I know the company is trying to save money, but having them in a tiny plastic bag and tapped to a piece of paper in the envelope was a little less exciting to receive. Almost didn't know what it was because of this. Just seemed like a bunch of advertisements and mail.", "id": 574}, {"review": "Bought this to use on my 1962 Strat Reissue. After a year or so of playing the rosewood fretboard become a little dried out and rough, of course covered with 100+ hours of grime and sweat. This kit has everything you need to make your guitar feel, look, and play like new. I put new strings on after using this and man! Felt just like the day it arrived from the factory. Can slide and play much smoother with this. Serious speed improvement.", "id": 96}]