[{"review": "Works as it should. Nice materials and I think it will be durable. Simple to attach to your mic stand and adjust as needed. It will improve your recordings, getting the pops and sssss out of your sound without having to do sound processing as much anyway.", "id": 46}, {"review": "These are great strings. They are the right length and go on easy enough. They are color coded which helps a bunch in getting the right string in the right hole as long as you aren't color blind. They go on, sound bright, and keep that new string sound a bit longer than uncoated strings. Had a salesman tell me once about these coated strings that they last forever, you only have to change them every 3 months or so. I had to reply that forever just doesn't last as long as it used to. Changing strings is no fun so if over the lifetime of your guitar you have to do so 1/3 less, that is a good deal even if they don't last forever. That means more guitar playing and less guitar stringing which is a no brainer in my book. Worth the extra pesos.", "id": 130}, {"review": "This stand is very flexible in the way it can be set up. Allows you to get close to the mic and still play an instrument, like say a guitar. Can be used either sitting or standing. Recommend highly. Be sure to get a pop screen for your mic and recording needs to improve recording quality.", "id": 279}, {"review": "This Sam SP01 can be easily modded for use with the Oktava MK319. I found instructions through a google search. The metal piece on the bottom of the mic holder must be removed. Instead of hammering it out, I used two screwdrivers to pry it out. That leaves a nice hole which is just a little too small to use. Using my dremel tool, I was able to enlarge the hole just a bit. As a guide the piece you remove fits in a small groove. You must file down the sides til the groove is almost not visible. Then your Oktava will fit just fine. This mod is not easily reversible so keep that in mind before starting. I'll post up a picture later.I found the screw-on connector to not be that high quality. It wanted to cross thread as I putting it on my mic stand. So I wouldn't want to be taking it off and putting it back on frequently. That's my only complaint about it.", "id": 393}, {"review": "These are nickel round wound strings which are on the bright side of the spectrum. Designed to fit the general use guitarist they do the job. You do get a bit of finger noise moving along the string which is normal for this type of wind. Being 10's they are in the middle between the lighter strings which are easier to bend and the heavier strings which are where the tone is. I love the color coding on these which makes it easier to get the right string in the right hole unless of course you are color blind and there is no help for that. They are made in the USA which is bonus points and reason enough to buy them right there, put America to work. Get to picking.", "id": 868}, {"review": "This is great product if you are chaining several pedals together. Using just one wall wart you can power all of them, at least those that receive this kind of power 9v. Where it went above and beyond duty was providing a L6 converter 'CL6' for Line 6 products. I have an M-Audio Black Box which had a peculiar size plug. It was 9V 1000ma but nothing would fit. Then I tried the L6 converter and bingo I'm in business and Black Box bliss. I would recommend having it around just for that. It costs about the same as 1 odf any other kind of converter and gives you connecters for several different kinds of pedals which might just save your night when you can't find that particular adapter in the rats nest of other adapters. A pedal junkies salvation.", "id": 428}, {"review": "I picked up an old Boss ME-6B that required the Boss BRA-120 power supply. That thing outputs 12vAC. It also has a different size connector. Being that those wallwart power supplies go for around  thirty dollars, I wasn't interested. So instead I spent ninety more dollars on this fuel tank and got a DC Power Plug 5.5x2.1mm to 6.3X3.0mm female adapter. Using  the 12vAC output on my Fuel Tank Chameleon works great. Awesome overkill solution. It also powers everything else and looks fine doing it.", "id": 713}]