[{"review": "They sent me the 1mm (Blue) by mistake but it turns out I prefer that size after testing it out.  Fast shipping.  I play bass rock/metal", "id": 61}, {"review": "Changed the strings on my Epiphone EB-0 bass today for the first time using this product.Fit the extra large tuning pegs on my bass with room to spare.  Cutter works great, winder makes the job really fast.  10 minutes it took for all 4 strings.  Next time will be much faster now that i know what im doing.  Highly recommended", "id": 94}, {"review": "I have a HEAVY Epiphone EB-0 bass and this strap is a life-saver.  Nice, thick and padded and doesnt look too dorky.  The little pocket for the pick is not too practical though because the pick easily falls out and is lost.", "id": 188}, {"review": "Some of the complaints are well warranted about this cheap unit.  First of all I had to fumble around with it for almost 15 minutes to get it to open straight because it seems like I got a previously-returned unit that some other customer must have bent the arms the wrong way along the joints and I was careful not to manhandle it because I could tell it would break if bent it the wrong way with too much force.  I was about to give up but I felt bad to do the return because I didnt want to make Amazon lose money and this is a weird shaped box and probably costs over $8 in postage to send back to them.But eventually I figured it out.  I am a 5 ft 10 inches tall man and this stand is tall enough because I opened it all the way and there was still an inch or 2 to spare if I wanted to raise it to the maximum.  Looks like those complaining about the height did not realize that all 3 segments can be stretched out to reveal the full height (They probably only raised 2 out of the 3 segments).So for the price I think you get what you pay for and since I just want a stand that will stay in my bedroom at home I think this unit will suffice but if you plan to travel around with it or if you are getting it for a kid under 18 years old I recommend you buy a sturdier unit than this because they will probably break it in short order.  And then you will be out the fifteen bucks plus have to buy a new one.The truth is that its a flimsy piece of junk, okay for a responsible adult that will treat it with great care (such as myself) but not for children or drunks, it is very fragile and easy to break.  I took the advice and tightened the adjustment knobs for height only finger tight without great force as previous reviewers attest that it is easy to strip out the bolt if you over-tighten so be very, very careful.I will keep mine but if I had to purchase a second unit I would not buy this one because I dont like flimsy junk and I feel even my large dog could knock this down and break the dang thing.", "id": 313}, {"review": "Simply the best picks ever for Bass.  Recommended by Eric Friedman on a post and Im glad I followed the recommendation.  Cost Twice as much as Tortex picks so I use these Dunlop picks for gigs and rehearsal and use the cheap-o picks for my finger exercises", "id": 626}, {"review": "Just as the others have said.  Its cheap with little to no padding but gets the job done as a dust cover and if you need something handy to transport your bass to and from gigs or to put the bass into storage.Its a perfect fit for Fender Squire J Bass.  I also got my Samick CR-13 short scale to fit in there but it was a tight fit so not the ideal choice for Short Scale bassesBut Im happy with it for under eleven bucks it gets the job done and I would buy it again", "id": 781}]