[{"review": "I love these picks.  The flex is just right for me, and they last forever.  I have never had one break.", "id": 61}, {"review": "This is a nice addition to a guitar that you don't want to drill a hole into for a strap button.  It's a quick release with the buckle.  One end stays on the strap - the other around the head stock of the guitar.  Makes it nice if you have more than one guitar without a strap button- Buy 2.", "id": 174}, {"review": "This is my favorite string to use on all my acoustic instruments.  The strings last a long time, in my opinion.  They keep their bright look and sound, even when my friend with acid for sweat borrows my guitar.I have always liked D'Addario's packaging.  Instead of each string coming in an individual envelope marked with the gauge, D'Addario color codes the ball end of the string -- so the G is green, the low E is brass (I think - I'm doing this from memory), the high E is silver, and so on. I really like that -- there isn't an explosion of paper at a gig when I have to change a string quickly. It's a learning curve -- once you know the system it's great, but the first few times, it's a bit of a hassle to reference the package to find which color string goes where.D'Addario is my favorite string, hands down, after almost 40 years of playing.", "id": 198}, {"review": "Once you get the hang of this capo, it's wonderful.  It takes a bit to get used to squeezing it to the correct tension.I have several guitars - but the one that I love using this capo on has a hard &#34;V&#34; neck.  It's pretty accurate on that neck up to the 4th fret.Nice product.  Worth the investment.  Now I just have to figure out how to keep up with it!!!", "id": 266}, {"review": "I bought this for my Taylor 714.  It seems to keep things humidified very well.  I like the idea that it takes moisture out and puts moisture in as needed.I have replaced packs twice.  I have not had any problems with the packages leaking or creating any problems in the guitars.", "id": 406}]