[{"review": "I've use these strings for years. I play often and like to change strings often. I can do it without breaking the bank and they hold up well for many practices and gigs. They hold tune very we (at least on my guitar) indoors and out. I'd highly recommend them.", "id": 198}, {"review": "My partner won't put a pickup in his guitar and I get tires of luggin' an amp around (along with the rest of the sys) so this does the trick. Clip on the boom stand, stick a SM 57 on it and an SM 58 to sing in and your set. Holds tight.", "id": 246}, {"review": "I've used both the ES-57 and ES-58 for several years now. They are a fantastic mic, great quality and construction. I love how hefty they are. I've got 6 of these and plan to buy more when needed. I would probably suggest a higher end if you were studio recording but I set up for live sound in and outdoors and these work great. I have several brands (some more expensive) but I always come back to GLS.", "id": 594}, {"review": "I've got a couple of these and for the most part I'm very satisfied. On the Mandy, absolutely no problems. On guitars it sometimes doesn't register on the low E. Usually, moving around helps.", "id": 635}, {"review": "I own several of these and general buy from GLS direct but I needed some quick and had other orders from Amazon so I got them hear at same price. GLS is great quality and durable. I use there 100', 30' and 25' cords and have never been disappointed!", "id": 692}, {"review": "I am the kind of guy that fixes everything with duct tape and when the item is more tape than product I go to a pawn shop and buy something used and start the process again. I saw this case and thought 50 bucks and it's for my favorite guitar, so I purchased it. 2 days later it was sitting at my back door (and I didn't have to pay shipping). This thing is a beauty! Plush interior, hardware looks great and good quality. Does not use the cheap spring latches but rather the locking type. Deep storage pocket and more. My 12 string fits in it w/room to spare and its' case is running out of room to tape so I guess I'll be purchasing another soon.", "id": 753}, {"review": "I admit it, my memory is getting worse and this thing does the trick. Hold my tab securely so I can flip though it with ease while I'm still playing my guitar. Much more professional than having a music stand and paper up on stage.", "id": 831}]