[{"review": "Have had one for years.  Has survived many gigs and rehearsals, and many months in the trunk of my car.  Harsh environment!", "id": 133}, {"review": "I have an older version of this model, but it works great.  I opted to use more heavy weight wall anchors that I got from Home depot.  2 hangers rated to hold up to 75 lbs each equals 150 lbs worth of peace of mind!  The hanger itself that I bought was used, so it was already assembled, so I can't comment too much on the assembly process.  I bought 2 of them, and each holds my precious basses with tender care and worry-free security!  And no, I don't own stock in the company!  :-)", "id": 154}, {"review": "I love the dual bulb design.  The clamp slid around a bit on my music stand.  Overall I like the design and flexibility.  Accidental turn-on in instrument case or gig bag could be a problem.  I'm sure I'll need to find a way to protect the product from breaking since it seems like it would not stand a chance on its own in my gig bag.", "id": 524}, {"review": "I am editing my earlier review.  I bought 2 of these about 6 months ago.  One works just fine, no problems whatsoever, I use it on every gig and at home.  The other has some kind of short in it.  It drains batteries almost overnight.  When I take the batteries out, no problem.  Tunes just fine, but I am sure over time the battery harness will break as it is made of flimsy plastic materials that surely will not stand this kind of test.I contacted Snark and Marcy, their customer service rep, sent me a new one free of charge even though the tuner was out of warranty.  Excellent customer service!  They have earned my loyalty even if their products are not perfect because their service is!I will edit this review later if the replacement turns out not to work perfectly.", "id": 706}, {"review": "This was recommended to me by the top engineer at Genz-Benz bass amplification company.  Andy said that this product is far superior to any other.  He was right.  Fixed the scratchy potentiometer on my Shuttle 6.0 amp.  Also fixed the effects loop jacks, which had become oxidized and were causing my amp to intermittently lose 90% of its power on gigs.  Not good!  After several gigs worth of testing, both problems are resolved!  Andy said that this product actually works better over time once it has been applied since it has a lubricating, cleaning and coating effect on the components.  Wow!  And no, Andy does not own stock in, have affiliation with, or represent in any way the manufacturers of De-Oxit.  Nor do I.", "id": 14}, {"review": "This is a fantastic little recorder, but not for $300.  I bought mine used for $75 on a bass player's forum in the classified section.  That was over 3 years ago.  It has recorded almost every show I play, which is about 2-5 gigs a month, plus a couple rehearsals.  I record for my own learning purposes, and sometimes to make very rough demo's (some audio is better than no audio!) and have come to really appreciate what this little gadget can do.  The interface is not perfect and there is a little bit of a learning curve with the settings, but if you use the Automatic Gain Control (AGC) setting, the recording level is taken care of.  I use Audacity to amplify when necessary, to normalize always, and to edit from .wav to .mp3.  Its pretty easy and I am no sound tech nor am I a studio engineer.And if you goof and unplug it before powering it down, no problem.  Just pull the SD card out, insert in to your computer, save the files on your computer as .raw files by changing the extension (but first make a copy of the original file so that if you make a mistake you have a backup) and import the file into Audacity as a .raw file. From there you can edit as normal and save your edited songs as .mp3 files.", "id": 463}]