[{"review": "Really nice cable! I've had mine for over a year now. And it has worked flawlessly. No problems with distortion or noise. Build quality is as solid as they come. Nice gold tips and polished finish for great connectivity! Keep it professional. And become a Monster! I did!", "id": 127}, {"review": "This is a high quality microphone. Sounds really clear and noise is nonexistent. Works great with my new mixer. Built very sturdy with metal and not plastic. Shipping was great along with packaging. This is a very nice dynamic mic!", "id": 213}, {"review": "This mini telescoping boom is the bomb! It is built very well with long lasting parts. It looks very professional and works without any problems. It fit perfect on my new Hercules mic stand and was ready to go. It holds your condenser mic very solid for a worry-free session. Especially if you have an expensive heavy mic you want to protect without any question of durability. I'd say it it worth every penny if you prefer quality equipment in your studio. This one is definitely a hit!", "id": 291}, {"review": "I'm loving this pop filter! It looks professional in design, and feels very sturdy on the mic stand. The built in shock mount is definitely a plus. I like it because some beginners try to grab the mic in the studio when recording vocals. This immediately let's them know to just speak into the microphone. Also offers the option of removing the pop screen if you want. Amazon was great in conjunction with the seller! My item arrived lightning fast! Amazon is like music to my ears, and that's why their products are in my studio. Simply THE BOMB!!!!!", "id": 584}, {"review": "Very nice pop filter! I use it on all my condenser mics! It works perfect for those hard P's and strong S sounds. It's built very well and adapts to almost any mic stand. It makes DeEssing a lot simpler when mixing vocals. And it looks very professional! I wouldn't be on the mic without it, now that I know of the big difference it makes having it!", "id": 533}]