[{"review": "This arrived and when I tried to use it, it turned out that the male threads were some  oddball metric size that does NOT fit any standard adapter.Instead, these theads stripped the fitting on my mike clip, so now I have to go somewhere else and buy a new gooseneck AND a clip.This is such a standard item, that there is no excuse for making it with non-standard threads, and NO excuse at all for advertising it as standard 5/8ths...", "id": 176}, {"review": "I'm in a situation where I have to sit to play due to hip problems, and it has been tough finding the right on stage seat.  For me, a stool is too high, and a folding chair too low, plus I need something that folds in with my other equipment.On it's tallest setting, this gives me the exact height I need. I'm 6', so it might not be high enough for a very tall person.It is also sturdy, I'm very animated when I play, and the support feels solid after several gigs of 2 to 3 hours. The cushioning is nice and thick as well.", "id": 362}, {"review": "I must have had over 20 tuners in the last few decades, and the Snark is by far my favorite.  I change out altered capos every few songs, so I have to tweak the tuning many times each gig, and this has made it much easier, even in noisy clubs with poor lighting.", "id": 707}, {"review": "I ordered this because I have an Ovation, and none of the clip on tuners were able to get a good grip on that kind of headstock.Due to the small size and adjustable clip, this tuner fit perfectly, and well out of the way. It took me a few tries to get used to pushing up on the ON/OFF button, but no problem now.As a tuner, I really like it. The small green screen is easy to read in low or regular light (haven't tried it in bright light yet), the bars for fine tuning are pretty stable, and it did a great job in a noisy gig, where I changed tunings about 10 times during the evening.", "id": 785}, {"review": "When they say small, they mean small.  I had to order the large to get it comfortably on my ring finger, and my hands are not large by anyone's standards.Find the same slide in Large, and I wrote a complimentary review there.", "id": 334}, {"review": "I've been using this for my 'beater' guitar, and it has done just fine in the back of my car, etc. It isn't bulletproof, but you'd have to pay a lot more for airline level protection anyway. Medium padding and a decent sized zipper pocket, more than I expected for the price.", "id": 400}, {"review": "Pretty cool gadget... a whole lot less trouble than opening and closing bottles, cans, or sprays, and does on a set of old strings.", "id": 543}]