[{"review": "This nylon pick has great play feel.  It is stiff enough to pick individual strings and still feels comfortable stumming chords.", "id": 62}, {"review": "The Martin M140 strings are good strings.  They play well and last reasonably well.  I change strings about every 2 to 4 months and play about an hour a day.  These strings lasted abotu 2 and a half months before they started to sound flat.  They did stay in tune well the whole time I had them on my guitar.  I had them on my Yamaha FG700S.", "id": 225}, {"review": "I have used Ernie Ball strings on my Les Paul for quite a while, Slinkys mostly.  I recently bought a Yamaha FG700S and quickly found that the high E string had a very \"tinny\" tone.  I searched the net to see if this was comon with this model, alas I found that it is.So I decided to try some different strings to see if it would help.  I ordered a set of Earthwood Lights and installed them last night.Wow, what a difference.  First the tone is much softer on the E string, second the action feels much more comfortable on strings 1 thru 3.  The strings that came on the guitar were Yamaha light strings but they were very stiff, especially the B string.  After a hour of playing with the Earthwood strings last night they were much more enjoyable, both tonally and physically.  Not sure how they will last, time will tell.Good strings I would recommend them.", "id": 237}, {"review": "I wanted to try the Clayton Beehold picks to see if the hole would help me grip the pick better so that it doesn't rotate in my hand.The .80 pick is a little too heavy for my style of playing but the hole is a neat idea and did seem to help a bit, but I gave up on the pick pretty quickly due to the stiffness.", "id": 792}, {"review": "The Dunlop strap locks work pretty well, but the standard hole cut in a standard leather strap is not big enough to accomidate the locking buttons.  The strap has to be modified by increasing the size of the holes.  This for all intents and purposes means that you will not be able to use that strap with standard strap buttons ever again.They do work as advertised and they are easy to take on and off for strap adjustment when required.", "id": 44}, {"review": "After about a month and a half I have noticed some corrision on the A and D strings at the 4th fret.  That is a little disapointing because these are suppost to last 3 to 5 times longer than \"regular\" strings.  I like the way they sound.  They are a little harder to play than the D' Addario strings that I am used to on my other guitar, and the Martins that I have used in the past.  If I still have to change them every 2 or 3 months they are not really worth the extra cost.", "id": 103}]