[{"review": "The product does exactly as it should and is quite affordable.I did not realized it was double screened until it arrived, so it was even better than I had expected.As an added bonus, one of the screens carries a small hint of the smell of an old grape candy I used to buy, so for reminiscent's sake, I cannot stop putting the pop filter next to my nose and smelling it after recording. :DIf you needed a pop filter, this will work just as well as the expensive ones, and it may even come with a pleasing aroma like mine did!Buy this product! :]", "id": 0}, {"review": "It is exactly what you need in a capo! You can cover all six strings, move one string over to get a drop d tuning or turn the capo upside down to get a partial capo (though a bit of adjusting may be needed to get the strings held down.).All in all, a great capo that is well made and will last forever.Kyser is an awesome small Christian company and I really like their products and supporting them with my purchases. :]", "id": 25}, {"review": "These are my favorite guitar strings! They are very long-lasting and sound great!I would recommend these for anyone, beginners or even people who play seriously or perform. They are very good strings, worth the cost! :]", "id": 103}, {"review": "This capo is great for adding another level to your guitar playing without retuning your instrument!Highly recommended! Just a nice sound it brings to your playing and has a bunch of great new chord combinations to mess around with!", "id": 345}, {"review": "Make sure you read the description of the color you are choosing. Most of them are plastic.I bought the ebony with pearly inlay. They look great, it is, indeed, real ebony with a pearl inlay.The pins are sort of an odd size (not sure if there is a generic pin size...), so they might work, and they might not. They fit one of mine perfectly, and another, not very well. I would assume they fit all Martin guitars well, because my experience with Martin is that their instruments are pretty similarly made in way of parts and quality.Overall, great bridge pins for the price, and they sounds much better than plastic ones!", "id": 392}, {"review": "When I plugged this into my computer and keyboard, it said one MIDI device detected, but I was not getting sounds from my piano onto my computer. I simple took the MIDI in and the MIDI out and switched them, and the problem was instantly solved. If your MIDI is not working right, try what I did, switching the cables to the opposite side. Sounds ridiculous, but it might save you a bit of time. :D", "id": 565}, {"review": "Snark tuners are great. Since I've bought Snark tuners, they have never broken or fell out of tuning capability in any way. I've had some for years that I still use today without ever changing batteries or anything. They are great and last forever. This one is also super accurate and allows you to really fine-tune your instrument. It have a vibration and mic sensor, so it can be attached to the instrument or set aside played in to to get a reading on the pitch that is being played. Really nice piece of equipment for a small price.", "id": 762}, {"review": "I like the Planet Waves instrument cables. The cable material is very bendable and easy to work with. Great so far.", "id": 168}]