[{"review": "Not much to write about here, but it does exactly what it's supposed to. filters out the pop sounds. now my recordings are much more crisp. it is one of the lowest prices pop filters on amazon so might as well buy it, they honestly work the same despite their pricing,", "id": 0}, {"review": "I've been trying out different gauges to experiment with different fretboard feels. These strings I have to say, stretched out and stayed in tune much faster than slinkys. They have great sustain and sound nice and chunky. I love the luster and shine of new strings, feels nice ans springy. Since this is my first time with this brand, I don't know how long they will stay good, but we'll see.", "id": 156}, {"review": "I've got 5 effects hooked up to this thing. It fits beautifully and powers all of them at once. Have no problems with this. I recommend it!", "id": 192}, {"review": "Defiantly a space saver. I can put all of my effects side to side ad hook em up with these patch cables. It's very convenient that they are angled like so, for low profile fits. My only complaint is that they easily fall out of the socket if you jostle them too much.", "id": 207}, {"review": "This is my first time using a hybrid mix and ti does take some getting used to but I enjoy the heavier bass sounds it provides while maintain easy to bend higher strings. Installed with no problems, plays pretty well so far. It stays in tune pretty well, it's still the first day and the pitch is holding well.", "id": 240}, {"review": "For the price, this box works just as well as as any expensive one would. Just put in a 9v battery and it works right away. Three knobs to control tone, level and distortion to get that perfect sound. I do recommend you get a power adapter, because this eats us batteries like crazy. I accidentally left it on for a few hours and the juice was all dry, batteries are expensive, get the power supply. Overall, this is a good budget buy, you won't need to money for quality with this.", "id": 280}, {"review": "I needed a new bass strap because my old one was frying at the ends. I choose this one because it was very durable. The nylon is very strong, I do not see it fraying in the future. The leather eds are nice and thick so the hook wont slip off the strap pegs. The guitar pick pocket on the the leather ends is a nice addition to keep your picks at hand. Good colour selection too. Highly recommended!", "id": 285}, {"review": "Restrung my guitar with no problems. These were my first set of new strings so I dont really know what to fuss about hen comparing strings but these seem to work fine and have a great tone. I can really hear the difference between new and old strings. The strings are nice and smooth, and springy, very easy to press on.", "id": 349}, {"review": "I get a lot of grease on my guitar from lotion, sweat, fingerprints, dust, what have you; I take some of this, spray it on a cloth, give it some elbow grease, and my guitars are shiny as the day it was made. I use it on my acoustic and electric guitars. The bottle lasts pretty long cause the mist is pretty fine. I use two sprays on the cloth for the front side of the guitar and then repeat for the back. It has a fresh lemon scent. I recommend this to everyone, a lot of product for an affordable price.", "id": 351}, {"review": "At this price range, this little effects pedal does admirably. You can get pretty decent sound out of this. No need to spend a lot, especially if your'e on a budget this is pretty good. I took off one star because the tone is sort of weird sounding in high-gain situations. Other than that I've had no problems. Holding up well.", "id": 355}, {"review": "Overall this is a pretty good stand. It is sturdy and has good adjustable heights. A good value if you have lots of stuff you need to hang on it. I took one star off because the bottom part is kind of awkward fro holding up the guitar as the guitar strap peg is at the very bottom and is the only thing touching the bottom of the stand which make sit easy to fall and I've had it fall a number of times. I'm just thinking that they could of designed the bottom wider. Also the edges of my guitars are always touching as if there is not enough room for them on the stand.", "id": 516}, {"review": "I've had this for 4 days and so far it's still working perfectly. I use it for my distortion box as a lot of people are as well. If you're looking for a 9v power supply with negative tip for your effects box, this is great.", "id": 521}, {"review": "Not much to day, it's a polishing cloth, it cleans your guitar, and it does it right. Good price too, nothing to complain about.", "id": 572}, {"review": "Reverb effects are no cheap but I was on a budget so I got this particular one. The balance between quality and price is good. The depth of  sound sounds great. I love all the options you get with this pedal.  The package comes with a bunch of stickers which I thought was kind of cool.", "id": 699}]