[{"review": "Perfect for my obscure use.I discarded the mic clip (or more so, added it to my collection,) and attached a RAM mount to the gooseneck. Now I have a universal articulating mount on a flexible post. What to do with it? I use this contraption to watch movies on my ipod touch on long flights. No more holding a little phone-sized thing up to my face for hours on end. This stand and the mount get the small screen right up to my line of vision.", "id": 633}, {"review": "Maybe they included some sticky pads and I missed it? This thing is great in theory, but it gets knocked off my desk periodically when it doesn't have a guitar resting in it.It does well at its job when it's in use, i.e. it doesn't fall when there's a guitar, but I think I'll use some tape or sticky gunk to help hold in place while it's lying in wait. ;)", "id": 746}, {"review": "The price is great.The sound is good.The power jack, however, leaves a little to be desired.My standard Boss daisy chain power supply cable comes out of this pedal 10x easier than any other pedal.I've now secured it with tape, so it should be ok.Based on other reviews, my guess is that I just got a dud and that most of them are okay.", "id": 795}, {"review": "So stiff. Nothing short of a five pound weight will cause this extension to buckle. If you sing and use effects pedals for an instrument, and can't rely on a good boom microphone stand being at every venue, get one of these and throw it in with your gear.", "id": 176}, {"review": "Used one of these when I forgot mine and loved it so much, I had to get my own.-- Small, takes up only one spot on a power strip or outlet-- Long cord is great!-- Enough juice to power all of my pedals simultaneouslyTotally worth the buy. Do it!", "id": 191}, {"review": "This is my first time buying a guitar without testing it first.I have no regrets.All of the positive reviews extolling the virtues of this excellent guitar model are spot on.If you're in the market, and don't have a grand to spend on a new acoustic guitar, get this North American made gem.You won't regret it.", "id": 432}, {"review": "Broke one of my Snark tuners when I kept it on a guitar while putting it in the case to take to a gig and decided I needed a tuner I could keep on any guitar while it was in any case.Pros:- Fits on any guitar- ...which then fits in any case- Cheap- AccurateCons:- Calibration button and on/off button are same shape, same size, and on the same tiny surface. Very easy to hit the wrong one.- Not great (poor viewing angle) for 3-on-a-side tuners (works better for 6 in-line tuners)- Not as easy to read as the SnarkOther thoughts:I only use this on a guitar that I play for only one song at shows (because the song requires two capos and a detuned string, don't ask.) I much prefer the Snark, but apparently I can't be bothered to remember to remove a tuner before putting my toys away. Idiot. At shows I rely on a tu-2 stompbox for tuning. Basically, this is a niche tuner. It's so stinking small and that's what counts.", "id": 785}]