[{"review": "One of the my favorite thigns about Strats is how easy they are to modify/customize. After about 10 years with my American Standard, I was itching to change up the look so I changed out the pickguard and then wanted to give it a nice vintage look with some aged knobs and pickup covers. I didn't need the back plate but this kit was cheaper than buying all the parts I wanted seperately. The back plate is a single-ply, mint green so if you go for a mint green pickguard and want the aged accessories, this will give you a matching back plate. You can never go wrong with real Fender parts.", "id": 222}, {"review": "I never really had an issue with tuning stability with the stock tuners on my American Standard Strat. What interested me the most was the easy string changes and locking tuners have really helped with that. But I have noticed that it does stay in tune better than before. These are easy to install and simple to use. All you need is a 10mm socket and your are set. As others have pointed out, these are staggered so there are 3 long ones and 3 short ones so you need to make sure you get them on the right way. It only took a couple of minutes to install and they fit like a glove. I've read some people complaining about the additional weight on the headstock but I don't even notice the difference. They work just like genuine Fender parts would be expected.", "id": 387}, {"review": "I swapped out the pickguard on my American Standard to a black one so I figured I'd change the back plate as well. While nobody really sees the back, it drives me nuts when the front and back don't match. Because I didn't want to go without a back plate, as some people like to do, I picked this one up. The holes lined up perfectly and it literally takes less than a minute to install. You can't go wrong with genuine Fender parts.", "id": 562}, {"review": "I ordered these because I wanted to deck the tremolo on my Strats because I don't really use the trem. I have a modern American Standard and an American Vintage Reissue Hot Rod 62 Strat. There are differences in the bridge and tremolo block but as far as I can tell the springs are the same other than the modern ones are black. My Standard now has 3 black and 2 silver springs but the 62 Hot Rod has 5 of the silver which are a perfect match for the ones that it came with. Easy to install and works like a charm.", "id": 676}, {"review": "I've been a Fender player since I first picked up the guitar. I've used different strings from D'Darrio to Ernie Ball and now I always use Fender strings. For Stratocasters I always use Super Bullets and for Telecasters I use Super 250s. The only difference between the two is the bullet end vs a ball end on the 250s. The bullet end is designed to give you better tuning stability with the tremolo on a Strat. I don't use the tremolo very much so I don't know how critical it really is for me but since the super bullets cost the same as the super 250s I figure I might as well get the ones that are designed for the Strat. Also, these are the OEM strings that Fender installs at the factory so you can't go wrong with that. I highly recommend them.", "id": 679}, {"review": "I'm a long time D'Addario user. From the time I started playing I've tried most of the different brands out there and always end up back with my D'Addarios. I got the .09's to try on my Strat and the .10's to try on my LP and found that these new NYXL strings do have a little better output and stay in tune a little better but the trade off is the cost. Currently they're $11.99 on here compared to $4.99 or less for the regular version. So if you burn through a lot of strings, that may be a consideration. I don't go through strings that frequently (I'll change on each guitar every 2 to 3 months) so it's not a big concern for me.", "id": 897}, {"review": "I picked this up because I wanted to change up the looks of my 3-tone sunburst American Standard. The holes lined up perfectly and it was easy to install but that's what you'd expect since this is a genuine Fender part. The only concern really is whether or not the color will work on your guitar. At first, it took some getting used to as it really darkened up the look of my Strat but I like the way it came out with aged white pick up covers and knobs.", "id": 217}]