[{"review": "There are plenty of flashier - prettier - modern-er looking or more nostalgic looking microphones out there.  Its all just so much marketing garbage. These mics are the best mic for the buck out there.  Anyone who claims to be able to tell the difference between this and far more expensive ones is blowing smoke up your a**.", "id": 20}, {"review": "I bought two to run from my amp to a lone pedal effect that I use with my bass.  The 90 degree ends go to the pedal and it makes for a non-intrusive smart looking setup.  I'm pleased.  I've owned them for a few months now.  No issues at all and they look good.", "id": 47}, {"review": "Not much I can say about a standard mic stand.  Unless it was a cheap piece of crap.  This one is not.  Nice heavy base plate.  Here is my only complaint:  I went to remove the UPC sticker on the shaft and now I have a mess.  I'll try some WD-40 to get the annoying residue off but for crying out loud, can't anyone come up with a sticker that is removable without a headache? And as an end user, a UPC sticker serves nobody. Why is it even there?  Put it on the box it comes in but get it off of the merchandise I'm buying!", "id": 231}, {"review": "I've used this for about 3 months now.  No malfunctions. Looks good. Works fine.  No complaints. What more can I say?", "id": 587}, {"review": "Well built.  The adjuster end is deeply notched so it can be set for a wide range of angles in about 8 or 9 degree increments.  (10 possible positions between upright and horizontal)  Best for setting up drum mics as it would hold position better than a gooseneck. I'm using it in a vocal mic application as it pushes the mic a tad further away from the  stand to give  me a bit more room.  But there is no counter-weight here so its best used at shallow angles.  If I was playing a thicker instrument like an acoustic guitar, or if on-stage energy has you moving a lot more, I would opt for a boom stand instead.", "id": 142}, {"review": "So I have these old EV mics and the little foam piece on the inside of the ball dry rotted and crumbled.  These provided an easy inexpensive solution.  No complaints.", "id": 778}]