[{"review": "I like this product, but wish it had a wider foot or base to it for carpeted areas, it does get a little unstable on carpet.  Does fine on hard floors.", "id": 321}, {"review": "Good medium picks, decent feel and sound.  Would recommend for practice picks, pretty decent on noodling.  Girlfriend likes the colors. hahaha", "id": 574}, {"review": "Easy to use, accurate, programmable, lights up, easy to read, decent quality.  I like it, Korg has never disappointed me.", "id": 595}, {"review": "I got this to help clean my strings after constant playing to help preserve them and keep them from having oils from my fingers cause them to fail.  Saves some money on replacements...I found another product that actually gets the top and bottom for a better cleaning of the strings so I like it better as far as the whole purpose of cleaning the strings.  I use this to apply my cleaner to the fingerboard now for a deeper cleaning.", "id": 730}, {"review": "This holder is rigid, well built, rugged and works great at what it does...holding my iPad2.  I play guitar and like to use my tuner app and scale app, metronome and other apps and having this hold my iPad so I can adjust it and see it clearly where I want it is nice.  Great product, highly recommend.", "id": 793}, {"review": "I didn't know a little battery powered amp could sound so good.  It sounds just as good if not better than my Roland Cube 20, of course without the effects and such, but still, a great little amp for practice and a little gig with family and friends.  Puts out pretty good power for a little 5w.  Has a great sound in my opinion.", "id": 76}, {"review": "Makes my guitar look great, from the fretboard, strings and body.  Everything conditioned and polished.  Great quality product, highly recommend", "id": 95}, {"review": "Its a little unstable at times, but the fasteners and adjustment areas on this stand do keep the stand in place and such that it can be good for a sound studio or classroom setting, not sure if I would recommend it for professional use, but that's why you spend more for better quality right?", "id": 279}]