[{"review": "the mini amp did not arrive with the battery as it was stated in literature. good thing I had purchased the 9volt power adapter. I was really surprised at the output considering how small the speaker size. ideal for kicking aound house and small partyof friends. should already come with 9volt adapter with along cord. it would be worth the increase in price to have it come altogether. would purchase again,", "id": 303}, {"review": "sturdy, strong, good quality cable for guitar, especially like  the fit with the right angle plug. would purchase again if need bd", "id": 419}, {"review": "could use a longer  cable  but it does work as it was suggested, and would purchase again if I needed to.", "id": 521}, {"review": "works as it shoukd, better instructions could come with it with a larger size text. also how to open to replace battery as well as the specs on the battery are lacking.", "id": 763}, {"review": "I chose this rating because even though it is an Epiphone, a Les Paul and affiliation with Gibson it is made in China NOT the USA as one would think by the name affiliations.  I think that fact should be pointed out in the advertisement that is is NOT a USA product. When opened, the white pick guard as showen in the picture was missing from the body of the instrument but I did find it in the pocket of the soft carry case. The white pick guard should have come attached to the body from the factory. So someone messed up in QUALITY CONTROL. With that said, I find the finished look is fine without the guard, the tone sounds good when not electrified and the sound is good when electrified. I decided NOT to send it back because everything else appeared ok when using it.", "id": 772}, {"review": "Works very well although I wish it had wider strapping or a choice of purchasing with a wider strap. Don't hesitate to purchase.", "id": 824}, {"review": "Solid music stand made of heavy metal poles and solid metal music holder. The joints that you tighten are made of a heav plastic material. If anything were to give out from use it would be the plastic parts. Right now in brand new condition everything fits well and grips solidly to hold poles in place. Arrived a day eRly.", "id": 155}]