[{"review": "You can never go wrong buying a Kyser capo.  They are made to last and really do what they are designed to do.  The great thing about this capo is that it fits both my banjo and mandolin so I don't have to have a seperate capo for each.I also have a capo for guitar made by Kyser and I can tell you that works just as well.  You can never go wrong with a Kyser.  Not only that I like the idea that it's an US company.  I've had some cheaper capos and they just don't do the job.  They either don't press down on the strings hard enough or they wear out too quickly if they get used much.  This Kyser will last a long, long time.", "id": 43}, {"review": "I've used these strings on all my acoustics and even gave some to a band mate.  They seem to keep their tone for a long time and don't change the instrument tone like some strings I've tried.  Like a lot of folks, I'm not that picky about my strings, but for those who are, this is a good light string that will sound great on your acoustic.", "id": 59}, {"review": "I got this for my Ibanez acoustic and found it was a real challenge to get it attached at the neck.  It took a few trys before I could get it buttoned so the strap would stay put.  Even so it was a good quality button.  The leather is tough and will last for years.  It will probably outlast the guitar.If you're looking for a good way to attach a strap to the guitar neck is a possible option.  Maybe if you have a Martin it might be a better fit.  But it's really worth the hassle.", "id": 122}, {"review": "This is a great microphone.  It fits easily into all the recording equipment I'm using.  It has some heft to it so I know it's not going to fall apart and be some wimpy microphone.  It gives me great sounds.", "id": 213}, {"review": "I was given a violin (fiddle) by my friend who decided they would never really learn to play.  The violin hadn't been used in quite some time so the pegs were really loose and wouldn't tune at all.  I got this product to see if I could fix the problem.  It worked just as it said it would.  A drop or two on each peg tightened them up enough to be able to tune the violin.Now that it's being played more regularly it's easier to tune, but know that if they pegs get loose again I have the product to fix the problem.", "id": 359}, {"review": "This item was purchased because I'm doing self-teaching on the fiddle.  I figured it would be a good idea to have this to train my fingers while I'm learning.  Since I'm used to fretted instruments this helps me visualize where my fingers should go.  I like that it has the different colors for the different finger positions.  I also like that it has perferations along the template so you can put as much or as little of the indicator on the fingerboard as you want.It did take some measuring to get this in place.  I had to be very careful to put it on squarely.  The closer I got to the bridge the more difficult it got and it was a little out of line, but not so much that it would affect how to use the template.One things I had to deal with was to make sure I had a MM measuring devise.  The bridge of the violin had to be 325 mm from the nut.  It took some doing, but I was finally able to get the bridge in the correct position in order to make sure the fred indicator would give me the correct notes.", "id": 770}, {"review": "I've used this strap on different guitars and it works great on all of them.  If you're looking for an economical strap this will work great.  My experience has been that Ernie Ball makes great products.", "id": 74}, {"review": "I had some other rosin that was just a mess to apply.  This rosin is great because it's encased in a wooden sleeve that leaves your fingers free of rosin.  It's so easy to apply and doesn't leave any messy residue on my fingers.  I haven't been playing the violin for very long but did know I needed something to rosin the bow easily.  This was exactly what I needed.", "id": 78}, {"review": "Bought this cover to go with Behringer mic.  It does what it's designed to do.  It was a little hard getting it onto the head of the mic, but at least that way I know it's not going to be falling off during a performance or a recording session.  Economical way to keep spit out of mic", "id": 178}, {"review": "Purchased this cord to help set up mic for some band recording at home.  The cable is great because it's long enough to allow us to move our mic where we need it.  I got this item much quicker than I expected.  The shipping was fast and the product was in perfect condition.  Seller is A+ in my book.  If we need more of this type of equipment would certainly buy from them again.", "id": 692}]