[{"review": "I started using Kyser capos a couple of years ago and have never looked back since. I now own several of them and have not had any problems with any of them. They work great on acoustic and electric guitars and they have survived the many children I teach lessons to even though they get treated rather rough at times. Great capos. You won't be disappointed.", "id": 25}, {"review": "This is a handy little tool. The winder is nice and the clipper works well. It doesn't pull the bridge pegs out so it doesn't get five stars from me. And don't be too rough when winding or it will break.", "id": 94}, {"review": "This is a lovely wall mount for your guitar. Comes with everything you need (except a drill or a screwdriver of course). It is pretty and very strong. I originally purchased it to hang on drywall (sheetrock) for my 5 year old's mini guitar but once I had it mounted I found that it is strong enough to hold MY ELECTRIC guitar, which is quite heavy and that is amazing to me because usually that kind of weight would pull a mount right out of the sheetrock. This is a good buy.", "id": 166}, {"review": "I can't compare this product to any others because this is the only pick holder I use. I have bought dozens of these over the years and have one on every guitar I own. And every student I've ever had, has one on their guitar as well. They are very strong and the adhesive is outstanding. They stay in place for as long as you want them to and at the same time, they can be easily removed and relocated. After relocation they are just as sturdy in the next location as they were in the prior location. I have had as many as 12 picks stored in one and as few as ONE pick stored in others. No matter how many picks you store, or for how long, the spring action loader never loses its resistance. I highly recommend these. I personally will never even try any others as I am so pleased with this product. If you or a student of yours tend to drop a lot of picks, this is the product for you.", "id": 167}, {"review": "I love this stuff. I've tried many fretboard and string cleaners but this one works the best. And in case you are wondering, it comes with a cloth cap attached to the bottle under the twist off cap so all you have to do is turn the bottle upside down and clean away. You may need an additional cloth in the beginning to wipe off the excess liquid because the bottle is full when you first get it (of course). I highly recommend this product.", "id": 234}, {"review": "This is an excellent gig bag. Plenty of compartments for all of your accessories. Well padded and has enough carrying options. A good buy.", "id": 468}, {"review": "I have tried several different kinds of guitar tuners and of the ones I have tried the Snark is the best. It is more precise easier to operate and just simply looks prettier. I highly recommend this tuner.", "id": 706}, {"review": "The Fender slick string cleaner works great when it is brand new. The great part about it is the design. The fact that it is wide enough to run along all six strings is a definite plus. The things I don't like about it is the top does not close tight enough and can come off during any kind of travel. Once the top is off or just not closed properly, the pad dries out and then it is useless. Also, the little cloth that comes with it is almost impossible to fit back inside the container once you have opened it. As stated it was really good at cleaning and was easy to use but I was only able to use it once because the top came off and it dried out. Unfortunately because of that I would not recommend this item. Go with the Fast Fret.", "id": 730}, {"review": "Good tuners. Can tune several different instruments. Just be careful you have it set to the right instrument when you are tuning or you will go through a lot of strings. I have several of these. They are a great size and can be left on your instrument if you desire. Personally I prefer the Snark tuner but these are a fairly close second.", "id": 799}, {"review": "I love these picks. I buy tons of them all the time. If you are like me and prefer to just strum tunes on your acoustic then these are the picks for you. I prefer thin picks for basic strumming as I am a beginner guitarist and they are more forgiving.", "id": 332}, {"review": "This is just an excellent product. I have been using this product on my guitars for over a year now and as long as they keep making it, I will keep using it. You only need a very little bit to polish the entire guitar and you don't need to use it for every polish. Once you put it on initially, you can simply buff your guitar with a dry cloth for the next two or three cleanings and the shine comes right back. There is enough in one bottle to last a very long time.I highly recommend this product and would like to also refer you to the Dunlop 65 lemon oil for cleaning your fretboards. The lemon oil very quickly removes any residue and shines the fretboard up extremely well. When it dries, your fretboard is beautiful and very smooth for all your bending and sliding tricks. 50 stars.", "id": 351}]