[{"review": "I have found Hosa cables to be an excellent value. More expensive cables may be more rugged, but for the price, I'm very happy with the Hosa's I have purchased.", "id": 6}, {"review": "Looks vintage but works great at a great price. As good or better than my Monster cable for a lot less money!", "id": 47}, {"review": "What  great idea to put all three tools needed when changing strings into one tool. The cutter even works well.", "id": 94}, {"review": "It's well made and is fine as straps go but the pick pocket isn't much use. The picture implies that it hold the pick so that it's partially exposed and easy to grab. However the pocket is bigger that this and fairly loose so that picks tend to fall out when taking the strap off.", "id": 285}, {"review": "This is the large? I can't see how anything any smaller could be of any use at all. The lines for the strings and frets are very close together.", "id": 361}, {"review": "Snark tuners are great! They are very accurate and are very inexpensive. I have three of them so I can keep one in each guitar case.", "id": 706}, {"review": "Snark tuners are great! They are very accurate and are very inexpensive. I have now four of them so I can keep one in each guitar case and one for the uke!", "id": 763}, {"review": "I love these little guys. The small size forces me to hold it so just the very tips is exposed. They have a nice textured grip. I bought the red ones this time so I can see them when I drop them!", "id": 68}, {"review": "I got this at a great price so decided to give a strobe tuner a try. If you're accustomed to vibration tuners it takes some getting used to it. While it may technically be more accurate than the cheaper vibration tuners, this advantage is of limited use given that the tuning of guitars still has to have some compromise from perfect in order to be well intonated. One advantage over the clip on tuners (by the way, you can't beat Snarks for the price) is that because it is electronically connected to the guitar it is not affected but other instruments that may be playing at the same time. I've noticed that while trying to tune when playing live by clip on tuner seemed to get &#34;confused&#34; by other instruments.", "id": 651}]