[{"review": "I was upset when I bought the mic stand and didn't know the clip didn't come with it.So I had to order a clip later.Nevertheless, It has good design to dampen the shocks.It is also rubber in construction so it won't crack like the other low quality clips.It is a bit big for the cabled mics (so you have to insert it deeper to hold it snag), but for wireless mics, it is good.I would recommend it.", "id": 247}, {"review": "Can't say I've tried all of the capos in the world, but I've had my share of the different designs.First I had the bungee cord type, then I had the snap on type, then I had the different capos designed for acoustic, or classical or electrical.This one by far, evolved from good design.The bottom curve portions fits the neck of my guitars just perfectly. The top portion is just wide enough to cover the strings.  The spring allows for adjustment for the optimal tension.The design on this is so that every string receives the same vertical pressure down to the neck. All of the others I have tried use a spring that could pop out (one actually did) and the entire capo came apart.This one even has a pick holder built in.It is light weight, just the right size.I highly recommend this capo if you need one for acoustic guitar.", "id": 843}, {"review": "I like Elixir.  I had to try this one because of another friend said it's ok and cheaper.I tried it and the quality is low end.The sound is not as crisp.The gauge is too heavy for my fingers (not their problem)All 6 strings are wrapped inside one single bag.I'd go back to Elixir next time.", "id": 130}, {"review": "No where on the description does it say that the mic clip is NOT included.  The only place is on the box AFTER you have received the item.  There's no instruction (which is fine). But in the product description it doesn't say that you must purchase the mic clip separately or you can't use it.I bought this and have it shipped second day because I need to use it and now I can't because it doesn't come with a Mic Clip which I have to spend another 5-10 to get it plus shipping.  The price is the stand is reasonable had it included the mic clip.  But without it, I felt cheated.", "id": 279}, {"review": "I bought this to replace another adapter that came with the Yamaha keyboard I bought at Costco long time ago.The original adapter was bulky and heavy and that's what caused the wires inside to break.Tried to stripped the rubber coating and soldered the wires together, but after short use, the heavy head of the adapter still ripped the wires apart.When it is big and heavy, when you unplug it, sometimes the kids hold the cable instead of the adapter.But the cable can not support the weight thus making it rip.This new design is actually a bit more powerful but only a fraction of the weight and size.It works beautifully the moment I plugged it in.BTW, I am using this NOT on the CP series.  It actually works for the cheaper keyboards too.My CP33 has this identical adapter which I tested on the other cheap keyboard before I bought it.It's great.And shipping was fast.", "id": 476}]