[{"review": "I picked up this Behringer CT100 cable tester because it takes the guesswork out of maintaining a cable collection. The unit does its job very well and it helped me find several bad cables that I previously thought were ok. It is well built and sturdy. The bottom of the tester has sharp metal corners and screws that could damage a wooden table. I suggest you get some adhesive rubber pads to support the underside.Although the machine itself is good, the accompanying documentation is awful. It presupposes a working knowledge with audio equipment that many users may lack. For example, it does not include illustrations of how the LCD readout should look when a cable is good or bad. I had to go to an audio engineering forum to find a diagram. As it turns out, the Behringer CT100 is an inexpensive knockoff of the Morley Swizz Army cable tester. The manual for the Morley unit is available online and it has diagrams that make the testing easier to understand.", "id": 318}, {"review": "I bought this effect because I saw a few YouTube demos that made it look pretty good. I had always wanted an attack delay effect and the Behringer Slow Motion was priced well below all competitors. When it arrived, I tested it thoroughly and found that it is tricky to learn and limited in scope. It only works well under these circumstances: All notes must be played slowly, individually and deliberately in order for the attack delay effect to kick in. You can't play a quick series of notes and expect the effect to work properly. Having said that, I found that the effect is nice, once you have mastered the technique. I tried to use it in conjunction with overdrive and sustain pedals and it did not work well at all. Other reviewers have suggested using it with a digital or analog delay pedal, which I have not tried. I considered returning the unit to Amazon for a refund, but I don't think that would be fair as it DOES work to some extent and it didn't cost me a lot of money in the first place. However, I do not think I would recommend it to a friend.", "id": 449}, {"review": "This Behringer DD400 delay unit has a lot of great features. I particularly like the stereo outputs which allow the user to send the delayed signal to a separate amplifier for a dramatic stereo effect. The extra-long 1300 millisecond delay is great for Pink Floyd/David Gilmour style solos. The shorter delay settings allow for rockabilly slap back effects, although I hardly ever play in that style, so it doesn't matter that much to me.Here's where it gets weird: I tested the unit using a vintage Fender tube amp for the primary signal and a Vox Valvestate amp for the delayed signal. As long as I played loudly, everything worked quite well. However, when I set the guitar down for a moment, I started hearing voices. Yes, voices! The delay unit was picking up radio frequency interference a la Jimi Hendrix at Berkeley. I have no idea HOW it was doing this, but I could clearly hear some sort of radio transmission like CB or family band radio. The interference went away after a few minutes.As for design, I don't buy the \"German innovation\" advertising line from Behringer. This is obviously a cheap Chinese copy of the legendary Boss DD-7 which costs four times as much. If you want really good quality, buy the Boss unit! If you can get buy on a fairly cheap delay unit that talks to you from time to time, the Behringer is ok.", "id": 488}, {"review": "The Behringer US600 is well-made. The high impact plastic housing should hold up well as long as it is not abused. It is sufficiently quiet in all modes and it does not seem to color the sound in the bypass mode.I purchased the US600 specifically for the &#34;Detune&#34; effect. This effect works quite well with single coil pickups going through tube amps. The effect is particularly dramatic when Outputs A & B are fed into two different amps, giving a nice room-filling stereo effect.I was pleasantly surprised by some of the other effects. The Pitch Shifter produces a very nice lower octave effect, about as good as I have heard anywhere. When using both outputs, it is possible to feed the original signal into a guitar amp and the lower octave signal into a bass amp. This makes the guitar sound HUGE!The Harmonist effect is amusing, but it has limited uses. It won't make you sound like Duane Allman and Dickey Betts playing in harmony. However, it is handy for short solos. I tried it in the key of G and got useful results.The Trem Bar would work well in loud uses like metal. The Flutter effect gives a nice Leslie effect sound.Overall I think this device offers more value than many more expensive pedals. I have seen several speak ill of it, but I'm not sure they took sufficient time to learn how to use the pedal. There is quite a learning curve on this gadget, but fulling results are obtainable if one takes time to master the device.One other observation: This is more of a studio effect than a road effect. There are many individual adjustments that need to be made in order to calibrate each effect. It would be difficult to do this with the box on the floor. I had to place it on top of my rig in order to access the control knobs and make adjustments. The only way it would work well as a floor pedal would be it the device were dedicated to only one effect (Detune, for example) while gigging.In conclusion, I debated for months whether or not to purchase this effect. I'm glad I finally decided to get it. The great sounding Detune effect alone makes it worth the price. The Octave effect from the Pitch Shifter is a nice bonus. The other effects are icing on the cake. Kudos to Behringer for building another reasonably priced effect for the home studio enthusiast and the weekend warrior!", "id": 505}, {"review": "I bought this adapter to power several devices by different manufacturers. Thus far, I am very pleased. Some of my guitar effects require at least 320 milliamps, which this adapter handles with no problems. I have heard no hum or noise from the adapter, either. It does its job reliably and well. I would definitely recommend it to a friend.", "id": 521}]