[{"review": "Hosa products are a good bang for the buck. I haven't looked up the specifications, but I'm guessing the wire is 22 to 24 AWG, but since it's only 10' long, it's good enough.", "id": 5}, {"review": "I use the 1.5 mm Dunlop Gator Grip for twenty years. The non-slip surface doesn't take long to wear off, but I have a work-around. I've even put them in a vice, and filed new points on them. I prefer an extra heavy pick because there's no delay from pick deflection.", "id": 65}, {"review": "Years ago I used the Clayton &#34;small teardrop&#34; picks. I couldn't tell from the picture, that these were full size, and I didn't check the size in the description.  I still had a few of the small ones, so I used them as templates, to cut these down. I would have rated them higher, if I could have used them as is. It's my own fault for not looking at the specifications. I purchased two six packs of Clayton Teardrop picks, but found Dunlop 423R60 0.60mm (Orange) Tortex Small Tear Drop Guitar Picks, 36-Pack which are a lot cheaper.", "id": 83}, {"review": "I've been using this mic cable for over ten years, and it had come up missing after an event. I looked everywhere I could think of, and thought I had lost it for good. One day, I happened to look between a ball of TV cable wire in the rehearsal room, and there it was. I didn't remember where I'd gotten it, or even the manufacturer. Although I have more than a dozen mic cables, this pliable cable, with it's own elastic clasp, was always my favorite.  I was ecstatic the day I found it, after months without it, and now have a backup. I highly recommend this cable.", "id": 283}, {"review": "I used to have bulk 18 gauge wire, and Switchcraft jacks, to make my own cables. These Hosa cables probably use 22 to 24 gauge wire, but are adequate for the price. The heat shrink strain reliefs are adequate as well. I recommend tightening the housing, because everyone of mine were loose.", "id": 419}, {"review": "It is well made and is very safe unless a drunk drummer knocks over your stand. I would prefer more tilt, but it serves the purpose. It's Also harder to use your iPad without holding it and having an arm rest. Very durable and light weight. If I had to do it over again, I would use a music stand instead. Someday I may use it on stage. It's made in Germany, so it could be taken into battle.", "id": 793}, {"review": "I had been using a full boom mic stand at my studio desk, and since it was off to the side, made it tuff to watch the level meters. This clamp-on boom serves the purpose, but has a hard time holding the weight of my Shure KSM 32 condenser mic. I tuck the goose neck of the pop filter under it, to keep it from sagging. Very affordable, and I found a work around for the weight issue. I wouldn't recommend this if you're doing a lot of recording, but it is sufficient for my home studio.", "id": 867}, {"review": "I own the old Ibanez TS9, that I modified to the original Keeley specs. Side by side, there is a difference, but I only use it for my rehearsal rig.  This is the first pedal, I've had to actually read the manual, in order to figure out how to install the battery!  The instructions tell you to use a ball point pen, to press in the hinge pins, in order to remove the foot switch cover!  I laugh when ever I hear about the &#34;Holy Grail&#34; 4558 IC Chip.  When I modified my TS9, I found that Chip at Mouser, for 15 cents a piece!  It was a net order, and I felt weird ordering 1, so I ordered 5. They send a 10 pound catalogue every month because of that purchase!!!  The Behringer TO 800 is a cheap alternative to the original if you're on a budget, and will do in a pinch. The civilians won't notice the difference!", "id": 381}]