[{"review": "Whatever size you are looking for Dunlop is the best option. It lasts long, sounds great, and feels very nice. It is probably the most favored pick among all companies. I recommend the orange one for beginners, and in general would not go much higher than the green ones because when it gets too heavy it does not feel to comfortable anymore and does not sound as well, but it is totally up to what you want. Either way, Dunlop is the best and for a great price.", "id": 61}, {"review": "I love these microphones, I really do. I also believe that it was really cool they threw in the microphone holders and the case is quite nice. The 2 things I did not like was 1, the microphone has to be really close to your mouth to get a good sound out of it, otherwise it does not sound as crisp. 2, although it was nice of them to include the microphone holders, the items they work with are very limited so make sure that they match up with a microphone stand you want to buy or else it won't screw in. It is good to be aware the wire that connects to this microphone is an XLR Female, so buy the correct wire when connecting to an amp/speaker. For the price I really do recommend these, as long as your fine with having to put the microphone centered,and close to your mouth. Overall a great product.", "id": 405}, {"review": "These have it all. Sound great, play great, feel great, tune great. I am now dedicated to these strings. It takes about 4 or 5 days before the strings are fully stretched and holding onto its tuning. Once it does, it's beautiful music after that.", "id": 500}, {"review": "This Capo does what it needs to do, makes it sound great, and is a great price. There are times where the capo is a little big and the fingers can hit it but in general, it is probably the best capo there is for an acoustic guitar. It does not break, and is very sturdy. Highly recommended.", "id": 603}, {"review": "This tuner looks nice, and works great. It puts guitars into the best tune. It has lasted for over a year and the battery hasn't died yet. Some might say it breaks easily but as long as it is dealt with gently there will be no problems. Great price, great tuner, worth the buy.", "id": 724}, {"review": "The case is very nice and sturdy. It has lasted over a year and will last for more years to come. The inside is very nice and soft with a big pocket to put things in it like picks, tuners, capos. It also has a lock on the case in case one might need it. This is a very good price for a case of this good of quality and I highly recommend it.", "id": 540}, {"review": "I like this speaker system, behringer makes good products when it comes to this. The sound is good and loud, you can control the levels and EQ directly from this so no need for a mixer. You can connect an ipod or laptop to it. And there are multiple sound options including phantom, and instrument. I used a female xlr to 1/4 trs cable but I have been told you can also use xlr to xlr, although I did not try it. The price was great and the wattage was nice. I must say, when we have people come over it is easier to hear them sing. With me playing on the piano it is sometimes hard to hear their voices but now it is equal and sounds nice in harmony. I also connected to microphones to it and it distributes the sound very evenly so it sounds good in a duet.UPDATE: I recently bought a guitar and started to use this amp for my electric fender, IT WORKS GREAT! The sound is great, the wattage is good, everything is wonderful. Highly recommend this amp if you want a small amp for your guitar.", "id": 654}, {"review": "The stand works great. It supports my Casio CTK6250 on the shortest level and can go pretty high as well. This thing folds up so it is easy for storing. It is a bit heavy, but that allows it to support almost any keyboard. This is by far the most stable keyboard stand out there and a great price too.", "id": 883}]