[{"review": "I bought this as a deployment that was shipped to afghanistan from amazon. I wasn't planning on using this as anything but a practice guitar. The way the military palletizes all of its cargo, I figured there was about a fifty percent chance it would arrive in a flattened box with wooden splinters sticking out of it, but I took the chance anyway. It arrived intact, and ready to play. The strings are a bit cheap, but the guitar itself is well made, and has a really nice rich tone. I was planning on giving it away when I left, but I am shipping it home instead, and it wioll cost me almost the price of the guitar to mail it home, but it is worth it. This one has worked out so well I am taking a chance on a 12 string, soon to arrive in Theater.", "id": 183}, {"review": "I was looking for a portable guitar that would survive the rigors of Afganistan. I was going to get the Martin Backpacker, which I have actually seen and held in a store, but other reviews sold me on this Washburn. The case was a particular positive point for me, and so was the 25% lower price. I am more than please with what I have received. The case is great for a traveling soldier, rugged and protective, with useful pockets. The Guitar itself is very well made, nice pegs and solidly built for such an inexpensive instrument. It does have a bit of a banjo like sound because of the small body, common to the type, as is the initial awkwardness figuring out how to hold, since the full sized fretboard overbalances the tiny body, and you can't exactly rest it on your leg like a regular acoustic. The thing is, this guitar is just plain fun, it is always handy, durable, and plays pretty well. Best buy I have made on a product I couldn't try out first. A testament to the quality of the reviews on Amazon, which have rarely led me astray.", "id": 252}, {"review": "I accidently ordered two of these, which proved fortunate because one did not have a battery when it arrived at my APO in Afganistan, where watch batteries are hard to come by. That being said, This is the most user friendly little tuner I have ever owned. I don't have a particularly good ear, but I can tell when I am out of tune, and I have struggled with other tuners in the past trying to get just the right tune. I bought this for a brand new backpack guitar, and I had the guitar tuned up in less than 5 minutes after I clamped this tuner on the neck. These are cheap enough to buy one for every guitar and keep it in the case.", "id": 706}, {"review": "I have used one of the black box meter style tuners for years and struggled with it. I could never quite get the fine tune I was looking for, and I have a little bit if a pitch issue trying to tune by ear. These little tuners are amazing. So easy to use, and portable, and cheap. I have several now, one for every guitar. Cheap is important, because they are made of plastic and I have had one break at the joint after a lot of use. I also received one without a battery, which upset me at the time. I am in Afghanistan and weird watch batteries are hard to come by. If you figure they cost about as much as a fancy coffee drink they provide a lot of tuning goodness for a little money.", "id": 820}, {"review": "Yep. it holds the strap on the neck of my guitar. I have a Washburn rover, a backpacker style, and so a stap is a necessity, and this works just great.", "id": 877}]