[{"review": "Although this mic is now considered primarily an instrument mic, that was not always the case and I've actually preferred this same basic design for live vocal use since 1970 when I bought my first one which was then known as a \"Shure Model 545 Unidyne III.\"  That mic got stolen about 2 years ago, but remarkably was still working at the time it got boosted and I was still using it when I needed one with an on/off switch function.  I've owned or used countless modern day SM-58's and SM-57's along with dozens of other mics over the years from all manufacturers.  I have a fairly deep baritone to bass type voice and I don't need to get closer than about 7 or 8 inches to a SM-57.  To me the SM-57 sounds similar to the $469 Shure SM-7 studio vocal mic if you put a windscreen on it and get about 2 inches away.  I'd only use an SM-7 in a studio environment though because they are slightly more fragile and over four times as expensive.  By design the SM-58's require you to get much closer to the mic to get a full range sound than with the SM-57's.  I prefer the SM-57's over the SM-58's for vocal use because they sound crisper on the highs and they sound fuller on the low end.  The SM-57 sounds more natural on vocals and never sounds muddy or muffled.  The SM-57 has one of the most pronounced proximity effects of any mic I've ever used.  If you tend to shove the mic down your throat you may benefit from the less dramatic proximity effect of the SM-58.  If you are ever going to use an SM-57 for vocals I'd recommend buying the Shure A2WS windscreen with it.  That genuine Shure windscreen fits precisely and locks securely onto the SM-57.  The SM-57 will pop like mad without one.  The only possible drawback to the SM57 as a vocal mic is that there is no model available with an on/off switch these days.  I can't find a modern SM-57 with a switch anywhere.  However, if you've ever tried using a mic when you forgot that the switch was in the off position it probably just became a liability. For my money, the SM-57 is the best all around microphone of the past two generations for stage use and some recording purposes.  For studio vocals I'd use an SM-7, which really doesn't sound all that much different from the SM-57 when the built-in variable EQ on the SM-7 is set the way I like.  The SM-57 and it's predecessors are to me the best all around microphone since 1970 and certainly the most enduring and durable.  You can not go wrong unless you get too close with no windscreen.", "id": 19}, {"review": "The first rule of microphones is that, \"No one microphone is perfect for every purpose.\"  Rule two is, \"Experiment with different mics in different applications to find your signature sound.\"  I've used Shure SM58's along with their ancestors and relatives back to 1968.  I primarily used them for broadcasting and recording spoken word content but I have used (and still do use) them for singing some back up vocals.The SM58 does one thing well and that is vocal performance when used very close to the mouth for public address use.  Some people, me included, actually sound better and more comfortable in a live performance setting when using another mic, the Shure SM-57.  The SM-58 is a very good vocal mic and for some people probably the best choice.  For example, anyone who can not resist putting the mic right up against their lips while singing will probably want the SM-58.  People with softer or weaker voices will want the SM-58.The SM-58 is highly directional and has a noticeable yet manageable proximity effect (which means the bass increases the closer you get.)  This mic does not pick up well from much over 8 inches away.  The reason so many singers think you are supposed to shove microphones practically inside your mouth is because the ball type Shure vocal mics require you to get them very close or they don't sound right.  On the other hand, the SM-57 sounds best several inches away from the user's mouth and works fine up to 12 inches away.  While the SM-58 is certainly the number one professional PA vocal mic, there are precious few other uses for it because it has a colored sound with a prominent frequency response boost in the upper midrange plus a sound source has to be very close before it is picked up clearly.  It works ok for conga drums and the like, but the SM-58 is about the last thing you'd want to use to mic a sax or guitar.  Personally these mics are not the best for my mic technique or the basic nature my voice, but for some people they sound great.  The live vocal mic that works best for me is the Shure SM-57 with a windscreen.  However for other people the SM-58 works better.  It depends on your voice and what you want the mic to do.  If you have a very deep voice, the SM-58 might be the second best choice after the SM-57 which has a better low frequency response.One certain advantage of the SM-58 is the excellent gain before feedback capability.  This mic can be turned up louder than almost any other mic without that annoying PA squeal.  Another advantage of the SM-58 is that it is still available (at a slight extra cost) with a built-in on/off switch.  The SM-58's ball shaped grills are very sturdy and even if you should dent one you can get a replacement which screws right on for about ten dollars.  I've seen SM-58's dented, rusty, dusty, smoked up, spit into, with pieces missing and slammed into a hardwood stage with the full weight of a boom stand adding mass to the fall and yet I've never seen but one stop working and that malfunction was due to an on/off switch that got dirt in it.All the pro-line Shure mics are top quality.  The pro line Shures also hold their value well.  If you buy one and decide you don't like it, you can get about what you paid for it on eBay.  I would compare as many mics as possible before buying one.  Senneheiser's EVOLUTION mics sound really good too and are worth a look. The SM-58 will be the number one on-stage vocal mic for the foreseeable future because most people follow the crowd instead of actually trying out different mics and picking the one that works best for their particular voice.  These things are so durable that even if they stopped making them today they'd still be around for another 20 years at least.", "id": 20}, {"review": "You are looking at what I consider to be the best friend a voice ever had.  During a 40 year broadcast and voiceover career I have used (or been forced to use) every other large diaphragm studio mic on the planet along with the Shure SM7B and it's predecessors the SM7 and SM5.Large diaphragm dynamics have some notable advantages over condenser microphones for voiceover work and solo vocalists in multi-track studio work.  I've used over the years the Sennheiser MD421, EV RE20, EV RE27N/D, Shure SM7B, Shure SM7, Shure SM5 and most recently tried a Heil PR-40.  Sometimes this was not of my own selection, but I just used what was available.  Of the lot the Shure SM7B is my favorite of the ones still available.  The SM7B is a better shielded SM7 and the SM7B of today has a better shock mount than the old SM7 or earlier SM7B.  The shielding in the B model minimizes RFI from computer monitors, florescent lighting, radio transmitter proximity, etc.  The SM7 was a redesign of the SM5.  I consider the SM5 to have been the very best vocal dynamic microphone ever created but it hasn't been in production in ages.  I have used a few ribbon microphones that were also pretty good such as the RCA 77DX and RCA 44 but they were not as good as the SM5 or SM7 or SM7B.Today's SM7B is the best non-condenser vocal microphone still in production.  Stop looking and buy one.  You will not find a better microphone for voice work whether singing or spoken word.  It has a very controllable proximity effect, something that is missing from the EV's.  I can play a SM7B like a violin, the others I just don't seem to have nearly as much proximity effect to toy with for dramatic impact.Everything that is good about condensers for voice work is in an SM7B while everything that is bad about condensers for voice work isn't.DJ's change jobs a lot and I got tired of finding the EV RE20 & RE27N/D mics or the Sennheiser everywhere I went, so I bought my own SM7B.  I never liked the EV's or Sennheiser much and didn't ever feel like they were much of a tool.  The Heil PR-40 is pretty good but doesn't have any on-board EQ options.  For recording not having the EQ is probably no big deal as you can tweak it in post production but for live radio you can't do much of that.The SM7B is a tool for skilled vocal talent, so if you are trying to make a novice sound good you might do better with an RE27N/D but for someone who actually knows how to really work a microphone over then the SM7B is only dynamic large diaphragm mic I know of that can deliver everything a real voice artist has to give.  The reason is that this microphone is designed for one thing, voice work.  The others are more versatile, but the SM7B is \"THE VOICE\" microphone and that was all it was intended to be. It has however found secondary duty as a bass cab microphone and it is pretty good at recording some very loud and boomy sound effects, but it is primarily a vocal microphone.Of all the instruments that have ever been recorded or broadcast, the human voice is the most complex and difficult to capture reliably.  That is one reason vocals sound good on a $4,000 tube condenser microphone, since it can capture all the complexity, inflection and multi-frequency overtones of the human voice.  Unfortunately even these very best condensers also pick up lots of things you didn't intend and also have at least a trace of self generated noise.  If you are doing a dry voiceover you can't hide the hiss of a condenser under something else.  With the SM7B you don't have to.Even for singing this microphone is sort of a secret weapon that kids calling themselves \"Recording Engineers\" today are usually totally ignorant about.  They figure anything short of a multi-thousand dollar tube condenser microphone is inferior for studio vocals and this microphone proves them wrong.If you want a good all around microphone, this is NOT it.  If you want the best dynamic vocal microphone, here it is.  As others have mentioned the output needs a decent preamp but works with all the pro studio gear I've ever connected to it.  I think if you have some cheap USB interface then you will want to put another preamp in front of it and that will make it far more usable for recording whispers.  Most real studio preamps are a good match for it. I've plugged it into some real junky mixers and had it work too.  You need at least 60 dB of gain, the spec sheet actually says 59.  70 dB would be better. Lots is made of the \"LOW OUTPUT\" of -59 dB but it isn't all that much less than the Shure SM58 which is -54.5 dB! -4.5 dB isn't much at all for any decent mic preamp.  But again most of the \"one-box-solution\" USB interfaces with built-in mic preamps is probably going to need some help as they were designed with the hotter output of a condenser in mind.The Shure SM7B comes with the built in shock mount in the stand mounting and yoke attachments.  Every other large diaphragm dynamic has a shock mount made for it but it costs extra.  They all need an external windscreen but only the SM7B comes with one! I got mine 10 years ago when it still came with two windscreens.  It has a nice metal case for storage/travel.  I think now they just come with one windscreen which is the bigger one Shure calls the A7WS but still come in the metal case.  I use the smaller windscreen mostly and Shure calls them the RK345 and their distributors still carry them. The smaller windscreen makes the microphone more open and airy for me and I'd suggest getting one of the RK345's, but that is the only accessory you'll need to add.  The windscreens are held on by some little Velcro tabs but easily interchanged.  They are also very durable for foam screens.On the back end of the tube is a round plate you remove with a hex key and under the plate are multiple EQ adjustments for Flat/Bass Rolloff/Presence Boost settings that you can fiddle with to get the sound you like best. You can just leave the plate off if you want. This is easily the most EQ flexibility of any large diaphragm dynamic.So I'm just adding my two cents worth here and joining the others who pretty much all agree this thing rules for voice work.  I should have written this review earlier but wanted to try the new Heil PR-40 first to make sure I was still an SM7B guy and it took a while for the Heil tryout to happen since I didn't want to actually buy one.  I still am an SM7B guy.  I would give it 4.5 stars but it won't let me do that, since there is nothing better right now in the class I rounded it up to 5 stars, but the SM5 was actually a bit closer to a 5 star vocal mic.", "id": 136}, {"review": "First of all this is NOT the best microphone ever made.  But for what they cost they certainly are more than I expected.  I give it 4 stars as a microphone period, without even taking the low cost into consideration.  They are so much better than the next cheapest thing that they are worth the extra $5 for sure. I bought one Behringer XM8500 then two more a couple of months later planning to use them as rehearsal microphones for a geezer band start up about 5 years go.  However, we actually have used these for vocals at some live performances when the sound tech's personal SM-58's are busy at another job.  I honestly think we sound about the same either way and maybe a little clearer with the Behringers.  At one time Alice Cooper and his band were using the Behringer XM8500's, however they may have moved on now for all I know.These are not Shure SM-58 clones even though they appear to be cosmetic knockoffs.  They have a slightly hotter output and a more flat response to my ears while the Shure's have a more pronounced lower mid boost that makes the male voice sound bigger and sometimes more distorted if not eq'ed correctly.  They are an ideal backup vocal microphone since the Behringer behaves like a compromise between a microphone tailored for a male voice and a microphone tailored for a female voice and actually works well without heavy eq.  It also is if anything more versatile than the SM-58 as it can be useful as an acoustic instrument pickup microphone working for anything that you would ordinarily use an SM-57 to pick up.  It doesn't overload easily, has a high output and a tight pattern with about the same feedback rejection as the SM-58.  It has a reasonably decent blast filter, so if using it for outdoor instrument pickup you don't have to add a windscreen.  Another strength of these is durability.  My 3 have sustained numerous drops, a couple of falls happened while boom stand mounted so not only did the microphone fall but the weight of the boom stand was behind it adding more mass to the force of the fall.  No damage at all to any of them!  I used to cringe when they fell or got dropped but now I just shrug. One weak point about these is they are more sensitive to handling noise, but on the stand handling noise is no issue.  Mine came in hard plastic foam lined cases with stand adapters.  The stand adapters are sort of flimsy but usable. If you want SM-58's you need to buy SM-58's.  If you want a good all around microphone in the $20 to $40 class then try one of these.  No on-off switch on these but we do have switches on some of the SM-58's we use and frankly the on-off switch is a liability!  I don't think you can find a better microphone new for the money and recommend them as a decent all-around microphone for the price.  You can pay more and get less.", "id": 213}, {"review": "This device works.  Here's what it does.  You plug an electric bass into the pedal's instrument input and then you can plug a second standard instrument cable into the pedal's high impedance output jack and then plug that one into a bass amp.  You also can connect it to a low impedance microphone preamp via the 200 Ohm low impedance XLR jack out.  You can use just the high-impedance output or just the XLR output or you can use them both simultaneously.  When the \"footswitch\" is off it functions transparently with no tonal modification at all just like a direct box.  When the \"footswitch\" is on an LED light activates and the tonal boost and tube emulation functions are on.  I put \"footswitch\" in quotes because I use fingers to push it, but leave it on all the time for my personal purpose.  When you insert a plug into the instrument input jack the unit powers on, so if running on battery be sure to unplug the input when not actually using it.Some other functional comments about it.  It runs on 9 volt batteries or a 9-volt power supply. I used batteries for a while but switched to an ac adapter.  Battery life isn't super but satisfactory.  Still if using it a lot, I suggest using an AC adapter.  When the battery starts going it sounds awful, but you could put it into bypass mode to finish the set.  Also when the \"footswitch\" is off and the LED is not lit, this thing functions as a straight XLR ouput direct box for anything you plug into it.  You could patch the output of an acoustic electric guitar or the output of an electric guitar pedal board to it and use that to feed a mixer for recording direct which is a very handy feature for the home recording hobbyist!  The amp emulation and tone controls are wrong for anything other than electric bass, so just use it as a direct box with the tone/emulation circuit off for anything except bass.The controls are all rotary knobs except the Ground-Lift switch which is a slide switch. The controls left to right, top row to second row are:  DRIVE, TREBLE, BASS, LEVEL, PRESENCE, GROUND LIFT SLIDE SWITCH and BLEND.Taking each control one at a time to understand what they do is important because they are not all logically placed.  The DRIVE knob adjusts the amount of gain similar to cranking the input stage control of the tube preamp and here is where you can get something like the tonal thickness (or edge) of overdriven tube tone.  Basically this part of the circuit injects variable harmonics and some of the more pleasing distortion out there for this purpose.  There is no ACTIVE/PASSIVE pad switch or extra active input jack on this pedal so if you have an active bass then you will not have to turn the drive knob up as much to get the tone you want.  The TREBLE knob is a + or - 12db boost and cut of upper frequency tones.  The BASS knob is a + or - 12db boost and cut of the lower frequencies.  12 o'clock is flat (or zero db boost or cut) on both the treble and bass knobs. The LEVEL knob is the master volume control and all it does is control the output volume with no tonal coloration.  The PRESENCE knob boosts the upper frequency range harmonic content for more attack in your tone.  The Presence knob isn't a midrange control, but does boost the upper mids.  The GROUND LIFT switch only effects the XLR output jack and it should be left \"OFF\" unless you hook it up and there is hum.  Then you can turn the Ground Lift \"ON\" and it might help eliminate the hum issue.  However it is better from a safety standpoint to remedy this by eliminating the electrical ground loop conflict that is causing the hum.  The BLEND knob controls the amount of tube emulation injected into the pedal's output with all the way to the left being none, 12 o'clock being 50% and all the way clockwise being 100%.CONS:  Very little bass gear, or anything else, is \"PERFECT\" these days.  Behringer gear has more build issues in general across most of their product line because using Chinese parts and labor is how they keep costs down.  Designed in Germany but built in China means you get Chinese components and Chinese build quality while the specs look pretty enticing.  For example at the first battery change the battery clip self-destructed as part of the clip's terminal stayed stuck to the battery having pulled completely out of the clip.  This was a Duracell battery, the standard for pedal batteries.  Went to Radio Shack and got replacement battery clips and fixed it with a new clip by soldering wires from the new clip to the stripped wires cut away from the old clip and taping up the solder joint.  I've never used this as a stompbox because the switch looks like it will break if you lean on it hard.  Construction is all plastic. The casing is very durable but based on previous experience with plastic switches on stomp boxes I know not to use my size 13-D foot on it.  The Treble and Presence knobs on mine will generate hiss and noise when set very high which may not be noticeable at all on a vintage type bass amp with no tweeter but becomes glaring when using a full range amp and cabinet or when using the XLR output for recording or a PA feed.  Basically I set the Treble and Presence to the point where I hear hiss start, then back off until it goes completely away because that is the functional limit.  Hiss is no issue in bypass mode because the preamp is off.  The jacks, other than the XLR, are the plastic box jacks that are soldered direct to the circuit board of the pedal, These type jacks are noted for causing problems, especially after rough use so take it easy with them and they should last a very long time.  This unit lacks any dedicated MIDRANGE knob but the Presence knob does seem to boost upper mids and treble simultaneously.  Some people who use this pedal as a stage-tool use it as a solo or \"scoop\" switch for slap & tap solos so the presence, bass and treble boost are basically all you need for a solo switch anyway.PROS:  First and foremost the price is almost too good to be true when you consider the price for anything else with similar features, but keep in mind that it has durability issues so be gentle with it and it will last indefinitely.  This isn't a Tech 21 NYC Bass Driver by any means, but works in a similar fashion to one.  I have a Tech 21 Bass Driver Deluxe that I use at gigs.  The Tech 21 sounds better but costs about eight times what the Behringer cost.  I use the Behringer at home and save that wear on my pedal board at home.  If I didn't have the Tech 21 unit I might take this unit to gigs, but it probably will last way longer the way I keep it setup at home all the time.  I especially like this unit when used with small rehearsal/practice type combos.  Many of these smaller combos have passive type tone circuits that basically are at flat when the tone is cranked wide open and this device really makes these little amps sound more serious.  Part of the beauty of an active bass is the tone boost capability you don't get in a passive bass and if you have a passive bass this can make it sound more like an active bass with the treble and bass boost in front of the amp.  It is also useful for boosting a signal in front of a longer cable run to the backline, say anything over about 18 feet.  For recording the XLR direct out is very useful and the XLR direct out can also be used to feed the PA at a gig if your amp doesn't have a XLR direct out.How I use this device:  I have my bass guitar plugged into the input and use the XLR output to connect it to a microphone mixer.  The output from microphone mixer is patched into a Turtle Beach Santa Cruz soundcard in an XP computer. I can then record using the computer's recording software, practice solo or I can play along to recorded music using headphones.  With headphones I can play as loud as I want anytime that I want without disturbing anyone.  Most computer speakers are very inadequate for electric bass, so I recommend headphones instead of your typical desktop computer speakers.  You can buy better computer speakers that are capable, but they will cost about the same or actually more than a decent bass guitar practice combo amp.  Quality headphones cost far less than quality powered computer speakers that are bass guitar capable.Having owned this pedal for about 4 years and knowing what I know about it, I would buy it again.  I would strongly recommend it as a home recording/practice tool but my recommendation as a stage tool is not as strong.  For home use it is fine.  You can use it at gigs but I'd be saving up \"gig bones\" to buy something more durable with better performance.", "id": 378}, {"review": "Ukulele straps are a rare thing and I've yet to find the perfect one.  This one gets close.  Not all uke players use straps, some do and some don't.  Purists say not to use one and that using one makes you look lazy or inexperienced.  However I have two acoustic-electric ukes and they are heavier than the non-electrified ones the purists use.  I've found that using a strap on my electric ukes helps with right arm fatigue from clutching the thing.  A preamp and battery adds a surprising amount of weight percentage wise to a uke when compared to a guitar.  This Neotech strap frees me up to worry about my strumming and fingering techniques more and dropping the instrument less.There is another device called a Uke Leash that also works well.  It ties onto the headstock. I like this Neotech better because even though the instrument isn't balanced perfectly, it is balanced better than with the Uke Leash.  The Uke Leash is easier to get on and off my body so it has some advantage over the Neotech Simple Sling.This Neotech Simple Sling soundhole clip strap works on my Concert and Tenor ukes equally well, but I have to adjust it some when switching it between the two.The wide clip is felt lined and it does not scratch the instrument.  I don't know how long this felt lasts but it seems well attached.  This strap should work fine on any number of various stringed instruments.You have to use reasonable care with a soundhole clip strap on a ukulele or you can damage the top by jerking down on the instrument.  The clip on the Neotech Sling is wider than most I've seen and this extra width reduces, but does not completely eliminate, that risk. The wider clip spreads the stress out.  I've seen other soundhole clip straps with much narrower clips and I'm afraid to try them on a ukulele.  I like this one with the wide clip and will keep it.The Uke Leash type strap that ties on the headstock still requires full right arm pressure to hold the instrument in place, so I like this Neotech soundhole clip device better.The only thing I don't like about it is putting it on is a little clumsy when compared to a traditional guitar strap.  But once on it is great!  You look a little dorky slipping your arm into it and then over your head and you can't do it with a hat on.  It gets easier the more you do it.I'd buy the Neotech Simple Sling again.  I recommend it to electric ukelele players who want to use a strap but don't want to drill holes for strap buttons on their ukes.  Just put it on in private because you look dorky putting it on.", "id": 824}, {"review": "I've used electronic tuners for a long time.  Most of them that I've owned you have to plug into your instrument.  That means they don't tune with a microphone but only with an electronic signal directly from the instrument.  I bought a Korg GA-30 that was about the size of a credit card with a built in microphone to tune acoustic instruments about 8 or 10 years ago.  I used that Korg until getting the Snark.  The Korg was durable and fairly accurate but the LCD display wasn't lit making it tough to read in low light and the needle seemed to jump around sometimes for no good reason.  Still for the money the Korg was a good deal on a tuner with a microphone in it's day.Enter the Snark SN-2.  This Snark will tune about anything.  It will tune either by vibration clipped onto the headstock of a stringed instrument or don't clip it to the instrument and use the built in microphone.  Clip it to a music stand, clip it to anything and it still works when you use the built in microphone for a guitar, upright bass, violin, saxophone, trumpet or even a tympani.  Use the vibration setting for tuning an acoustic or electric guitar or ukulele or mandolin or banjo without interference from other sound sources.  It tunes about anything no matter the notes or key you want to tune your instrument to.  It senses the entire scale.The Snark SN-2 has a well lit, clean and bright display that is easy to read in bright light or total darkness.  The display pivots to any angle.  It is very light so it adds very little weight to the headstock.  The battery seems to last a fairly long time, longer than the 9-Volt battery in my tuner pedal that burns through pricey 9 volt Duracells at the rate of about 1 per month.Long term durability seems to be a question to me due the small pivot on all the Snark clip-on tuners.  I've only been using mine for about 2 months now and while the pivot part seems sort of fragile I've had no issues at all yet and it still works good.  I don't think you should drop it very often.  So far I've dropped mine once with no damage.  Even if it did break, 10 Snarks are cheaper than the rack tuner I have and the Snark is just as accurate.While long term durability is undecided I can't complain at all about the versatility, accuracy, high visibility display or the low cost.  I really like mine and use it everyday on an electric bass or a ukulele or a guitar.  It really gets around and tunes them all.  The color is sort of a metallic red, almost Candy Apple Red.  I ordered spare batteries but haven't needed to change one yet.I'd buy it again and suggest one as a gift for any musician that doesn't have one.  I'm sure they'll use it often.  This tuner is a real good buy at a good price.  Spare CR2032 Lithium batteries are less expensive on Amazon, so I suggest ordering several with your tuner so you'll be prepared.I've never used the metronome feature other than to check it out.  It flashed a locked tempo but I really don't need that feature.", "id": 707}]