[{"review": "This isn't a review of these strings so much as a warning or caveat for those of you playing guitars with floating bridges (usually for a whammy bar) and not using these heavier strings already.I wanted a little fuller sound than the 10-46 slinky strings (aka regular slinky) and the idea of some driving base appealed to me so ordered the beefy's. I strung them up but had a hard time tuning the guitar. Every time I got the higher strings in tune, the lowers would go down as much as a half note. It took awhile to realize that my floating bridge was coming off the body as I tightened the strings. So I pulled the back plate off my strat and set to off tighten down the the tensions screws. I made about 5 adjustments each time retuning the guitar to check my progress. The final time I tightened them down, the high E string broke. Since these were my only beefy's, my day was done with these strings. However, given how far I tightened the tension screws, I think I would have had to purchase an additional tension spring (not too expensive or difficult to install if you have the inclination to do it) to get the bridge flush with the body.As I said, this isn't a knock of these strings. I never really got a chance to play them. Just a heads up for anyone moving up to these heavier strings. It can be quite a shock the first time your see your bridge sticking out at a 45 degree angle to your guitar and if you aren't careful, you can damage your guitar.", "id": 98}, {"review": "After all the whining I saw about these picks, was a little hesitant but bought them anyway. It doesn't help that Amazon puts \"Most popular\" posters above \"Most recent\" so unfortunately the review many of you read no long applies to the product. I got all 12 of my picks in a plastic bag divided in half with 6 picks each. So I got my full order. In addition, I like these picks a lot more than the plastic ones I buy at the local music shop. They feel thicker or more stable or something without being hard. I am very happy and will be reordering when the time comes. These are by far my favorite picks. The feedback is good and they're stiff enough to strike clear tones. A winner to me.", "id": 120}, {"review": "This is an inexpensive but for the money, well built case. I don't have any complaints. My Fender Strat fits snugly in the lined case and while it isn't the most durable case (I wouldn't use it to ship my guitar) it is strong enough for hauling your guitar from one place to the next.", "id": 324}, {"review": "I like to walk around while I play. It's a hangup of mine. This strap works fine for that. The only thing I've noticed that can be annoying is that strap moves easily across my back so it is very easy to get the guitar out of position (the neck too high or too low). Other than that, it's a good deal for the price. Maybe I just need a shirt with more cling.", "id": 479}, {"review": "After reading all the great reviews, I moved to these Light/Medium strings from the light gauge. They do sound much better and have a better tone than the light gauge. However, I noticed one thing that has driven me crazy. Finger slides are much harder with these strings. The lower strings (E, A G) just don't slide as easily until there is some buildup in them. As a result my fingers get out of position and don't hit clear notes until I've slid those areas a couple of times. That's probably due to the oil and other nasties build up in the strings or me just getting used to them. The packaging was also a bit confusing. Since there are two strings to an envelope, it seems I too easily get the strings reversed on set up. Other string makers I have tried, color coded their strings and it made it much easier to string up. Overall good strings and I'll probably buy them again.", "id": 294}]