[{"review": "These picks have a very unique shape and sound that have helped me play faster with a smoother tone.Unfortunately, these picks did not receive a five-star rating because of their price and lack of durability.  They wear down fast.  Mine are usually worn out after a day of use and I don't think I play particularly hard.  At around $4.50 for six picks, these are some expensive pieces of plastic.However, these picks are so full of awesome that I am compelled to pay a little extra.  I will definitely be buying more.", "id": 66}, {"review": "I have to start off by saying this cable does not produce the same sound quality of my Mogami Gold cables.  If you are recording and are going to meticulous about your sound, this might not be the cable for you.HOWEVER, for the price and purpose this a five star cable.  The plastic plug ends relieve stress on the connection, but also feel sturdy and secure.  The gold plating ensures a solid connection.What I like most about this cable is that it's guaranteed for life and I can bring it to a Planet Waves authorized dealer for a replacement... or so their packaging claims.  I have not had to replace mine.", "id": 195}, {"review": "This strap seemed a little awkward at first, but after a rigorous six month evaluation it's become my go-to strap.I currently have it locked to a Fender Strat and experience NO problems with the strap ends rubbing against the body of the guitar.  Although the strap ends are light plastic, they've held up well.  The nylon strap itself has held up well with no fraying or noticeable wear.  The nylon isn't that soft, so if you are that guy who insists on playing shirtless then this may not be the strap for you.It will lock to most standard strap ends, if the body of your guitar allows it.  I wasn't all that happy with this strap connected to a Les Paul.", "id": 208}, {"review": "All tuners like this are going to be a little \"jumpy\", none of them are perfect.  This does the job perfectly once you get the hang of it.The Korg Pitchblack was a little out of my price range, so the GA40 is working perfect for now.  Overall this is a fair priced tuner from a reputable brand... five stars.", "id": 331}, {"review": "This a solid performing unit at this price point.  I've been using this alongside my laptop for as long as I remember and it works the same as the day I bought it.  The two line instrument and microphone inputs make this perfect for a beginner or anyone needing a budget interface that works and is easy to use.My only negative criticism would be the plastic feels a little cheap.  But this is still a great USB interface for anyone who absolutely cannot spend any more than $60.", "id": 364}, {"review": "If you are fan of the Jazz III you will definitely like the Ultex version.  From my experience, the Ultex has the sound and feel of Tortex but without the \"memory\" aka wear.  The Ultex is thicker than the standard nylong Jazz III's and only when directly compared will you notice that the Ultex version has a slightly larger gripping surface.Five stars for being a better Jazz III.  However, the prices for these on amazon are absurd.  I got mine through musiciansfriend for around $2 shipped.", "id": 413}, {"review": "This is not the fanciest cable you can buy, but it fits my low budget.  It works perfectly, it doesn't feel like its going to break anytime soon, and my pedals are perfectly connected.", "id": 11}, {"review": "These strings have made me a D'Addario customer for life.  The sound and feel are perfect, and I find that they last much longer than more expensive coated strings.  I have no desire to buy any other brand.These strings are NOT over-hyped.", "id": 156}, {"review": "Yes, you are paying a little extra for peace of mind and the reputation of Mogami gold quality. I found this to be a good investment if you are meticulous about your sound. Compared to my old cable, the Mogami Gold produced a more transparent sound... you might have to do a side by side comparison to get the idea. When recording guitar, I am able to clearly hear individual strings while playing overdriven chords. No matter your playing style, this cable will work well with your sound.", "id": 493}]