[{"review": "After going to various guitar/music stores and trying out many guitars (Yamaha,Ibanez, Fender and others) I researched on the internet and stumbled upon this make/model and saw the MANY positive reviews it had. I was reluctant to purchase an instrument without playing it first, so I purchased the best sounding guitar locally (costing me $129). After 1 day I realized I was unhappy with it still and took a chance and purchased this guitar online. The many reviews were absolutely correct. THIS guitar is wonderful and sounds great. I replaced the strings yet the original strings were just as good as the LIGHT strings I bought. Even though it is only an $89 guitar, I will treasure this one as if it was $300. Perfect intonation all the way up to the octave. Low action and stays in tune for days!", "id": 148}, {"review": "I love my laptop, a Thinkpad T40. It does almost everything I need .. almost. A MONO mic jack, no other inputs. The Behringer U Control gives me STEREO now. The Behringer reputation pulls through once again. I've tried some USB sound cards without success. This product puts my older laptop besides newer ones. Well done Behringer!!!", "id": 384}, {"review": "The 3-pack is a FANTASTIC deal. I've been around mics under $100 for 30 years, and when compared to other mics in the $50-$100 range, they are as good or better! Good lows and clean highs without ANY hiss. Absolutely NO whine or hiss when used with a mic preamp. Don't miss out on this GREAT deal.", "id": 405}, {"review": "This small device has amazing quality. The built-in mic records very well compared to those tiny hand-held mono-recorders. Mic gain controls boost volume BUT add some noise (like reviews state) but when used on low-gain, record quite well. Audio-IN records even better when used with good microphones and a mixer (I used a Behringer U-802) for AMAZINGLY clear recordings. Several types of SDHC cards work well and have NOT found a card that did NOT work with this device. Even NiMH (1.2V) batteries can power this, although alkaline (1.5V) last longer.CON: The plastic case is vulnerable to scratches and breakages so treat carefully.", "id": 463}, {"review": "After online research, I decided to buy (and found locally) this midi pad to use in Reason 4. Although not confirmed (online) as working with Reason, I was happy to see it worked immediately with no problems. My CPU is Windows 7, but it worked on my MSI netbook also. This unit also worked in Ableton Live (as stated online). I would recommend this pad to anyone looking for an affordable midi drum pad that works in many music programs.", "id": 628}, {"review": "As a musician I wanted both a PA and an instrument amp, but I also wanted extra inputs and outputs. This has it all. Whether you want to output TO a PA or FROM a PA...... TO your guitar amp or FROM it.....and even play your MP3 player while you play AND sing. If you need more inputs, then just output a mixer to it. The tone controls are nice and the bass you can get is quite amazing for a 5.5\" speaker. Link to a bass amp or sub-woofer and you definitely have full sound. Certainly loud enough for a 1-man-band gig and definitely enough to supply an outdoor party with some music. I know it's a copy of other speaker/amps... but its a Behringer. I think it's a wonderful and adequate Must-Have for any musician.", "id": 654}, {"review": "I am both a bass player and a fidelity freak, always fussing over tone settings. This tiny amp packs BIG sound for everything from a harmonica to a keyboard .... and even my bass. The CD input has NO controls but is a very useful feature just the same. Having Behringer mics and a UB802 mixer, I banked on this being a good amp and was NOT disappointed. The 3-band tone controls do an excellent job of shaping sound to fit any instrument. No 15-watt amp will compete with live drums OR outdoor settings.... and do NOT expect 2 instruments to sound perfect together, but for indoor practicing and intimate small crowds, this amp will impress you. Every musician should have one of these around. Money well spent!", "id": 398}]