[{"review": "Nice little kit. it has 800 grit sandpaper in it, I hadn't noticed that in the listing, maybe I overlooked it. I had just bought some 600 grit at homedepot and used on the neck of a used guitar that had been neglected for nearly a decade. The 600 made it glassy smooth again (wet sanding) - I used this instead of the 800 that came with the package and it worked well for me.I had made the mistake of waxing my fretboard with carnuba wax after reading about it on a chat board. Big mistake it deadened the sound terrible. I was miserable, my guitar sounded like s***.After 20 minutes with this kit and a new set of strings and Bob's your uncle, good as new. I'm going to use this everytime I change strings on all my guitars.Nice little kit, I might even get around to using the 800 grit paper that came with it one of these days. Works a charm on acoustic guitars, haven't tried it on the electric guitars yet.", "id": 96}, {"review": "I bought this strap to use with an acoustic bass that is rather gargantuan,- A Tacoma 4 string, after a bit of adjustment it worked great. Then I bought an ovation 12 string roundback (very roundback this is a deep dish) I needed a strap to make this bad boy sit where I was, so I grabbed this strap off the bass and gave it a shot. After adjusting it for the difference in size it worked great. Now I'm buying another strap so I will have one on either guitar.(I usually keep a strap on all my guitars if the cases will allow it, sure beats taking them off and putting them on)This strap is very comfortable on an acoustic/electric guitar, probably more so than on a bass as it is supporting less weight. Due to the width of the strap it distributes the weight over a larger area, meaning less pressure on any specific area. This makes it very comfortable.I might change all my guitar straps from 2\" to 3\" now that I've had a taste of comfort.If you aren't comfortable playing, than you are distracted which removes you from the creative moment. This helps keep you in the moment and in the groove and it don't cost a fortune, plus it holds a pick or two.I like my phat strap just fine.", "id": 188}, {"review": "I'm using this with an Ovation Balladeer. A guitar with a rounded back that demands you use it with a guitar strap at all times. My guitar strap is over 50 years old, circa 1967, so the leather is a bit worn and it had a tendency to slide off the strap holders on the guitar at the most inopportune times.With these strap loks, the strap never comes off. I leave it on when  I put the guitar in the case, and they are there and waiting when I get it back out. I've had it on for 2 and a half months now, with no problems. The hardest part was putting them on, which really wasn't hard at all, just took a moment to understand the mechanics of the mechanism and voila' Bob's your uncle!!Recommend these for anyone who needs to keep their guitar strapped and ready for action. They are plastic and will wear out someday, I'll buy another pair then.", "id": 261}, {"review": "Nicely made strong strap with colorful pattern. It fits my ovation quite snuggly, I bought some retainers, but found them unnecessary so far. I couldn't remove this strap if I wanted to, well I could but its just too much work. So it will stay where it belongs for a few years at least.The only thing I don't like about this strap is the edge of the strap is a bit abrasive on my bare neck. Not a problem in the cooler months when I'm prone to sweaters and such, but in the summer it takes a bit of getting used to. It's made of a canvassy cotton, so its strong, but its also a little rough. I'm going to try waxing the edge with canning wax or candle wax and see if that smooths it down a bit.It is a very nice strap and will last years. I like it almost as much as my 40 year old ACE strap, which is much softer due to 40 odd years of use and abuse by a multitude of musicians. But finding an old ACE for anything close to this price is a fools journey.Buy one, then keep your eyes out for a hootenanny. You'll be ready.....", "id": 286}, {"review": "Love it. makes plugging in a lot of stomp boxes easy peasy. Quiet power supply, lots of cables and end caps and adapters, for what you'd pay for a single power adapter. It's nice not having to  dig out half a dozen power supplies just to set up and play. About the only thing missing would be some right angle adapters, but I'm sure you can find them somewhere.good quality, and the cord is extremely long for a dc power supply.", "id": 428}, {"review": "great little pedal. Has a nice set of adjustments to give a wide range of delays and echo to your sound. Easy to use, very low price, classic sounds. I wish I had 4 ears so I could buy another one. Strictly home studio use, haven't tried gigging with it, though it seems pretty sturdy, it is plastic, but pretty solid plastic. I also have a Danelectro  Fab Echo and this just blows it away. The Danelectro is okay, but it just doesn't have the depth or adjustment that the Berhinger pedal has.", "id": 506}, {"review": "I bought this on a whim. I was pretty satisfied with the extra heavy picks I was using, but wanted something with more grip. These picks have a logo and the company name molded in, which gives purchase to you pickin fingers to hold on to the pick. This seems to be a perfect thickness for some of my guitars that have silk and steel strings. With the xtra heavy picks I was losing what little treble these strings had. With this little purple wonder I got my treble back and still had great control for playing fast or playing hard.I like them so much I bought another hundred just in case the purple pick monster eats all my other picks.Its a great pick, its delrin or whatever(delflex) generic name they give it to avoid trademark issues, but its the best plastic for picks in my book. The tone is superb and the ease of holding is wonderful. I keep a couple of these in all my guitar cases.I recommend these if you enjoy playing guitar or just enjoy owning things that are purple colored. They don't taste like grapes however.", "id": 577}, {"review": "This snark thing is the cats meow, its absolutely Charlie. It hears things I don't and tells me whether they are what I want to hear to be in tune with the standard tuning used by so many musicians today to play musical things alone or together.If you like being in tune, this is probably for you. It is colorful plastic and is fun to look at even if you are not tuning anything. You can clamp it on a cat's tail, but the cat will not like it and the cat will break it so don't even think about doing that you sicko.Great design, easy to read, works better than 2 other brand tuners I own. only bummer is you can't carry it in your pocket cause its plastic and it is designed to break so you will buy another one or superglue your fingers trying to fix this one. If it were available in titanium housing it would be perfect and about 400 dollars, oh well.I suggest you purchase one immediately or risk your status of being cool, hip, out there or whatever standard definition of outside the mainstream you use to characterize yourself in an attempt at being singular without risking ostracization for standing outside the contemporary definitions of humanity.  oh the peer pressure........", "id": 706}, {"review": "This bad boy rocks, fits in guitar case, it slices it dices it makes julienne fries. Well no, but  it does slice guitar strings in half and it will pull bridge pins and wind/unwind guitar strings, though.If it had a flashlight, tuner and fingernail trimmer it would be perfect, but engineers are mortal and I couldn't put a tool the size of a watermelon inside my guitar case (at least not without coating it with butter first).Its plastic and steel, it will break eventually as everything does - imperfect world, re &#34;breakfast club&#34; bolts fall out, doors fall off, but til then I'll enjoy using this. The string winder is a little awkward. I have a little fender brand gizmo that looks like a pez dispenser with a swivel head on top, its small so I keep it in the guitar case along with this contraption - winds strings much faster than this device, but if you've got the time this one will work just fine. I also wear two pairs of socks in case one gets a hole in it, I'm prone to redundancies.It may be sheer rumor, but I have it on good sources, that this item is actually based on alien technology recovered at Roswell New Mexico. Your chance to own alien technology at an affordable price not like those I-phones that they took out of the saucers.If it only came in mink it would be perfect.", "id": 94}]