[{"review": "Used this to replace a dead volume pot in an older Strat-type guitar, and it sounds great!  The diameter of the threaded portion was a little larger than the original, Chinese pot, so I needed a cheap reamer (purchased through Amazon) to enlarge the pickguard hole.  It's a nice, smooth pot with no scratchiness.  nice big lugs to solder to.", "id": 216}, {"review": "Got this for an SG-style guitar, and it fits with plenty of room.  This is a better quality bag than an &#34;average&#34; bag, but with a couple of comments:1.  It smells like an industrial rubber factory upon opening.2.  The large, main zipper is easy to close but somewhat difficult to unzip.  Surprised me because it's a large-toothed zipper.3.  Construction seems to be pretty good.  This is not a hard case, but to get a guitar from point A to B, it works just fine.4.  Padding is sufficiently thick.  It's not a paper thin bag, but it's not thick enough that the guitar would survive a drop.Would I get another one?  Probably, as long as the use was long term storage or to travel small distances.  Otherwise, I'd get a soft sided hard case (the new wave of Styrofoam cases) or a regular old hard sided case.", "id": 311}, {"review": "This is a solid little USB Interface.  There are no frills, and there's no latency.  I have used this for @ 4 years without any problems, and it's very portable.  I run this between my small, 8 channel mixer and my laptop for recording guitar, and it's well worth the price to have one of these around.  Can also be used with tape players to import audio into your computer; I use this for more than just guitar recording.", "id": 384}, {"review": "These are perfect for those using Dunlop strap locks but have more guitars than straps.  These are Allparts parts, quick USPS shipping.", "id": 630}, {"review": "A great idea, but pure crap in terms of functionality.  if you don't have something heavy on the flat end, the rubber piece moves, and before you know it, your axe is on the ground.  I saw some pictures of putting a 12 ounce can on the flat part as a counterweight, but I'm not so hot with that idea, especially if the can is open.  The lip need to extend down longer, and *something* needs to be done on the bottom of the flat portion to stop this gadget from moving around.  If I had a permanent place to mount this, I'd gorilla glue it down, but that then defeats the beauty of this being mobile and I'll get an extra guitar stand instead.  Good idea, but it doesn't work.", "id": 746}]