[{"review": "I like the durability of it, and the on/off switch. it came with a carrying bag and a mic holder + adapter. its not as powerful and clear as i though it would be, but its far better than the other mics in the price range that i have used. i haven't tried this through a PA live yet. i just bought an Helicon voicetone and im hoping it boosts it a little. im sure i will have this mic for years to come and hopefully i can spring for a better Shure later on.", "id": 75}, {"review": "Its OK, the adjust ability is not what i would like but it does have some uses and its built like a tank. i got this for free from my girlfriend who had it given to her from some old guy who told her it was a broken distortion pedal so i can't complain about it not being worth what i paid for it. i currently have this on my pedal board along with a Digitech MainSqueeze which is less expensive, more adjustable and just more versatile. would i buy this, yes if i didn't try anything else first. nuff said.", "id": 137}, {"review": "its a windscreen, this is the first one i have bought but it seems to work how it is supposed to. it could be less dense i think. idk", "id": 178}, {"review": "I bought the Hell babe 10 years ago, it was my first wah pedal and it has been on my pedal board ever since, the same one. i have never had a major problem with it, the boost knob fell off a couple years ago but it was plastic and i did kick it a lot over the years so no big deal. Its no crybaby and im glad, it has its own sound that i have tried to get out of my vintage crybaby but couldn't no matter how much i tweaked it. I actually run both my crybaby and my hell babe on my pedal board and i find myself using the hell babe way more, especially since it has the auto off and spring back. it really makes my solos rip. buy it, you will have a ball. My only complaint is that the spring is loud and audible when playing acoustic gigs but acoustic guitar sucks so whatever.....", "id": 379}, {"review": "i originally wanted the Boss DD, but after doing a side by side demo, i decided that i'm not Buckethead and don't need a 150 dollar pedal just to do some intro stuff now and then. I have the Berhinger Reverb Machine and HellBabe and they do equal if not.....no they do equal to my Boss counterparts. Especially if you are looking for a unique sound that isn't stock Boss. i wouldn't take these on the road or anything without 3 or 4 backups, but for recording and doing demos Behinger is the way to go, timed effects wise anyway. they are made of plastic after all.", "id": 488}, {"review": "Just picked up the Korg pitch-black from Guitar Center yesterday. I use a Snark most of the time but i needed something i can tune with during practice while everyone is playing and making noise. love the thing so far. its accurate, fast, fits nicely on my pedal board and its metal not plastic like most tuners for this price. i like the multiple display options and calibrations. Mute function is awesome and true bypass i believe. great buy, i am happy with it. i got it in red.", "id": 504}, {"review": "Super cool pedal with tons of applications. it sounds great for recording. i wouldn't take it on a tour or anything, it is plastic. the harmonizing function can be buggy at times. the trem function works great. it has a input for an expression pedal and i would recommend using one to save your pedal the wear......it is plastic. I love Behringer pedals, for the price you can get a ton of great sounding and functioning pedals at more than half the price of the Boss counterparts. one of my favorite pedals of all time.", "id": 505}, {"review": "awesome patch cables for your pedalboard. they are not as rigid as your typical patch cables which works for winding in and around pedals easier and you can twist and angle them however you want without stressing your input jacks. love Planet Waves gear.", "id": 662}, {"review": "exactly what i needed to set up my pedal board. the flexibility is awesome, you can wind it underneath and around the pedal board and still plug it in to the pedals with out straining.", "id": 663}]