[{"review": "What's most impressive isn't the top-drawer leather and craftsmanship -- that goes without saying from Levy's.  it's the clever design, the way it fits onto almost any guitar strap, adjusts to almost any position, and adjusts to (almost) any small wireless transmitter.  transmitter, not receiver!", "id": 264}, {"review": "The surprise here is how they traded a little bit of diameter (the Fatso part) for incredible flexibility (the other F-part).  Looks great, no noticeable noise or signal loss.  A really nice change from stiff skinny rubber cords!", "id": 587}, {"review": "Once I read about the Bugera B5, I knew I wanted one.  Why futz with tube-like effects when you can have real, live tubes -- two in fact!  Only five Watts, yes, but that's still enough to fill a room.  But it's the extras that cinch the deal: this is built like a brick house -- you can jump up and down on it if you want to.  It has an internal cable for the speaker, so you can easily plug in a different cabinet.  Comes with built-in reverb.  Headphone jack standard.  Best of all: an attenuator, so you can get the cranked sound even at low volume levels.  Easily upgradeable -- I put new tubes and speaker into mine, though I probably didn't have to.  A small but effective little amp.Edit: I had modded my Bugera with a Jensen MOD-8 and used it for bass, but recently I found a source for Celestion Super 8 drivers and popped one of those in.  Amazing low-end output for such a small cab!", "id": 618}, {"review": "It's fairly tough, but flexible.  No noise that I can hear, and the connectors look solidly-mounted.  I would definitely buy this brand again.", "id": 745}, {"review": "I just bought a Rickenbacker 4003 that came with Schaller strap locks pre-installed.  I've used Dunlops before, but those would require redrilling the holes to put them on the bass, so I just bought the Schaller buttons.  I don't quite like their look as well as the large round Dunlops, but there's no question about the quality -- these are not going to fall off the bass anytime soon.", "id": 790}, {"review": "My bass had original-equipment Dunlops on it, but they were silver-tone, whereas all my other hardware is gold.  And after 30 years, they looked kind of dirty and tarnished.  So, I knew it was time for a new gold set, and I couldn't be happier with their look and quality.  I have used that other S-brand on other instruments, and really prefer the Dunlops.", "id": 44}, {"review": "Let's cut to the chase: this is, more or less, a tight roll of gauze soaked in mineral oil.  But that's exactly what I need to clean and protect my fretboard.  The lubricating feature is just a nice plus.", "id": 72}, {"review": "Straps don't get any better than this.  Super leather, very well put-together.  Perhaps a bit wide, but i play short sets.  For the gigging pro, I think the width is an advantage in spreading out the weight.  excellent, just excellent.", "id": 480}, {"review": "Bought a couple of these as replacement tubes for my bass amp, and I think they improved the sound over the original EH ones.  These are considered \"boutique tubes\", but I think they're popular for a reason.", "id": 687}]