[{"review": "I've been playing for over 40 years. I currently own 60 or so guitars. My problem with LP's is they feel like a boat anchor around your neck, I've bought and sold quite a few. Another problem with real LP's, you only get one chance to drop one, just see how many used ones have head-stock repairs. They ARE beautiful guitars but not comfy for me to play. I deal in used guitars, picked up an Epi Special ll along with several other guitars at a resale shop for very cheap. I didn't mess with it until I was ready to set it up for resale. I fully expect to do a fret level on most guitars, even a lot of higher end guitars need it. I found on the Special ll the frets were actually very well done (Chinese version from 2011) and only needed a slight leveling (would have played fine without it but I am very picky). It didn't take much to get it set up, small truss rod adjustment, new set of 10's for strings. little bit of adjustment to the bridge, cut the nut a bit....note it played well the way I got it, just like my stuff perfect. Got it set-up and plugged it in to check the electronics and that's when I started to really become impressed with this guitar. Cheap pickups are supposed to sound muddy with no character, these sounded pretty good, actually very good, nice and bright with a nice tight bottom end. I check sound also by cranking up a backing track to stage level and playing a few tracks. It cut through really well. I noticed while doing this test that the volume had a very nice sweep to it and didn't lose any highs when turned down. The tone knob was also very usable with a good sweep, very nice. I popped off the back cover to check what was in there, full sized pots, maybe not the best quality but much better than expected. I normally upgrade electronics on my personal guitars to get the controls to operate the way I like but no need to fix what's not broken. Yup, I said \"on my personal guitars\" because I am keeping this one for myself. The neck is very fast and comfy, it's NOT a boat anchor so my shoulder will thank me. The tuners are the lower end trapezoid type but turn smoothly with no backlash and keep the guitar in tune fine, once again if it ain't broke don't fix it. Please note that most tuning problems are from a binding improperly cut nut. I've set-up hundreds of guitars and almost all of them need nut work, doesn't matter what price point you are at. This also has a bolt on neck. A lot of players say you have to have a set (glued) neck. I feel glue actually deadens the sound a bit, I prefer a good solid bolt on to transfer sound, IMO. I have found that the quality level of the low end foreign guitars has become very good. I know that corners have to be cut to get to the price point of these budget guitars but all in all the Special ll is good to go right out of the box with just a little tweaking. My advice is to go try one, my taste may not be the same as yours. There are a lot of good value well made guitars now-a-days, I just found at this price vs quality ratio the Epiphone Special ll really is special. Get one, get it set up for a few bucks if you can't do it yourself, and you will have a good instrument. Oh did I mention this is a very good looking guitar?", "id": 31}, {"review": "I was buying a pawn shop guitar, when paying they handed me this amp and stated it came with the guitar. I didn't expect to actually use it but what the heck, I could sell it and make a bit of money back. Got home to set up my new pawn shop guitar and plugged into the Frontman 25 just to see if it worked. I was surprised to find out not only did it work, it sounded very good. I own a Deluxe Reverb all tube amp and the little Frontman 25 had the Fender sound. What really was impressive was the reverb, it went from a nice echo to full fledge drippy surf sound. I actually took it to a few small gigs and it did very well, I normally use a Blues Jr for small gigs but the Frontman did a fine job. On some smaller gigs when all I need is a little reverb I just plug straight into the amp and it worked well, plenty of volume and smooth reverb plus it's small and easy on the back. All in all very impressed and have decided to keep it. I would easily pay full retail, it is a nice little amp, might even see if I can squeeze a 12 inch speaker into it!", "id": 223}, {"review": "Very nice bridge. This was an OEM part so didn't come with screws, springs,claw, or tremolo bar, just the bridge itself. Not the best but for the price was a killer deal. The block is full size, probably zinc or some mystery metal, vintage bent saddles. Would be a good replacement for an older MIM Strat with the smaller block, or other Asian import, or just to replace one that's wore out. Like I stated it was dirt cheap and decent quality.", "id": 677}, {"review": "I got mine in a trade for practically nothing. I figured I could sell it and make a few bucks, saw the Mustang amp around but never gave it any credibility, looked like a toy to me. Anyway I decided to plug it in and was shocked at the full sound of the little 8 inch speaker. I researched and found there is a program called Fuse that can interface with the amp. I downloaded and linked to the amp, there I saw you can make a lot of changes that can't be done with just the knobs. I saw it had a Deluxe Reverb setting. I have the Deluxe Reverb Reissue so dialed in the same settings with the fuse software. To my amazement it sound like a smaller version of my Deluxe! Fender really got close with the modeling. I went ahead and programmed a few more patches and set up a footswitch to change between 2 settings. I liked it so much I went out and bought the Mustang II. I almost like the Mustang I better but the II does have enough power to gig with if you aren't a loud band. I will leave my Deluxe Reverb at home for my next small gig and use the Mustang, maybe even the little one and mic it up..", "id": 718}, {"review": "I ordered this Epi Jr because I had one years ago my Son adopted for his own and missed having one. Saw this in TV yellow and had to have it. I came well packed and looked much better in person than the pics on the website. It was set-up very well, among the few guitars I have purchased that were playable out of the box. Fret work is top notch. Finish is good, some very slight blems but if you play it like you should you'll add some of your own. There was a slight binding in the nut, most people think it's the tuners right away but most tuning problems are at the nut. A quick fix with some pencil lead or chap stick will fix it up. If you can't make your own nut adjustments visit your favorite guitar tech. When you hear the pinging sound when tuning you have a nut issue. The only thing I did was lower the bridge a bit and this thing plays like a dream. Plugged in it sounds good, you can get a lot of different sounds with the simple use of the volume and tone. Picking closer to the neck or bridge varies your sound. Play close to the bridge with tone wide open puts you in Tele territory while using the volume to clean things up or add some dirt to the sound. Add some tone knob and pick closer to the neck to get into the blues region. This guitar will make you a more versatile player. The absence of a neck pickup reduces the magnetic pull on the strings and lets them ring out. Sustain is very good as a result. I could carry on forever but you get the idea. I've been a player for 45 years and a collector for half of that. I own many vintage guitars including Gibson, Fender, Gretsch. I have the most pleasure from playing the newer imports, the quality is superb on the most recent ones. Tone snobs may laugh but my new Epi Les Paul Jr plays just as well as most anything out there.", "id": 738}]