[{"review": "It is so hard to get an honest review of any mike that isn't a Shure SM58. This is considered the gold standard by which all others are measured. Of course at least part of this reputation is deserved, but perhaps more for the durability of the SM58 than its sound. I have a couple of SM58s and a couple of PG58s. I was considering the SM48, but the PG58 has slightly better specs, and almost identical price.The first thing I noticed out of the box was that the PG58 is slightly bigger and slightly heavier. It also has a different switch than the SM58. The metal screens protecting them aren't interchangeable. I then plugged in one microphone cable so the settings would be identical. I tried both mikes, one after the other, first with speaking and then with singing and playing guitar, and then I changed the settings, or more specifically, the effects and the EQ on the PA. I repeated the experiment, speaking and then singing while changing between mikes.Here's what I noticed: The SM58 is slightly flatter in the mid range. The PG58 is slightly brighter and has a touch more presence. They are about equal on volume. The slight differences in tone can be easily manipulated with an EQ or just ordinary tone controls. Neither was susceptible to much feedback or vocal pop.I haven't tried out this side by side comparison in a live situation or even in practice, as it's too time consuming and interferes with playing. It's difficulty to judge in those situations too, or at least awkward, but I have used a combination of the two in practice and no one seems to be able to tell the difference, except one person actually expressed a preference for the PG58, but that could be just the settings.I looked at the specs for the two mikes side by side. The SM58 is a little flatter in response, especially at the high end, over 10K Hz, and it picks up a few dB before the PG 58, somewhere between 50 and 60 Hz. However, since the human vocal range is generally between around 300 and 3000 Hz, neither of these seems likely to have much effect, although the SM58 might be a tad more responsive for a bass singer.I also tried out two different Behringer mikes and a Radio Shack mike. The Behringer 8500 was totally outclassed by both of the Shures, sounding tinny and thin and with little presence or volume. I tried out a Behringer 2000XM and was impressed by the similarity. These mikes sound almost identical (The B 2000 and the Shure SM). The Behringer 2000XM seems to have been discontinued, though, and replaced with the 1800XM, an inferior mike offered in bundles of three for under $50.I then plugged in a Radio Shack mike that was a spare backup, not even taken out for practice. The model number is 33-3001, probably also discontinued. This was an excellent sounding mike, with good volume, presence and tone.I didn't have any other mikes to test in this side by side experiment, but I did reach some conclusions:There is quite a bit of snobbery in choosing microphones, with the Shure SM58 held up as some unreachable standard. They ARE sturdy, and they are good mikes and the price is not unreasonable, at around $100. However, there are other microphones which sound nearly identical and are also sturdy and reliable, at lower prices, including the Shure PG58, and most likely the SM48, though I didn't have any of those to test.I wish more people would give unbiased reviews based on actual performance instead of condescension toward those who are either on a budget or looking for alternatives to the standard bearer. I'm giving this 4 stars only because I haven't had enough time to give an evaluation of how this holds up in comparison to the SM58.", "id": 18}, {"review": "I play steel guitar and add effects to the song and different ones to my solos. I'm always looking for something that will add an extra appeal to certain songs. This is easily adjustable, and adds a depth and a near-Leslie sound. I use it often and it adds an interesting sound not possible with other effects. It's easy to use in combination with, for instance, a Chorus, or a Tremolo, for dynamic steel guitar sounds.", "id": 429}, {"review": "This is an interesting, limited effect pedal. I bought it mainly to use with my (non-pedal) steel guitar. On a pedal steel you can bend notes with the pedals and levers, and most steel players use a volume pedal to do swells. However, I play standing up and manipulating the volume pedal was difficult to control because of balancing on one foot and the sensitivity of some of the pedals.This pedal gives a simulation of the volume swells that give steel guitar that distinctive sound. It's sort of like an automatic wah in the way it works. Since the steel is always being played by picking the individual strings (no chording), this pedal works along with that technique. I combine it with a sustainer to make the swells extend a little, and it gives a fair approximation of using a volume pedal to swell the notes.I tried this with regular guitar, but it's not the same. For chords, it does add an effect, but it's not very distinctive, and for single notes, it would depend on the song. I haven't really found many instances where it's useful there either, as I normally don't want volume swells for solos on guitar, but on steel guitar, it works very well.", "id": 449}, {"review": "This is one of many Behringer pedals that offer a unique, stand-alone sound. The chorus effects are well known, and even included on many amps, and featured on almost every multi-effects pedal. I like the individual pedals because I can add in just what I want instead of relying on someone else's idea in a pre-set. This Chorus is just about right. It has a range of sounds for different situations, and is very reliable and well made. There is no problem with the B. tough plastic cases. If you want a metal housing, it's for some sentimental reason, thinking that metal is automatically better or more durable than plastic. You just need to push the off on switch, not bat baseballs.", "id": 487}, {"review": "This pedal does add reverb and it is adjustable to different effects, but the range of effects is not great and the difference in them is often not very pronounced. It's kind of an &#34;empty&#34; sounding reverb, as opposed to more lush effects. The Reverb Machine (RV600), also from Behringer and for only $10 more is a FAR superior machine with more effects and better tone, though it has a couple of other minor drawbacks. See my review of that item for clarification.", "id": 545}, {"review": "I bought this because I was going on a trip and needed an amp I could pack in my suitcase that would work with a battery.I had a similar amp before that died. The Honeytone is very compact, but looks cool and is very simple to operate, with just three controls, volume, tone and gain (distortion). I found that some level of distortion is necessary to have any volume. If you try playing clean, with no distortion, you'll be underpowered. The trick is to balance the gain and volume for your instrument and situation. I tried a regular electric guitar, a lap steel guitar, a slide guitar, an acoustic-electric guitar, an acoustic-electric mandolin and a silent banjo. I thought the acoustic guitar would overwhelm this little amp, but I was surprised that it added to the projection and wasn't bad on the tone. It has a handy belt clip and a useless little leather handle (just for looks). I am using it to play an electric instrument in jamming situations where everyone else is playing acoustic, and I can adjust my volume to blend in. I think a mike with an unbalanced output (1/4&#34; phone jack) would also work in here, for street corner singing, for instance, though I haven't tried that yet as all my mikes use XLR jacks and there would be the issue of a mike stand or a lapel or headphone mike with a phone jack output, which might be hard to find.Overall, I'm very pleased with this amp and it seems sturdy and reliable so far, and at $20, a bargain.", "id": 605}, {"review": "I read mixed reviews of this pedal board, but I had tried half a dozen multi effects pedals and modeling processors and pedals with limitless combinations all in one. However, I found all of those too difficult to adjust to my needs, or too cumbersome to flip through all the channels to get to the sound I wanted and then modify it. What I wanted was four or five single effects pedals that I could preset to the value I usually use and then turn on each effect as needed, giving me lots of combinations. I had a couple of Boss pedals and one Behringer one and I ordered a couple more of the inexpensive Behringer units, which I'm generally pleased with, though they're perhaps not in the elite category. They work fine for me. I didn't want 5 or 6 units cluttering up the space and each demanding its own wall wart.This compact board with its built in case and cord management was the perfect solution for me. Instead of the Velcro found on many boards, this has foam cutouts which hold the B and B pedals securely and give enough room for the connectors and daisy chain power supply to stay tangle free. It all plugs in with one adapter (provided) and it also comes with all the short connectors to connect each pedal together.My pedals are  incredibly easy to use and extremely well organized now. The case holds them securely and the lid fits on and holds everything in place for transport. Everything is ready to play by just removing the lid and plugging into the outlet.The latches are not the most secure, just a simple plastic slide that looks like it could easily break. However, there are matching holes right next to them so a small lock or even a twist tie could be inserted if the latch does malfunction.Overall, I'm extremely satisfied. If you're doing something similar to me, I'm sure you will be too. The foam cutouts can be manipulated for other sizes of pedals. I have exactly enough to fill it, with the addition of a dedicated tuner that mutes everything while I tune.", "id": 616}, {"review": "This isn't the best power supply available. It doesn't truly isolate each input. The description says the outputs are &#34;isolated,&#34; but what this means is that they are independent; that is, if one input has a short in it, that one will cease to function and not the other, working inputs. So the short circuit protection is isolated, but the grounding is not.This can cause some issues with noise, but there are other things that can cause noise too. It's not always just the power supply making the noise. It could be certain pedals, cables, or some combination of factors. A power conditioner will sometimes help as well.However, the Joyo provides plenty of power--enough for 8-9V inputs and 1 each of 12V and 18V.It is dependable, solidly built, comes with plenty of connectors and is small enough to fit on moderately sized pedal boards. I have 12 5 x 3 pedals on my board with 2 of these Joyo units, and my board is about 26 x 14.There is some noise, but I don't attribute that just to the power supply. It takes some investigating and maybe an experienced tech to trace this down. I'm not sure it can ever be completely eliminated, but the Joyo itself seems to produce very little, and it's a third to half the price of the truly isolated units, and a definite step up from a daisy chain. It also has those cool blue lights that you can turn on or off.", "id": 852}, {"review": "I've tried numerous stands for the variety of instruments I use: electric guitar, acoustic guitar, mandolin, violin, and banjo. This one fits all of them and holds them securely and folds up easily for transport. It doesn't get in the way, has rubber feet and padding, and just works simply and effectively. It's not flashy looking, but then it's never seen because it either is hidden by the instrument, or blends in because of its compact size and black color. Nothing else is as versatile and effective, including the multi instrument stands, the ones with other shapes of the support arms, and other folding designs. This is simply the ideal.", "id": 883}, {"review": "I had a BOSS Blues Driver pedal that I really liked, that is until I got this Behringer Tube Overdrive. For blues, you (or at least I) want a gritty, dirty sound, one that implies some of the hurt implicit in blues music. I was happy with the Boss, but I decided to try this B. pedal, and I'm glad I did. I compared them side-by-side, and the Tube Overdrive was much grittier, like a small tube amp pushed just past its clear sounding limit. It's perfect for the sound I want, and I can adjust the amount of distortion to my preference. Some like a LOT of that sound, but I prefer just enough to color the sound and shape it to my desires, leaving the rest to my playing and the dynamics of how I attack the strings.I've now retired the Boss pedal. In a careful comparison, the Boss had a cleaner and slightly more clear sound, which is not really an overdrive, but more of a distortion, but a clear distortion, if that makes any sense. It does add sustain, but it can't compare with the B. pedal's effect, which implies a power barely held in check, just exactly what I was after.", "id": 381}, {"review": "I've had Behringer mikes before, and currently have a couple of XM2000s, which are very reliable and comparable to Shure SM 58s. I saw this three pack of 1800s for $40 in a hard case and couldn't believe it. I hooked them up right beside the 2000s, and while there is a little difference, it's not much. The 1800 has a little more high end, but it's easy to adjust the tone for slightly more bass. The presence is also boosted a little on the 1800, meaning less reverb should be put in the mix to avoid a tinny sound or the possibility of feedback.For now, I'm using the matched 1800s as the main mikes for our vocalists, and keeping the older 2000s as backups.I bought the 3 of these for less than the price of one SM 58. Although the Shure (and the B 2000) is better, the difference is hardly noticeable once the tone and presence are compensated for. I can afford to buy another 3 pack for complete backup.A wise choice for the budget conscious.", "id": 405}, {"review": "I had the Behringer DR 600 (Ultra Reverb), but was unhappy with its tone and limited selection of reverb sounds. Although this unit is only $10 more, the difference in sound and tone may as well be $100 difference in quality of sound. That is, this one really sounds super once you adjust it to your own preferences. It may not have every reverb sound, but it has a nice selection, and they cover an impressive range, as well as giving you the option of &#34;wet&#34; (full) or &#34;dry&#34; (tinny) sounds and a &#34;trails&#34; that essentially adds some sustain. There's also an &#34;echo&#34; setting, but it's not very pronounced, though it does add an &#34;echo-like&#34; sound.So, my complaints are not with the quality of the machine or the range of effects or their qualities.There are a couple of annoying inconveniences. One is the BRIGHT blue light (indicating &#34;on&#34;). This has been commented on before. I have an array of pedals and this one is as bright as all the others combined. When it's on, you can't read the dials because of the glare in your eyes. I did find a solution. I put dark nail polish over the LED bulb. I had to put it on and wait for it to dry and reapply several times to get the dimming I desired.The second annoyance is that the name of the pedal is in black letters against a dark blue pedal color. This is impossible to read in stage (or even dim room) lighting. Of course, you can &#34;remember&#34; where it is or which one it is, but my other Behringer pedals all have white lettering, making them much easier to read. Every B. pedal has its own distinctive color, so that helps. My solution to this little dilemma was to buy some 1/4&#34; white vinyl letters from Office Depot and put them over the words &#34;REVERB&#34; on the pedal.It was annoying to have to make these cosmetic changes, but now I'm much happier with the pedal and can enjoy its sound instead of focusing on these minor irritations.", "id": 508}, {"review": "I have several Behringer pedals, all placed in a Behringer 6-pedal board. Most of the B. pedals work quite well. I have no quality issues with them. Some people complain about the plastic cases, but they are tough and reliable unless you're in the habit of abusing your pedals by smashing them around or can't control your &#34;stomp&#34; pressure. Some are better than others, and this one works perfectly. I have 6 B. pedals (one of them is a tuner), and each seems to add some noise to the amp output, especially when it is in quiescent mode (no signal input).This pedal, placed at the end of the line just before the signal goes into the amp, quiets all that noise that the other pedals generate. I had to check this, because I at first thought my amp was making the noise, but when I bypassed all the pedals, my amp was quiet, which was a relief. Then I needed relief from the pedal noise, and this did the trick.The controls are a little misleading, but easy to get used to and adjust. The &#34;send-receive&#34; function is for quieting the noise you send to an additional effects pedal, which seems pointless, as the best way to use this is to put it at the end of the chain to quiet all the effects.The mute function may help, but when I turn on my pedal tuner, this also functions as a mute.I had to do a little modification of the B. pedal board to make this fit in, as I already had 6 pedals in place. But, with the removal of a couple of screws, it fit into a slot meant for a longer pedal.I don't actually need the on-off function on this most of the time, so placing it in that sideways, out of the way spot was no disadvantage. I just leave it on all the time so it always quiets the noise when I'm not actually playing. However, I can still operate it if necessary, for example for the mute function if I needed that.It's aggravating to have to have a pedal to eliminate noise from other pedals, but at least there is an easy solution in a noise gate like this one.", "id": 615}]