[{"review": "Use this for home recordings and some voice over recordings for work. I like the long neck on it and its a double filter so you get a tad bit extra. I tested it against my single filter and it did make a difference, as expected. It makes sense that if you have an additional layer there it will filter more effectively, but I wasnt sure if it would effect tone or highs, and I didnt notice either effected.", "id": 46}, {"review": "Not happy with the sellers description or the product. The description says \"Heavy Duty\" which makes you assume that it's a regular hard plastic Mic Clip, but it's not. IT'S RUBBER!!! It sucks. Used it a couple times and it's hard to slide the mic in and I can see after a couple more uses how it's probably going to need to be taped because the swivel will become very loos cause the rubber will wear down quickly, and flex. IT'S FLEXIBLE!!! Who uses Flexible Mic Clips?!!! Make sure you don't buy this and get a hard plastic clip instead.", "id": 135}, {"review": "I use this at home for rough tracks and have also used it at work for voice over. Its worked great. Very happy with it. Its not a $2000 quality mic but it its a good mic for the money. Some of the tone can be a little tricky sometimes, but for the price its expected to not have it sound like butter.", "id": 254}, {"review": "I use this with my Audio Technica condensor. Works great for home recordings hooked up to garageband on macbook pro for rough recordings. Its super simple to use and has a dial for the gain. It's not bulky which is a nice.", "id": 538}, {"review": "I had purchased one a while back for my electric and then my acoustic was always leaning against the wall so I had to get another for my acoustic. Super simple to install and very sturdy once installed.", "id": 166}, {"review": "Not much to say about the mic stand, it's what I expected it to be so thats good and the price was right. NO problems with the seller the product came quickly and everything was in great condition.", "id": 515}, {"review": "No problems with seller and product came quick. I wasnt expecting much from the mic. I mean c'mon what can you expect for that price. I wanted it to lay down some quick vocal melodies over rough tracks and it's good enough for that. Doesn't have a really great range, I think the RockBand mic has a better range than this, but like I said, it's a cheap mic so what can you expect. Honestly I should have saved my money and been a little more patient to get a better mic.", "id": 623}]