[{"review": "Spectraflex makes great cables. I bought this right angle 10' red cable for my older Ibanez guitar. This cable is built to be extremely durable, is made in the USA, and comes with a lifetime warrantee. The 20 gauge construction and rugged nylon braiding makes for a very low noise cable, and the connectors are very secure and feel quite substantial (especially compared to a cheaper Fender cable I had been using that required almost constant tightening.) Though Spectraflex cables are not the least expensive (nor the most expensive,) they are a great value and I am definitely a fan. I recommend this cable without reservations.", "id": 47}, {"review": "As a kid I learned to play the trombone proficiently, but my heart wasn't really in it, so I took up the guitar, which I love. I played for several years but stopped playing for lack of time. I recently started playing again and was looking for the perfect pick for classic rock (I have an old Ibanez and a Les Paul Custom) and have tried several picks in that quest. There are several I have liked (and several that I haven't) but thus far my favorite is the 1.0mm Tortex (blue) picks. They have a very nice, almost powdery, matte feel that minimizes slippage and they just don't break, though the 1.0s are fairly stiff. Depending on what you are playing there are various thicknesses available, and most people will find something suitable for their personal preferences. I won't say that I will never try anything else, but thus far I find myself picking up my 1.0 Tortex more than other picks.", "id": 61}, {"review": "I own two Hercules GS302B stands for my electric guitars, and I couldn't be happier with them. When I needed an acoustic stand I turned to the Hercules GS301B and have no regrets. At the forefront of my purchasing decision was the safety of my guitars. Not only do stands have to hold guitars securely, they shouldn't harm the finishes of the instrument. Unfortunately many stands will harm the nitrocellulose lacquer on many higher-end guitars; since I have two guitars of this nature, protecting them was of the utmost import to me. Fortunately these stands protect most nitrocellulose finishes, and I have never had problems with mine. The stands themselves (both varieties) fold up to be very compact if you need portability, and support the guitar very securely. I don't gig with these guitars, so portability was not paramount to me, but stability was: these stands are extremely stable and are very sturdy (mine reside on a carpeted floor, and I have never had any issues with them tipping over.) Some people may not love the yellow and black \"bumble bee\" coloration, but I actually find it whimsically industrial. I am completely happy with all three of my Hercules stands: they are safe, portable, rugged, and won't hurt the finish on most guitars. If I need another guitar stand, it's a good bet I will buy another Hercules.", "id": 417}, {"review": "The Dunlop Max Grip Jazz III carbon fiber picks really helped improve my accuracy, no doubt in large part due to their relative stiffness and profile. I tend to drop picks and have tried numerous brands and types of picks, but for ease of grip these are hard to beat. I am a relatively inexperienced player, and while more experienced players can address technical subtleties better than I can, I have come to depend on these as they have helped me to hugely improve my picking accuracy in a relatively short time. As far as durability goes, they are the reigning champs. I bought a pack of six, and I've been using them for a while now and can't tell them apart: the three I've used look like the three that are still in the bag to my eye. I doubt seriously I will need to buy more for months (who knows, maybe years) as they just don't seem to wear even after hours and hours of use. I recommend these picks without reservation.", "id": 686}, {"review": "I have recently come back to the guitar after several years on hiatus. I have several bad habits, including a tendency to need to grip the pick too tightly or I drop it at some point. On a bit of a lark I bought a pack of the Clayton BeeHolds (0.5mm,) and really like them. The hexagonal hole really does make them stay in place with much less grip required, and I find the hole to be in a very natural-feeling spot. The pick is fairly long, but I have not had any accuracy problems with them, and so far durability has been good.I still use other picks too, but I really like these and can't imagine not keeping an ample supply on hand.", "id": 792}]