[{"review": "Monster makes a wide array of cables, including some that are very high end. I initially purchased a pair ofMonster Rock Instrument Cable - 21 Feet - Angled to Straight 1/4-Inch plugto use with my keyboards, but when it came time to purchase cables for my bass and guitar I thought I'd pinch a few pennies.  I am so glad I did.I compared this cable model to the more expensive models I previously purchased and, aside from looks, could not detect any difference in sound. I Swapped back and forth between my guitars and keyboards, ensuring that each model was used on each instrument - still no difference.What the more expensive model has going for it is looks. I am not sure it (the higher priced model) is even more sturdy because the molded stress relief ends on this model seem to make it more reliable than its pricier sibling.Bottom line: carefully compare both cables using your own instrument and amp - if possible - before making a purchase decision. You may find, as I did, that higher price does not necessarily equal higher value, even from the same manufacturer.", "id": 1}, {"review": "First, the reasons why I awarded this five stars: the construction is uniformly excellent. Both ends have strain reliefs, the 1/8\" connecter perfectly mates with the plug into which I insert it, and the XLR end is a quality component.I purchased this specifically to transform the third channels in myPowerwerks 50 Watt Personal P.A. Systeminto something more useable. This greatly expands the functionality and versatility of the portable PA by allowing me to plug in another mic. Since I have three of those units daisychained I was able to significantly enhance the entire system with this simple adapter.Another reason why I love this is it's noise free. In some environments in which I play there are sources of electromagnetic interference that cheap cables will pick up and transmit. I have not had that problem with this one, so it's another plus.Overall I am very pleased with this adapter and actually purchased a spare in case I damage or lose my primary one. It's a bit pricier than others I considered, but I feel that the quality and peace of mind are worth the premium.", "id": 8}, {"review": "I use this with fairly light mics (seeNady DMK-5 Drum Mic Packagefor details).While I generally do not mic bass drums, when I do this stand allows me to do it my way, which may seem unconventional to some folks. I place the mic on the batter side of the drum about three feet back. Since this can be problematic with the floor tom and throne (and hi-hat) hindering access, the boom and adjustability of this stand are a great help.Where the stand shines if micing amps. Some small amps, such as theFender Champion 600 Electric Guitar Amplifierare usually placed on a raised surface to keep them off the floor. This stand will reach any stand that is chair seat height. For larger amps that are on the floor or tiltback stands, this mic stand will still allow you to position the mic where you need it.My use is relatively narrow - kick drums and amps. But for each, this stand is excellent in my opinion. With the mics I am using it is heavy enough to remain stable, and for where I need to place those mics, it allows me to do so with relative ease.", "id": 77}, {"review": "This is definitely a high quality cable. However, my experience with this model and the less expensiveMonster Standard 100 Instrument Cable 21 ft. - straight 1/4 plugs S100-I-21model has shown me that the only difference is one is \"prettier\" with its gold colored, bling fittings. Sonically I found them to be the same - or to my ears anyway.As you can see by the tag above this review Amazon has verified that I purchased this cable (as well as Amazon verifying my purchase of the less pricey model on my review on that product page.)I initially purchased a pair of these cables for my keyboards because I had invested a significant sum into those instruments and wanted nothing but the best cables. I purchased the standard cables for some low end instruments including an old Squier Jazz Bass and a new, but very inexpensiveEpiphone LP Special II Les Paul Electric Guitar, Vintage Sunburst, neither of which to my mind warranted top of the line cables.Much to my surprise, when I started testing each cable on each instrument (all through the same amp to keep things equal), I could not discern any sonic difference between both Monster cable models. Same manufacturer, but different models. To be sure, this more expensive model looked \"cooler\", but when it came to sound - no discernible difference (that I could detect anyway.)  More perplexing is the molded stress relief ends on the less expensive model seem to make that one more reliable!My recommendation is test both this one and the standard model side-by-side before plunking down extra money for no added value beyond looks (which, I have to admit, may be a selling point on stage for some folks - no shame as long as you know what you are paying extra for and why.)", "id": 127}, {"review": "One thing I love about this extension bar is it will fit over the relatively large diameter down tubes on my hi-hat stands. I use anOn Stage Microphone 13-inch Gooseneckto connect to the bar, then I attach either aNady DM70 Drum and Instrument Microphoneor DM80 microphone. The bar-gooseneck arrangement is sturdy enough for that mic model.This also works well for mounting on microphone stands. I use it and a shorter gooseneck to mount the DM70 for tenor and alto saxophones, or a DM80 for baritones. Again, it works perfectly for my situations.I always keep a few of these, plus various size goosenecks, just in case I need to mount an additional microphone and I am short on stands. It's one more tool to make set up less stressful.Trust me, when you need one (and chances are you will if you're a drummer or a sound tech) you will thank yourself for having the foresight to purchase it for situations I cited above and those that I have not foreseen.", "id": 143}, {"review": "This is nearly identical to theGuardian Cases CG-020-B Bass Guitar Caseat about half the cost. However, there are some issues with this case as well as limitations.First the issues: while the covering appears to be stitched on, it is - for the most part - glued on, and if the case is left in a hot, unventilated space like a car for prolonged periods the covering will start to life at the edges. On the other hand, someone who takes care of their gear is probably not going to leave their instrument in a hot car (or garage or other storage space) for prolonged periods. However, you should be aware of the issue, if for no other reason than to remind you that if they case suffers, imagine the effect on your bass.The limitations are simple: the case, while a hard shell design, is not as strong as one made from ABS plastic. The top is relatively flimsy as are the sides. This is not a show stopper if you use the case for home storage and occasional gigs, but if you have a heavy road schedule, and especially of you are not personally loading and unloading the band's gear, this case will not afford you the protection of an ATA-style case.Also note that I have only used this case for a Fender Jazz Bass, so any long-scale J- or P-style basses will fit. I cannot be sure about other brands and models.I mentioned an ATA-style case as a better solution, and it is essential for protecting your instrument if you have heavy road or even local gig schedules. For less demanding protection I recommend that you also consider this case (which I purchased as an upgrade when I became aware of the issues and limitations of the Musician's Gear model:SKB Electric Bass Rectangular Hardshell, standard latches, handle.If you still opt for the Musician's Gear case, you are still getting relatively good value and are certainly making a large step up from a soft gig bag.", "id": 149}, {"review": "I ordered these as both a spare and to use with my lower end keyboard (a Casio PX-320) so I could leave my expensive Roland RD-300NX in my home studio. Much to my surprise this cable is pro quality. It's as noise free as myMonster Rock 21' Instrument Cable, and I cannot tell the difference between the two cables when I am using this one with either or my keyboards. The remainder of this review is going to compare this cable to the Monster model.I'll give the Monster cable a plus for outer jacket and overall construction, but where it matters - signal transmission - I frankly cannot tell the two apart. Part of the reason may be that this cable uses both foil and braided shielding to minimize handling and emissions noise. And I am sure that the oxygen-free copper conductor also has something to do with it. Both the every expensive Monster cable and this one share some high end components and construction.I love the strain relief on this cable more than the one on the Monster. It does a better job of holding flex to a minimum, although the connectors on the Monster are a better quality.Bottom line: the Monster cable wins out in few places, but this one is no slouch or cheaply made piece of junk. In fact, I will probably keep the Monster cables in my home studio and switch completely to this model for gigging. For one thing, there is no discernible degradation in sound quality with this one, and for another this costs a fifth of what I paid for the Monster. Even if you insist on using the more expensive cables, this is a great one to have as a spare.", "id": 168}, {"review": "I use this when myOn Stage Microphone 13-inch Gooseneck, Blackare too long for what I want to do. Sometimes - on rare occasions - I have used this to extend the length of the 13\" model.The mic I mainly use this with is aNady DM70 Drum and Instrument Microphone, which is small, relatively light, and works with saxophones as well as drums and cymbals. When I am using that mic for alto and tenor sax, I use anOn Stage MY550 Microphone Extension Attachment Barto clamp to the pole of a regular microphone stand, and attach the gooseneck and DM70 without using a separate mic stand.Because this and its bigger sibling are so versatile I keep a few of each size around, plus a supply of extra extension attachment bars. In some situations they can be a savior during set up.  I will empahsize, though, that anything larger than the DM70 or DM80 (which is slightly larger and heavier), and this may not hold your mic in place.", "id": 176}, {"review": "These are obviously designed for microphones with the Shure SM-57/58 series form factor. I use mine for the much heavierBlue Microphones enCORE 100 Studio-Grade Dynamic Performance Microphone, and this clip holds it right where I adjust it to.The threads in the base of the clip appear to be precision-machined. Mine effortlessly mate with anOn Stage MSA7040TB Adjustable Microphone Boom, Black, anOn Stage Stands 7701B Tripod Boom Microphone Standand aMusician's Gear Die-Cast Mic Stand Black, which are the only stands with which I've used this clip.Bear in mind that if you are using microphones that are designed with form factors that are different from the Shure SM (and PG and similar), or a different brand that uses that form factor, then this clip will probably not work. Also I cannot vouch for it as a clip for heavy touring, although for local bar gigs it should easily hold up, and at the price you can afford to purchase some spares (actually, you SHOULD do that.)I am personally pleased with mine and do not regret selecting this model. I have five or six on hand, including a few spares, and if I needed more clips, this is the one I would purchase.", "id": 179}, {"review": "This stand is practically indestructible and is ideal for gigging. If you need a boom, simply add anOn Stage MSA7040TB Adjustable Microphone Boom, Blackand you're good to go.In addition to being indestructible, this stand takes up far less stage (or studio) real estate than a tripod type stand like theOn Stage Stands MS7701 Tripod Boom Microphone Stand. And despite the relatively small size of the base, it is far more stable than the tripod stands. Admittedly, this stand is a great deal heavier, so if weight is an issue you may not like this type.Even with a boom fully extended I have found this stand to be stable. For outside use in fair breezes this stand remains upright, which is not always the case with the tripod types. Moreover, there are no legs to break (I have lost one tripod stand to that problem.)If you transport your gear often, and especially if you play outside (or inside on cramped stages) this stand is the best choice in my opinion.", "id": 231}, {"review": "I use this to mount to hi-hat or cymbal stands, as well as on mic stands. See my customer-supplied photos at the top of the page for examples.One thing I love about this extension bar is it will fit over the relatively large diameter down tubes on my hi-hat stands. I use anOn Stage Microphone 13-inch Gooseneck, Blackto connect to the bar, then I attach either aNady DM70 Drum and Instrument Microphoneor DM80 microphone. The bar-gooseneck arrangement is sturdy enough for that mic model.This also works well for mounting on microphone stands. I use it and a shorter gooseneck to mount the DM70 for tenor and alto saxophones, or a DM80 for baritones. Again, it works perfectly for my situations.I always keep a few of these, plus various size goosenecks, just in case I need to mount an additional microphone and I am short on stands. It's one more tool to make set up less stressful.", "id": 246}, {"review": "I recently picked up a used Casio Privia PX-320 and it had a cheesy, little square sustain pedal that slipped around and had a terrible feel. I heard that Casios were finicky about third party pedals, but purchased this anyway.  It worked (I needed to set the polarity switch on this pedal to open).It also worked perfectly on my Roland RD-300NX, but I expected that. What I love about this pedal is it has a fantastic feel that rivals a real piano, and is the equal to the feel of my expensiveRoland RPU-3.One main reason why I gave this five stars in addition to the compatibility is it's built to last. It's heavy, all metal exterior except for the bottom pad, and has a six foot cable that allows you to place it practically anywhere. Plus the price is right. In fact, the entire package is impressive when I compared it to other models that I considered. And it's light years ahead of the OEM pedals that Casio ships with their Privia keyboards.", "id": 251}, {"review": "This stand is probably one of the most popular among smaller bands, jammers and home studio owners because I run across them everywhere. And like everyone else I wound up with a few of my own. Here is what I have learned during the four or so years I have owned and used this model:- For the money they are a bargain and work extremely well in home studios and practice spaces (assuming the areas are not overly cramped.)- They hold up under light gigging and jamming, meaning they are not transported more than two or three days a week.- Good stability inside, even with heavier microphones like theBlue Microphones enCORE 100 Studio-Grade Dynamic Performance Microphone. Not so good outside if there is a fair breeze.I lost one to stepping inadvertently on one of feet, which immediately broke, and another has started binding when I try to extend or collapse the center pole. Those problems are not necessarily quality issues since in the case of the broken tripod it was my fault and not the gear's. As for the binding - I am sure that a good amount of grime has found its way into the tube after four years of use and transporting the stands. Had I taken better care of them those problems may have been prevented.For inexpensive stands these are hard to beat. However, I now use theSeismic Audio - Tripod Microphone Mic Boom Stand - PA/DJ/Band/Church/Wedding use, which I consider to be a superior stand for a small increase in price. Also, for outside use or when stage real estate is an issue I have found the old school styleOn Stage MC7201B Round Base Microphone Stand, Blackto be a far better solution.", "id": 279}, {"review": "I've uploaded customer-supplied images above to show just how much gear one of these is capable of holding and how small the stage or studio footprint is. When you factor in the price it's plain to see that this rack is not only a bargain, but a flexible platform for mounting components.One other characteristic that the images reveals is this is not a table-top only rack. They work very well on the floor.The rack itself is easy to assemble and is built like a tank. I have a bass amp head and a power amp, plus a power conditioner in one of my racks that, combined, weighs around 50 pounds. The rack is not stressed or strained by this weight, and could probably hold another 50 pounds safely and reliably. Another plus is it comes with a bag of high quality mounting screws for components, eliminating that expense (I was expecting to have to orderRaxxess Rack Screws With Washers Hardware (Pack of 25), which turned out to be completely unnecessary.)My only complaint is the rubber feet caps easily fall off, but a little glue rectified that rather trivial problem.If you need portability, reliability and value for smaller gear suites that are frequently moved (such as setting up on stages) this is an ideal solution for rack mounted equipment. I am so pleased with mine that I intend to purchase another one, bringing the total to three.", "id": 322}, {"review": "This clamp on pair of miniature lamps does an excellent job of illuminating music, set lists and notes. The manufacturer claims 12 lumens of light, which is roughly equivalent to a 1 Watt bulb, but the lens and the way the light is diffused make them seem much brighter. Since the design keeps the light somewhat directional they are relatively discreet and will not interfere with others on the stage, in the studio or in the audience.The three batteries will last 28 hours of continuous use according to the spec sheet, and that is in the ballpark of the use time I am getting between battery changes.What I love is the dual heads, each on a gooseneck that is over a foot long. The length gives you a lot of flexibility [no pun intended] for placing the lights exactly where you want them. The goosenecks easily bend and stay in whatever position you bend them to. The clamp is perfect for most stands and has a layer of padding to prevent marring surfaces. The manufacturer claims that this light can be used free standing. Frankly that is a stretch and I would recommend a light designed with a larger base if that is what you are really looking for. This one does work beautifully clamped to music stands, and the illumination will cover both pages of a chart.", "id": 388}, {"review": "For me the combination of color coding and high quality cables make this a great value.It's the cable construction that drew me to these in the first place. The insulators are tough and do not easily nick when being dragged around on rough stages. However, it's the attention to small construction details that I love. The XLR ends are quality components, but cheap, ill fitting junk that some companies use to keep costs down. And unlike those cheap ones these will mate and disengage smoothly.Another factor is the strain reliefs at each end. Those keep the conductors from fraying or breaking inside the cable, which will often occur at cable ends on cables without them.Of course the color coding is a godsend. I can now tell at a glance what is connected to what, both live and in my home studio. I have not experienced any extraneous noise using these, but I am careful to eliminate sources or route around them. Still, these are as good as any other cables I have purchased.I'll also admit that price initially entered into my buying decision. I was frankly concerned that at the price point these would turn out to be junk. Not the case. I can happily say that sometimes you really do get more than you pay for.", "id": 424}, {"review": "I use this to patch in four ports from aBBE DI-400 4 Channel Active Direct Box Direct Injection DI Boxand two from anAlesis Mic Tube Duo Stereo Tube Microphone Preamplifierinto a mixer. First, the size is perfect in my rack configuration. The cables easily reach, and the color coding makes it a snap to see at a glance what is connected to what. That is a great improvement over tags and labels that require you to get close to read.What makes these a bargain is construction. The insulators are tough and do not easily nick when being dragged around on rough stages. However, it's the attention to small construction details that I love. The XLR ends are quality components, but cheap, ill fitting junk that some companies use to keep costs down. And unlike those cheap ones these will mate and disengage smoothly. Another factor is the strain reliefs at each end. Those keep the conductors from fraying or breaking inside the cable, which will often occur at cable ends on cables without them.Overall each cable in this set is constructed to withstand frequent set-up and teardown, and is built to last. If you are shopping for patch cables in this size these are a great value in my opinion because you will probably not have to replace them for years.", "id": 435}, {"review": "The construction of this set is superb. The ends have heavy duty strain reliefs, and the XLR connectors are well made and perfectly mate with receptacles on the devices being patched.Probably the biggest plus is the cable itself, which appears to be heavy gauge - certainly thicker than my other patch sets - and built to last.In addition, I love the attention to detail in the form of color coding, which makes tracing cables behind the rack a lot easier.I have patch cables from different brands and this set does stand out for its quality when compared to the others. And the price is so close to the more generic ones that I have been using that I am switching over to this brand for my future needs.", "id": 438}, {"review": "I have mine attached to one of the support arms on myOn Stage KS8291XX Pro Double X Keyboard Stand. While this attachment is designed for both square and round tube supports, I was unable to use it with anOn Stage 2 Tier Folding Z Keyboard Standeven with the top tier removed. The reasons for the problem with the latter stand is the friction fitting on the attachment bar was too small for the oblong support tube, and had it mated, the height of the attachment bar would not have cleared the top of the keyboard.When attached to theOn Stage KS8291XX Pro Double X Keyboard Standwith anOn Stage MSA7040TB Adjustable Microphone Boom, Blackattached to the top screw-in post that perfectly mates with the boom, this attachment bar/boom combination easily clears the height of either keyboard I use (aRoland RD-300NX Digital Stage Pianoor aRoland V-combo 76 Key Stage Keyboard).Bottom line, make sure your stand can accommodate this attachment bar (according to the manufacturer it will work with most X-style stands), and carefully measure the height of the top of your keyboard from the center of the support arm to which this attachment bar will be inserted. The total height of the attachment bar after insertion is approximately 7.5\".  If your keyboard is still too high for the attachment bar + boom or other mic holder to clear, you can gain an additional 3\" with aShure A26X 3\" Mic Mount Extension Tube.", "id": 495}, {"review": "This stand easily supports my 50 poundFender Frontman 212R 100-Watt 2x12-Inch Guitar Combo Ampat any height setting. In fact, even extended to the highest the this stand supports that amp with no issues from the center of gravity or weight distribution of the amplifier.I love the ease of setting up and breaking down this stand. It is essentially three parts: the base and two removable arms. Granted that this is heavy, but the added weight is there because this thing is built like a tank.In addition to being rock solid, the parts mate perfectly with no slop in tolerances. The support arms slide into the base with no friction or excess movement, and the height adjustment has three nicely spaced positions. You merely pull back on the spring loaded knobs to release the safety pins that engage the arms for position. Once you line up the holes, release the knobs and the pins solidly engage and hold the amp in place.My only complaint - and it is more of a wish - is the tilt of the stand is at a fixed angle. I would love it if I could adjust that too, but I am sure that it would drive up the price of the stand. One final note: these significantly increase the footprint of an amp on stage. Specifically, it increases the depth dimension by nearly 100% of my Frontman 212R, although the difference in length is nominal. I mention this so you can factor that in if you normally play small venues with cramped stages.Overall, this is an excellent stand and one that is stable and heavy-duty. At the current price (at the time of this review) it's a bargain.", "id": 517}, {"review": "This is a rock solid throne that has a wide adjustment range for height and a workable range for the backrest.The height of the backrest is fixed, but you can adjust how far back it can be moved. I am referring to lateral motion and not a tilt angle. The seat itself has a nice, comfortable padding that is about on par with a mid range drum throne (I apologize, but that is my best reference for comparison.)Assembling is simple and fast. I had some issues lining up the seat height that stemmed from the need to perfectly align two outer and two inner holes in the frame and seat bar, but after getting a feel for the tight tolerances I managed to get it done with no problems.Another thing to note is this is primarily for guitarists. The foot rests are not going to be much used by drummers in particular, nor by keyboardists whose feet will probably be busy with sustain and expression pedals. However. this is still ideal for keyboardists because the seat is comfortable and the backrest promotes good posture.I used this with drums. but be aware that the seat will not swivel, so the front bar across the bottom can interfere with pedals and your snare drum stand - unless you move it back a bit.The final note is this is heavy and somewhat clunky to transport. It's not a deal breaker. On the contrary, it will reduce performance fatigue because of the ergonomic design and that alone offsets any inconvenience.", "id": 518}, {"review": "I have used this pedal on both myRoland RD-300NX Digital Pianoand myRoland V-Combo VR-700and it's one hundred percent compatible with both. One nice feature that ensures compatibility is the polarity switch that enables it to work with just about any brand and model keyboard.It's well constructed and I have not encountered any issues with the two-piece bottom. In fact, after over a year of use on carpet issues reported by another have not surfaced. If anything this pedal is as good as new.The feel is superb. There is positive resistance as you depress the pedal and the spring tensions it in such a manner that you can control exactly the rate of depression or release. It is not so tight as to fatigue, but the response is positive.Another feature I love is the six foot cord length - it gives you room to place the pedal when you have tiered keyboards and multiple pedals on the floor. The cable itself and the plug look to be high quality and have withstood over a year of constant use with no problems.If you are looking for an inexpensive, but not cheaply made, pedal that will work with just about any keyboard this one is worth considering. I am sold on it and would replace it with an identical pedal if something happens to this one.", "id": 537}, {"review": "I purchased this for handling convenience more than any other reason. I useOn Stage SS7761B Tripod Speaker Stands, which are light duty, but awkward to carry. This case solves that problem. When I mentioned light duty in the title, I truly meant it. While I gig twenty times per month, nearly all are totally acoustic, with a small powered speaker for rooms where the pianist/vocalist has to project over a grand piano. On very rare occasions do we need a full PA, and that is where this case comes in handy. Moving individual speaker stands from my vehicle to the performance area is awkward. Transporting them in this case isn't.These hold up beautifully if used three or four times per month when a full PA is needed. I am not sure I would want them for the heavier, all metal speaker stands because the weight would quickly wear the case out. It has reinforced stress points, but I still feel those are not adequate for heavier stands.You can easily fit the two stands that I mentioned above and aOn Stage Stands MS7701 Tripod Boom Microphone Stand. The side pocket is good for incidentals like XLR to 1/4 inch adapters, patch cables and the like.Bottom line: this case is for occasional use only, and even then for lighter stands. I awarded it five stars because it does exactly what I need and is not touted to be anything but a light weight case.", "id": 552}, {"review": "I had two of these and wound up selling one because I never used it. The one I kept is currently serving as a keyboard amp for two keyboards (simultaneously): aRoland RD-300NX Digital Stage Pianoand aRoland V-combo 76 Key Stage Keyboard. I was able to do this because there are two inputs on the front of the amp. Input 1 is designed for normal sensitivity and Input 2 is designed for guitars with active pickups. Thus far I have had no problems with both boards connected at the same time, and it does not seem to matter which board is connected to which input.The sound is impressive. Exceptionally clean, and the amp provides controls to allow you to contour your sound, which helps significantly when running keyboards through it.  Moreover, the amp is loud if you choose to make it so, and even at high-gain settings it has ample headroom.If you want distortion, this is probably not the amp for you. You can switch it from clean to drive to more drive, but it is essentially still a clean sounding amp. I find this to be a plus, but I have met my share of guitarists who think otherwise.Another great feature is you can daisychain these amps using the Pre-Out on the master to the Pwr-In on the aux amp(s). You can also use these two jacks to run an effects loop. I personally have no use for those features, but I can see how they could be useful.Overall, I love the amp and wish Fender made a single 12\" model because it is pretty heavy and bulky. Those are hardly significant complaints since I sometimes regret selling my second one because if something happens to the one I still have I would replace it immediately.", "id": 559}, {"review": "I have owned a few of these and they hold up perfectly. What I love is they do not introduce noise in the signal path, and have some nice touches in the way they are made.One of those 'nice touches' is a strain relief at both ends, which will prolong the life of the cable as well as prevent micro breaks in the conductor that can (and will) introduce noise and static eventually. The plugs are also of the highest quality. They mate perfectly with 1/4\" receptacles on guitars and amps.I mentioned that these are for inside playing. What I mean is for outside gigs on rough concrete, cobblestone and similar surfaces the outer jacket will fray as the cable is dragged across the surface. That is not a negative aspect of the jacket as much as a reality of the material from which the jacket is made.Otherwise this is a bargain when you consider the quality, price and performance. Get one as a spare if for no other reason because I think you will be pleased with it.", "id": 586}, {"review": "I've been playing with my brother's Lunchbox and when he first plugged in for a jam at his house I thought he was joking. This amp can easily cut through drums, even in the close confines of his practice studio. Granted, I am not a heavy hitter, but we were messing around with come classic rock from the early 60s and this amp at three on the volume knob was plenty loud.The tone is very good, but not exceptional. It's not as clean as a Fender or Jazz Chorus, but it's still better than many of the amps I've listened to. If you want to make this a spectacular tome machine plug aBoss FBM-1 Fender '59 Bassman Pedalinto it.About the quirks. The ambiance knob is no substitute for reverb. It does give a hall-like sound as you increase it, but was designed to simulate an open back amp more than a true effect. The gain controls the input signal to the amp, and according to the manual is more like a soft overdrive. The volume level is solely controlled with the volume knob with the gain knob playing no real role in how loud the amp gets. Finally, the speaker switch on the rear is for turning the internal speaker on and off, not the speaker out circuit for routing the signal to an external cab. That means that you can use ths amp as a head by turning the 6.5 inch internal speaker off, or have it active with a cab as a set of external speakers in addition to the internal one.Plugging phones into the headphone jack will NOT turn off the internal speaker. You need to do that with the speaker switch. Personally I love that feature because you can also use the phones jack as an output to a PA with the amp's internal speaker still active.You definitely need to follow the instruction manual, and especially the advanced user's guide, or you may be initially disappointed. My brother returned the first unit he purchased because there was a pop when it was turned on or off, as well as a slight hum when it was idling. The replacement amp exhibited the same problems. However, if you follow the manuals (plural) you can prevent both problems. I mentioned quirks - the power on and off procedure and positioning the gain knob to the mid level are the keys to smoothing the amp out.Bottom line: this tiny amp packs a punch and has sound characteristics that have to be heard to believe. If you want true reverb you will need to plug in a pedal (check out theBoss FRV-1 63 Fender Reverb Pedalif you haven't already), but for small venues and practice rooms the ambiance feature is probably all you need. Do take the time to read the documentation before you start using it because when this amp is properly used it's simply amazing.", "id": 685}, {"review": "I purchased mine to protect a relatively inexpensive Epiphone Les Paul Jr, which fits perfectly (as does a Squier Strat.)On the plus side, the price makes this an attractive alternative to most of the soft gig bags on the market because you are getting a rigid case that can take some (but not a lot) of abuse.The reason I claimed that this case will provide only basic protection is it does not have the top and side strength to protect an instrument if you stack heavy equipment on the case when packing your gear. That should not be a problem or detract from the value as long as you are aware of this. One other issue I've had with the case is I left in a car on a hot day the tolex covering started lifting from the edges, especially the lip around the top of the case. Again, this is not a problem as long as you are aware of it and do not leave the case in a hot, enclosed space for prolonged periods.For inexpensive guitars this is an ideal case that will provide protection for your instrument. It is perfect for occasional gigging, but would probably not withstand the rigors of being on the road. I would not hesitate to purchase another one if I acquired a guitar with a soft gig bag because I do like the better protection this particular case provides.", "id": 751}, {"review": "I was leery of this since it was half the total price of just about every other one I considered. Because of the return policy I took a chance and am not only glad I did, but am also thoroughly impressed with this hanger.First, I doubt if I could build one for anywhere near the price of this if I purchased the materials locally. Factor in that shipping (at the time of my purchase) is free and this is a no brainer.Installation is also a no bainer and made so by the mounting hardware that comes with the hanger.There is one concern you may have. If you have instruments with nitrocellulose finishes the protective rubber sleeves on the hanging fork may eat into those finishes. Personally, mine are being used to hang a cheap Squire Strat and J-bass, and an Epiphone Les Pail Junior II - instruments more decorative than functional. I am not saying the sleeves will ruin the finish, but merely raising that possibility to help you to make a purchase decision.The bottom line, though, is if you are hanging guitars that do not have a nitrocellulose finish these hangers are a bargain. In fact, they are probably the best deal you are likely to find and are worth every cent.", "id": 779}, {"review": "I purchased this to add basic effects to a small PA based on daisy-chainedPowerwerks PW50 Portable PA Systemheads and got a lot more than I bargained for.The effects are beautifully done. Reverb sounds natural and there is a wide range of choices for both reverb and echo. For the record I keep mine set at Club with the wet/dry knob set to a straight 12 o'clock position. Wet means more of the effect and dry means less.There is a mic gain on the left side of the unit, and the mic input (XLR only) has phantom power. The XLR out goes straight to your mixer. There is also a USB port for software I do not use so I cannot speak to that feature.The unexpected bonus on this device is the tone feature, which I leave on. It adds a dimension to vocals that does not interfere with them, not does it alter them in ways that are mechanical sounding - you can set it for minor to major pitch correction. I suspect that most folks will want less of this than more.Overall this is a perfect addition to a vocalist's toolbox because it is straightforward to use and relatively inexpensive. It's also perfect for adding vocal effects to small, bare-bones PA systems. It transformed mine from essentially a loudspeaker to a true PA.", "id": 849}, {"review": "I needed a new stand for my home studio so I thought I was cutting corners when I purchased this one. As it turns out, this stand is practically indistinguishable from myBelmonte Orchestra Stand Deluxein construction and material quality. That stand sells for twice the price of this one at the time of this review.The stand is adjustable enough for sitting or standing musicians, and is stable enough to use outside. The rest/tray mechanism holds a lot of weight without losing any adjustments. In fact, I have attached anAleratec Universal Tablet Mountto hold an iPad with sufficient room left over for a 438 page copy of theThe New Real Book - Volume 1and it holds those rock steady.Another feature that I like is the legs can be configured like a tripod with varying angles, which is useful for outdoors with light breezes that would knock over lighter stands. Or you can set the legs flush for maximum stability if space and the stand's footprint are not problems.Bottom line: this is a professional grade stand at a student stand price. I am thoroughly pleased with it and if ever I need another stand this is the model I will purchase.", "id": 858}, {"review": "I purchased this when it was on sale during the Christmas season - I figured that for the asking price at the time I could not go wrong.My expectations were frankly low. I had heard nothing but horrible things about Epiphones, with the main complaint being they would not stay in tune. Other complaints included poor overall quality and terrible playability. What I received was the polar opposite: I received an instrument with a strikingly beautiful finish, and one that stays in tune (amazingly it was close to being in perfect tune when I unboxed it.)I am not wild about the strings that came stock, but I am a drummer and suffer the same disappointment about heads that ship with new drums. I guess guitarists expect to change strings on a new guitar the same way drummers do when it comes to heads. In the near future I intend to restring the guitar withD'Addario ECG25 Chromes Flat Wound Electric Guitar Strings, Light, 12-52, which, while thick, should make the instrument jazz-friendly. I realize that flatwound strings will require a new set-up and intonation, but considering how good the guitar is and how relatively little it cost me, the new strings and work will be an investment.Out of the box, though, the action was reasonably low and the frets appeared [to my novice eyes and fingers] to be properly dressed. I have already invested in a good - but not great case:Guardian Hardshell Electric Guitar Caseto store the guitar (I also uploaded a customer-provided photo on this page that shows the case and how well the guitar fits.)For the record, I use the following amp, which I have also reviewed that is a perfect match to this guitar:Kustom Defender 15 Watt Class A Guitar Headthat I run through aKustom  The Defender 1 x 12 Guitar Extension Cabinet for 5H Head.Bottom line: this is a great instrument for beginners and not a bad one for experienced players. The price is right, and the quality clearly shows that off shore manufacturers have made significant improvements over the past year.", "id": 31}, {"review": "I own two of these and they are perfect for home studio vocals, and a step above dynamic mics as long as you run this one through a pre (I use aPreSonus Tubepre Single-Channel Vacuum Tube Mic Pre. No matter which pre you get make sure it can supply phantom power because this mic needs it.Also, this model is XLR only. Even if you get an XLR to TRS adapter you will not be able to provide phantom power to it with that arrangement, so make sure that your mixer has a spare XLR input for this mic, and that it will provide phantom power if you skip my recommendation to get a pre amp.There are a few other things you need to know or consider if this is your first condenser mic: use the included shock mount because this mic picks up handling noise. Merely touching it will show up as ambient noise in your mix. A pop filter is essential.This mic is not optimal for live performances because it's delicate and does not lend itself to excess handling. It is perfect in controlled, stationary environments like home studios. Another reason is itd will pick up a lot of nearby stage noise if not placed in a 'sweet spot'.I mentioned that this is perfect for vocals and it is. However, it is not the best solution for micing instruments or amps, especially those in the lower registers. One of the main reasons for this is the low end frequency response is starts at 30Hz. You would be better off with a mic that goes down to 20Hz for instruments and amps.Bottom line: this is a great entry level condenser mic, especially for folks on a budget. As long as you understand its limitations and operating characteristics you should be pleased with it. I have had mine for almost four years and both have held up and and still sound great for vocals.", "id": 159}, {"review": "One of these is more than sufficient for small venues as a main keyboard amp with channels for a mic and backing track. A pair of these connected via the stereo link jacks will handle larger venues including outside gigs. They can  be configured as a master/slave set-up with a single link cable (a 1/4 inch speaker cable), or with two cables two fully functioning amps that can handle ten inputs, assuming five inputs per CM-30. In reality the single cable configuration is more than sufficient.The low, mid and high range frequencies are perfect for either a piano or organ. I have run both aRoland RD-300NX Digital PianoandRoland V-Combo VR-700. The grand piano setting on the RD-300NX sounds like the real thing out of this amp, as does the B3 emulation from the V-Combo.I did a direct comparison with this against aMackie SRM150 5.25-Inch Compact Active PA Systemand the sound of this beat it hand's down. Bear in mind that this was designed for keyboards so the sound has been optimized for instruments in their frequency range.Vocals through the channel with the XLR are adequate, but not particularly spectacular. Also, there is no phantom power or ground lift features, so you will not be able to use this in a studio with condenser mics or correct electrical imbalances. That leads me to conclude that this is best for live performances.I use mine as a powered main, but it is designed to function as a monitor with the main controls on the front of the box. That is somewhat inconvenient when using it as a main because the controls will be facing away from you. However, once the levels are set during sound check you can control the levels via your instrument's volume and EQ controls.There are a few things to note regarding mounting this on a mic stand. First, the manual recommends that the total height from the top of the CM-30 to the floor not exceed 43 inches. I agree. This may be relatively small, but it's heavy at over twelve pounds and the center of gravity at the limited of the recommended height is fairly high. It's easy to tip over, especially of you are not using a tripod style mic stand with the legs fully extended.", "id": 410}, {"review": "My Instant Order Update notice shows that I purchased this in December 3, 2010, and during the time I've owned this cable it has been heavily used and is still noise-free and perfect in all respects.  For context I purchased it to connect a mic tube pre-amp to a mixer, so it has been set up and torn down many times in the past two and a half years.Key points that earn the five stars is the heavy duty strain reliefs, which keep the inside conductors from bending and stressing. I am guessing those are why this patch continues to be noise free and provide a strong signal.  Also, the XLR connectors are of the highest quality. In the past I have cut corners only to find that small details like connectors do not always mate well. Not so with these. They engage and disengage without binding or looseness. Bear in mind that they have been in frequent use - inserted and removed hundreds of times.The outer jacket is fairly thick, which to me is an indication that the manufacturer did not cut corners when this cable was constructed.Overall I am pleased because this patch has withstood a lot of use and has held up perfectly. I would not hesitate to purchase more of this brand and model if I need additional ones.", "id": 554}]