[{"review": "Now-a-days I just search amazon because they have always got what I want at reasonable prices. This is no exception. I am not a musican but wanted a case to carry my Epiphone Les Paul Custom Pro to the guitar guy for setup etc. This was was better then I expected. It is sturdy outside and nice fusion inside with a tight but not too tight fit. In other words great all around. I know it sits on a self with many other guitars when I take it in to the guitar guys so I am perfectly confident that it is well protected. and it is lockable (with key)If you are looking for a more then good case for your Epi LP just get this one. You will not be disappointed.Also. I ordered it on a tuesday and it came the next day. No special shipping. Maybe it is my locations but that was great too. Well packed.", "id": 50}, {"review": "How much can you say about a patch cable. This is a good one at a good price.I recommend it.", "id": 578}, {"review": "Too much noise with one spot. This was way better.Lot of feature.Outlets 1&#8211;3 can all be used to power either 9V or 12V pedals. For each outlet, just use the VOLTAGE SELECTOR switches to choose the voltage you need, plug in your pedal and go!Outlet 4 works the same way and gives you a similar choice &#8211; except that it&#8217;s between 9V and 18V.Outlets 5 and 6 may only be used one at a time. If you use them both at the same time, you might get some noise. Like outlets 1&#8211;3, outlet 5 gives you a choice between 9V and 12V. Outlet 6 is a 12V AC outlet for pedals that require AC power.6 isolated outputs delivering 300mA each (centre pin is negative) AC output at connector 6. Will power all pedals.Most of my pedals are 20 to 30 mA. So potentially I could have 40 plus pedals in a chain. AwesomeAll the cables you needLike all T-Rex Fuel Tank power supplies, your new Chameleon comes with a full set of cables to help you keep your board clutter-free. Once you&#8217;ve selected your voltage options, just plug in and play!Excellent!Don't even think about it.Just get it.Highly recommend it", "id": 713}, {"review": "I thought I was using good guitar cables but I kept getting intermittence with one.So I tried this Monster cable. It eliminated the problem.My only minor complaint is that it is very stiff. This is minor but no matter what I do it curls up unless you have it fully extended.I would still recommend it though.", "id": 126}, {"review": "This is a good looking strap. Much lighter and thinner then any strap that I have had. It has to be half the weight of others but that makes it very comfortable.Looks great on my blond Tele.The price is right as well.I like it", "id": 353}, {"review": "This is an excellent choice if you're looking for a nice analog delay with a small footprint.It looks great, it's easy to use, and it's a fantastic size for a delay pedal.The analog delay is nice and warm -- much more satisfying than digital delay to my ears. Also, the modulation button enables you to add a chorusing effect to the delays.There is a internal adjustment that I don't think I will need to use for now anyway.I highly recommend it !", "id": 507}]