[{"review": "fist off, guitar center had this for 29 bucks!!! I KNOW RIGHT. It was in front of the tag for this (30 bucks) and the sp-1 for 14.99 so I got it, but it was in the wrong spot, I went, got the price tag, and after minimal drama, they gave it to me for the price they had it INCORRECTLY listed.that said, the pedal is great. The problem people have with the pedal, as I can see it, if they say it or not, is that some sounds DON'T HAVE THE SAME SUSTAIN AS A PIANO OR SYNTH SOUND. It has been fun playing organ sounds and trying to \"pump the pedal\" to keep sustain and not \"wash out\" the tone. this thing is great and if anyone needs a pedal for their synth (I have a casio wtk-4200 I believe), it is as good as you need. As said, any over-sustaining is when you need to learn when and where to release and start the sustain again, which is the true art of it. 30 bucks? robbers.", "id": 251}, {"review": "If you want an eq pedal right away to tweak guitar/keyboard sounds, this think is GREAT. People are trying to hate on this, but it is fine, I was expecting the worst from the reviews, but still wanted it so I got it anyway. You don't need the adapter they push (the behringer brand 9v), best way to work with this is turn all bands ALL THE WAY DOWN, then just go up with each one till you get the guitar sound you like, then you can turn it off during this test to go back to your \"default/normal sound\" to hear the difference. It works nicely, and for the price it was a steal. In the future I may get a more expensive one, this seems fine for now.", "id": 380}, {"review": "loved this thing, I have since lost it, as happens with little doo-hickeys like this, lol. worked good. pretty precise, meaning you will fight with it to where it is happy. sometimes it felt a little off, but robots know best, right?", "id": 394}, {"review": "got this to run instruments into my comp to use with sony acid, and this works well. I had problems with the sony acid (latency, boo) and while I downloaded an asio program to cut the latency, I don't use it really now, but is good to have when and if I use the sony for recording and not just mixing. the stereo sound on this is great, like true guitar stereo.", "id": 639}, {"review": "sing that in a drivin and cryin 90s alt rock way. why? cause that's what this bad boy (or girl to be pc) does. It is instant ideas. The thing that makes this so simple and effective is you can simply record a riff (or melody/top part), then create around it, loop by loop, or just one idea with another on top. As simple as this sounds, otherwise, you would have to record a track, then play over that, taking time and killing inspiration in the process.There are others on the market, to be sure. I had the boss looper with 2 pedals, and it was noisy on playback. That was years ago, and I couldn't get rid of it fast enough! I've used delay pedals my whole life, and being a fan of shoegaze/dream pop, I have always had a love of layered guitars/loops, a la the church or the chameleons, or chapterhouse, lush, house of love, and stuff.I looked on youtube and read reviews for a while before my purchase, as I don't have money to waste. This seemed to be the best choice for me. The use of this live, especially without the footswitch (sold seperately), would be tough to be sure. There are some stop and start moments, as to be the case with loopers. The only one I've seen that seems seamless is the boss one or roland one with like 5 pedals and is like 700 bucks maybe more. There are demos of a guy looping himself with different instruments all running into it. For the price, it should be and is great.This little wonder though, is fantastic. The price can't be beat, and it doesn't suck up tone as some of the other ones do from what I've read. The thing I would say is, it's best for recording, and to use as an audio notepad in a way. You can use saved loops in songs, but since they are already formed, so it's silly to start a song with 5 guitars in a dense dance!my last thought on this, this is a secret, come closer......closer now...come on I won't bite..........A VOLUME PEDAL! that way you can layer with different adjusted levels and not bending down and fixing levels and such. sounds simple, but you'll see. I am going to look for a decent one.", "id": 668}, {"review": "My review(s) for this have changed a few times, but no more. When I first got it I liked the sound, though it did sound a little cold and digital, and this is from someone wanting to record shoegaze/dreampop, which by it's nature is full of cold tones (reverb/chorus/delay) shimmering, a la cocteau twins, chapterhouse, lush, so at first I thought it was great. Then the fuse software was even cooler, all this customizing the sound, though it did sound noisy and needed the compressor to take some of the noise away.After all of that I finally realized I was trying to ignore the fizz/crackle/hair, it's called a few things. Go to the fender forums and look it up, or search it on yahoo/google.The thing happening with this amp I think is a few things. Fender guitars sound best through it, which is silly if you don't own a fender, and I don't and refuse to get a squire as that body is so played out, I wanted ANYTHING but a strat body, unless I have a grand to pay for an older one, I'm not going to get a rinky dink one, and I would only get one after I got like 5 other dream guitars first.so everyone has different problems with pickup quality and guitar quality. Also, playing into a modeling amp is like playing into a computer, that may be fine for some (younger folks), but to a lot of people I've read the complaints I was trying not to realize, as I didn't feel like having to pay for shipping to return it, BUT I DID!And I am so glad I did. I almost got a peavey vypyr, and I am glad I didn't. This amp, to be fair, is really close to being really cool, but that sound problem, which I read on fender's own forum/website, FENDER ACKNOWLEDGES IT EXISTS, BUT DOES NOTHING TO FIX IT IN FUTURE MODELS!! sorry, but that's some big company b.s.I've been reading of people saying it sounds cold and lifeless and all that and tube this and tube that, and I was like \"what music snobs\" and what have you. But I realized that I'm a music snob! I love the music I listen to more than anything, and feel like the music I create should have a life to it as well. So I returned the mustang 2 and ALMOST got a marshall mg 30 watt, cause I wanted an amp with a clean sound that didn't have that crackle sound, but THANKFULLY I caught myself before that return, as after that, it would have been final.The decision I did make I think will be great for me, as I'd rather start with a good real tone, then get the effects I need. I kept reading reviews of these teenagers that hadn't played for more than a year or two or so saying \"throw away your pedals, you won't need them\" and \"I was going to get pedals, but don't need to now\", that's kind of the danger of these amps, they end up making everyone sound the same! No matter what tweaking I was doing on the mustang, it sounded the same but in a different costume.I think this amp and modeling amps are best for beginning guitarists and I've seen some old timers getting an amp for home use after years, maybe that's for them, but I needed something to record with and practice and get the best, most real tone possible, so that means tube amp.I think if I played this at a GC I wouldn't of gotten it, and I just tried to make myself like it.", "id": 719}, {"review": "I use this every now and then, it does seem to suck tone, but it does reduce noise, though I actually stopped using it and didn't hear much difference! with distortion and reverb, things can get a little noisy in there, but the original tone with everything set up is worth it unaltered. but I will keep this as it will come in handy one day I'm sure.", "id": 740}, {"review": "just make sure you get this when you get the tascam. I didn't run it without this power source, that seems too ghetto. they should just jack the price to what it would be with this and viola! but what do I know.", "id": 461}]