[{"review": "Purchased after another folding stand which cost the same $$$ literally fell apart.  This one is much better although not quite as portable.  On the plus side, music stays put on this one, it's very stable and the height is fully adjustable.  You can buy with confidence.", "id": 155}, {"review": "Using this for a PRS electric guitar with satisfactory results.  Easy to set up. Sturdy enough for repeated use.  No worries about using this with an expensive instrument.  Simply put, it's well made and works great.", "id": 436}, {"review": "This light clips on the back of the stand and hold nicely.  The light from the LEDs has a blue tint to it. I'd prefer something more 'white'. Each light can be controlled individually and has a low and high setting. I gave 4 starts because it doesn't get quite as bright as I'd like but it does the job.  It seems well-made and will operate off battery power as well as an AC adapter which is included.", "id": 524}, {"review": "Purchased two of these to hang up guitars at home.  I saw them used in a guitar shop so I assumed they were more than sufficient for use at home. I'm using them with both acoustic and electric guitars. They appear to be designed to hang the guitar away from the wall to avoid abrasions on the back and they do just that. The hooks can be stretched apart or squeezed together to fit the headstock of the guitar.  Overall, they are attractive, well-made hangars.", "id": 154}, {"review": "I gave it five stars! I purchased this for my young son but I find myself drawn to it because of all the really great things this amp does.  I wanted something flexible and decided to buy the Mustang III over the II because of the power and the larger speaker.I've read the reviews here and they pretty much sum up what I think about the amp. It sounds great and it has loads of power.  Since it's solid-state, it falls apart a bit when pushed really hard and lacks a little at the bottom end, but for this price?!? Wow! I have no complaints.One thing most have failed to mention is the non-amp features like the input for an MP3 player and the Fuse software that comes with the amp for customizing tones, creating jam tracks and setting up the amp to suit his tastes. Both Mac and Windows are supported. My son is a newer guitarist and has used these things extensively. Since he's 11, he doesn't have many opportunities to play with others. He can create jam/click tracks and play along. We also downloaded new firmware from Fender and used the software to eliminate a fizz issue that existed in earlier versions.People who own this amp can create their own tones and tracks, then upload them to Fender's user web site. We watched a David Gilmour concert and he was inspired. He wanted a tone that sounded like his. We downloaded a few Pink Floyd tones created by other people.  One of them was particularly great. We tweaked the delay settings a bit and saved it.  He loves it.Great amp. I can't compare to Line 6 but I can compare it to other amps I've heard. It's pretty nice.  Equally nice is the fact he can experiment with tones without spending a pile of $$$ on FX.", "id": 737}]