[{"review": "My 8th graders are literally beating the crap out of these sticks. They are good and reasonably priced.  The principal is mad at me because I told them that a real drummer plays constantly, so the walls in the halls, cafeteria tables, and classroom desks are getting pounded constantly.", "id": 151}, {"review": "I bought this pedal new, hoping to get an electric solid body guitar to sound somewhat like an acoustic guitar on stage.  I knew going in that it would not sound like a Martin D-28, but I thought it would be good enough to play a couple of acoustic parts without having to switch guitars.Imagine my profound disappointment.Really, Boss??? This is by far the worst pedal I have ever used of yours.  This thing has a terrible hiss when you turn the \"Top\" control higher than about 9 o'clock.  At first I thought I must have a defective unit, but then I started reading reviews on-line.  Seems like it is part of the design. It's too bad because one can hear some promise in the faux acoustic tones, hidden beneath a wall of fizz. Totally unusable, as far as I'm concerned. By the way, I tested it direct to a PA as well as into a guitar amp with a single coil guitar (strat).", "id": 411}, {"review": "Ha, Amazon rejected my first review because I mentioned a competitor by name (chickens). Let's just say that the price is excellent, much better than the competition, and the cables work great.  How's that?", "id": 426}, {"review": "I'm not a big fan of Planet Waves because they ruined the Dare Strap, but this is a good product - it definitely helps alleviate the weight on your shoulder.", "id": 452}, {"review": "These are great strings.  I thought the bullet end was BS hype, but I really think it makes the string stronger and the sound clearer. And even if that is my rusty ears lying to me, I can say with conviction that they definitely fit better with my G&L Legacy guitars - regular strings had the little extra wind from the ball end coming right up to the saddle in some cases - these solve that problem.", "id": 679}, {"review": "Something about EB Strings, they really are \"slinky\" - whatever that means. They have a cool vibe and make my guitars sound better.  Plus they are a little easier on the fingers than the other big brands.", "id": 812}, {"review": "Easy to adjust and holds the iPad secure.  I actually have 2 iPads on one mic stand (one shows charts while the other plays backing tracks).  No issues at all and would order again.", "id": 831}, {"review": "This is a nice product that is perfect for someone like me, basically a one man band.  Guitar is my primary instrument and I am a decent singer, but not great.  This can help clean up my vocals and is helpful if you occasionally stray off key (a little).  Very simple to operate.  Like most swiss army knives it can do a lot of things pretty well but none of them great. Hvr, considering the price, I think it's excellent.  Would buy it again if stolen (as they say).", "id": 849}]