[{"review": "I recently bought a few packs of Jazz IIIs and I was shocked.  They don't play at all like what I was expecting.  Under high magnification the edge doesn't look the same as the old Jazz III either, and they don't play the same if you turn them over!!!  What's up with that?I'm sorry to give such a poor review to a great brand like Dunlop.  Let's hope this is just a short-term fluke.", "id": 67}, {"review": "This stand works fine if you don't need a shock mount.  The base is wide and heavy enough to secure the mic well and defeat most vibrations.  I ran into trouble when trying to mount a R0DE NT2-A mic on a shock mount.  The low height (4 1/2\") - which would otherwise help stabilize the mic - left too little clearance between the mic and desktop.  If you think you might upgrade and someday use this stand with a shock mounted mic, you're better off buying the slightly more expensiveOn Stage DS7200B Adjustable Desk Microphone Stand, Black.BTW, my copy of this stand also did not have the 3/8 inch male thread.", "id": 250}, {"review": "I'm really happy with the Black Ice Heavy picks (1.10 mm), which I bought after being badly disappointed with my last order of Dunlop Jazz IIIs.I would call the Black Ice picks medium sized.  They are roughly the same size and shape as Fender 551 picks, but a little bigger than the Jazz IIIs.  They are stiffer than the 551s and perhaps a touch less stiff than the IIIs (and thinner than the IIIs too).One thing that may account for the nice way the Black Ice perform is that the edges are beveled and smoothly finished in a way which differs from the 551s (which I still like) and from the Jazz IIIs.In terms of playability, they are about the same to me as any other pick of this shape and stiffness.But the most important thing to me is the hardest thing to communicate to you:  The tone.  I love the tone I get with these picks, and the best I can do for you is to say that I was looking for a pick that would generate a solid, mellow jazz tone with an archtop - a tone that reminds me of say, Barney Kessel (but without Barney's chops of coursse).  This is what the Black Ice delivers.", "id": 576}, {"review": "I bought this pedal, tried it out and returned it.  On the plus side, it is quiet, sturdy, has a reasonable footprint, does not suck tone, and it is passive.  But the feel was not quite right for me:  Even with the adjustable tension - I couldn't lock it in to where I wanted it.  I'm very used to the Ernie Ball pedals, and I also like the new Morley Volume Plus.But to be fair, pedal tension is a pretty personal factor, and this might easily be a 5 star product for you.", "id": 673}, {"review": "My main complaint is that this tuner is only approximately accurate.  It also occasionally fails to register at all.  I've tried putting in slightly different positions on the head of my guitars, but the contact is sporadic.  I A/B ed the Snark against two other tuners, and the snark fails to show notes that are a little flat and sometimes shows false sharp readings.  The other two tuners agree with each other and sound right to my ear.  Most people like this tuner, and on the plus side I also liked its convenience and the ease with which the results can be read.  Unfortunately my copy did not nail the pitch.", "id": 724}]