[{"review": "I've used the Tortex picks for a while now, and have been really happy with them. This pick however, takes it to the next level. Very strong and great bite for a relatively thin pick. I use the .73 for acoustic and the same holds true. Great product.", "id": 54}, {"review": "I've used these strings for quite a while now. They have a fantactic tonal quality and longevity. If you're looking for a good string that last a fair amount of time before dead string syndrome hits... I'd recommend these.", "id": 60}, {"review": "This is an excellent product. I've used one of these before, and don't remember it having lock washers... this does. When you tighten this down, it actually stays tightened.For $10 you cannot go wrong with this. Bear in mind that it's for a standard 10 hole diatonic harmonica, not the 16 hole chromatic style.", "id": 354}, {"review": "I bought this for a friend who's previous tuner was lost. I have to say... I've been so impressed by how easy this is to read, that I'll probably buy one for myself now.Other than a great display and accurate tuning... this is made with a move-able arm between the tuner and the clip. The arm is a dual ball joint and allows you to configure this is any position you'd like.I wasn't expecting it to be this nice. Very cool!", "id": 811}, {"review": "Let me start by saying that I never even opened these. I've given it a 3 star merely out of respect for Hohner. I have no clue how they play, so you'll have to look at other review for that info.I ordered this product based on the fact that the description states \"Includes a deluxe, red pro type hard shell case\". Well... not from Music123 it doesn't. When I asked Music123 about this, they said \"oh... well, we provide Amazon with our catalogue, and we leave it up their discretion to input the pictures and descriptions of our items\". REALLY!!!???Not only did this not come in the red case (which I didn't really care about anyway), it didn't come in any version of this case style (which I was interested in). The case that's shown, is the case that's sold individually on many sites for $19. So I figured... wow!... what the heck? I'm getting 7 harmonicas that cost $6 a piece if puchased individually, and I'm getting a $19 case with them. You'd be silly not to bite on that, right? Well... they came in a cheaper, nondescript black zipper case, not the one with the Hohner logo on it. Save your money and order this through Musicians Friend. It's the same price, free shipping, and you get the actual item as it's described on their site.In closing... it's been a week since I sent this product back to Music123, and I still have not received my refund. Do yourself a favor and avoid them!!!", "id": 693}]