[{"review": "This cable disproves the notion that you get what you pay for. It's quality outweighs its price. Let's face it, a cable is a cable is a cable. But the quality of these cables can vary greatly. I replaced a lighter cable with this one and I was surprised at the difference in the quality of the sound from my amp. I have an Ibanez ART series guitar into an Ibanez 15 watt amp set up in my home. With nothing changed but the cable, there was a significant difference in quality and volume. So much so that I checked with my guitar teacher who said he was not surprised. The quality appears good. The ends are heavy duty and the little bit of hum I had due to the proximity of everything was attenuated to the point where it was inconsequential. I've seen more expensive cables and this one is (so far) great.Hosa GTR210 Guitar Cable 10 Ft", "id": 6}, {"review": "Nothing special. Just like every other strap of its kind. I compared it to other poly straps I have and it's OK. No better and no worse. Price was good. It took a long time to come. Leather ends seem OK. I mention that because it appears to be the main complaint..I'm using it as a spare so it should be OK. I'm a little disappointed. I'm used to a higher quality from EB products. It is very adjustable and should be able to be used by nearly everyone. I don't perform a lot of antics on stage, it's just me and the axe. I don't expect any problems. Hope this helps. Small &#34;thumbs up&#34; to Amazon.", "id": 74}, {"review": "Although it is touted for acoustic guitars, it works well with my Ibanez Electric as well as my dreadnaught and acoustic/electric. The spring is tough and it holds securely. On and off is a quick process if you have the hand/finger strength to operate it. I rate it 4 stars only because I just received it and haven't had a chance to use it much. But, I like it so far. It was delivered quickly. It does the job. I'll update after I've had it for awhile.", "id": 116}, {"review": "I sent this to my grown daughter for her birthday and she has been very pleased with the product. I have three tuners myself and I find the Korg to be portable, easy to use and easy to read. Battery life appears to be adequate. Oh, and not to forget...accurate. Shipping was faster than advertised. A \"thumbs up for this one\". Amazon comes through again on price and product.", "id": 330}, {"review": "There isn't much to get excited about in a guitar stand, however, it does it's job and the price was right. I purchased four and they were all delivered on time. Each adjusted to, and held, its guitar securely. I have found the stand to be very stable. The welds seem secure ad the materiel heavy enough to do the job. My music teacher has a similar stand which cost him 4x as much. It's does not appear to be of better quality.", "id": 519}, {"review": "I'm new to the guitar and I'm just discovering how to use picks and what picks work best (for me) with different guitars and different effects. I like these for my acoustic Ibanez dreadnaught. The pick seems to help me get that deep bluesy sound from the D'addario strings. They are comfortable and I like the feel in my hand. The mediums suit me. Maybe it is all personal taste but I think they are worth buying. Amazon pricing is great. The picks feel great and I'm having a good time.", "id": 574}, {"review": "What do you say about a little chip of celluloid? Well, almost everyone I know who plays has a preference in guitar picks. These do it for me. I like the look and, more important, I like the feel in my fingers and on the strings. They also seem to make a good, clean sound. I use an Ibanez electric and a Gibson acoustic as my favorites out of seven guitars. Maybe, it's all in my head but, these feel good to me using any of my guitars.", "id": 575}, {"review": "The Snark SN-1 is small, accurate and easy to use. I have a more \"sophisticated\" tuner and the Snark works faster and is much easier to use.", "id": 706}]