[{"review": "Clayton's rule! Been using since they debuted and will never change to anything else.Long lasting and great tone besides.Awesome.yes,indeed.khjghjjh hgkjhgk", "id": 83}, {"review": "Has everything you need to keep fretboard in condition.Works well,Seems to hold up well also(treatment lasts for awhile...)Emery cloth for polishing frets is nice,worth $20.00,for sure.....", "id": 96}, {"review": "D'Addario,what's up? These didn't last long at all.I don't play my Martin very often,(too busy with electrics..) but these were trashed in a month.Guess your using recycled car bumpers for strings now? Never purchase again.", "id": 198}, {"review": "This is a Palnet Waves and just as good as the more expensive ones.Material is rougher,but that's a good thing.", "id": 208}, {"review": "..it works.But expect some flaws.First,finding a driver to use was a pain.It doesn't come with a software disc,so look on Behringer's support site for driver download.Whatever driver you do use it kills all other audio,you can't run any other media player and get sound.My advice is unless you have a dedicated PC or laptop for using this...get something else.", "id": 418}, {"review": "Just as good as any 20' XLR out there.Considering I spent $6.00 for it,it rules! Will buy more when needed.", "id": 465}, {"review": "Nifty little item that does what it's designed to do.Realistically,it's not worth $10.00.$5.00? yes.Save your money.I regret this purchase for what I paid for it.", "id": 543}, {"review": "Got it for $5.00 bucks and wish I'd bought about 5 more.Just as good as anything else out there,Onlky complant is the adjustment to the neck support does go as low as I'd like,but that's my take on it.Buy if you need a stand.For the money,you won't be disappointed.", "id": 841}, {"review": "Installed this on an old Aria dreadnough I found in a dumpster.Cleaned it up,buffed the finish out,tweaked the truss rod a bit and installed this saddle with new Dunlop .012's and this is one of my prize acoustic's now.Thanx GraphTech!", "id": 415}]