[{"review": "I bought this to use with my keyboard. I wasn't really aware that there were other options for keyboard pedals. It doesn't work as smoothly as the pedals do on an acoustic piano, which is what I'd always used. Doesn't have the same feel either. Nowhere close.In my opinion, a sustain pedal like the M-Audio SP-2 Sustain Pedal with Piano Style Action or other similar pedal is a much better choice. The price difference is only a few dollars and the feel and action are so much better. The only thing I've found the Yamaha FC-5 Sustain Pedal is good for is taking up space in a drawer where I keep my electric guitar pedals.", "id": 2}, {"review": "When my case arrived I feared it was too small to hold my Epiphone Dot. But, this case fits my Dot like a glove. The case is sturdy enough to protect my guitar from knocks and dings while the plush inside pampers the guitar's finish. The accessory compartment is large enough to hold my picks, tuner, and extra strings.", "id": 157}, {"review": "I was thrilled when my guitar arrived and even more so after I tuned it and began to play.My guitar is absolutely beautiful. The finish is flawless. And it's got that new guitar smell...ahhhhhh.It does have a pick guard (that is not shown in the photo on any website or in any catalog) which pleases me. It would be a shame to scratch the surface while strumming with a heavier pick. I read one review on a music vendor's website where the reviewer complained about Takamine and Jasmine printed all over the pick guard. And they were right about that...but I found it very easy to remove all these words by simply peeling off this protective sticker. Dah.The strings are a little heavier than I like but I'll be changing them in a few weeks anyway.The sound and craftsmanship is anything but what you would expect from such an affordable guitar and everything you'd expect to pay more for. It has a rich, full bodied sound.I am now a diehard Takamine fan.", "id": 183}, {"review": "I bought one of these pedals 3 years ago, along with some of the other Danelectro pedals in this line, and was happy with it. The sound I get with it is very, very cool. After a while it just stopped working. While I was disappointed at that moment I just ordered another one the next time I was online. You can't beat the price. If it does stop working after after a few years of use, you aren't looking at paying $90 or more for a new pedal. All of my other Danelectro pedals are still working just fine so it may have been a fluke in the electronics or I just used it to death. An electrical engineer friend and I took the pedal apart to try and fix it but decided it wasn't worth taking up our time since I could replace for $15. So I ordered another one. Definately get an adapter for this. Yes, it's casing is plastic but quite sturdy. Just don't jump on it like you're trying to put out a fire when turning it on and off. Guitars and effects are the tools of a musican's trade not the hammer and nails of a builder's. Think about getting a 1 Spot adapter so you can chain several pedals to one outlet. If you would rather use batteries for each of your pedals...well...I'd suggest buying them by the gross. Any effects pedal made by any company is going to eat batteries like a stoner eats potato chips. Used alone or with other effects, the Danelectro Fab Slap Echo Effects Pedal will be sure to delight your auditory kinesthesis.", "id": 315}, {"review": "The D'Addario EXL110BT Nickel Wound Electric Guitar Strings, Balanced Tension Regular Light are great! I've been a long time fan of D'Addario strings and these strings did not disappoint.They were very easy to string my Fender Strat with and stayed in tune a good long time. The strings had a good feel to them as well.Where I noticed the Balanced Tension the most was when I played chords. You know how you have tuned your guitar and it's tuned as well as it's going to be tuned but, when you strum that first chord something just doesn't sound right? You check the tuning and it's tuned alright but why isn't it sounding right?These strings gave a clear, clean sound when I strummed those chords. Bar Chords were terrific too. Impressive.I think I have some new favorite strings for my Strat!", "id": 868}, {"review": "Planet Waves NS Artist Capo is as near perfect a capo that I've ever come across. I've been a Kyser Capo gal for many, many years but, this capo has that one beat by a mile. There was absolutely new fret buzz no matter which of my guitars I tried it on or which fret I placed it on. As I strummed each string to sound was so clear. It's also very easy to open with one hand and keep it open, without any stress to your hand, until you release your grip to clamp it into place.I do believe the folks at Planet Waves have developed the best capo ever! And the price ain't so bad either.", "id": 894}, {"review": "The Snark SN-5 Tuner for Guitar, Bass and Violin gives me spot on tuning. I especially love being able to tune with a silent tuner. When playing music with other musicians who are also tuning or warming up I don't have to be concerned with hearing myself pluck the strings of my guitar or violin while comparing the sound to a pitch pipe or keyboard. This tuner works by picking up the vibrations of my instrument.I decided to buy this tuner after another musician lent me his extra one during a jam session. I was really impressed with it and had to get one for myself ASAP!", "id": 762}, {"review": "D'Addario's NYXL1046 Nickel Plated Electric Guitar Strings, I have the Light, are THE best! I've got them on my Fender Strat. I can tune my guitar and play it for a couple hours and still not have it go out of tune. Even if I'm using the tremolo bar and bending strings these things stay in tune. When I get together with other guitar players to jam I don't have to worry about being the one who has to keep tuning my guitar. A couple Ernie Ball die hards are about ready to jump ship and get on the D'Addario Line after seeing mine in action.I can put my Strat aside, pick it up to play a few days later and it's still in tune. Doesn't happen when I pick up my other electric that don't have these strings on it yet. Either I'm going to have to put these on my other electric or the Fender is going to be my baby who gets all the play time with Mama.I've never used strings that bend so well. And they don't cut into my fingers as much when playing for extended periods of time. These are miracle strings in my mind.Most importantly, they sound GREAT!Good going D'Addario!", "id": 897}]