[{"review": "These are good for the average guitar player who doesn't want to much strain or pain on there fingers. Not the fullest tone, but you wouldn't expect that with extra light strings.", "id": 27}, {"review": "White thin picks by fender, what else can I say? They are very good looking, the only downside with thin picks is that you tend to keep buying thin picks because they keep breaking BECAUSE YOU ARE PLAYING FAST AND WILD WITH THEM!", "id": 117}, {"review": "I chose this rating because a fine paper towel seems to work just as well as this microfiber polish cloth.", "id": 184}, {"review": "Yeah I kind of bought it on a whim, it's confusing as hell first of all. I don't really understand it but it was shipped and explained perfectly as described. :)", "id": 531}, {"review": "I seriously never knew steel guitar picks existed i've been playing guitar for like 5 years. These picks are the BOMB!, + they don't break on you when you strum too hard/fast :D, i would rate this product 6 stars if i could i'm completely satisfied with these picks!Tip: These picks are great for HIGH ACTION/HIGH GAIN GUITAR SOLO'S.", "id": 804}, {"review": "I chose a 5 star rating, because i've simply never owned a tuner of this high quality in my lifetime. This tuner blows away my old 'Guitar Professor-Qwik Tune' Tuner. This tuner gives unbeatable performance therefore the price is justified in my opinion.", "id": 851}, {"review": "Fast Fret, or at least some kind of string cleaner is a 'must have' for anyone who plays guitar. Because, if you think about it, strings get really dirty over time, and this product solves that issue. :)", "id": 72}, {"review": "It's a great versatile foot rest that any guitar player can benefit from, very good value at only $10 not counting shipping, very satisfied.", "id": 321}, {"review": "=] - Really satisfied with the chair. I cannot explain how cool this chair is. Very glad I got it, definitely worth the price for the great overall value that this chair really gives you.", "id": 518}]