[{"review": "I really like the one-handed operation, and I really do prefer that the access to it is behind the fret board instead of out front. That makes it easier to reach for a quick change, and for easy on/off. I've been a Jim Dunlop fan for more than 40 years, and this product just reinforces that!", "id": 116}, {"review": "If you haven't used this stuff, and if you plan to play 'squeak-less' guitar, take the risk. Buy some.  You'll wonder how you ever played without it.  You might even become the next Joe Satriani!", "id": 173}, {"review": "Planet Waves makes good stuff.  Take the load off your shoulder from that old Jazz bass, and get a padded 3 inch wide strap. It's long enough to allow my bass to rest at arm's length.  I can adjust it to fit my acoustic guitar, which I hold much higher, and check out the little 'pick-pocket'.  I like these well enough that I have four of them.", "id": 188}, {"review": "Guitar tone is more subjective than almost any other topic.  And I'm sure that brand loyalty has as much to do with our perception of that tone as any other ingredient.  Even so, D'Addario has provided a consistent product for more years than I'll readily admit to knowing. I've used may other brands, but I seem to always return to D'Addario for all my steel stringed acoustic guitars.", "id": 333}, {"review": "Jim Dunlop has produced these for more years than I'd like to admit to personal knowledge.  As long as I can remember, I've had one in my case and one on the workbench.  There are dozens of wannabe models, but none are as genuinely authentic as good ol' Jim Dunlop's.  I gotta remember not to get the black ones, though.  I seem to lose them to easily - or maybe they are really that good, and they just get 'borrowed'.", "id": 347}, {"review": "Update:  We received a replacement for this item. It does everything it was advertised to do, and it performs quite well, although the clip on the new one doesn't grip as well as the first.  The device tunes within 6/10ths cent as compared to a stroboscopic piano tuner. Our thanks to D'Addario for their assistance in satisfying this customer!Please check our reviews.  We review regularly, and rarely have anything poor to say about products.Unfortunately, we cannot remain positive with this device.  Our small band keeps an average of 8 instrument tuners at the ready.  We have several NS1 models that work flawlessly, as well as TG-200 models that we really like.This one seems to consume coin-cell batteries at an unacceptable rate.  On average, it 'eats' a battery a day.  It also has a much darker display, making it hard to read unless the stage is quite dark.  One would think that if the display were darker, less power would be drawn from the battery.  Average room lighting is too bright to use this tuner.We do like the ability to rotate the display, so that the tuner can be mounted in front or behind the headstock, with the display maintaining proper orientation. Unfortunately the poor performance means that this unit will find its way into the junk-drawer on the workbench.", "id": 785}, {"review": "I've been a musician for over 40 years.  I've seen an awful lot of products come and go.  I don't get excited about the latest-and-greatest very easily... but having said that, this is the best idea in headstock tuners I have encountered. I bought one, and found it so useful, I ordered two more!  Planet Waves makes good quality stuff, and they make some 'faddish' stuff.  This item is definitely in the good quality family.  It's easy to read outdoors in the daylight, yet not so bright as to distract in low stage light.  Great design, Planet Waves!  Excellent price, GO-DPS!", "id": 822}, {"review": "When you need an audio insert cable, you need an audio insert cable.We custom manufacture insert cables for custom sound-reinforcement fixed installations.  For  mobile rigs, such as mixer cases with processing gear, it's simply not cost effective, and Hosa is our go-to brand for reliability and durability.  There are other brands, but our reputation is at stake.Hosa allows us to maintain our good reputation, while lowering our labor costs. Thanks for such a dependable product, Hosa!  Thanks for such a great price, Amazon!", "id": 9}, {"review": "Other than that, when you need 10-32 rack screws, these are the real McCoy.  Wide enough pan to grab the ear, narrow enough to clear that next piece of gear!  Thanks, Raxxess!", "id": 22}]