[{"review": "I have one of these in every one of my guitar cases. You never know when you have to replace a string and this is a convenient helper. Cutter, winder and pin puller. Gets the job done and it is inexpensive.", "id": 94}, {"review": "Used these while putting together my personal Blues/Classic Rock Frankenstrat. Replaced everything but the body. Needed these accessories to match a brand new Fender pick guard. They worked fine at a great price.", "id": 222}, {"review": "Since this is the third hanger I have purchased it goes without saying that I really like it. My only criticism is that it ships with mounting hardware that is for a &#34;brick&#34; wall. I am fairly sure that 90%+ of those of us that use these hangers mount them on a plasterboard wall. How about shipping it with a suitable wall anchor for drywall? Otherwise, a great hanger that I trust for use with my expensive guitars.I'm just running out of wall space and money for new guitars.", "id": 289}, {"review": "Excellent product at a righteous price. Helps my guitar stay in tune.Changed the saddles at the same time and the sustain is much better.", "id": 387}, {"review": "Excellent value for the money although not any more heavy duty than other stands I own. Nice and stable for my classical guitar.", "id": 436}, {"review": "I don't play with a guitar below my waist. I am six feet tall. While very well made, wide, comfortable and good looking, this sling was far too short and had to be returned.", "id": 480}, {"review": "Tons of useful information on this wheel. My only criticism is that the accompanying manual could be far more exhaustive and more clearly written. Seems like reasonably durable construction. Compact enough to stow it in a guitar case.", "id": 531}, {"review": "Great value. Works well, tunes tight and is CHEAP. When the battery is run down, the screen darkens but it still works. What more is there to say.", "id": 706}, {"review": "I buy these and put one in each of my guitar cases. Bright display, easy to use, works well and cheap. I have bought several of their models. I particularly like the fact that when the battery is dying the display becomes darker but the unit still works correctly. I hate the tuners that give you bad readouts with weak batteries. Had a problem with the pivot joint breaking on one of the older models, but it was replaced without a peep by the manufacturer. Newer models seem a bit beefier.", "id": 707}, {"review": "No moving parts. No high tech components. The ultimate in low tech. It's a rubber stamp and it works for the intended purpose. I find this size useful but I guess it depends on the individual's needs. Enough said.", "id": 361}]