[{"review": "I agree with those reviewers who really like this pickup. It has a very natural sound, is reliable and amazingly strong. The suction cup issue is easy to solve, it just needs to be a bit humid and it will stay well. I also bought (for comparison) the Cherub WCP-60G, which is not bad but has much more of an unnatural metallic sound, plus it seems more feedback-prone than the AXL. I can only recommend, if you have a nice classical guitar and want to amplify it with true sound, the AXL is an excellent and inexpensive solution. I doubt that the $200 stuff is much better.", "id": 610}, {"review": "So, there are some people who review this as superb, with no noise and just the best thing ever. To be honest, I have no idea where this is coming from. I do get a good amount of noise (static buzz) that makes it difficult to use it when playing your guitar in a more quiet mode. Also, the sustain is not as good as I thought it would be and I had to do a lot of fine-tuning with my amp to find a satisfying setting (works best with some additional reverb setting).That said, for the price, it is pretty good. I do not understand why some folks are all upset about the plastic. It is what it is, a rather inexpensive compressor that does a pretty good job for that price.", "id": 645}, {"review": "Works amazingly well, is very precise, and easy to handle. I have seen other devices that would get confused about frequencies and jump back and forth between different notes. Not so this one. It is a great, reliable tuner.", "id": 762}, {"review": "Pros: works really well and is easy to use. The sound quality is excellent and bypass works fine, too. It is amazing how you can add layers upon layers without any loss of quality.Cons: it takes a bit to get accustomed to the timing, not lest because the switch is somewhat sticky and requires some extra effort, which has an impact on the timing. Also, the LED is placed too close to the switch, so you tend to cover it up with your foot. They should have put it higher up right next to the dial.Overall impression: The positive aspects completely outweigh the minor negatives. It's a great and inexpensive looper.", "id": 869}, {"review": "Having a neck-heavy Epiphone SG G-400, I really like this strap because it is not only comfortable but also provides enough friction to keep the guitar in place without much effort. Leather straps are good, too, but they tend to slide off the strap button.", "id": 188}, {"review": "I like how easy it can be attached to the soundhole, or, for that matter, to the headstock, where you may get less feedback than with the soundhole. It works well but produces a somewhat metallic sound, not quite true to your guitar (you will note this in particular with a classical guitar). This can be balanced, to some degree with your amp's equalizer and/or the treble and bass settings. However, compared to the AXL Pickup (which I bought for comparison), the Cherub is suboptimal when it comes to the sound it produces. It is not bad, but it does not reach the quality of the AXL. Both are inexpensive enough that you may buy them together and see what you like best. The Cherub may actually sound better with an acoustic metal sting guitar.", "id": 759}]