[{"review": "This shelf is so convenient and so often used that you would think that it should come on every music stand. It just slips on to the lower shelf and creates a smaller shelf for pencils, pens, clip on tuners, capos, etc. It pays dividens in not cluttering up your book shelf so that items go spilling to the floor every time you adjust a book or turn a page. I love how a pen, capo, or tuner clipped to the top lip of the shelf serve to keep pages firmly in place until your book is &#34;trained&#34; to stay in place. A must have, five star item.", "id": 128}, {"review": "This is the last Capo you will ever need to buy unless you have the need for both curved and straight capos for various fretboards in which case you'll still want to stay with the G7th capos for both needs. No need to worry about damaging your guitar neck from over tightening or nonpadded contact. No spring clamp to wear out & lose gripping strength which produces a buzz over time.  Low profile design is the easiest for playability as you don't have to learn to play around it like you do on a Keyser. The unique, adjustable tension also allows you to control to sound to your liking, great for advanced tricks like capoing just a few strings. Can't say enough about this easy to use tool with ultra simple, unobtrusive design.  Love it and have one in every case.", "id": 266}, {"review": "For players that want a high quality guitar strap that weighs almost nothing, last forever, stays in place, and has classic good looks there is not a better strap than Levy's natural leather, suede strap (without the piping and stiched edge). The dying of the suede side is deep and flawless and the strap is a quality piece of hide without bulk or unnecessary weight from padding.  Feels great to the touch and you quickly forget that its even touching your shoulder. It can be a little bit of a chore to get strap locks on, but once on I have never had any worries or failures so that my guitars are nick and ding free. Plenty of color choices.  This is a simple, elegant strap that inspires envy.  Planet wave has a nice strap that is the only one I've seen (and owned) that even comes close, but  there is no other suede strap that is even in the same ball park as the Levy MS26.  I own 4 and they are admired by everyone who sees them and slips them over their shoulder.  It could cause you to reconsider use of shoulder straps... It did for me.", "id": 481}, {"review": "Bought this switch as the OEM for my son's Bronco 40 which gives you an off/preset 1/preset 2 switching set up.  Simple, light and does what its suppose to.  Not built like a tank, but better than the cheap after market versions.  Gives you lots of cable so that it is good and practical for real life gig set ups.  Cable and plug are solid, thick Fender quality components. Worth the money.", "id": 563}, {"review": "The best look and performance on a Fender guitar.  I've used the Schaller & Fender pinch top and found these to be the best performing, easiest to use, and best looking.  It does have a larger profile, but I find it flattering to the fender guitar form.  Easy to install and have never failed me.  I like that there are three pins to ensure a proper grip rather than one pin holding in in a channel like the Schaller & its clones. Outside of security (which I find greater with 3 pins) it all boils down to personal preference when it comes to strap locks.", "id": 682}, {"review": "A great, clean look for the otherwise ugly string guide clamps. The guides on these are not rollers, but are the next best thing visually and performance wise in my opinon.  The only guides that I like better are the round 50's guides for Tele's, but then I like those asthetically only on Tele's.  An inexpensive mode that looks and works great.  To the inexperienced eye this simple, clean looking mod can make a Mexican or Chinese instrument look more like the made in America models.", "id": 115}, {"review": "Wow!  This is the pedal to own.  There are a lot of good pedals out there, but this one has that original, bright wah tone and a range of features and tonal settings that can take you from 70's quack to surf warble to rock tone sweeps. Just amazing! If you don't have to have a specific dunlop signature pedal, this will get you through most of the tonal range you could imagine. A great purchase and built like a tank.", "id": 323}]