[{"review": "I don't know what I would do without this little shelf on my music stand.  I works on my non-Manhasset sold-shelf stand, holds my pencil/highlighter/flute swab & even occasionally a small speaker set that I have for my phone.  It easily slides over the lip of my music stand and is reasonably secure.  Very well worth the $$.", "id": 128}, {"review": "Wanted to buy a better stand than the cheap metal folding one that I'd had in high school.  This was a great compromise between portability/storage and sturdiness.  I did want collapsible legs, which this has, and the solid coated metal shelf is wonderful after my old metal folding stand.  Works well with the Manhasset second shelf accessory, and has been in constant use for months now.  I've had absolutely no problems with it.  The height is easily adjustable, and the shelf tilt is easy too.  Am very happy with what I got for the price I paid!", "id": 155}, {"review": "I have a rose-gold plated flute, and wanted something to clean it that would not rub away the plating.  This does the job perfectly.  Wipes off fingerprints & smudges easily, and with a little water cleans up lip stuff that gets stuck on my lip plate.  Is easy on the plating and very gentle.  Washes in the washing machine on handwash with no fabric softener and line dries.  Am very pleased.", "id": 184}, {"review": "Got this tuner/metronome as a replacement for a tuner-only model.  This is INCREDIBLY easy to use right out of the package.  The tuner function indicates clearly whether you are sharp or flat (or amazingly in tune).  The metronome is easy to use and has great subdivisions (eighth notes, sixteenths,etc).  For home and ensemble use, I personally couldn't ask for a better gadget for the price.  Very happy with it!", "id": 298}, {"review": "Works well as a tuner, but I did return it to buy the Korg tuner/metronome combo.  Thought it would be easier to have it all in one machine.  However, this worked fine as a plain tuner.", "id": 634}]