[{"review": "Works great for my acoustic dreadnought.If I had any complaint it would be that there's nothing to prevent the lower part of the guitar from banging against the wall. It would be nice if they had an option for something that could hang down off the hanger - a little cushion - that would go between the wall and the guitar. No reason I can't make something like that on my own, though.Edit - 9/24/2013 - Just got my first classical guitar and realized that the wider neck won't fit into this hanger. Nothing worth complaining about, but just something to note - if you need a hanger for a classical guitar, this isn't it.", "id": 166}, {"review": "I bought this gig bag to carry my Fender strat around. I'm just starting to learn guitar so I didn't really know much about my options. I figured I had a Fender guitar so I might as well get a Fender gig bag.Little did I realize how good this one really is. Most gig bags don't come with all these storage pockets. There's plenty of room for a few books, an electronic tuner, string winder, strings, whatever.Padding could always be more, but that's the case with probably any soft-shell bag you buy.All-in-all, I like this bag more and more since I've discovered that all the other options in the price range aren't nearly as good.", "id": 468}, {"review": "I bought this guitar nearly a year ago. It was my first guitar. I never cared much for the sound. It always sounded out of tune, even when it was in tune. I eventually bought an acoustic guitar to learn to play and have been happier with it than this Squier. My skills are slowly improving but I wanted another electric so I sprang for a Epiphone Les Paul. Yes, it's 3x more expensive than the Squier BulletStrat - but it sounds 10x better.If you buy a Squier, I think you need to be prepared to make this a \"project\" guitar. You'll probably want to replace the tuners, pickups, bridge, etc.Or just buy a better guitar to begin with. At this price point you probably won't find much better but you probably want to spend a little more for a much better guitar.", "id": 555}, {"review": "Thank goodness Amazon doesn't sell this gadget for the forty-dollar retail price tag.I just got mine today and tried it out. The sound quality complaints are no joke. There is a constant hiss and any slight movement of the iRig or iPhone while playing will create a loud static noise. Don't know if a better quality jack on the iRig would've solved this problem or not.But if you're willing to tweak with the input and output line levels as well as your speaker or headphone volume settings, you may find a happy medium that you can live with.Still, the ability to carry an amp around in your pocket is pretty cool. If I find the need to really use one of these I'll probably spring for something that plugs into the iPhone dock connector. Until then this'll be a fun toy to play with.March 29, 2012 - Just a quick addendum to my initial review. I've since discovered the noise filter in the AmpliTube iPhone app, and wow, what a difference! It sounds much, much better now. No more hiss, no more static.", "id": 710}, {"review": "I bought this not for the tuner, but because I needed a metronome.However, I had to give the tuner a try as well. With my trustySnark SN-1 Tunerattached to my guitar's headstock and this Snark SN-4 on the table, I proceeded to tune my guitar. I was impressed that both tuners were showing identical tuning even down to the fluctuations as the note rang out.As a metronome, I don't know what kind of frills others may offer but this does everything I need to keep in time.I only have one minor complaint. You can't view the Snark SN-4 at any kind of sharp angle. You need to view it head on. If you place it on your music sheet stand, that's great. But if it's not facing you, or lying flat on a desk, you may have trouble reading the screen. An integrated flip out kick-stand would make this perfect.", "id": 732}, {"review": "Just skimming through the other reviews, I see that at least one other reviewer has complained about the same thing. Nearly every time you pick up your guitar, the rest will fall off your desk. The part that sits on the desk should've been weighted to prevent this from happening. It's a nice idea and does what it says - it keeps your guitar nice and safe from scuffs when leaned up against your desk.But considering this one REALLY annoying flaw, I wonder if I shouldn't have just payed a couple more bucks for another guitar stand instead of this rest.", "id": 746}, {"review": "I am starting out learning to play guitar. I wanted a way to record myself playing guitar onto my laptop so I could go back and listen and to also play both lead and rhythm parts and mix them together.After asking a few questions on a message board, the Focusrite Scarlett 2i2 was recommended to me. It's pricier than some of the options I was considering but given the reviews I figured it was worth taking a chance.I'm glad I did. The Scarlett 2i2 is a piece of cake to set up, even for a guy like me that's pretty PC savvy but never dealt with external recording devices.I'm running Windows 7 64-bit and everything installed flawlessly. The drivers loaded without a hitch and immediately recognized the Scarlett when I plugged it in.The included Ableton Live 8 Lite software recognized the unit as well.I'm looking forward to using the Scarlett more to improve my guitar playing. So far, I'm very happy with my purchase, even if it was a little more than I initially wanted to spend.", "id": 801}, {"review": "When I bought my first guitar about 6 months ago I just chose a pack of picks on Amazon's list of \"other buyers also bought this\" and those were these Fender 351 picks.At the time I figured all picks were created equal.Since then I've tried various sizes and brands - Dunlop, Planet Waves, etc.But I keep coming back to this Fender 351 Medium pick for both my electric and acoustic guitar.The sound it makes is nice and sharp without being too trebly.The Planet Waves picks all seem to be a little muddy-sounding.I've found a winner with these Fender picks and will definitely be ordering more.", "id": 120}]