[{"review": "Recently, I was building a Telecaster project.  A friend recommended using the 4 way switch instead of the stock 3 way switch.  This allows you to have the three positions normally found on a Telecaster,  bridge only,  bridge + neck in parallel, and neck only.  It also adds the ability for you to add a setting with the bridge and neck pickups in series.The result of this added position is that you get a higher volume output from the guitar than in the regular bridge + neck position and  a slightly higher top end output.  This is clearly a case of &#34;your mileage may vary.&#34;  I've been used to the traditional 3-position switch on my other Telecasters.  I'm a bit indifferent to this mod.  If I was building another guitar, I would probably use this switch again.  It does what it is supposed to do and it is within a couple dollars of the 3-way.  However, I would not change out a working 3-way switch for this.  For me, the added benefit just isn't worth the effort.", "id": 113}, {"review": "I recently traveled across country carrying 2 similar guitars. One was in the SKB Fender case ($99.95 on Amazon), the other in this Gator case purchased locally.  I was told it was just as good as the Fender case. Both ended up in checked luggage.  After 1 flight from Florida to LAX and back (non-stop, minimal handling) the glue on the top section gave up.  The padding is now loose and the strap to keep the top from flopping completely open is dangling inside the case.  Neither guitar was damaged and the cases appear in fine shape, but after having the padding fall out, I just ordered another SKB Fender case.  The Gator will be re-glued and used only for local trips.  The SKB Fenders will be my airline cases from now on.", "id": 131}, {"review": "These were purchased for my parts bin.  They fit, they work, they are quiet and they won't make your life miserable.  That's all I want from replacment parts.", "id": 216}, {"review": "It's not going to win any awards for sound quality, but it sure is cute.  As you might expect, it's a pretty boxy sounding little amp, more reminiscent of 60's portable transistor radios than a double stack Marshall.  But it did the two things I wanted it for.  First, it has a belt clip, which I can attach to my belt or a guitar strap.  Second, it has a headphone out, so I can plug in a set of ear buds (1/8&#34; stereo jack).  You can get it to a clean decent practice room level if you keep the drive control set at minimum.  Surprisingly, the Drive control works it's way in gradually, letting you control the distortion a bit with the guitar volume control. With the drive control cranked up, you can get the amp unexpectedly loud, but terribly distorted.  For something you can throw in your guitar gig bag and take with you wherever you go, it's not too bad.  With a set of earphones, I would put it on par with some of the more expensive amp-jacks that are available.  If you plan to use it as a practice amp and you're not moving about, I would recommend getting a power supply (will use the same ones as most effects pedals).  Battery life appears to be around 3~5 hours, but the performance starts degrading at about an hour's use.", "id": 303}, {"review": "I now have these tuners on an American Strat and an American Tele.  They seem a lot smoother than the stock Fender tuners, which honestly, I have no problem with.  These were purchased on a whim.  I don't find changing strings that big of a bother.  These will save you a few minutes.  I guess if you're a gigging musician, they would be of more value for quick string changes to an onstage guitar.  Don't get me wrong.  If you want a set of locking tuners for your American or Mexican Fender guitar, these are excellent.  But I'm not sure that most people would derive enough benefit out of them to warrant replacing a good functioning set of regular tuners.  I like them, I don't love them.", "id": 387}, {"review": "I recently traveled across country carrying 2 similar guitars, a Fender American Standard Strat and a Fender American Standard Telecaster. One was in the SKB Fender case ($99.95 on Amazon), the other in a Gator case purchased locally.  I was told it was just as good as the Fender case. Both ended up in checked luggage.  After 1 flight from Florida to LAX and back (non-stop, minimal handling) the glue on the top section of the Gator case gave up.  The padding is now loose and the strap to keep the top from flopping completely open is dangling inside the case.  Neither guitar was damaged and the cases appear in fine shape, but with the padding loose, the Gator case is going to require some repair before it can be used again. Other than a couple of scuff marks on the SKB Fender case, it's as good as new.  I just ordered another SKB Fender case.  The Gator will be re-glued and used only for local trips with cheaper guitars.  The SKB Fenders will be my airline cases from now on.", "id": 557}, {"review": "Once you install a full Dunlop Strap Lock on a guitar and strap, that strap becomes unusable on any guitar that isn't equipped with Dunlop buttons.  Since I only use about 3 straps but have more than 3 guitars, it didn't make much sense to buy full strap locks.  My only concern when I ordered these buttons was that they might not be exactly like the Dunlops and not securely keep the guitar and strap connected.These buttons look and act exactly like the ones that come with a full set of strap locks.  After testing a set, I have now purchased buttons for most of my guitars.  The side benefit is that they are fully functional when used with a guitar strap that is not equipped with the Dunlop locks.", "id": 630}, {"review": "This is probably the best pedal purchase I have ever made.  I'm not familiar with more expensive compressors and how they might be noticeably better, but this one sounds exactly how I would expect a compressor to work.  It just makes things sound solid.  I've watched the wave envelope it puts out using Audacity and Adobe Audition and the compression works as advertised.", "id": 834}, {"review": "I'm not sure what I was expecting.  This definitely is a fuzz, but the one I got doesn't seem to have much in the way of subtlety.  It's either nothing, a lot, a lot more or way too much.  It's not bad and it's probably just my personal preferences, but this just isn't my cup of tea.", "id": 836}]