[{"review": "I got this pretty fast. I took it out of the box and wanted nothing more than to give it 5 stars just for value alone. I'm still shaking my head in disbelief that I got this guitar for the price. First, the 'tuner' issues that I've been reading about. Replace the strings! I stretched and stretched these things and they would not stay in tune. A set of D'Addario 10's cured that straight away (or whatever you prefer just change them). The tuners aren't the best but they are not to blame, it's the cheap strings. Now, technically if you only play open chords this was playable out of the box. The neck angle was so off the A string rattled no matter how high I set the bridge. The guitar would not intonate due to the ridiculous angle. Yes I could have sent it back but I suspect I would have gotten another just like it. I had to spend about 6 hours shimming the neck AND the nut (Never had to do this to the nut on an electric, not even on a used guitar. The nut slot was cut too deep), as well as working on leveling nearly every fret to make it playable. It required 3 business cards to shim the neck which is the most I've ever had to use. After I got that straight I removed a bit of paint from the neck and set it with wood glue in the pocket and on all the screws. In my opinion this helps a great deal with these and all bolt ons for that matter.If I bought this used none of this would have been a big deal. But as I'm looking at this horrid neck angle and doing all this work I'm steadily staring at the 'QC passed' sticker. Must have been built on a Friday afternoon or something.--- NOW--after I did this it is sweet!!. I play through a Peavey Valveking 100 and it rocks as good as my Strat w/  Duncans and Dimarzios. The quality of the electronics is not sub par at all. After adjusting the pickups screws to match the string height and getting all the horrible wax off them,  I'd argue that this is as good as any Epi I've ever played as far as pups and all, so don't hesitate there because I don't really care for Epis and I'm in love with it. (I bought this to sell mainly, but now????)  The build quality; hmm, if you can do guitar work go for it. Otherwise I'd highly recommend a more expensive model. The $299 models are great right out of the box usually.", "id": 31}, {"review": "This is my second order of the 10 pack. A local store wants 29.99 for one set of these. The feel is really good in my opinion as opposed to all the other brands I've tried; including, and especially the most commonly used eb's. I have however had a slight issue with certain D strings. On occasion, it looks as if the winding is chipping off, but not at the frets. I change strings quite often so it really doesn't matter. Not sure what that's about but it doesn't affect anything and like I said this IS my second order of these so I gave them 5 stars. Any less and I'd look dumb.", "id": 156}, {"review": "I've read where people are using bottle caps instead of these. My guitar is more valuable to me than that I suppose, because I'm not trusting that my expensive gitty won't hit the floor. I mean you pay for a quality instrument right? Why on earth would you skimp on keeping it safe? I'm sorry but that's just idiocy in action. This isn't 1960, get an upgrade already. I play standing up 95% of the time, so these are a necessity. I have had these separate on me when taking them off hastily, but all except one snapped right back together. When I first started playing, I had a brand new (to me) guitar hit the floor and the neck break because I didn't use them. That's something that should only happen once in your life, if at all. The only complaint I have is whatever happened to the round ones? They were a bit more appealing to the eye and do the same thing just as well.", "id": 261}, {"review": "I use these at parties and they work good for the price I paid. I really have no complaints aside from sometimes you really have to get up on it to get a good clear voice in a live band setting. I use a wireless for that now, still for the price, these are hard to beat.", "id": 405}, {"review": "I like many things about this tuner. The fact that it turns off quicker than most and you only have to press the button to turn it off. Unlike the Fender which you have to press and hold. May not sound like a big deal but if you need to change tune in the middle of a show this one's faster. The Fender tuner in my opinion, and for my needs is more accurate and easier to see due to the fact that it gives a nice green color once you tune up. But this one's cheaper. Ahh decisions decisions. Still, you can't go wrong either way.", "id": 706}, {"review": "Received these with lightining speed! They came heavily guarded in boxes so shipping is less likey to mess them up. Alot of adjustments to these, and they actually adjusted high enough for me at 6'5\" to be able to sing at Lemmy's angle! Great for singing, micing amps and such. These are 39.99 each at a local music store so....Update: These are perfect for micing amps or for use as a drummer's mic, but if you grab it with some enthusiasm, the plastic part the mic attaches too will separate and the whole thing will come off in your hand. I used clear epoxy on both and have yet to have any more trouble like that. I still say they are good for the price, just need a dab of glue to ensure no incidents happen.", "id": 815}, {"review": "I bought two of these straps from a local store for thirty bucks each about two years ago. They've been the best straps; along with the same straps without the grommets, that I've used. I figured I'd save a bit and get a couple more from Amazon. I got them fast and saved twenty bucks. They do fine with my fairly heavy Fender and St Blues guitars as well as my P bass. They are middle of the road for price and width, but give me no comfort issues at all. My second favorite strap is one just like this except without the grommets. Super tight and easy to lower. Raising it is a different story though. I just save the fast &#34;lower played&#34; songs for last. Those are the best ones anyway. Excellent strap.", "id": 172}, {"review": "These strings are good, especially for the price. I have found better strings through D'Addario however, and the feel of them is  superior to these in my opinion.", "id": 226}, {"review": "These were great. I can't brag on them enough. I AM however an electric gitty player primarily. I just use an acoustic when on trips and for couch songwriting.", "id": 237}, {"review": "It works well I mean it doesn't crumble apart or anything. I use a Fender so its not as much of a worry but I have had one and seen other Les Pauls fall over sideways or get bumped into, they then fall and break the headstock. That's why I don't use them anymore.", "id": 519}, {"review": "They all work and none of them have given any trouble. My pedal arrangement stays loose and the whole thing gets moved and jerked around (a lot). I would have liked them to be a little bigger in diameter but for the price they work great. No regrets, Rock On!", "id": 847}]