[{"review": "This quality bag would probably cost more like $35+ at your local music store. Appears well made, has good padding and several pockets for strings, picks, cable, whatever. Taking one star off for the slightly bothersome smell (also mentioned by other reviewers). Not terrible, but somehow chemical. Hope it goes away soon.", "id": 311}, {"review": "Try to get the version w/the black cabinet for around $300 as that's what most major music stores are charging. In any case, I was really looking more for a twin 12\" speaker to pair with an amp head but those can cost as much, if not more, than this combo!The clean side of the amp is exactly that - very very clean. This amp has tons of power to spare. In your house you do not have or want to turn it up beyond 3. Can't even imagine what the 8 or 9 might be like. I have my own separate effects stomp box so I can let this amp sound like almost ANYTHING. The big plus here is that unlike with real tube amps that need to be cranked up pretty much to get the right sound, here you can have it set on 2 and still get pretty much any amp sound (I am using a ZOOM MS50G). All in all hard to beat, for practice session as well as small to mid size gigs. Only thing I miss a bit is a headphone jack.", "id": 559}, {"review": "Will be getting the amp in a day or two. At the sale price of $119 this can't be beat. My research on this device said that to make the really good little solid state/tube hybrid even more awesome is to replace the JJ 12AX7 with a Mullard Blackburn vintage 12AX7 (from the 1960's). It can cost around $30-50 a piece for a NOS (new old stock) but will sweeten the sound without adding or subtracting noticeable gain. In the end the Micro Terror should sound just like real tube amps costing many hundreds more.1st UpdateTook delivery and hooked it right up to my Marschall 412 into the 16 Ohm jack. Volume at about8 o'clock and gain at about 3 o'clock. Man, what a great sound. Very tubey! Typical British growl at higher gain settings. Loud. Plenty loud for your bedroom/office/whatever. Turning it up a bit should be more than enough for a gig at a bar. Just be sure to use a GOOD QUALITY SPEAKER CABLE, like the GLS. Will be updating when I get the vintage 12AX7 tube replacement. So far I am very impressed. Honestly, with a sound this good, why buy a TH30 for 5 times the price. Measured how loud this thing is. At about 3 feet in front of my Marshall 1960 lead 4x12 with gain at max and volume at a bit less than 8 o'clock I got around 84 decibels playing strong but not super strong chords. This is too loud for most apt. buildings for sure so better plug in the headphones.2nd UpdateTried out several compatible tubes...ie 12AY7 12AT7 and the Mullard 12AX7. Each will have a subtle or more obvious effect, sound is such a subjective thing you really have to try this out for yourself.  I personally found the Mullard to be the best. Really nice tube sound, typical Orange, sounds as good as most amps costing several times as much.", "id": 844}, {"review": "First of all, 20 ft is not too long. Better to have a little bit of extra length than too short. The cable works fine and is very flexible. Also looks nice and is easier to track than plain black ones. Recommended!", "id": 875}, {"review": "Do not expect this to sound like a Fender Frontman with 2 x 12\" speakers. But for practicing in your bedroom or similar it's perfect. Plenty of sound effects to mess around with. Are they as good as dedicated $100 per stomp box effects? Probably not, but so what. Just found out the best part of this amp. You can connect it via the USB port to your PC not only for using the rather cheesy Fender software, but it lets you pipe your guitar's sounds into software like Garage Band. You can thus save yourself a dedicated audio interface like an M-Audio M-Track or similar. PS: It is not recommended to go directly from the guitar to the MIC or LINE IN in of your computer (even with the right adapter plugs) as the impedances will not be right. On top of that, I have connected the Mac's headphone audio out to the amp's AUX in! Sounds MUCH better than listening to the PC's normal puny speakers.UPDATE: While the built in USB interface does work, a dedicated device with good pre-amps like the Focusrite 2i2 is much better in getting guitar audio into a computer.UPDATE TO THE UPDATE: While I am keeping this amp for convenience I have quickly learned that NOTHING can match a real tube amp. You can simulate all you want (and I am talking much more expensive SW solutions, its like imitation chocolate vs. REAL chocolate. Got the Marshall DSL 40 Watt combo. Amazing sound.", "id": 882}, {"review": "Inexpensive and practical. You don't have to watch out too much when placing a guitar on this - just about any angle will work. Needs little space, another plus.", "id": 883}]