[{"review": "If you play 12 acoustic you gotta get this one.  Just a hair longer on the padded area which is what  you need.  You can tell them from the 6 string version by the ridges being much closer together on this one.", "id": 42}, {"review": "OK quality and certainly better than a piece of rope.  I found it a bit uncomfortable for sure but for the money it is worthwhile.", "id": 189}, {"review": "A real workhorse for sure.  Not too heavy but still very robust and reliable when you are holding up expensive guitars.  I also have the 6 guitar one which is incredibly big ... almost too big but still easy to use once you get the hang of it.", "id": 301}, {"review": "Was not sure about this one but it is darn easy to use and works quite well.  I still use the Kayser for most stuff but this is great for a backup.", "id": 304}, {"review": "If you have the full folding single stand this works quite well but the ones with the rounded neck that is one piece with no hinge are a bit tight for length.  OK quality but not as good as the stands themselves which are all fantastic.  I don't understand how people can spend thousands or even hundreds on a guitar and then buy an 8 dollar stand only to see their guitar fall over or get damaged at the neck.  If you pay attention to the prices you can really get some great deals on Amazon... untouchable deals ...", "id": 403}, {"review": "Standard great quality from Planet Waves/D'addario but these certainly can change price very frequently throughout the year.  I think it almost doubled in price a week after I ordered... not sure why.", "id": 406}, {"review": "A bit too soft but given the fact it does say made of suede you should expect it to be super soft.  Better for lighter guitars IMO", "id": 481}, {"review": "This is hands down the most comfortable strap I own.  I am pretty sure it is really a bass strap but I use it on my electric guitars and it is superbly comfortable.  Not cheap but keep looking to see if there is a sale or a demo model.  Worth the wait.", "id": 484}, {"review": "Would not say it is the best feeling strap but does look very nice.. It is a little stiff feeling compared to the others I have purchased but overall it is very nice.", "id": 660}, {"review": "Such an easy part to install even if you are a clutz.  Makes a massive difference to the sound and can be a half decent price sometimes.  Worth every penny mind you...  Does require some length and height adjustment for some Epiphones and you should have some basic tools and glue to make it stay put..  So far so good.", "id": 691}, {"review": "Very accurate tuner BUT it broke within the first week I used it.  The little head on the tuner is connected with an arm and a ball and even when  you are gently the three prongs holding the ball joint can crack and break rendering it useless.  I will try to get a replacement... Now as a tuner it was really quite good but just not durable which is kinda what you need.", "id": 706}, {"review": "Another great Roland product.  Really easy to use and well built .... very good sound.  great for practice.  Certainly do not get the RC 2  ... get this RC 3 model for the memory banks and ability to store the banks later...I did think of getting the larger ones but those are just way to big... Check for sales or demos", "id": 739}, {"review": "Love these capos and nice that you can get them in other colours.  Prevents you from getting yours confused with some one elses.", "id": 25}, {"review": "I have found that sometimes these cheapy ones tend to break fairly easily but these ones have lasted me a very long time.  Hardly any breaks considering I get the thin ones.", "id": 120}, {"review": "Certainly worth every penny you pay for them... and they do vary in price for sure from dealer to dealer.  But if you have a $2000 plus guitar the last thing you want to do is drop it because of bad strap knobs/pins.  These are great for sure.", "id": 278}, {"review": "Guess this was an open box or dented box but the stuff inside seemed ok.  Will need to check them next week or so.", "id": 297}, {"review": "For the money this is a tremendous pedal.  The next step up might be the new MXR Bonamassa tube pedal but that is almost double the price.  By the way Bonamassa does use this pedal albeit a fairly old one ... maybe the maxon made version.  I doubt there is that much difference...  Very well made and useable and effective tone controls unlike other pedals that I find only click in at the ends of the adjustments and the middle area is modest.  It is great and I kinda like the great look.  You really have to watch the prices cause they do fluctuate a fair bit .  It has gone up more than 10 percent in just a few weeks..", "id": 446}, {"review": "Nice strap but a bit too stiff ... might loosen up in time but certainly worth buying.  Well built and good adjustability.", "id": 659}]