[{"review": "I was really torn about getting this because of its price but decided to take the plunge and have no regrets. The action is better than my six string Epiphone acoustic. It sounds so sweet, looks so sweet, and plays so sweet. I keep it tuned down a half step and use a capo to protect the neck. I would definitely recommend this especially if your on a budget. It stays in tune and don't let the laminated top scare you, its great.", "id": 153}, {"review": "Have these on my Tele, very interesting to play around with. I bought the regular gauge first and usually use pink slinkeys on all my electrics, the regular chromes where like telephone wires compared to my regular gauge so I bought these instead. These were a lot easier to play and more like my slinkeys. They still are heavier and you can really feel it when bending but they add a completely different feel to playing guitar and your tone. When playing these I tend to play more sixties inspired, the flats help capture that surf guitar tone which is really cool. I really like them but they are completely different and I wouldn't recommend them to everyone. As far as CQ goes these are great, no problems, feel great, sound great.", "id": 259}, {"review": "Not the same as a MXR so don't get your hopes up on that. It is however a great compressor for the money and useful for many applications, I find myself using it for bass more than guitar but its great for either.", "id": 454}, {"review": "Fits great and helps to eliminate feedback. I could see some having problems with the size of their sound holes and it can be a tight fit but it definitely works.", "id": 497}, {"review": "I've been using this for a year to home record through midi and its a great buy. This was so much less expensive than a lot of other ones but it works just fine. No regrets on the buy at all.", "id": 565}, {"review": "This is an awesome analog echo effect. Very similar to a EHX Memory Man it does it all. The only complaint is the pots have limited function unlike the MM so instead of a lot of play on some of the knobs you have a very little bit of play which can be annoying. Other than that for the price its just awesome.", "id": 608}, {"review": "I've used this live since I got it and it works great, no problems. Its made of plastic but that doesn't effect anything, its pretty tough. It has two modes, noise reduction which clips the noise and silences it when the note fades out, and mute which lets you mute with the stomp switch. I use the mute mode live to silence my bass in between sets but I have also used the reduction mode when my pickups were noisy. Both modes work great and there is a sensitivity knob to dial in the right clipping. Full on it will clip the notes hard and sometimes register quieter notes as noise and clip them all together, less and its more subtle. Great value and a great tool.", "id": 615}, {"review": "Great flatwound strings. I put these on my J-bass over a year ago and they still sound and feel awesome. They are stainless steel and very smooth. I have never tried other flats except for chromes on my Tele and Fender tapewounds on my fretless, so my view may be biased. For what I paid and how they sound, feel, and have lasted, I am very pleased.", "id": 664}]