[{"review": "I have been using these strings for the last 7 years.  The tone last longer than any other string and they don't break on me.  In those 7 years I haven't broke a single string.  That being said I don't play heavy at all.  I will buy these strings until the day I die. especially the acoustic version of these...", "id": 106}, {"review": "I have been using these strings for 7 years.  At first I used the Elixir Polywebs, but those things broke all the time.  I switched to these and haven't broke a string since.  If you play a Gibson or Martin I would buy a heavier string, but these match well with my 414ce Taylor.  Because of the price I don't use these on my cheap Fender Acoustic, for that I suggest Earthwoods.  I even use the Electric version of these strings on my American Srat, very pleased there as well.", "id": 109}, {"review": "The power supply which is not included is a funky size, it does seem to work with a standard pedal power supply but I wouldn't recommend it only because it is not the proper size.  The guy that was using this was using it with a Fender Telecaster, and a single 12&#34; tube amp.  He found that the volume was cut by ~ 15-20% even with the pedal turned all the way up.  Any time a pedal allows for volume loss , it tends to effect tone & yes, Mr. Sound Engineer, &#34;tone&#34; is a real thing!The pedal is pretty bulky and won't fit well in most pedal boards, but it's not any more wide than the Morley, but it seems to be taller, longer, and heavier.I gave it 3 stars because, &#34;It's Okay&#34;, but it is far from great, and I would not buy this product again.  I understand the price is cheap, and if this is all you can afford, then go for it, but if you have the extra cheese, spread it.", "id": 212}, {"review": "I used to use the Tortex pick until a buddy of mine gave me one of these.  I ended up using that pick for something like 3 years (playing 1-2 times/wk).  Once I started playing 4hrs/wk at my church, I decided that this pick had proven its self so I order a small box.  I have never dropped one of these and have never broken one.  FYI: I generally don't play hard and I always play acoustic, Nanoweb custom lights.", "id": 549}, {"review": "What does anyone really want to know about a string winder.  Yes it will help you string your instrument quicker.  And Yes, it's still in one piece. I would buy it again.  You may even buy 2 because the same gnomes that steal pick's and capo's take these too.", "id": 683}]