[{"review": "I purchased this for a friend who has just taken up playing the violin, she prefers it over the rosin that came with her student violin because of the wood that forms a grip around the rosin.", "id": 78}, {"review": "bought this on a whim and I am glad of it, I have not used the string winder part yet but the cutter makes short work of both guitar and mandolin strings without the risk of marring the head, just be careful you can pinch yourself if you are not careful.", "id": 94}, {"review": "In my house alone we have a bass player, a acoustic guitar player, a sax player and a violinist, that is not counting myself (I attempt to play mandolin and harmonica, usually I fail) so diverse instruments used to require different tuners but with this little all in one the clutter of tuners and pitchpipes is history, I just set aside a music nook in the family room with this mounted to a music stand and everyone can tune before practice, the sax player sneers at us tuners but still finds use for the reference notes and metronome function built into this little beauty.just be sure to buy theKorg CM-100L Clip On Contact Microphone For Tunersif you want to tune your instrument while others are playing.", "id": 298}, {"review": "Used this on my mandolin and it brought back the new instrument sheen it had lost months ago. I sprayed it on a bit of cheesecloth, used that to rub the instrument down, then wiped with a soft Chamois, worked like a charm.", "id": 351}, {"review": "Unlike some other reviewers I have found no quality issues with mine, it came symmetrically bent with a plastic pad that doesn't smell like anything, it holds my harp exactly where it needs to be and is easy enough to remove, all I need to do is loosen the bottom wingnut, rotate the harp away from my mouth, and lift the frame over my head.To change out harps bite down on your harp, use your hands to depress the tabs on either side and then pull your head back sliding the harp out as you do, to insert a new one place your harp in your mouth, depress tabs and use your mouth to center the harp in between the plates, when it is in position release tabs making sure not to get your lips caught between the harmonica and the plates as they pinch shut.", "id": 354}, {"review": "Got these as a gift for my 11 year old nephew, he loves them, the only problem is that his friends keep walking off with them.", "id": 366}, {"review": "usually picks are picks, but these are a blast, I play by holding the \"horns\" between thumb and forefinger and using the mouth to pick out the notes, I had to order 2 extra bags of these because people keep begging for one.", "id": 373}, {"review": "these are a lighter tensioned version of their popular J74 strings, the pitch is somewhat lower than the J74s and the effort needed to fret a note is much less, nice for old fingers and beginners.", "id": 408}, {"review": "This is one of those simple gizmos that make you wonder \"why didn't i think of that\", it snaps around my mandolin strings by the bridge and a quick run up to the nut and back down  every few weeks keeps the strings clean, and best of all I don't find lint from my cleaning rag in the wound strings any more since I started using this instead of the cheesecloth I used to use.", "id": 543}, {"review": "I bought this for a friend who always wanted to play violin but never could afford one, the quality was surprisingly good considering how cheap it was, I helped her set it up (took 15 minutes max, just needed to get the bridge just right) and the only flaw I found was the horrible pegs that came with it, I had some spare rosewood ones in a drawer which fixed that small problem, as for the rest of the violin the furniture was workmanlike, not concert quality but serviceable for a student, the body was what really surprised me, for a mass produced student model it has a nice sound, I do believe that with nicer furniture, a better bridge, and strings I would not be ashamed to play this at a venue, how it will hold up over time is a open question but from what I can see of its internals it is well put together.this brings me to my only real problem, as she never has played any instrument at all she makes this violin squeal like a pig, I am no good at teaching so I got her a few books and downloaded some vids from youtube for her to watch but still...Her husband has forbidden her to bring the violin home till she can play so she comes over here to practice, which has led my neighbors to believe I am responsible for the sudden disappearance of several neighborhood cats (I think the noise chased em away) I am waiting for the call from the SPCA as I type this.", "id": 596}, {"review": "the snark series of tuners are the best small tuners I have found, I have both the the SN-1 and SN-2 for my guitar and mandolin respectively, when buying be sure to get the correct one for the instrument you are going to use it on, if not sure which, get the SN-2 (red) one it generally will work for all instruments.", "id": 706}, {"review": "I am just learning the mandolin and bought this as a afterthought and I am glad I did, I am a longtime guitar player and the way you hold a pick for a guitar and for a mandolin are totally different combine this with the twin string setup on the mandolin and how close the twin strings are to each other and I have suddenly developed a case of the clumsys as far as keeping hold of my pick, its bad enough dropping my pick in the middle of a jam session but it would be worse having to go fishing around for it or a replacement, I stuck this on the back of my mandolins head between the strap and the tuners so when I drop my pick I just flick a new one out and continue on.", "id": 167}, {"review": "I am just learning how to play the mandolin, one of the problems I was having was supporting the mandolin and fretting the notes, since I got this strap adjusted I no longer have to hold the neck so I can concentrate on the notes, I like the fact that you can unclip the strap at either end without touching the adjustments so I can put it into my case without having the strap laying across the neck, yet pick it up and with one click it is ready to play.", "id": 352}, {"review": "I use this on my mandolin, it is easy to use once you have the trick of it, first this thing has a long end with eyelets on it (that the other reviewers fear will scratch the neck of their instruments), and a short end (designed to prevent said scratches). To use place the capo on your strings with the short end facing you, use your left thumb to hold it in place with the short end dangling just below your thumb, next loop the long end over the back of the neck using your right hand to pull it under the neck and then up toward your thumb, this will trap the short end under the long end and prevent the long ends eyelets from touching your instruments neck, now just rotate your left thumb out of the way so you can buckle the strap in place and you are all set.I prefer this capo over the other 2 I have because it is so tiny, barely  bigger than the first two joints of my pinkie, and yet it does the job it was designed for, its small size means I can toss it in my mandos hardcase storage box and forget about it till I need it.The only downside to this is that the elastic will eventually stretch to where it will no longer work, but then again at 5 bucks you can't have everything.", "id": 356}, {"review": "In my opinion Snark makes the best tuners in the 10 to 20 dollar price range. This particular model has a metronome built in to it, the metros options are a bit limited and the beat can be lost if you are in a noisy environment but for the price I consider I bought a tuner with a freebie built in.The tuner obviously works on mic alone so if the noise level gets too high or the note too soft it doesn't register but for my use (holding my fakebook open while I play mando and harmonica) it works well.", "id": 732}, {"review": "This bag includes several different thicknesses of picks so you can see which fits your playing style best, and the varied colors means the more vain of us can color coordinate our pick and instrument.", "id": 744}]