[{"review": "The pots on my bass has become &#34;scratchy&#34; so I sprayed a bit into them, turn the pots back and forth a few times and no more noise. Great for what I needed.", "id": 14}, {"review": "This has become my number one cable for my Carvin bass. I gig with it a couple times per week and it has been rock solid. I only use something different if I need a longer reach. And I love the tweed cover. Very satisfied with this one.", "id": 47}, {"review": "I put it on the boom of my mic stand. Tight on some, not on others. I need to put a shim on it for some stands to keep the picks in place.", "id": 70}, {"review": "This is a good stand that can be used for both electric and acoustic guitars. The upper brace has an interesting way of securing the guitar neck making it unlikely your instrument will topple over. The stand can be used with or without the upper brace. On mine, the wheel that locks the upper brace in place is not as locking as I'd like it to be. Also, the &#34;feet&#34; don't spread as wide apart as I'd hoped. A few more inches would have been appreciated. All in all, a good but not &#34;perfect&#34; stand.", "id": 133}, {"review": "In my band, we have a song where I use a kazoo for one song and I needed a way to store it until needed. This cup holder does the trick. It also holds my water bottle with no problem. The problem is it doesn't do both at the same time. That's on me; this is a good product for what it does.", "id": 530}, {"review": "I had always used the Kyser clip-on-the-top capos (and still do), but I liked the look on this Dunlop clip-on-the-bottom model. It works great and looks better.", "id": 116}, {"review": "I admit I haven't had it long, but so far so good. I have a Gator pedal board that came with their power supply. Unfortunately, that thing has a proprietary connector on the cable. The PS is fine, but the cable is shorting out. Couldn't find another cable, so I thought I'd find another solution with a more generic cable. This Joyo product fits that and is cheaper than the competition (which made me a little skeptical). I may never need all its features, but for what I need (powering 5 devices) it is doing the job beautifully. My pedal board includes tuner, chorus and octaver stomp boxes, a bass DI and a Rolls headphone amp. The JP-02 frees me up from any other wall warts. Money! Now I just need to figure a way to attach it to the bottom of the pedal board.", "id": 852}]