[{"review": "After you use these the large, flimsy old school picks will be used just when you don't have one of these babies available.  These are the best picks out there.  If you don't have these already you better purchase them now.  Black or Red, the color is the only difference.", "id": 67}, {"review": "This stand seems to be made especially with the Fender Stratocaster in mind and might also be a perfect fit for other Fender guitars.  On my Les Paul the cable plug on the guitar is exactly where the bottom holder bar is.  If I adjust the guitar so the plug is not on the bar, the guitar sits at an angle where the guitar might tip over on it's side.Needless to say I will use this stand for my Stratocaster but I am purchasing a different model for the Les Paul.", "id": 91}, {"review": "If you like Jazz Guitar picks and if you like Tortex picks this is the perfect marriage.  These are the best.  Enjoy.", "id": 341}, {"review": "Tortex picks are the best.  Pitch black is so cool.  1.0 mm is the perfect thickness.  Don't buy those other picks, buy these because Tortex ... Black .... 1.0 mm is the perfect combination.", "id": 350}, {"review": "Firm pick, just the perfect size and keeps a sharp tip.  Once you try these picks you never go back.", "id": 413}, {"review": "If you use a medium pick for playing these are really cool picks to play with and about the same price as a fender or dunlop medium pick.  For a Beatles collector what a great price for a neat Beatles product.  Even the packaging it cool.If you need picks for playing or a neat Beatles product to collect you won't be dissipointed with this purchase.Excellent product from a fantastic seller.", "id": 614}, {"review": "For whatever reason I excpected the tin to be a little larger then what it is.  I thought the size of an Altoid tin.  I was thinking I could not only store the fifteen Beatles picks, but also store my hundred other picks in the tin.It is very nice looking tin and the picks are cool,  well worth the just under $8.00 price tag. I may order another one with different print on the tin, but it is a small tin.  Just a little larger than a zippo lighter.", "id": 669}]