[{"review": "I am editing my previous review on this little guitar after taking the time to properly set it up, dial it in and play it for a while.  I edited yet again as someone didn't appreciate my \"gloating\" over other guitars I own.  Sorry to offend YOU.I made a knee jerk review (again) right after I got this.  But in all fairness I received my Gibson Les Paul on the same day, buying IT from my local music store and professionally set up, ready to go.  I was comparing apples and oranges, so to speak.  But now, even after comparing them to each other, they really aren't that far apart.The Gibson is the best guitar I've ever owned and made my previous comparison based on it.  But this little baby is now my second favorite.My other review was NOT FAIR!!!!!!  I paid a lot more for the Gibson and 149 bucks for this Epiphone.  Dollar for dollar this little Ephiphone is a steal!!!!  WOW!!!I must honestly admit, the edge goes to my Gibson, but not by as much as you'd think.  This little Epiphone is an outstanding guitar, regardless of price.  If I were to play them each blindfolded I would never guess one was $149 guitar, ever!  The tone of the Epiphone is much like the Gibson Les Paul.  It's easy to play, comfortable and has a sweet sound.  I can either rock out with it or mellow out and play the blues or classic rock.To be honest, I will probably play this Epiphone a LOT more than the Gibson.  After all, if I ding this one up I haven't broke the bank.  I think I'll tend to use this one a lot more than the other.I am very happy with this Epiphone Les Paul and will proudly play and OWN it.  I am amazed they can make this thing for the money they charge.  I may purchase another one and put it away as I'm sure the price won't stay this low.  PLUS, I'll get another one in a different color!!  You can never have too many guitars..  I am going to an a pickguard to this one.  The finish on it is outstanding and I'd like to keep it that way.If I were thinking of learning to play the guitar, this one is a no-brainer....BUY IT!!!If you're an established player looking for a really nice practice guitar, I'd buy this one is a heartbeat.  I was shocked at how sweet it sounds, how good it looks, how comfortable and light it is and how well it plays.  Sure it was way out of tune and required a few height adjustments but now it is FANTASTIC.New rule for me, no writing reviews until I own the product for at least one week!!!!!", "id": 31}, {"review": "First, I have to say the only reason I bought this is that we have two pot belly pigs that live in our house...so this was a no-brainer to purchase just to have as a fan of pigs, and I play the guitar too.Now for the review.This little &#34;collector&#34; amp turns out to be something I will actually use rather than put on a shelf to look at with all of our other pig stuff.I was very surprised how well built it is.  It's solid as a rock with chrome handles, edge guards and a pig snout for the volume control.It looks like a mini suit case and contrary to another review, the AC adapter fits into a compartment inside so it may be stored internally.  It also operates on batteries which makes this little thing quite the gem to take with us this summer.  Now I can take the Fender or Gibson electrics rather than the acoustic.Okay, I keep getting off topic here...The sound is clear and crisp for it's size.  Sure, it's not my Fender Mustang IV, but I didn't pay 600 bucks for it either.  But then my Fender doesn't have a pig's snout!!  There are no controls on this for tone adjustments, just a volume knob.  But, most of our modern electric guitars have quite a bit of tone adjustment anyway.  I would compare the sound coming from it as above average but it's the novelty of the amp that is the real attraction, for me anyway.As for it's size, I would say it's just about the size of your average small jewelry box.  But it's much heavier, deceptively heavy but I like that.  It doesn't have that &#34;cheap&#34; feel about it.Like I said, I WILL use this occasionally, especially during summer months when we cruise in the convertible or in the conversion van.  I look forward to the comments the amp will get, I'm sure way more than my guitar playing skills as I still have a lot to learn.  But, learning should be fun and this little amp and is just another way to make it even more fun.In summary, I would highly recommend this to any pig lover who owns a guitar or to anyone who's looking for a portable amp that operates on either batteries or an AC adapter.A word to best describe it....&#34;COOL&#34;.", "id": 76}, {"review": "I just put this on my Dot Hollowbody.  It's a big, heavy guitar and this strap looks good and does the job.  I like how it looks and feels and would buy another one just like it.  The price was great, had the Gibson name on it and was a great value.  5 stars.", "id": 79}, {"review": "I have found the perfect strings and these are not them.I will use these for my lower end stuff I will probably sell anyway.  We all have our preferences but I'm not an Ernie Ball fan.  They're cheap though.", "id": 87}, {"review": "These are the Gold standard for all Strat type electrics, Fender or not.  I put these 150's on all of my Strats regardless of the brand.  They are durable enough to take a pounding and sound great.  I tend to play my Strats a bit rougher than my Gibson's or acoustics so these are well tested in my house.  I get a bit carried away with amp volume and tend to bend the strings a bit.  I will continue using these on all of my Strats until I find something better which I haven't yet.  I do use other strings on other types of guitars and you can see my reviews on those as well.These are bullet proof.  They take a pounding and last as long as you could expect!!!", "id": 88}, {"review": "I wasn't quite sure what to expect but have a few old guitars with pretty weathered looking fingerboards.  I figured I'd give this a try.  I am so glad I did.  I could not believe how much residue was on the rag after I cleaned the fret board, yuk.  Then I used the 02 treatment product to treat it and it really brought out the natural color.  I'd like to say it looks like new, but the guitar is a 1967 so that would be a stretch.But it looks a heck of a lot better, almost new.  I used it on one of my less valuable acoustics, but it's still a '67 USA made Fender.  I have such faith in this that I'm going to do my '77 Gibson acoustic next.Then I have a couple of electrics I will do when I change strings on them.  This stuff is great.", "id": 96}, {"review": "I put these on one of my Gibson Les Pauls' and so far so good.  Great sound and no wear after one session, unlike the D'Addario strings.I will update in a few weeks as I see how long they last.", "id": 107}, {"review": "I am upgrading my Chinese Fender Strat with American Hardware.  I own an American Strat too and plan on making the best of the Chinese one.  Going to upgrade electronics and everything else too.These are exactly what's on my American Strat5 stars", "id": 115}, {"review": "This Capo is inexpensive and works well.  Clips on easily and hold strings down nicely.  What more can I say.  Gotta keep it simple on this review because it's a simple item.  Simply, it does what it's supposed to do for a low price.  I think it will last a while too but I'll probable misplace it before it breaks anyway so I have a few of these floating around.  You should have one of these in each gig bag.", "id": 116}, {"review": "These picks are perfect.  They are just the right feel for medium and look awesome.  What more can you say about picks other than they are perfect.", "id": 117}, {"review": "These picks far exceed my expectations, I mean how good could a pick be anyway?  These are the classiest, nicest looking picks I own.  They look great, feel great and play great.  Call me a snob, but I wanted these to match my Fender Stratocaster.  Kind of like using a GM part on my 68 Chevelle..If you own a Fender and want to spend just a few bucks for a &#34;feel good&#34; gift to yourself, buy these.I love the color and texture too, they don't slip or move around as you play.", "id": 120}, {"review": "I bought 2 of these and will order a few more.  They are very nice looking and functional too.  I have been keeping my guitars in floor stands or in their cases but it takes up much needed space and just creates clutter...not that a guitar should EVER be considered clutter.The GREAT thing about these is that your guitar(s) are always &#34;right there&#34; and you can choose whichever one you have a hankering to play at that moment.Just a note of caution though.  Make CERTAIN that you mount the hanger screwed into a stud or on a solid wood surface.  The weight of your guitar will pull it right from sheet rock.  Included are sheet rock plastic backers but personally I would not trust them and nobody wants a hole in their wall.  I would also use longer screws than they provide with the purchase as well.  I'm sure the screws are okay but I wouldn't trust them myself.I would highly recommend these for someone with just one guitar or many.  Well worth the small price paid.  The shipping was incredibly fast too, as always with Amazon.", "id": 166}, {"review": "I love this little item.  I was reluctant sticking anything on my nice new Fender but I love it.  No more hunting for picks anymore.  When I am through playing a just slide my pick back into the holder and it's always there when I pick up the guitar.Placement is everything though so think it out before you just stick in on your guitar.  I placed mine where I'd never rub against it, between the amp cord inlet and a control knob.  Make sure it isn't in the way of your strumming or any place your body will rub against it.I love this and have one coming for my acoustic too, only it is the wood grain version to match the wood on the guitar.Oh, I use medium picks and fit 7 easily into the holder and wouldn't try to squeeze another on in, but that's why you have a gig bag anyway.  This is a must have item, in my opinion.", "id": 167}, {"review": "I will keep this short.  The price is unbelievable, it's nice to have three sets in a box and these are the best acoustic strings on the market.  That's only my opinion and everyone has one......so many will disagree.I have an regular acoustic and an acoustic electric and strung both with these strings.  It made each guitar sound like a 3 thousand dollar guitar.  I find that most inexpensive guitars have cheap strings, most can be vastly improved with something as simple as new strings.  I really believe in these strings.  When I find a good thing, I am hooked and I will not use anything BUT these on anything acoustic.  On a guitar, strings are everything.  The tone feel and bend is what's important.  These are very light and VERY easy on the fingers, unlike clunky stock strings on most acoustics.  I guess they think you need big, think strings to produce volume....not so.  Some will disagree saying they break if they're too thin.  I would rather have a shorter life with strings, getting a pure beautiful, rich sound than have a long lasting flat string.  My thick stock strings were killing my fingers.  These are effortless to play and sound so sweet and mellow, just like an acoustic should sound.Again, someone will chime in and bash me for saying this...but I would put my inexpensive Yamaha up against guitars costing 10 times what I paid.  I have no plans of changing brands now I've made the string switch.  Some say thin strings break easily, but you should change strings often anyway.  I can do a string change-over in about 15 minutes on a bad day.  It's worth the effort.  I don't plan on hammering my acoustic anyway.  That's what the Fender is for.  AND it's not that I'm cheap either.  I own 18 guitars, 16 of which are electrics.  3 Gibson Les Paul's, 2 Fender Strats (one American) a couple of Dillions (another great find) and some other nice guitars.My Acoustic is just an inexpensive Yamaha 700 but is a very nice guitar for the money.  But after changing the strings it sounds like an expensive Martin.  It didn't take me long to throw a set of these on my acoustic electric and got the same results.5 stars in my book, more if they'd allow that.  There are no other options unless someone gives me a set that blow me away.", "id": 198}, {"review": "Bought this for one of my cheaper guitars and it does the job.  It adjusts easily and doesn't look bad either", "id": 208}, {"review": "I bought these because I am constantly loosing screws when I change pickguards or do new builds.These are exactly what the doctor ordered.  Original equipment so they're the right screws,  A must have for every guitarist, no matter what brand you own as they work on everything.These are well made and don't strip when screwing in for the first time.  If it's a new project, always drill pilot holes anyway.  I am so glad I bought these, one by one they are being used...almost time to order another set.I store them in a little sandwich bag.  5 stars", "id": 215}, {"review": "As cheap as these strings were, I am pleasantly surprised with the results achieved.I picked up an old, cheap electric guitar that needed some work.  It had been dropped on it's head.After repairing and playing it, it still sounded like crap so I had these strings, they were cheap and I put them on.  Only took about 5 minutes to restring and was well worth the effort.Okay, the guitar (and I am too embarrassed to give the brand) isn't my Gibson Les Paul or my Fender American Strat, but damn, it sounds good now.  If I didn't have so many guitars, I might keep this one but I will probably sell it to make room for another.These were well worth the few dollars I spent on them.  Honestly, I won't restring my Fender with them, I'll use the Fender 250 bullets.  But these are great for about any electric.  With guitars, crappy strings kill it.  Great strings can make a bad guitar okay, not great.I will continue buying and using these on my lower end guitars but will spend the few extra bucks on my high end guitars.", "id": 226}, {"review": "I ordered the one in the photo, with brown sides and got a standard black one.  I have the black one on my Fender Stratocaster and wanted the brown one for my acoustic.  Unfortunately they sent the wrong one but I'll use it anyway.  It's also not the same size as the one in the photo, much wider.I wish I had the right one as the one I got doesn't match the guitar.  I know if I put up a fuss they would send the right one, but it would cost more to send this back than I paid for it.I will say that these are a must have if you're tired of searching for picks.  Finish playing, slide your pick into this and it's there when you play again.", "id": 233}, {"review": "Admittedly, I don't use these on my high end stuff, I use these on my cheap axes to bang on.  Why?  The are strong, durable, and sound good.  The tone isn't as pure as some other strings on the market but for the cost, they do the job.  The really good strings I typically have to change often, as I like a light string.These hold up well, taking a good bend and beating.If you have a teenager who isn't light with the pick, or if you have something you tend to get very aggressive with, these are perfect..5 stars for what they are.", "id": 239}, {"review": "I am disabled, a disabled Vietnam Vet, and my mobility is becoming more limited every winter.  My wife bought me this for Christmas, thinking I needed a new hobby to keep me busy during the harsh winter months.I am so happy she did.  My first thought was \"Now I have to learn how to play this thing\".  I am so glad she chose this particular guitar for me to start with.  I now own 26 guitars and have even built 2 custom guitars.  I always get carried away with new projects and can already play quite well, or so I'm told.  I practice a lot.Now about the guitar.  I wanted to wait until I knew a little something before I reviewed it.  First, I don't know how they sell these for the price they do.  It is a very high quality piece, comparable to guitars in the thousand dollar price range.The action is nice and low, good especially for a beginner.  I did find just the perfect strings and it made a world of difference.  I use light D'Addaro strings and love the tone and feel.The Yamaha is solid wood everywhere, no laminate as you'd expect for this price.  The tone is fantastic, the finish is flawless and tough.  It sounds great gently playing or really getting down and rough with it.  I have been strumming vigorously for over four months now and not a mark is on the guitar.  I have been playing many other guitars, all electric as well and am looking at a high end acoustic now, but will always keep my first.  There is no reason for me to need another acoustic, I just will because I can.This Yamaha has great tuners and stays in tune well, rarely having to make an adjustment once the strings are stretched.The neck is nice, though a bit thick so I cheat sometimes with my thumb on the low E.  The set-up was perfect with this and I just can't see where it's going to take much if any maintenance over the years other than replacing strings as needed.The Yamaha came with a great hard case, tuner, pics and other goodies as a package and was very inexpensive.  I did put a nice soft leather strap with a quick disconnect on it as there is no front strap button but no big deal there.If you're looking for a nice acoustic or thinking about taking up playing, this would be a great place to start.  I see these selling used for what I paid for mine new so you're bot going to lose money on it either.  Read the other reviews, this is a really nice value.  It is still my only acoustic that I own, my other 25 guitars are all electrics or project guitars.  I do have my eye on a Martin though.5 PLUS stars for this one.  If you're considering it, buy it.  You will not regret it.  I still play this on almost every day.", "id": 360}, {"review": "This is a nice small amp.  It delivers nice, pure sound at more than loud enough levels for me.  One thing I like about this amp is that it is very simple, not a bunch of complicated settings to worry about.  Another thing, I think it's the nicest looking amp I have and I have about 10 amps now.  It's about the same size as my little Fender Frontman 15 and sits side-by-side with it in my living room.  I use the Fender for electric and the Behringer for the acoustic for practicing.If you're looking for a no frills amp that doesn't cost a lot or take up much room, this is a good one for you.Makes a great little practice amp.  I am totally happy with this one and see no need to add an additional acoustic amp.Mine looks a lot different than the photo, it's more brown and actually looks better.", "id": 398}, {"review": "I thought I was buying the 10 footer and realize I ordered the 5 footer too late.  Let's be honest here, what good is a 5 foot amp chord unless you're sitting on the amp?  My bad..I never would have ordered this as it costs the same money for the 10 footers as it does for the 5 footers.  I would not recommend buying a 5 footer unless you practice in a closet.", "id": 419}, {"review": "I just got this and love it.  My Fender Stratocaster fits perfectly into the bag, padded well too.  I can fit all of my &#34;stuff&#34; into the MANY pockets as well.  This bag is amazing and nothing like what I expected for the price I paid.  It has shoulder straps to carry the bag and contents on my back and also has a large loop to hang the bag on a door or hook too.  If you need a bag to protect your fender and to carry you stuff in, buy this one.  I LOVE IT.  I would expect to pay a hundred bucks for this kind of quality but only spent 30 bucks.", "id": 468}, {"review": "I bought this one for one of my heavier guitars hoping for some shoulder relief and it does the job.  It's inexpensive and the padding is excellent.  It looks like it will last too.", "id": 470}, {"review": "This seems to be a nice, rugged stand.  Much better than the one I received with a guitar I ordered.  It went together fast and is well padded.  It cradles my guitar well and seems to be solid.  I'm not sure how much I will use it now I have discovered guitar wall hangers, or string swings.  I prefer hanging them on the wall and not having them on the floor in the way, just my preference.I suppose these would be good for mic night or doing a gig, but I don't expect that will ever be something I do unless I get a lot better than I am now.  I still suck....but I'm having fun and trying.", "id": 519}, {"review": "If you own an American Strat or Tele, this is a must have for the neck of your prize.  I love this.  It proudly states the guitar's origin of Corona. California with the Classic Fender name scribed.  Wonderful.  I have these on all three of my Fenders.  Again, these should really come standard on all American Strats.", "id": 527}, {"review": "I am revising my previous review on the 3250L's...I have now only had these on my American Stratocaster for two weeks.  I loved them so much at first that I ordered 5 other sets and restrung several of my other Strats and other guitars.BIG mistake.  Why am I so impatient?These were unbelievable right out of the box, bring my Strat to life, giving it an unbelievable feel and sound.But, with every positive, there's usually a negative....and wait for it.....wait for it...yup, there was.I changed pickguards only two weeks after installing this on my Strat and noticed all three smaller strings. G,B &E; were all flat on the fret side.  They were already worn out.  I suspected something as the sound had changed already too, becoming flat after only about a week.This is NOT mu only guitar, I now have 17 total and rotate playing so I bet I hadn't played the Strat for more than6 hours or so.Now, I'm so disappointed.  I'm going to step up to the 250's, then the 150 if I have to.  I love the sound but don't want to change strings every week.To make a long story short, I wouldn't buy these again unfortunately and the search goes on for the perfect set of strings.", "id": 679}, {"review": "For some reason, this one just doesn't hit the notes right.  It looks like it should tune more precise than other models but the tone is way off for mine anyway.  I have tried it several times and it just doesn't tune right.  Then I recheck with my other brand and it's not even close.  Maybe I just got a bad one?  I like that this one shuts off automatically..but again, it's WAY off tune.I did like the style, size and color.....but it doesn't work right so it's like running with a flat tire...", "id": 706}, {"review": "This amp cable is perfect.  It fits my need for practicing.  It's just the right length for sitting on the couch, strumming daily.  I would like this one for each amp I own so I'm not always taking it from amp to amp.  I will buy some more of these.The cable also looks nice and completes the Fender look.  I would highly recommend this and give it a no-brainer 5 star rating.  I have nothing negative to say about this.", "id": 803}, {"review": "Don't know why quality instruments don't come with bone nuts but these are a very inexpensive improvement.  The next time you change your strings, check and see if your current nut is plastic.  If so, have a few of these on hand and re[place that nut.  You will hear the difference and they don't wear out like plastic.Just make certain you get the height correct so your action isn't too high.  Rule of thumb, grind just a bit at a time and keep checking for correct height.  You can always remove more material but you can't put it back on...This is a quick, easy improvement.  I have bone on all of my guitars.", "id": 857}, {"review": "I love this assortment.  Every color and size you'll ever need.  You can never have enough picks but this batch should keep you going for a while.  This was an exceptional value and the picks are of nice quality.  I would buy this again or recommend to anyone.  I use medium picks so would search for a large batch of these in medium only though.  Definitely a 5 star purchase.", "id": 878}, {"review": "My first review was a knee-jerk reaction to this amp as it had no manual with it.  I couldn't get it to sound like I wanted it to.....I WAS SO WRONG IN GIVING IT ONLY 2 STARS...I must now rerate it with a 5 star.  This amp does almost too much for the money.  My only wish is that a manual came with it as you really need to spend some serious time playing with it to see the depth this thing has.  It can do ANYTHING and sound any way you want it too.WOW, I never knew my guitar could sound like this.  It actually gives you any sound or personality you want it to have.  I am beginning to love this thing and it will surely be my favorite Amp when I totally figure it out, if I ever do.  The sound production is endless as there are so many setting and different combinations of settings.So, in short, forgive me as I have sinned and judged too early.  BUY this thing but give yourself some time to familiarize yourself with it.  If you are looking for a small, plug and play amp...this isn't it.  But it you're looking for a powerful sound with endless possibilities. this IS it.  It is growing on me and I wouldn't part with it now.", "id": 882}, {"review": "Perfect for re-stringing your guitar.  Very portable too and fits in my gig bag with spare strings.  The price was right too.  This is a must have tool and isn't cheap like most of the plastic ones out there.  The nice thing about this one is it  cuts off excess with ease, just looks better trimmed neatly.5 star product", "id": 94}, {"review": "I read all of the reviews and bought 6 pairs of these based on the reviews.So, I put these on my Gibson Les Paul last night and played for a few hours.  I didn't hammer the strings, just played easy, mostly the Eagles.As I was hanging the guitar on the wall afterward, I took a quick look at the strings.  I was shocked to see the high E and B strings were already flattened.  I never would have expected wear after just a few hours of light playing.The strings sounded great, but by the time I had them stretched enough that they would hold tune, they were already worn.I guess I'm going to HAVE to go to heavier strings so I'm not changing strings every few days.  These just did not perform as expected.Giving these 3 stars is being generous.  I have 5 sets to use up now, damn.  I was using light gauge and thought these mediums would hold up, but they lasted for only two hours......my Fender 3250L bullets at least lasted a few weeks.  Going to try the Fender on my Gibson and see how they sound.  I'm still in search of the \"perfect\" set of strings.  I'm open to suggestions", "id": 156}, {"review": "I needed a Jack Plate for my custom Stratocaster build and ordered this one.  It was far better than I expected.  It is very heavy duty, great chrome plating.  Not at all what I expected for the money.  A definite quality part worthy of this project that will be with me for life.  Nothing but the best going on this guitar, including this plate.", "id": 218}, {"review": "Very pleasantly surprised buy this one.  I like the leather ends and it adjust easily and stays put.  It looks like it will hold up to some abuse as well.  A nice strap for my lower tier guitars.", "id": 285}, {"review": "These are fantastic and unique guitar picks.  I love the hologram effect and the cute babes as well.  It's always nice to have a conversation item and these little ones age great to show off to your guy friends.  Love them, and they're good quality picks too so I will use them.", "id": 366}, {"review": "After reading many review on my Yamaha 700 acoustic guitar I have owned and played for 4 months, I finally took the advice of other consumers.  MANY people suggested changing the stock plastic nut and bridge saddle to improve tone.This guitar is an incredible deal and piece the way it was.  I did put a light set of D'addario strings that made a world of difference.I was due for another string change so upgraded with this set of bone nut and saddle.WOW, it really did make a huge difference.  This guitar is such a quality piece, especially for the money.  But, with the string and bone upgrades I can't imagine a sweeter sounding acoustic.  It changed the tone to that of a classical  guitar.  I am so happy with my changes.The high notes are pure and ring nicely and lows are rich and deep.  The sustain is a drastic improvement, each note lasting nicely into the next.  I am so pleased and excited with my guitar.If you own this or any other acoustic with plastic nut and saddle.....change them, it's a very quick fix.  And find a nice set of strings.", "id": 860}]