[{"review": "I really like these strings. Good sound and the feel is good. Not sure there is much difference in tension of lighter strings, however. I only bought one set, not three sets and have not had to change them yet after three months.", "id": 198}, {"review": "Don't know what I expected for such a cheap price, but this product's quality is in line with its price. Also, the fit over my ukulele's fretboard is very tight, making it hard to put on and remove.", "id": 356}, {"review": "A light weight but well made covering for my jasmine guitar. Good material, good zippers, good design. There are much more well padded soft and hard cases available but they take up a lot more room around the house when not in use. I like this one because it provides enough protection without being cumbersome. For travel, you would need better, but for most uses, this is a good choice.", "id": 539}, {"review": "It was cheap to buy but works just fine. I thought it might not be tall enough to hold my guitar securely but it does. The arms are coated with a soft material that prevents scratching. It is small but the arms stretch to hold almost any guitar securely. Perhaps it might be too light for a very heavy guitar. In that case, I would recommend a stand that is taller and heavier.", "id": 92}, {"review": "This is a great guitar for the money. I paid $69.34 for my guitar and bought it through Amazon.com from Streamline Audio Video. It arrived ahead of schedule in great shape, ready to play right out of the box (after tuning it of course). If you want a better guitar than this, you will need to spend a whole lot more. The sound is great and it is easy to play. Only about 41&#34; long and may weigh a bit over the 6 lbs. stated in the description. My strings arrived is fine condition and the action was very close to what I will need.", "id": 148}, {"review": "If you are a beginning guitarist, like myself, you probably can't tell one note from another. This product does all the hard work for you easily, quickly and accurately. The only thing I needed to know but didn't was that if you get a reading of G and you need to make the reading B for the B string, the notes follow the alphabet from A to G and then begin again. So you are turning in the right direction from G if the next note is A. The one after A will be B. Seems simple enough if you know anything about music. I didn't.", "id": 706}]