[{"review": "I have used Dunlop Straplocks for 32 years. I bought the original style years ago for my Strat, Les Paul and Partscaster; the last two having the most weight.These things have lasted through gigging and anything else i can throw at them with no problem. I ordered strap pins only a few months ago to put on a few more recent guitars and one of the push button locks finally went out. It was on the strap I used the most for the heavier guitars so I got some mileage out of that thing. I ordered a whole set of new ones here last month and put the locks on a new strap and the buttons on another guitar.I suggest these over the other brands - watch what touring bands use. These things lay flat and there are no protruding parts to catch. If you happen to be without a strap with locks on it, these new pins can be used like regular pins but are larger so a strap will be pretty much secure.The price is good, price them anywhere else and include shipping. I always buy strings, picks or other stuff to get free shipping.", "id": 44}, {"review": "I do some guitar repair work and one of my customers needed a LP case. I have bought a lot of stuff here on AZ so looked at this one and had it shipped to him. He says its great so that is my review.Prices are always great on AZ and Prime saves me money in shipping.4 stars is my tops, anywhere.", "id": 50}, {"review": "A friend and I have run across a luthier who makes some cool stuff as well as repairing/restoring older guitars. My friend had a Tele custom made for him and needed a case so I ordered this one and it hits the spot. The neck is cradled in there nice and the guitar doesn't move at all. My buddy likes the case so I am happy.Nothing gets 5 stars - there are no generals present.", "id": 131}, {"review": "I have played guitar for most of 40 years and have used about any type of plectrum made. I have used coins and washers at times.My favorite pick for years was a Fender heavy and then I went for the really heavy brands like Dunlop or Clayton but found they are way too heavy and were eating my tone. I went back to Fenders and then found I like the medium best.Fender makes these in the coolest colors now so I went with them. Price them at a store and you will come back here.These came from GO-DPS which is no big deal as I shop on AMZ enough to know they use secondary sellers a lot of the time.However, I ordered a lot of stuff the day I ordered these and the full exhaust system was in my house 5 days later. These didn't show up so I contacted AMZ which goes back to GO-DPS. it took nearly a month to receive an envelope containing 12 picks. It didn't kill me not to have them - I have a million picks, I just wanted to see these in my hand.That said, I will definitely buy these again in the future and go for the different colors.Great price, great picks.", "id": 120}, {"review": "I retubed my Carvin X-60 combo with a duet of Mullards and 3 of these EH preamp tubes. Wow - they all come to life and make the amp sizzle. The price was right from AMZ.", "id": 229}, {"review": "I have played guitar/bass for quite some time and have used numerous tuners ranging those those big Korg strobe tuners to my latest Sabine STX-1100. I liked the big Boss TU-1000 but that is overkill unless in certain situations.I was at a big jam in a nightclub around Christmas and saw a bunch of guys using clamp on tuners of varying brands and thought I would try one. I looked at the Amazon offerings and after reading reviews settled on this one over the SN1 or SN2.This is too easy and my guitar has never stayed in tune like this before. It requires no input from your guitar so can be used any time. The only thing I don't like about it is it doesn't really like the E string of my bass. I don't think it picks up those long wavelengths so well. I will try the SN8 shortly and give this one to a friend.I do recommend this for guitarists because you will always be in tune no matter the tuning. If you leave it on while soloing you can see what notes you are playing. I am my own guitar tech, as well as for a friend, and I can set the intonation perfectly with this thing.Get a Snark and you will be happy.Edit - I don't like to use this with my PRS as the headstock has very little room to clip this to. The only place to clip is the very end and you are fighting tuning keys for space at that point. If you can get it there comfortably it works but nothing like with a Fender or Gibson; both which have plenty of space on the headstock.", "id": 762}]