[{"review": "These are the best strings ever.  I've tried almost every string on the market, and these are by far my favorite.  They sound great and last forever.  Believe the hype...they really DO last FAR longer than any other strings, and they sound great while doing it.Many other strings will sound great for a short while, but as soon as they get \"gunked up\", they lose any brilliance and tone, and become dead sounding.  Not these.  They will sound great for the life of the string.  In fact, the only way I know to change them eventually is not because they stop sounding good (which they don't), but because I'll start having intonation problems and I know the strings need to be changed.  Normal wear and tear does that, but these strings last SO long.I've tried the polyweb strings from Elixir as well, but I didn't like those at all.  To me, they didn't FEEL right.  Sticky or something (not like your fingers stick to the strings, but like you could tell they were coated).  With the Nanowebs, they sound AND feel like regular strings, but last forever.  The only string I'll use.", "id": 106}, {"review": "By far the best acoustic strings, period. They sound great, and last forever. TheElixir Nanoweb Electric Custom Light Guitar Stringsare the best electric strings ever, and these are the best acoustic strings. Fantastic.", "id": 109}, {"review": "These tubes just aren't for me. They don't sound great...kind of flat and lifeless. Also unreliable. One (out of 7) arrived DOA and another has failed since.", "id": 228}, {"review": "This capo works just fine. The only downside is the same as with most capos...it requires some fine-tuning to get it work on different guitars. The only one I've found that doesn't is the Kyser...my \"go to\" capo for years. Because of its design, that capo adjusts to any guitar (acoustic vs. electric, thin neck vs thick, etc) easily. The only downside of that capo is that it sacrifices a tiny bit of perfect intonation for the sake of ease of use.This capo has a similar \"pinch\" design (spring-loaded), but doesn't adjust as easily to different guitar/neck sizes. It has a wheel that allows for it to be tightened or widened as the guitar needs. This allows for a bit more accuracy of intonation, but at the expense of ease of use. It's certainly not difficult or extremely time consuming, but it's not a capo you want to use to quickly swap in between songs.So, all said, I still prefer my Kyser. It allows for much faster changing, which for me is worth the slight offset in intonation accuracy. But this might be a better option if you're in a studio or won't ever need to use a capo for more than one song at a time (or don't plan to use it on more than one guitar in the first place).", "id": 843}, {"review": "D'Addario strings are like the Kias of the string world. They make cheap products that cost a lot less but last a lot less time. These strings are OK...I've always been partial to Nickel wound (particularly semi-flatwound, but I digress). My typical strings are Elixirs, so I'm used to them lasting a long time. In this case, the strings sound good...like most nickel strings do. But they didn't last long at all before they started sounding dull and lifeless, and stopped keeping intonation accurately. So, like most D'Addario strings. So...they're not bad, but don't expect them to last like Elixirs do. You get what you pay for.", "id": 868}, {"review": "The capo is pretty good. I like the ability to customize tension. However, it is unclear which way the capo should be put on - with the &#34;pincer&#34; side facing the floor, or facing the ceiling? In either direction, it's a bit awkward to put on/take off, as the angle of the pincer is difficult to get right quickly. The Kaiser is still the best, IMO, but you can't adjust the tension on those. Overall, this is good but not great.", "id": 894}]