[{"review": "Works great for changing out the strings on ones guitar.  Compact enough that it's able to be stored in your case if you want or if you have a tech box that you bring with you.", "id": 163}, {"review": "In my experience these cables were not great.  The connectors rattle, they are made of cheap materials and the cable subsequently had a ton of line noise.  I can't expect miracles at that price-point but I certainly expected better. I avoid this brand of cables.", "id": 444}, {"review": "I just got this and I've noticed that it when I activate the pedal it sucks almost all of the bottom end out of my tone... I have a crybaby that doesn't have the range the 847 does but its 10x's more transparent.  There may be other factors at play here as it is new, but the lesson is: try it before you just buy it to make sure it works for you.", "id": 451}, {"review": "Lifesaver.  I bought this and a Planet Wave's O-Port (which advertises that it can help reduce feedback as well) I use this at every show where I have to plug-in.  This is a must for anyone who plugs in and doesn't want to worry about feedback.", "id": 497}, {"review": "This is great but I needed an actual sound-hole cover.  I bought this along with the Planet Waves Screeching Halt sound-hole cover.  Though only using it for a short time I did notice the bottom end seemed more focused.", "id": 704}, {"review": "My ipad lives on this thing!  I might be considered the laziest person around but I use a mic stand to place my ipad over my head so I can watch movies in bed while laying down.  I sometimes feel like I'm in a spaceship when I go to interact with my ipad.  I do wish it could rotate both directions.  It only goes from hamburger style to hotdog style by way of a right turn which is great if the stand sits on the right side of the bed.  But if you sleep on the left you're gonna have a bad time...", "id": 793}, {"review": "I bought this due to the constant problem of getting that awful out-of-tune twang with my previous Planet Waves capo when I would try to reset the capo on a different fret.  Planet Waves capos are awesome, don't get me wrong but this one is specialized for acoustic and works wonderfully.", "id": 887}]