[{"review": "Yes, you really replace your strings very fast with this Winder. And it also cuts the strings. Very helpful. i recommend.", "id": 94}, {"review": "In the case of you change the guitar strings, or in case you just make a revision setup, this item is very useful, because the guitar will be land and the her body will stay firmly attached.", "id": 163}, {"review": "It is really the best pick holder i ever had. I can put 6, 7 picks on it. It says very tight on the headstock and its visual is superb, I recommend.", "id": 167}, {"review": "My frets were completely whited after using one of these sheets. I recommend using it togheter with a metal cleaner and you will return your frets to original factory bright. Incredible!", "id": 317}, {"review": "Beatiful, amazing strap. Very soft, very confortable, sits perfetcly on fender strap lock, and looks like my G & L Custom Fender Select Case. What else, so?", "id": 353}, {"review": "These Fender Locking Tuners are the best for Stratocaster guitars, mainly if you have a tremolo system, what helps a lot the tuning stability and speeds up the strings change.", "id": 387}, {"review": "Yeah, i bought these for my friend' s band and their sound are really very impressive. Great durability and tone.", "id": 407}, {"review": "These cables are really the best. They sound perfectly, they look and feel strong, their contact is perfect. Life time warrany. Recommended.", "id": 578}, {"review": "This is a very good strap lock system. i put it on my wolfgang guitar and it locked very properly my strap. recommended.", "id": 607}, {"review": "Very, very good tune result. It really put yout guitar in tune. But the arm is so fragile. It has broken 2 monthes after the purchase, so i had to repair it manually with glue. I recommend.", "id": 706}, {"review": "It works and cleans the strings, but its durability is a little low, for about 2 months. I recommend Planet Waves String Cleaner if you plan to use a really good cleaner.", "id": 787}, {"review": "I liked the fact i can insert more than 5 picks and they really stand tight and don't fall down. But the original glue was not string enought and the holder has fallen on the ground.", "id": 233}, {"review": "The strings gauge is the best thing on this strings set. 0.1, 0.12, 0.16, 0.28, 0.38, 0.48 are the perfect balance between weight  and confort. It fits very well on my guitars: 1) Fender EVH Wolfgang, 2) IBanez S470. The cons is that these do not come with VCI, so expect some flakes when you open the pack.", "id": 499}, {"review": "Theses strings really have a good tone and tremolo stability greatly improves!!! The heavy bottons 32, 42 and 52 adds a BOOM in the tone. The others, 10, 13 and 17 are nicely and decent tone also. I don't rate it 5 stars for the lack of VCI. When i opened the pack there were no plastic anti corrosion protection. The high strings were plenty of flakes. If fender solved that it would be perfect.", "id": 679}]