[{"review": "Look, it's a plastic box that's just 5.5&#34; square and 2.5&#34; deep, with a cheap three-inch speaker inside. It produces decent sound, although there's substantial background hiss and it has a nasty habit of picking up digital &#34;static&#34; from my computer. It's OK as a practice amp, but I certainly wouldn't want to perform with it. In short, it's only a small step above toy level, which is what you'd expect for a twenty-dollar amp. That doesn't mean it's not useful, but you need to be realistic about what you're getting here.", "id": 303}, {"review": "This is a great little keyboard for use with GarageBand on the iPad. GarageBand recognizes it as a controller for the Keyboard, Smart Keyboard, Sampler, Smart Guitar, Smart Bass, and Drums. You can even solo on the Akai keyboard while the Smart Keyboard autoplays an accompaniment! In addition to offering the superior feel of a real keyboard, this Akai keyboard has much more consistent touch sensitivity than what's built into GarageBand for iPad.Unlike other keyboard controllers I've tried, this one plugs and plays with the iPad--no powered USB hub required. (You do need Apple's Camera connection Kit, of course, to add a USB port to your iPad.) It's not loaded with gimmicks--just the essentials, and the essentials work very well indeed. The keys are 85% of standard width, which is large enough for fumble-free playing. It's lightweight, compact and thus perfectly suited as an iPad accessory.", "id": 629}, {"review": "I bought this to replace the inexpensive Musedo T-50 tuner that came bundled with my Kala KA-S ukulele. The Snark SN-2 is much more accurate, but its LCD display is not very bright, and has a narrow field of view. (Yes, I did try a fresh battery, but it made no difference.) I wish it were brighter and easier to see. Still, it's a very good tuner overall.", "id": 707}, {"review": "The product photos make this look like a small, plastic item with cheesy chrome plating. Nope! It's a very solid, fairly large item made of heavy cast metal. You could drive nails with this thing--no exaggeration.The folding legs are clever and provide good support for desktop use, but they have some drawbacks. Yes, the Meteor has standard mic stand threads in its base, so you can put it on a mike stand or boom. But if you want to mount this mic in a shock-absorbing rig (I'm using a scissor-arm suspension boom with shock mount), you'll find the body is too short for the shock mount's sleeve to grip, and the three legs get in the way. I had to make a special adapter from 1 5/8&#34; plastic pipe and assorted hardware.The Meteor's sound is great as far as I'm concerned, but I'm not a professional audio engineer, so I'm not going to try to tell you that this is the equal of a $1,200 Sennheiser studio microphone. It is better than Samson's inexpensive GoMic, which I also have. I certainly have no complaints. I've used it to record voice and ukulele playing, and it's done a bang-up job with both.", "id": 743}, {"review": "I'll echo what others have said: this is a superbly built instrument for the price, and I don't know how Epiphone can make them to sell so inexpensively. It looks, feels and plays like an instrument that cost at least twice as much.A few notes: what looks in the product photos like a black finish around the edges and on the back and sides of the &#34;Vintage&#34; model is actually a super-rich deep, deep mahogany/maroon color, and it's unbelievably beautiful.As others have said, the factory-supplied strings are crap; if you judge the instrument by them, you'll be disappointed. Include a set of Aqila Nylgut strings when you order this ukulele, and restring it as soon as you get it.I was a little surprised that the sound was quieter than my $60 Kala soprano uke--normally, one expects a concert ukulele to have a louder, fuller sound. But the Les Paul has a relatively small soundbox compared to an all-acoustic ukulele, and that probably accounts for the quieter tone. I think it's a *better* tone, and I'm more interested in delicacy than in loudness, so I'm happy with it. If I wanted stadium-filling volume, I could always plug this into a stack of Marshall amps.Oh, I almost forgot one important note to all owners: IT IS POSSIBLE TO REMOVE THE STUPID, UGLY PICK GUARD! Since ukulele players rarely use picks, and when we do, we use soft rubber or felt ones, there's no need to protect the finish from scratching, and that white pick guard really detracts from the instrument's looks.I applied gentle heat from a hair dryer on its low power setting for about ten minutes, and very slowly and gently pried up the edges of the pick guard with my fingernails--no sharp tools! It came off pretty cleanly, leaving only a few small spots of adhesive residue. I was able to get rid of those with small amounts of rubbing alcohol on cotton, without any damage to the luscious ultra-glossy lacquer finish. And the ukulele looks SO much better now! If you feel as I do, feel free to do likewise. Just remember the key words: SLOW and GENTLE. Don't force anything, and you should be fine.", "id": 814}, {"review": "It's sturdy, and holds even a heavy mic in any desired position. I'm using it with a Samson Meteor USB mic (which required some adaptation due to the Meteor's short body), which is a heavy cast-metal mic. No stability problems whatsoever.", "id": 867}]