[{"review": "This thing sounds great! I run two outputs from this into my DAW (Reaper), so that I can have a direct DI for reamping and the regular tone from the Hartke's preamp for an overall bass tone. The general sound of it is warm with plenty of low end, and the \"Shape\" control is pretty cool for adding a little bit of distortion/break-up for layering. It's easy to reamp with, so layering the unshaped Hartke tone + another track of shaped \"gritty\" tone can get you some seriously solid sounding bass tones in a mix - especially for higher gain metal playing.Awesome unit for the price, very happy with it.", "id": 236}, {"review": "I'm a heavier fellow (5'11, 220) and some of the harder benches I've tried were a tad uncomfortable for long sessions. This one, on the other hand, is very comfortable and has plenty of padding and support. It folds up easily and looks to be very well made. 5 stars, no complaints, and much nicer than a lot of the more expensive options.", "id": 306}, {"review": "I've bought three of these now - this is an awesome, well made case that fits just about any superstrat guitar easily. The most recent was for something rather unique (a fanned fret, compound scale eight string) and that guitar also fit perfectly with plenty of room to spare.There are more expensive options out there, but for a non-fitted \"do it all\" case, this is the best bang for your buck hands down. I am comfortable using it to carry any of my guitars, from the inexpensive ones to the high end customs. Great case, great price.", "id": 324}, {"review": "I have a lot of high end instruments, and I live in New England so proper fretboard care is a must - especially with ebony and other woods that are prone to cracking and drying.This stuff is fantastic - MUCH better than lemon oil, dries a lot cleaner and doesn't leave any oily residue on the board at all. An hour after it's applied it sets up and doesn't get on your hands. I apply it on occasion with the strings on (I use Elixirs) and have never once had a problem.The best few bucks you'll spend on guitar care. 5 Stars.", "id": 344}, {"review": "Considering the price is so cheap on these, I took a chance on this about a year ago for my home hobbyist studio. To say that I used it \"rarely\" is an understatement - maybe once a month when I have friends over for jamming as a way to get my vDrums and a bass DI through my powered wedges. That said, within a year two of the channels stopped working altogether, and the main volume fader became scratchy and jumpy to the point that the volume all the way down would = the volume ALL the way up.Aside from it not working less than a year later, as others have mentioned the lack of a power button combined with the wall wart adapter is a bit of a pain as well. However, if you're building a studio on a budget and want to roll the dice, it's a decent little mixer while it works.Pass on this - sound quality is decent for the price, but reliability gets a zero.", "id": 369}, {"review": "Not much to say here - they're knobs. They look good, are well made and fit perfectly on the CTS pots in my guitar.", "id": 853}, {"review": "I have quite a few mic stands, and picked this up to use for micing a guitar cabinet. I love the low profile and the design of the feet - it's very sturdy, and all around better than the DR stands that I have which cost twice as much. It has plenty of weight to it and enough reach to easily reach all 4 speakers in my 4x12 without becoming &#34;tippy&#34;.5/5, though it would have been nice if it shipped with more than just the single cable clip.", "id": 77}, {"review": "This thing is useless. Good idea, but way too light/rickety to be useful. Unless you're constantly aware of it, 99% of the time you'll end up just kicking it over when you go to put your foot on it. Pass on this.", "id": 321}]