[{"review": "Good quality for the price, It's a mic on a stand. Plug it into an amp, computer sound card, karaoke machine, whatever, and belt out your favorite tune. Is this the most bestest sounding microphone on the planet? No, my friend. It is not. Sorry. But it is perfectly adequate for most purposes. The stand that comes with is light and I wouldn't subject it to too much abuse (don't invite Iggy Pop over, he's rough on mic stands) but it will do the job admirably if what you want is something to hold the mic while you wave your hands in the air like you don't care. And you're gonna do that, right?", "id": 422}, {"review": "You know, any time a company actually sticks a battery in the box with their product, it just puts a smile on my face. Planet Waves has not only made a great, small, easy to install and easy to use tuner, they included the battery. That's an A+ in my book.I've got a 12-string acoustic guitar. Pretty much every time I go to sit down and play, I would waste a good 5 minutes grabbing my old tuner, balancing it on my knee, and trying to tune up. With this head stock tuner sitting on the guitar, I just turn it on and quickly get in tune and down to the serious business of jamming. It truly makes the task many times easier. The display is easy to read. It's read when the string is way off and green when you're close, using lines on either side of the key/letter to indicate sharp or flat, or right smack dab in tune.If I had the money, I'd stick one of these on all my guitars. As it is, having it on my 12-string is going to save me hassle and time. This baby is worth every penny and I highly recommend it to any guitarist.", "id": 785}, {"review": "If you've read my review of the much cheaper Hohner Old Standby Harmonica, Key of C you know that I love the Special 20. It's great for beginners or experts alike. Sounds great right out of the box and plays well. I was able to bend notes right away with this one, while other cheaper harps take a long time (or never) to break in properly. All the notes/reeds sounded good. If you're serious about playing, you will be very happy to have this harmonica around. I've had many different kinds over the years and this one is my favorite.", "id": 828}, {"review": "These headphones are almost perfect. The sound is great, good balance between highs and lows. They are comfortable too as far as ear pads go. The only problem is the size. These are for people with big heads, or who wear headphones over a hat, or who are buying headphones for their pet grizzly bear. Maybe all the people at Tascam have really big heads. Mine is average, and these slide down because the headband is too large even at the smallest setting. So minus one star for that. Otherwise, sound quality is excellent. Comes with a 1/4 inch adapter, which is nice. Good price.", "id": 888}, {"review": "I normally get Elixir strings, but these sounded too good to pass up. They are indeed some high tech strings, with features including break resistance and improved tuning stability. Plus they feel and sound good. So grab a pack and get jamming. You'll definitely want to check these out.", "id": 897}, {"review": "I had a lot of questions and concerns when I ordered this. Well, it arrived today, I've been playing it for the past few hours, and here's the answers to those questions:1. Is it worth the money?Absolutely yes. This is an amazing bargain. There are better guitars out there, but not for $170. This really is a great deal.2. How does it sound?Fantastic. It's definitely \"bright\", which a few of the other reviews pointed out, but it also has new strings on it, so it might be a little too early to judge. That said, it's got a nice full sound and if you play up closer to the neck you get more bass in the mix.3. How's the action?Just right. Low enough that it's easy to play (for a 12 string) but no buzzing strings.4. How about the neck?Wider than a 6 string, but not much. Probably a centimeter or so wider. I have small hands and had no problem playing it. The main thing is the added pressure it takes to push down twice as many strings as normal.5. How does it play?Great.6. How does it look?Great. Nice natural finish, all shiny and new. What's not to love? (Note: the picture shows a more whitish finish, but it's a normal natural finish like you'd see on most acoustic guitars. Natural wood color.So if any of you guitarists have been thinking of buying an acoustic 12 string, take a look at this one for sure. I wish I'd bought it long ago. There are just some songs that need to be played on a 12 string.", "id": 153}, {"review": "A looper pedal has been on my list of things I'd like to get some day for a long long time. Why I waited so long to get one, I can't say. All I can say is how glad I am not only that I finally got one but that I got this one. It is fantastic. Here's why.First, ease of use. I really thought I'd be slowly working my way through a long manual, then slowly figuring out how to use the pedal. On the contrary, I got this out of the box, plugged it in, and was recording my first loops in a matter of minutes. The instructions a brief, clear, and walk you through the steps. This manual wins on brevity and clarity in the great manual wars. As I delved deeper into the options I was able to quickly figure out how to do everything I wanted to do.Second, user interface. It's a pedal. It's got knobs and buttons. This makes me very happy. It's well laid out and easy to get to all the settings. Once you've got it up and running, I strongly recommend setting it up so you can set a rhythm on a new loop by tapping the pedal. The work flow with this thing is just very logical and simple.Third, features. It has built in drum beats that are simple but sound better than just a metronome and help you get in the mood to jam out your loops. The beat is like a guide track, not recorded into the loop.Fourth, plays nice with computers. There's a usb port and you can connect this to the computer with a standard cable (not included) and copy your loops to the free downloadable loop library software. There you can make some basic adjustments to them and organize them.Fifth, comes with an AC adapter. It actually has to since it does not run on batteries, but still, I was happy to see it in the box.Sixth, you can add an SD card (not included) to expand the memory substantially.All of which gives you some specifics but misses the overall experience. The experience for me has been pure jamming joy. I hear a song in my head, and very quickly have the basic concept captured as a loop. You can plug your electric guitar or a mic into the input, so you can capture anything you want.For the price this is a wonderful piece of gear, and my only regret is not having bought one sooner. I'm having so much fun with it.", "id": 668}, {"review": "I just picked up a Pod HD500 and I love it. Of course a couple days later they announced the HD500x, but it doesn't look like they've made any major changes. Anyway, if you're thinking of getting one, here are my thoughts, in no particular order:*This thing is versatile. You can use it in a number of different ways. Just as an effects board with 8 customized effects, with effects and amp sims, as a midi controller, and as a recording interface, to name a few*Line 6 gave you access to the guts. Everything is tweakable, assignable, and flexible. They trust their users to read the freaking manual. I'm amazed at how much you can customize this thing to suit your needs. Want the foot pedal to control the feedback level on the delay? No problemo!*For live performance, this thing would be perfect. It allows you to organize your presets in \"Set Lists\" and name everything whatever you want. You can change between banks of patches easily and change between the patches themselves.*While not all the effects are my cup of tea (in particular, some of the distortions sound too harsh to my ear) there are enough options to make anyone happy. For example, I love the distortion I get from the tube compressor with the drive turned up.*The built in looper goes forward, backward, half speed, before effects, after effects. Fantastic!* It's built like a tank. Metal exterior, everything feels solid and like it will last longer than I willIf you've got the cash and need a solid array of effects for live performance, take a look at these and the new 500x version. Just buying a handful of the actual pedals this simulates (not to mention the amps) would cost you more money, assuming you could even find some of the vintage ones. Truly a great piece of gear!", "id": 700}]