[{"review": "Not too much to say, it's made out of foam, made to slip between the strings, made to hold two picks.  I have several of these, for acoustics and for electrics.  My son lost one before during a performance on stage so it is not that secure that it won't be dislodged, still, it does stay on majority of the time.  I do recommend this.  My son's guitar teacher calls this a \"fancy little pick holder\" and I've had people ask where to buy one when they see it for the first time.  One must also be careful, my son lost one of these so I know it is a possibility of it falling off.  He lost it after performing in a play on stage.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 29}, {"review": "Pretty flexible due to the 0.60mm thickness, I would recommend the Dunlop Max Grip picks over these picks.  The Max Grips have a much better grip.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 64}, {"review": "Heard good things about the Ernie Ball Slinky string set and decided to give it try on our son's Taylor GS Mini.  Replaced the worn out strings out of that guitar and he is back in business.  Honestly though, it is hard to really compare strings, these seem fine and currently I see no reason to try another brand.  In conclusion, I see no reason not to buy and install these again.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 86}, {"review": "Researched around for a highly recommended capo and the result is the Shubb.  This is a capo that while is not easily adjustable to slide up and down like other spring types, it's a great capo and very durable in construction and material.  Like a good guitar that is well cared for, this is something that's great to hand down to the next generation.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 121}, {"review": "I have a few Planet Waves products and I can safely recommend them.  This is no different, it works, I have no issues with the product, if you are looking for a peg winder,  or any accessory, I'd recommend you look at Planet Waves among your research in brands.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 161}, {"review": "Love the quick release system, I just hook on one end to the guitar and the other to a strap, perfect for use when you are standing and playing.  I can just quick release it when I'm done.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 174}, {"review": "The Hercules Travlite Guitar Stand is an average stand in my opinion.  It does hold up the acoustic guitar and it is very portable but I'd keep your guitar and stand out away and close to a corner, if you value your guitar.  Not a specific knock on the Hercules but most low and portable stands like this, are the same, they do keep the guitar up but a careless bump can knock it down.  You may be careful around it, but it's hard to say for others nearby.  For a cheap guitar, I wouldn't mind using this, but for a more expensive guitar, no thanks.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 417}, {"review": "Looking for a strap that is sturdy, comfortable, and simple in design, I use this strap along with and without the Planet Waves quick release system, perfect for use when I am standing and playing.  I have several, for our electrics and acoustics.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 658}, {"review": "I purchased several thicknesses for my son so he can test them all to determine which ones he liked best.  These 1.0 are not the ones he likes.  I would not get these again in this size.  A little too stiff.  The quality of the picks and grip are great and that is why I rated 4 stars.  The stiffness is just due to preference.Please click YES if my review have been helpful to you, it will encourage me to continue writing and updating my reviews, and leave a comment if you have any questions, I will be more than happy to answer if I can be of help.", "id": 680}]