[{"review": "this is a great stand for anyone looking to mic up their guitar amp, seems well built and rugged, although the mic clip is just a cheap plastic component you should immediately replace!", "id": 77}, {"review": "this mic gives a great range of recording purposes! Seems well built and rugged, the only complaint I have is that the face plate on the front fell off after only a month of light use, they must use a cheap adhesive for it, I had to clean both surfaces and give it a dab of gorilla glue to get the plate back on", "id": 82}, {"review": "definitely recommend these over any other string trees. I used both, one for DG and BE, required some minor drilling so I had a guitar tech do it for me just to be safe...", "id": 115}, {"review": "the knobs seem very easy to over tighten, I haven't done it yet but I'm planning on treating this stand with the utmost care so as not to have any surprises when I put my expensive PA speaker on it", "id": 329}, {"review": "This is a great way to easily add or remove a strap to your guitar. If you don't enjoy dealing with a strap getting in the way when sitting and playing but don't like putting a strap on and off or if you just want more peace of mind that your guitar won't slip out of the strap while you're playing then upgrade to this system!", "id": 386}, {"review": "I use this cable between my fender blues jr and a ditto x2 looper, it works great and the angled jack puts less stress on the cable and input jack", "id": 419}, {"review": "does a good job polishing my strat after playing, reasonably priced, definitely something to keep around if you play your guitar regularly!", "id": 437}, {"review": "looks and fits great on my start, nothing more I can ask for! my original neckplate was slightly bent in one corner before I replaced it with this one", "id": 475}, {"review": "gives a nice little boost on my blues jr, however this is not a replacement for an overdrive pedal in my opinion, just more of a boost. wish it had a grippy bottom made from rubber vs a smooth bottom made from plastic...", "id": 563}, {"review": "works great! pretty simply to swap out the old springs for the new ones, I'd say there was a slightly more smooth feel now when I use the whammy bar", "id": 676}, {"review": "replaced my old bridge assembly with this new one and it really brought the strat back to life in terms of looks and feel. also this was priced right in my opinion....", "id": 678}, {"review": "this tremolo arm needed to be bent outwards a bit in order for it screw down enough while still clearing the volume and tone controls, overall a pretty good purchase", "id": 558}, {"review": "my only complaint is that it doesn't seem as accurate as some traditional tuners, but that's probably by design so you aren't fiddling over fractions of a semitone when you're trying to tune your guitar between songs/sets", "id": 820}]