[{"review": "I very recently bought this guitar for my young daughter based on the previous reviews.  She's joined the jazz band at her school and since she is smaller than the average 12 year old, she needed a smaller sized guitar.  It was packaged very well and it took a while just to get the guitar out of the packaging.  The only thing I have found so far that sort of disappointed me was that there were some dark stain blemishes on the white pick guard. Trying to get the stains off with a damp paper towel didn't work so I took a special soft, damp sponge made to remove stains and gently rubbed it over the spots.  They came off but the finish on the plastic pick guard is dulled where I had rubbed the stains off.  That sort of irked me.  However, it didn't seem to bother my daughter nearly as much as it did me.Despite the blemish episode, it fits her perfectly.  I tried to tune it using a clamp-on Snark tuner.  That didn't work at all for some reason so we went to Guitar Center and bought an electric guitar tuner which you plug the cord into from the guitar.  That really worked well to tune the guitar.  The tuning pegs (gears) were stiff and a bit hard to turn.  When I change the strings I will adjust them to make them easier to turn.  The strings the guitar comes with are very cheap so I'll need to change those out soon for a much better set, but they'll have to do for now.I plugged the guitar to my old Crate amp and it sounded pretty good.  The knobs on the front of the guitar turn well an did what they are supposed to do.  It's easy to control the tone and volume from the guitar without having to dicker much with the amp.  My daughter had a great time getting used to it.  She's a great classical guitarist (I teach classical guitar) so playing an electric guitar was a new experience for her.  My old Strat is just too big and heavy for her and this black one looks good (despite the dullness that only I can see) on her and she was awesome playing jazz guitar in her school concert the other night.  Since this guitar is so inexpensive and is just right for a smaller person, I really can't find anything major wrong to say about it.  I'm glad I bought it, just wish it didn't come with the stains.  It feels solid, well-constructed, and not very heavy.  I like playing it too!I've ordered a really good gig bag, new cord, a Pignose amp just for her and of course, a bunch of new electric guitar strings.  She'll find the small stuff in her stocking this Christmas!  I can't wait for us to do some mother and daughter electric guitar duets!!", "id": 152}, {"review": "I play and teach classical guitar and needed a good digital recorder with which to record myself and my students and also be able to convert to mp3 format to upload to the internet.  I've recorded several solo pieces and it does pick up the guitar very well, including all string squeaks and fret buzzes (darn it).  So, it will force you to clean up your playing a bit.  If you are a musician and want a recorder that is very portable and relatively easy to use, then this little gadget is quite good.  It won't give you \"recording studio\" quality, but you can clearly hear the deep tones of a classical guitar and no hiss, or background noise (unless you have big-mouthed birds like I do) so you're recording is very clear.When I get ready to record, I set the gain as described in the manual, then set the recorder on my music stand and begin playing.  Since I bought the 4G card, I can play the piece as many times as I need too in a row without worrying about it running out of memory just as I finally play the piece to my specifications.  Also, if you connect the H2 to an electrical outlet and not rely on the batteries, that is one less worry.  Your H2 won't die during recording because the batteries give out.I can't really tell any difference in the recording quality with or without the wind sock that came with it.  It sounds the same.  I guess if I were a singer I would use it to screen out wind but a guitar doesn't really need it.  Yes, the screen is very small and difficult to read - I keep a magnifying glass handy, but now I've pretty much got the button pushing sequences memorized and don't need to use it as often to see the screen.  Also, download a free editing program such as \"Audacity\" so you can convert your recordings to various formats.I'd give it 5 stars if the case was a little more substantial.  It seems fragile and I dropped it once but luckily it bounced off my foot which had a big fuzzy house shoe on it so it didn't break.  But it might have if I had not broken it's fall.  And you will need a longer USB cord.  I can't believe the one they sent was so short.  But that is a very easy fix and overall this is one nice little tool.  And for the price, I'd buy it again!  :-}UPDATE 2.22.12I'm still using the H2 Zoom on almost a daily basis to record my students playing and my own playing.  I still love it, it works great and I feel I really purchased a great item.", "id": 463}, {"review": "I only have used this tuner on classical guitars (the ones with nylon strings).  I teach classical guitar and have had the opportunity to use it on many different classical guitars of varying quality.  It has tuned them all very well.  A great advantage I've found using this tuner (Tune Tech TT500) verses tuners which use a microphone, is that I can now talk with my students while tuning and no longer have to ask them to please be quiet while I tune their guitars.  Kids especially like to talk and now I can fully engage in conversation with them while tuning their guitars.  The only problem I've noticed, and thus only 4 stars, is that I usually have to begin tuning with any string other than the low E string.  For some reason, the tuner seems to have trouble sensing the low E vibrations and the needle will not move.  This problem has always resolved itself when I tune another string and then tune the low E.PROS:1.  Pitch is registered quickly with minimal needle fluctuations2.  Ambient noise does not disturb tuning sensor3.  Small and compact4.  Swivel head for ease of viewing the screen.5.  The screen is very bright and is also easily seen in direct sunlight.6.  Rubber feet on clamp will not scratch guitar7.  Clamp is strong and will open wide but easy to squeeze open with fingers.8.  Being a chromatic tuner means you are not stuck just tuning EADGBE.  It's tuning range is 12 note. A2 - B7.9.  Will automatically turn itself off after 3 minutes of non-use.CONS:1.  Delay on tuning low E string2.  Buttons rattle while tuning 2nd string, B.3.  Plastic on screen scratches easilyI don't yet know how long the button battery will last or how much battery replacements cost.  I will update this review when I have that information.  But for now, I am very pleased with this tuner.  I have owned many electronic tuners and this one so far beats them all.  I have also used it to tune my guitarlele and it tunes it darn near perfectly!  Great chromatic tuner at a great price - I love it!", "id": 635}, {"review": "There's really nothing I can add to what's already been said about this tuner.  I teach classical guitar and one of my students came in with this tuner.  I took a look at it and knew I had to have one too.  This tuner will tune chromatically, so you don't need to buy a special tuner for that.  I can use it on my guitar as well as my guitarlele which is tuned a 4th higher than the guitar.  I chose it over my other chromatic tuner the night my daughter was to play guitar in her school's talent show.  I needed to be able to tune her guitar accurately and quickly despite all the noise in the large room.  It performed fantastically!  (And so did she!!!)It's soft and rubbery feeling and won't scratch your guitar.  The reading are easy to read: red light you're flat, green - you're on pitch and yellow - you've gone sharp. It reads almost instantly.  My other chromatic clip-on tuner had some trouble with the D and low E strings but this tuner seems to give me a pitch quickly.I like this tuner a lot and highly recommend it.", "id": 706}, {"review": "I bought this Snark tuner for my daughter to use to tuner her classical guitar and her guitarlele.  I've been using a blue Snark tuner for a couple of years and have loved it.  I thought she needed a Snark of her own and it works like a charm.  I like the chromatic aspect of it because you can tune your strings to any pitch other than concert pitch.  Sometimes we like to go lower, and sometime a whole or half-step higher.It's beautiful to look at, clips on the head of the instrument with soft rubber feet, and truly does an excellent job of tuning.  I teach classical guitar and have found this tuner to be one I go to the most, and I have a lot of different tuners.  I rarely use any of my other tuners anymore, relying mostly on the Snarks that I have.  It uses a CR2032 button battery which is inexpensive and lasts a long time.  I use my Snark at least 4 times a day either tuning my instruments or my students.  What I really love about these types of tuners is that you can talk while tuning since it feels the vibrations of the string instead of listening to it.  It will tune practically anywhere  - loud rooms, etc...and tune accurately.", "id": 707}, {"review": "I bought my Yamaha guitarlele about 2 years ago from Long & McQuade located in Canada.  It's the same as the one Amazon is selling here.  I teach classical guitar but have always loved the sound of ukulele.  My reason for buying this is because I don't have to learn how to play the ukulele and can play the guitarlele using the knowledge I already have - yea!It is very similar to a guitar in many important ways.  It has the same 6 strings tuned the same way.  However, and this is VERY important so please read carefully:  To get the best sound out of your new guitarlele you must tune each string up in pitch.  For example, let's take the 6th string (lowest) and tune it up to A instead of E.  Clip on your electronic guitar tuner and crank that string up a bit until the tuner reads \"A\".  It will be the same pitch as the actual 5th string on the guitar.So here's the breakdown on tuning each string:6th = A5th = D4th = G3rd = C2nd = E1st = AYou really need to to tune it this way because otherwise the strings are too floppy and you won't get that beautiful ukulele voice.  The action is very good and it will not be any harder to play.The instrument overall is fairly easy to play, especially in the lower positions.  I have trouble holding it because I'm used to holding a classical guitar so I always have to make adjustments to get used to it.  Barring chords especially higher up the neck is kind of tough because the frets are so close together so I usually play easier stuff.  Also, I have discovered that certain types of music really play well and others aren't so good.  Almost all Celtic music sounds great!  Christmas carols are lovely, but Spanish stuff doesn't sound so great, imho.  The instrument just doesn't have enough power to carry some types of music.  Blues are good, and very ancient sounding tunes like those that would have been played on a 4 course guitar from back around the 15th century sound really cool on the guitarlele.  It seems to be well constructed, the tuning gears work well, the action is good, frets are inserted straight and level so I really can't find anything to complain about, especially for the price.I would suggest keeping the tunes simple and have fun!  It's just like a little guitar with all the same strings and same number of frets. You will probably have to tie a strap on it to hold it in place but that's not absolutely necessary, especially for those of you who are accustomed to playing small stringed instruments.I took it camping over the summer and had a great time playing it around the campfire in the evenings, something I've always wanted to do!  I'm quite fond of my guitarlele and am going to purchase another for my daughter so that we can play duets together on them!  :DUPDATE 4.10.13-------------------------------------------------------------------------I bought another guitarlele (this time from Amazon) and it is exactly like the one I purchased a few years ago.  This one is for my daughter and she is having a delightful time playing it.  We've been playing guitarlele duets together and they sound great and is such a fun thing to do!", "id": 747}, {"review": "This will work with my daughter's iPod Touch generation 4.  However, the \"Garage Band\" app is for iOS 7, and hers is an iOS 6.1 and will not update to 7.  So, though she can't use Garage Band, there are others that are supposed to work.  She downloaded the Ampkit app and it works great with her iPod and the Apogee Jam.Here is a list of other apps that are supposed to work with the Apogee Jam:AmpkitAmpliTube (version 2.5 or greater)Amps & CabsAnytuneApple GarageBandAudio Deck ProfessionalBias iProRecorderEveryDay LooperFairlight SamplerFantastocrats StudioMiniGibson's L&M;Hindenburg Field RecorderiAnalyzeriMovieiRecorder ProiShred LiveJamUpLoopyMcDSP Retro RecorderMultitrack DAWNano Studio (TRG-16 pad sampling)PocketAmpPocketGKReap DFXRiot FXRock Prodigy: GuitarScratchTonesSonoma FourTrackSonoma GuitarToneStudio Devil Guitar AmpTaylor EQVocaLive (version 1.5 or greater)Voice MemosXewton Music Studio 2.0It's a pretty cool idea, but the cords are a nuisance.  Most electric guitar players like to stand while playing, and the cords need some managing to keep them out of the way and not have them pull out of their connections.  I was surprised at how small the JAM is.....slightly bigger than a Bic cigarette lighter.  Using this is much more convenient than lugging an amp around, and it saves on other's ears and nerves if they can only hear the acoustic playing of the guitar strings, especially if you are beginner guitarist!Overall pretty good, and very simple to operate.  Just make sure you have a full charge on the device of your choice.  My daughter also used it to record her playing and said that was easy to do.", "id": 895}, {"review": "This is your basic, black electric guitar cable but it works great.  So far the connections at both ends are solid and the sound from the amp is great!  Nice and rubbery and 10 feet is long enough.  If problems arise later with this cable, I will update this review, but as of now there has been no problems whatsoever with this cable.", "id": 6}]