[{"review": "Folks, I've tried them all from Dean Markley to Ernie Ball.  All have their good and bad points.  But after 22 years of guitar playing, D'Addario still makes the best electric guitar strings for my money.  Although I prefer the super light top, regular bottom version, I have always loved the feel, tone and durability of D'Addario strings.", "id": 156}, {"review": "I've been playing guitar and using capos for 23 years.  I've learned this...if you are a serious guitar player there are many \"must-have\" items you need in your arsenal.  One of them is a capo.  By clamping one on a guitar you can raise the pitch and key of the entire guitar relative to the tuning it is in.  Essentially you are changing the scale length of the entire instrument when using this device.  They are quite common, inexpensive and the basic design really hasn't changed in many years...until now.That's where this product comes in.  This capo is great because it doesn't simply rely on a loaded spring to clamp down.  It has an ingenious but simple tension adjustment knob.  The reason this matters is because, depending on the guitar, sometimes a traditional loaded spring capo imparts too much spring tension (or not enough) when clamped.  Too much clamp pressure can result in squeezing the strings out of pitch.  Not enough pressure can result in annoying buzz and dead notes.  Either one is not good.  This new capo eliminates that in an efficient, effective and economical manner.  I highly recommend.", "id": 843}, {"review": "I've been using D' Addario strings for 20+ years to great satisfaction.  These flex steels are excellent.  Bass tones, response and resonance are superior to my ear.  You can't go wrong with these guys.", "id": 896}, {"review": "I have used D' Addario electric guitar strings for years and have always loved their feel, playability, tone and reliability.  This set is no exception.  Light gauge for those who like to shred a little more but still great tone.  Highly recommend anything by D' Addario.", "id": 897}, {"review": "I'm a D'Addario man myself, but hey free is free.  So I jumped at a chance to try these strings out.  Thus far they have proven durable both in terms of playability and longevity of tone.  So many other variables to consider when rating strings such as the guitar they go on, the gauge of string being used, the playing style and climate of the end user, etc.  These are a solid performing string set, though I am unlikely to switch allegiances from D'Addario any time soon.  Still there is no reason to fear trying these Elixir's out.", "id": 899}]