[{"review": "Got this cable to run a rockband keyboard controller to my M-audio profire 2626 to control midi in Pro Tools. Works great! Firm fit, solidly molded ends, reputable branded cable.(a bit on the thin side, but i haven't seen to have any issue due to this or anything. Couldn't go wrong for $5 at the time of my purchase and prime eligibility.", "id": 4}, {"review": "I've been swapping back and forth between Evans and Remo for a while, but after really liking the emad kick head I decided to lean more toward Evans just for consistency in my setup.I consulted with an online forum to find which would be the closest 'compatible' drumhead to what I really liked from Remo on the Evans line, and I was led to the G2 series. (from Remo's Emperor series-- both being 2 plies of 7mm free floating film)Honestly, I think I'm going to stick with Evans from now on though!I ordered my pack shortly after the announcement of the 'level 360' sizing, and I wanted to give them a try. My fears of getting some old stock were unfounded and the set that I got was new enough to be L360 sized.I got them on, and the tuning seemed to be pretty easy. I use a drum dial to ballpark me and start my tuning process, but it went smoothly. Not sure if it was the placebo effect, but I seemed to be able to get a little more low range on my floor tom as well-- deeper but just as resonant as an 808 kick.The coating seems to hold up better on the Evans heads as well-- Remo tends to 'flatten out' within a few hours of play, where the Evans not only lasts longer, but has a more finished feel to them.", "id": 395}, {"review": "I've got two other Levy's cotton straps that I picked up at local brick and mortar stores and they're fantastic! I picked one up on Amazon and I was unaware that there was an 'extended length' version and that it was what I had bought before. I suppose it's just easier for theNo big deal though, just an observation worth noting because if  you just picked one of these up based on prior purchases (and you're a big guy like me and/or you play with the guitar/bass around your knees) you may not be getting what you thought.In any case, these are very comfortable (soft edge), they stick on you (as opposed to some other materials which may tend to slide down), and they last.", "id": 479}, {"review": "I've been playing guitar for over 10 years and decided to take up ukulele as an extra little hobby.This one is pretty decent, especially at the price point. Not exactly the pinnacle of quality, but good enough to learn on and it comes with a case and a booklet with some basic songs and a chord chart. It doesn't seem to drop tuning enough to be too bad of a nuisance, but if I haven't picked it up for a few days it does need some tweaking.", "id": 536}, {"review": "remember those little sticky gummi hand things that you used to get out of the quarter machine at the grocery store?Sticky Hands - 12 per unitThese are kinda like that, but a little thicker and shaped into blue rectangles that are approximately 1\" x 2\".you can stick them to any part of your drum head to dampen sound as needed. They even work on cymbals if you're looking for a quicker decay!The closer to the center (or more pads you use), the more dramatic the effect. You can also cut them to get more pieces out of them if needed. If you drop them or they end up getting too dirty to stick to anything, you can wash them in the sink with dish soap and air dry them.I've been using them for years and they work amazingly!", "id": 892}]