[{"review": "This is my third pack; the 1st pack has been using for two months, the sounds are rich and full, and the feels are still good.  I broke the high E on the 1st attempt of restringing, and luckily I had bought 2 packs at the same time.  So, I want to keep a completed pack for back up.  I have been fingerpacking for quite long time recently, sometime, i will practice for 4-5 hours+ until i'm tired for the session.  I have used light steel strings on my acoustic, but these ones are easier for fingers even just tiny lighter.", "id": 28}, {"review": "I have tried few picks, textured, mallow color, and this bright green.  I like it bright color that is very easy to found, and 0.88mm seems right for me to strumming on an acoustic guitar.", "id": 61}, {"review": "I brought this set beasue one of the strings broke on the kid size guitar, and I also wanted to have backup strings.  I haven't tried many different strings.  I have used the strings (D'addario EXP) that came with on my Takamine GS330S, and it's been good for year+. IIf the strings break, I will try this one GS330S as well.  Over all, I think D'addario is great for warm balance tones. After the strings were set and \"stretch\" for few days playing, it stays in tune.  The strings were set for more than 6 months, they still are playable, and the sounds are okay on kid size guitar.  I don't think there will be any problem if the strings are on my GS330S.  I'm happy with the purchase and the quality of the strings.", "id": 198}, {"review": "I have it for more than 6 months and mostly use it for practicing with the metronome.  I have another tuner, which is set EADGBE, that is much easy to tune without any confusion. Although this tuner has flexibility for tuning differently, it's confusing for me because it keeps changing the chord and going left & right +/-20 or more.  However, it's a bonus for using the tuner, and I don't have to bring all to the classes.  For the metronome, which is my initial purpose to purchase it, it's great and have enough adjustable calibration, 13 beats, rhythms, and tempos for practices.", "id": 298}, {"review": "Brough this for trying \"electric\" feels on the acoustic guitar, and don't want to waste too much money on electric acoustic (preamp) guitar or big amp if I don't like the \"eFeels\". After researching awhile and reading tons of good reveiws of it, I decided to give it a try.  I didn't expect too much on $20 amp, but surprisingly, it positively gives me more than I ask for.  I also brough it with the adaptor, which is great to save $$ for long runs, and I don't have to worry about the battery for home practices.  It is adorable out of the box; it looks like a lovely toy, but it works professionally based on its 10w amp.  I don't care much about the manufactor's suggested modes, basically, I just fool around with the three button controls to whatever sounds I like in different songs on guitar / uke.  I like the small size that won't take too much space on my tiny room, it's cute to look at, and it is practical too!I had the high frequence of feedback as one of the reviwers when I used a poor pickup; however, when I changed to another one, I can turn the volume as high as I want with the same direction and setup as the previous poor pickup.  I almost thought that was an issue from the amp, luckily, I have two different pickups to try it deeply.  After using the better pickup, the amp doesn't have any issue yet.  I have used for few times, so I don't know about its longevity yet!One more thing about the headphone mode that is not completely silent because the guitar's sound itself won't be muted, but the headphone does mute the effected sounds from the amp; anyway, it's a great feature to have.", "id": 303}, {"review": "very smart & handy design that my acoustic guitar doesn't have to be drilled a hole for.  it's very easy to buckle the guitar strap on the neck & its botton button of the guitar, that is!", "id": 568}, {"review": "I have been using Olympus VN-7100 for recording piano and singing sessions, and I want to upgrade it to DR-O7MKII for stereo and connecting to computer. It has more features for me to learn new songs rather than recording tasks. Used it few times to record piano and singing recitals and practices.  The sounds is amazing, and it is much better than VN-7100, and the price is worth to spend.  I haven't fully utilized it yet and didn't have time to study the menu completely, so I just checked the menu whatever I need at this stage.  So far, I am happy for what I got the recording quality from this guy.The build is light, which is good, but its plastic material is kinda cheap as most reviewer commented, and the size is bulky, and I think it can be shorten as DR-40, too bad I don't need 4 channels yet even though I can use it for guitar practices and session.  Ended up I picked DR-07MKII for slightly less $$ ...Bought it for my x'mas gift and got a promotion of $15 rebate at that time. I mailed whatever is needed for the rebate to the vendor for almost 3 weeks, but I still haven't gotten any notice from the vendor.  Besides that, the vendor requests to cut the bar code label from the original box with a filled form for the rebate, which make me dislike.  If they don't rebate to me, and I can't return it neither since the original was cut & trashed!  feel like it's a tricky rebate ...", "id": 755}, {"review": "DOWNGRADE TO 1-O STAR AFTER RETURNING IT BACK TO BROOKMAYS, THE SELLER:I am really disappointed by the seller, BrookMays', ignorant responses to my return of the defective Cherbub Guitar Pickup, which picks up unwanted noise by the wire's own movements and the high frequency of feedback that other pickup won't have the same issue.  After two weeks of the returned item was delivered, I didn't hear anything from the seller regarding the return, so I emailed to the seller to see if we can settle it asap.  Too bad, four days after the email had been sent, I only got the email of telling me the case# of the message I sent without any further response to my refund.  until my patience is gone to deal with this hassle, and I don't think it's worth to waste more time on it, despite the fact of wasting the time and money I spent on this useless pickup and the shipping costs. Therefore, yesterday, I emailed my last contact to the seller regarding the refund of the purchase and gonna report this to AMAZON about the bad after-sale service I ever have before if I still haven't heard from the seller shorty.Today, I finally received the seller's response to my refund, the seller denies the issues of the pickup and claims, \"it was not defective. All pickups are going to get unwanted noise if you move the guitar. The feedback can be to to many other issues. I have issued the refund of $7.04.\"  Obviously, the reply is unconvincing; although the feedback can be raised from varies issues, i have tried with another pickup to the same directions and setups, but it doesn't have such problems at all.  The fact is NOT ALL pickups get UNWANTED noise although I didn't try many pickups.  Cherub Guitar Pickup doesn't work as the product description to pickup the original tones of the instrument regardless the surrounding noises.  Moreover, the unwanted loud noise from its wire movements is really annoying, and there's no way to stop the wire movements while strumming. Indeed, I won't use it, and I don't want it to sit at my house as a useless property, so returning back to the seller may help to improve the issues it has.  However, the hassles I got from the seller is totally unexpected and it's NOT worth at all.By the way, I'm also unhappy about the refund of &7.04, I bought it for $8.79 along with AMAZON Free Shipping of the purchase of $25 or more.  To me, it is not the money of $1.75, but it's not fair to the buyer, who doesn't get the right service and quality from the purchase but only wastes the times and money on this matter. So if you really need a pickup for your instrument, I highly recommend you to spend few more dollars to get a much better and reliable one. Don't make the same mistake as I did to try this one because of the cheap price, in turn, you may get more hassles than you expect on such cheap merchandise.  I don't want that happens to anyone else, so I decided to tell you what I went through to keep you from the possible hassles before betting on it.2 STARS FOR THE 1ST REVIEW AFTER USING IT TWICE:I like the clip-on design, which is easy to use, so it is worth 2 stars; however, it doesn't work well clipping on small soundholed string instruments like ukes and kid size guitars because it touches the strings.  Besides that, it also picks up loudly through the wire's own movements, not as the description \"regardless the surrounding noises.\"  I have distressed from those unwanted loud noises.  One more thing that it somehow produces much higher feedback to the mini amp that I use, and I have to turn the volume as low as possible to prevent the high frequency of feedback. However, when I switch to another pickup with the same setup on mini amp and acoustic guitars or uke. the amp doesn't have any feedback even turning it to almost the highest volume, and the other pickup doesn't have the unwanted noise from its own movement either.  I don't know whether is my lack of luck or the poor pickup I got ... I bought it because its cheap price (less than $9) & clip-on design, but, I can't accept the noises and I have to waste my shipping cost to return it back to the seller. So, if you want to give it a try, you may bear in mind that the seller, BrookMays, doesn't take any responsibility for the shipments even the item doesn't work properly as claimed description. Good Luck then!", "id": 759}, {"review": "Like this camo capo's simplicity and its unique color.  My friend got a new one after seeing me using it, but his is a bit shorter than mine.  Mine works both uke & acoustic guitar, I have no problem to use it on single hand.  As the manufactor suggests for its duration, I don't clip it on the guitar when it's not in use. :)", "id": 25}, {"review": "Bought it for using Danelectro mini amp, so I don't need to worry about the battery.  It works perfectly as an adaptor should be, & you won't have any surprise by its performance. :)  two stars out because of comparing the price with the mini amp (less than $20), the adaptor is pricy ($8.50), but it still saves me $$ for the long runs.", "id": 40}, {"review": "Got it right b4 x'mas, thanks Amazon!It is one of the best value I have purchased.  Suction design is great for any size of string instruments, uke, small soundholded guitars, or acoustic guitars. Thanks for the previous viewers' tip to moisture the suction b4 pressuring on the surface of the guitar that next to the bridge.  It stays great and pickups perfectly without any unwanted noise from the pickup wire itself (recently have bought another one does).  great value and quality for $11 i spent ever.", "id": 610}]