[{"review": "I really didn't expect this guitar strap to be anything more than what it is. It's tight knit nylon with leather to attach to the strap posts, It's not a super fancy top of the line guitar strap, but it serves it's purpose well. feels sturdy enough and it's adjustable for a man of any size. I ordered it on the 20th and received it on the 23rd, no complaints here. If you are like me and do not feel that it is necessary to spend 20$ or 30$ on a guitar strap then this would suit you just fine, for 6$ you can't beat it. buy one or 2 nothing to lose here", "id": 74}, {"review": "D'Addario Are The Best Strings That I Have Tried, I Used To Use Ernie Ball Super Slinky's But Found That These Last Longer, The Ernie's Bend and Play Well But They Tend To  Go Dull Faster Not To Mention The Ernie's Start Corroding Within A Week, These D'Addario Strings Stay Brighter Longer, I Usually Change Them About Every 4 Weeks, The Ernie's Only Last Me A Week, 2 Weeks At The Most, That Can Get Expensive Fast, All Around The D'Addario Strings Are The Strings 4 Me, Retraction, when I originally wrote this review I thought they were the best, Turns out they are in fact way better than Ernie Ball Strings, but they are no longer my preference, A friend of mine told me about DR strings and they are much better than these D'Addarios. DR's last three times as long as D'Addario. the DR's cost a lil more but they are way better, for the money Addarios are good but I would recommend spending a few dollars more for DR strings", "id": 156}, {"review": "The Product Itself Is Good, Shined My Guitar Up Nicely, The Cloth I Received Was A Black Microfiber Cloth With The Ernie Ball Logo, I Must Say That The Cloth Is Very Nice, It's Soft And Lint Free, So The Cloth Alone Was Worth Purchasing This Polish, After The Polish Is Gone I Will Probably Try Another Product, I Need Something That Will Conceal The Fine Scratches On My Guitar Finish, Probably Like A Guitar Wax, But All In All This Product Seems Good For Wiping Down The Guitar After Playing, Keeps The Instrument Nice And Shiny. It Removes Smudges And Fingerprints Quite Nicely, Not A Bad Product, It Arrived Within A Couple Of Days, I Am Satisfied With This Purchase", "id": 194}, {"review": "these strings are great if you need practice changing your strings. these strings last 2 days and then they are dull and lifeless and need to be changed, the high e and the b string tend to break before they even get tuned to pitch, Ernie Ball strings are garbage, the only time I will buy these is if it's the only thing available, most people like these because they are endorsed by so many musicians that are paid to say that they like this garbage, and even if they do like them they are not your average players that need more than 2 days out of a set of strings, Touring musicians have the guitar tech change the strings after they play their set, and they get an unlimited amount of these crap strings so their guitars always sound fresh,  you can spend 4$ for a set of Ernie Ball or D'Addario every 2 days or you can spend $7 for a set of DR strings and change them once a month, or you can spend 10$ for a set of Elixir Polywebs and change your strings once every 3 months,  It doesn't make sense to use these crappy Ernie's unless you are sponsored by EB and have an endless supply and a tech to change them for you like the rockstars,", "id": 226}, {"review": "If your electric guitar is noisy and crackly then you need this tape to shield it, even with humbuckers my guitar was picking up noise, interference , I installed this copper tape and the only sound comin from my guitar is sweet sweet music, no more hum, noise, crackling etc. overall this was an excellent buy", "id": 694}, {"review": "just received the cable, it sounds clear, doesn't feel like it is made of the best materials, I just got this cable today so I can't really comment on how durable it is and how long it will last, so far I tend to believe it is a decent cable for the price, I don't use a microphone very often so this cable should last a while. so far it is working well, I would buy another one if I needed it, the price is right,", "id": 602}]