[{"review": "Ok, so I just installed these things for my KRK 6's (no stands...just sitting on two other speakers).  What can I say?  The bass, which previously had disappeared in my studio, is now present again!  My monitors sounded kinda thin before because I was losing so much energy to my desk, but these things have made a ton of difference!  My stereo image even feels wider now!Sure, they're a little pricy, but hey...THEY WORK!  If that's what they want to charge for them, and people continue to buy them, I'm cool with that!  I'm happy with the reults my $40 got me!5/5!", "id": 57}, {"review": "Ok here's the deal...I'm just a small home studio type of guy, and honestly I wasn't expecting much when I shelled out the $120 for this mic.  I have just always seen it around and I thought it would be a solid choice for my first multi-pattern mic!  The first time I recorded with it, I had it on omni mode and played some acoustic....it sounded amazing!  I can't believe this mic is that good.  Crisp, clean sound (who cares if it's made in China like that one guy says?), and very flexible usage.  I've since used it on toms, acoustic, a room mic for amps, and even some background vocals, and it has shined every time!So if you're like me and looking for a low-price LDC with multiple patterns, GET THIS.  You won't be disappointed at all!  :)", "id": 82}, {"review": "The title says it all.  There is literally no better deal on the net for the quality you receive!  I've been using my cables very happily for 2 months now with no problems!  If you're looking for some good TRS cables....look no further!!", "id": 440}, {"review": "What can I say....for the price, this is the best tuner out there right now!  So nice not having to step on a tuning pedal in order to tune while I'm gigging onstage.  I just cut the volume on my guitar (Snark senses vibrations through the neck...so no sound needed!) and I'm done!Tap tempo works great too if you need to know the tempo of a song!  Just another awesome bonus :)", "id": 706}, {"review": "I've had it for about a month now and it hasn't fallen apart so I guess that's a plus, but the main issue with this rackmount is that whatever automated machine they used to drill the screw holes is definitely defective, as a large majority of the holes are slightly deformed and will not take in the provided screws and are therefore USELESS.  Thanks to this problem I am only able to use TWO slots out of TWELVE.  It's definitely very frustrating and although the price is tempting, stay away from this.", "id": 322}]