[{"review": "I have found this throne to be comfortable for studio use and it seems to be solid enough for everyday use.  It is sturdy and heavy enough for the average player and the price is definitely right.  The padding is just about right and feels good and comfortable for the session times for which I have used it.  I don't know how it would hold up for touring or constant use, but it is perfect for my needs, as I am a guitarist who plays drums for demos in the studio.", "id": 139}, {"review": "I bought this recorder to capture live audience audio for a live video project.  I can say that it worked amazingly well for this and did an excellent job at recording the bands without any distortion or excessive noise.  The recorder stores two files at the same time, one being a file at your chosen sensitivity and another safety track at a lower level in case there are any clipping issues with your main recording.  This accounts for quick transients or anything that might cause the recorder to overload and ensures that you will get a good take.The microphones can be folded out to extend the stereo field or in to tighten the field.  In addition, you can use external microphones or XLR inputs for professional-level input from the soundboard.  I found that the internal microphones did a wonderful job of reproducing the audience experience and I can't say enough good things about the performance.  This is an absolutely wonderful recorder.Bottom line: Highly recommended", "id": 800}, {"review": "This unit is compact enough to take with you if you need a small interface to take along with your laptop for field recording.  It is powered via the USB bus, so you don't have to carry power supplies, or worry about finding an outlet for the device.One issue is that this is not a plug-and-play device.  You will need to install a device driver in order for your computer to recognize it.  After the driver was installed, I was able to get Pro Tools to recognize it right away without any issue.  I recorded some tracks just to see how easy it was to work with and how it sounded.  It works like any other interface in Pro Tools, so you will be able to use it easily enough.  The mic pre-amps don't seem terribly powerful and you will have to really up the input level to get anything out of a 48v condenser microphone like the ones I use to record vocals and guitars.  I found that the overall sound quality was okay, but just okay. I wouldn't want to use this for anything important, but it will work fine if you are doing a field recording of rehearsals, or doing pre-production in a practice space.  I wouldn't recommend it for serious studio work though and I would rather drag my Pro Tools I/O rack to a location if I was in the field.The build quality is a bit suspect on this as well.  I noticed that the unit made a clinking noise when I picked it up after taking it out of the box.  It seems that the bottom panel is not secure and is a bit loose.  I can move the top and bottom together and apart, making a clinking sound.  This can, of course, be taken care of very easily, but I would rather have a device come as it should.  I have never had a problem with a TASCAM unit before and I have had a ton over the years, so I hope this is just a one-off quality control issue.  The knobs feel okay, but there is a bit of play in the line out control and one of the attenuators is sticky.Bottom line: 3/5 starsRecommended for casual use, but not for commercial use", "id": 874}, {"review": "These headphones really seem to be built pretty well, so it is with some regret that I have to report that I don't like them.The sound reproduction is not flat, and it has a distinct bass heaviness that I can't use when recording or mixing.  In addition to the bass-heavy delivery, there seems to be a dip in the upper mids, a boost in the low mids, and a rolling off of the high end.  This just doesn't work for me in the studio.  The overall size of the headphones is large and they won't fit well for people with smaller heads.  I had some people try them on and they all stated that the earpieces went down too far and didn't fit on their ears properly.  I checked to make sure that they were retracted to their smallest size and they were.This is a shame, as TASCAM make some fine products and are a good name.  I have owned four DA-88 recorders, many field recorders, and three different portable recorders from them, all of which have been great. I am certainly not saying anything bad about the company, but their headphones are just put out there to be low-priced headphones that are not suited to a professional studio.I have used theSony MDR7506 Professional Large Diaphragm Headphone [Electronics] for decades now and I still recommend them.  I have had the same pairs for over 20 years and they are all still going strong, barring replacing the ear padding.  The Sony headphones do not cost a tremendous amount more, and they are worth every penny if you are doing studio work.I would also recommend theAKG K 240 MK II Stereo Studio HeadphonesorAKG K 240 Semi-Open Studio Headphonesover the TASCAM reviewed here.  The AKG perform much better when you are using a headphone amplifier though, so that would need to be taken into account.", "id": 888}, {"review": "These strings are really quite good, but I wouldn't call them perfect.  The unwound strings are not quite as bright as I am accustomed to, but they still ring nicely.  This is the only complaint I have about these strings.  If the unwound strings were a tiny bit brighter, these would be 5-star strings.  As it stands, I give them 4.5 stars... not a big knock, actually.The low-end on the wound strings is very nice and quite warm.  I put these on a jumbo and it definitely accentuates the &#34;jumbo&#34; aspect of my acoustic.  The sound is very big, full, and nice.Definitely a recommended product!4.5/5 stars", "id": 899}, {"review": "I bought eleven of these in order to hang a bunch of my guitars and I found them to be extremely simple and quick to install.  The included anchors work perfectly and went in without issue, leaving the String Swing solidly connected to the wall.If you are hanging a lot of guitars, making two rows (one high and one low) seems to be the best option.  I spaced the hangers eighteen inches apart and the guitars I put up look nice and have a good, tight spacing.  I uploaded two pictures of my wall after I had installed nine of the hangers and I couldn't be more pleased with the look... the pictures are uploaded on this product page.  I have put up the other two hangers since I uploaded the pictures, so I will have to do new pictures, but the ones that I put up will give you a good representation of the look you will get with these.The easiest way to hang a lot of these is to use a laser level such as theBlack & Decker BDL100AV All-In-One SureGrip Laser Leveland a long cloth tape measure that you can tack to the wall.  I just went down the wall making dots directly on the line, drilled quick pilot holes and nine of the string swings were installed in about 20 - 30 minutes.  I think that this is the quickest and easiest way to get a professional-looking installation.As far as the performance of the hangers goes, what is there to say?  The included anchors are big enough to keep the wooden backplate securely fastened to the wall and the hanger screws into a metal receptacle in the middle of it.  As long as you make sure that you tighten the hanger properly, you will be in good shape.I DO NOT, however, recommend buying theString Swing Home and Studio Wall Bumper Brown, as they are complete garbage and fall off the wall almost immediately.EDIT: I put the other hangers up now and did NOT drill pilot holes.  The anchors are made in such a way as to be nailed into the wall without using a pilot hole.  Just mark the positions, use a hammer to nail the anchors up to the screw portion, then screw them in.  It took about 1 minute to put a new hanger up, but this was partially due to the fact that I was able to use a level and put it against the bottom of the other hangers to get the line.  At any rate, you do not need to drill pilot holes; just nail and go!", "id": 166}]