[{"review": "these cables are nicely constructed. i bought them for home use only. home recording or just practicing.they seem to work well so far. i wouldnt gig with these on a regular basis, but for home use, with littleabuse, they should last.", "id": 168}, {"review": "yes you can tweak it so its less, but cant even use it for recording with or without an amp so much hiss its unusable.", "id": 182}, {"review": "bought this for a modest step up in vocal tracks for home recording on my 24 bit neo 2488.Ive been using the mxl990. mic would be great for the price if it wasnt defective. used it forabout 30 minutes before crackling and static started. had to go back to the 990 until all of thereturn and warranty is taken care of. i still recommend the mic though. it is hotter than the 990in its highs, but with good compression, power amp and eq the result is well worth the money.", "id": 371}, {"review": "run this into my laptop from a behringer 1202fx mixer. windows 7 didnt need to install any drivers,it was plug n play. reaper picks it up immediately, just arm the track, set level and record. I will offer thistid bit of information because i had the problem where very little signal from the mixer and uca 222 into reaperhad the track peaking out and distorting. I found that others had the same issue. I had to right click on the volumespeaker in the bottom right on the task bar of my computer, click \"recording devices\", select my uca222 (not internal microphone) from the list,click \"properties\" at the bottom of the Sound window, select the \"levels\" tab and reduce the level to around 2 or 3 to have an equal volume from themixer into windows 7 and Reaper. Until i did that, every signal into Reaper was too hot and would distort even if the mixer output was set to next to nothing.I tried everything in reaper to resolve the issue until i finally did a search for others having the same problem.So far the behringer uca 222 is working great. and signal is clean.", "id": 597}, {"review": "the product is great. a lot of nice features. i am running it through a little Cube amp to practice withand it is not the kind of amp you want to use. best results are going to be with an amp that allows you toloop through another available channel and bypass any effects you have on the amp like distortion. if you havethe amp overdriven, then the loop comes out that way too, and the byproduct of that as well on a smaller less capableamp is noise cancellation.Trying to solo over a rhythm part for instance cancels out the signal being sent from the pedal through the speakerand clobbers what you're trying to play over.Great pedal, but have a good amp with multiple inputs to put it through.", "id": 668}, {"review": "works as described on the ipad. for the price id expect a more durable product.its all plastic, but no moving parts to concern yourself with so it should hold up fairly well.", "id": 710}, {"review": "use them for home recording,  nothing on the road. for that purpose these are made well. wouldnt use these regularly for gigging wear and tear would break them down pretty quickly.", "id": 578}]