[{"review": "Some people are not comfortable using the drywall anchors that are included with this hanger. If the drywall anchors are installed correctly you will have no worries about it pulling out of the drywall. I have used these drywall anchors for 10 years now to hang heavy wood blinds which are raised and lowered daily without anchor failure. Concrete block homes exterior walls have no studs to anchor this hanger. The only options are the drywall anchors. They are good to go.", "id": 166}, {"review": "No Doubt.... It's not a really exceptional guitar but for the money you get more than you should. First impression of the guitar was terrible. I took it out of the box and started to play. The neck had a huge bow in it. The truss rod was completely loose. I had to adjust the truss rod to make the guitar playable. I'm not sure if it was just my guitar that wasn't set up or if that's the way they come. If they come with a loose truss rod then this guitar is not for a beginning player as properly adjusting the neck is best left to someone who knows what they are going. Once the neck was setup and the guitar tuned I was pleasantly surprised. The guitar sounded pretty good. The neck is thin and has the familiar feel of an electric. Action was good. Upper fret access is really good. The guitar stays in tune while playing. Plugged into an amp playing through the pickup offered no surprises. The bright red red stained finish on the top was a nice touch. I expected red paint. I would have preferred bigger frets for bending and ease of fretting. They are a little small. $175 for a roundback is really a no brainer. If your a beginner or have some playing experience you will enjoy this guitar and the value it offers.", "id": 296}, {"review": "I can't find a single complain about this amp. The amp modelling is fantastic. Plug in for a mic/CD/M3 player. Quality driver. I'm not going to go through all the features that yo ucan read o nthe website. I used to play through a chameleon and separate amp in a rack to get these effects. Only thing I wish it had was the ability to save a custom sounds. But you can't ask for much more for the price of $399. You won't be disappointed with this amp.", "id": 466}, {"review": "I bought this strap for a ESP EC-1000 Les Paul style guitar.  I was a little apprehensive before ordering considering the cheap price. When I got the strap I was impressed. The locks work perfectly and fits my guitar. The back of the buckles are covered with foam so that they don't harm the finish on your guitar. Locks are solid and ratchet closed with a release button to open. It's not going to unlock on you. Strap would be more comfortable with a shoulder pad as the strap is nylon with no padding. Good strap for sitting down or playing standing short gigs with a light guitar. Long shows with a heavy axe might not be too comfortable.", "id": 208}, {"review": "This is the best guitar cleaner and polish I have ever used. It cleans the grime and greasy fingerprints off very easilly and leaves a brilliant shine without a waxy/greasy feeling that cream polishes leave. This is a must for black guitars. Great product. Only wish was that is was bigger than 4oz. It's quite expensive for 4oz. But 2 or 3 sprays does the whole guitar including the neck.", "id": 351}]