[{"review": "Back in the 1980's I bought a can of deoxit(not the right name but can't remember it) which worked much better and cost much less. It was made for the military. The spray has 3 levels but the low is still way to high. It does work but the stuff I used to have was much better. I don't see much else out there so I may have to stick with it.It is just very wasteful for the cost. I have had good luck with wd40 too, but it is very flammable. I would call it average.", "id": 14}, {"review": "I bought a couple of sets of strings for my banjo. Strings are a matter of preference of how they sound and feel. One person may love them the next may not. They are very playable strings, but on my aluminum rim saga banjo the sound was a little to bright. I took them off and put them on a another wood resonater banjo, they sounded much better on that one. One reason I buy these strings is they are made in the U.S.A Why buy strings when they don't tell you where there made.I put on a set of Daddrio medium set and liked the sound better but they are a little harder to play.All strings must be kept clean if you want them to last. wipe each string when done and they will last longer.", "id": 255}, {"review": "And works well for it. My only concern is that the shaft that holds the weight is plastic and not metal. I don't know how long it will last. I might find a tube to place over it and make a lager hole. But the price is right and the stand is solid enough. All areas that touch the banjo or guitar are protected and should last.", "id": 258}, {"review": "I wanted to wait till I got another phono preamp before I wrote this review. I did get this from AmazonTC 754 BLACK Phono Preamplifier SwitchableI really needed more aux inputs for cd etc. But right away I noticed my first impression that it sounds overly bright. The next issue is a real problem but it might not be with others. I am using a vintage Garrard turntable. The rca jacks work fine with all other amps etc except this little preamp. They are tight but do not make good contact and I need to mess with them. This problem is gone with the new preamp. Overall it is a good little unit and you may not have the same issues. If you can afford more or need more inputs you might want to look else where. It does sound ok other than being a little bright. It does do what is supposed to do.", "id": 363}, {"review": "I had done a fair amount of research on banjos before I bought this. It has many of the same components of a more expensive banjo and plays very well. Yes there many banjos and some with more frills. There is no indication of where this banjo was made, but the quality is top notch. I am a woodworker and judge workmanship closely. I see no flaws on my banjo. I did not have the problem with the 5th string machine being to tight as others. I bought mine from [...], the same place it ships if you buy it at Amazon best was 10 bucks cheaper with free shipping. If I could give it more than 5 stars I would. I can play a guitar and learning a few banjo chords was easy. I also have very large hands with chubby fingers and was worried about it having a small neck, that is not a issue either. While I am expert on banjo I would gladly buy another and see no reason to spend more money at this point and probably not later on either. A keeper for sure.", "id": 649}, {"review": "There are plenty of reviews here that explain this unit and it works well. Before this I had been using tuner pro android app that also works well but I don't have it all the time.There is one big negative, it is absolutely useless outside in the sun or even shade. Can't even tell if it is on or off. Outside of that I am glad I picked the \"red\" version instead of the others.", "id": 707}]