[{"review": "Well made. Works as it should. However, seem to be getting a little bit of noise from a shotgun mic straight into a D800. (more than the usual expected)To see if it was the Mic, cable, or adapter; Tested it going straight into a Zoom H4 recorder.Seems to be a little but more noise going through this adapter cable than straight into the XLR input.No big surprises. Minor clean up in post.", "id": 8}, {"review": "Not sure there is much to say about a mic stand clip.Solid plastic. Brass threading. Adjustable pivot screw.I've always been pleased with On Stage products, even down to there cheap $3 clips.", "id": 179}, {"review": "Not much to review about a simple tabletop mic stand. Solid heavy base. Well built. Does the job of holding a mic. No more, no less.", "id": 224}, {"review": "I actually use this stand for more than holding a mic.I use it for video and photo purposes: Holding light reflectors, flagging, speedlights, etc.It's heavier than it looks and cheaper than those stands specifically marketed for photo.", "id": 279}, {"review": "Great Recorder on so many levels.I use it for external audio recording for DSLR video.I was surprised by the quality of the built in stereo mics.Dinged it one star because the display and menu system is terrible.Not intuitive and too many steps to get into changing or checking some basic functions.Something I will have to get used to.", "id": 581}, {"review": "So I went for budget pricing without going to the absolute cheapest.Using for audio acquisition for film / video purpose.Pleasantly surprised at the construction quality of this cable, considering it's made in China; We'll see how they hold up over time.So far, clean sound using a shotgun mic straight into a Zoom H4 recorder.My only gripe is that the rubber grommet between the metal connector and cable was obviously not put on straight during manufacture, and will not go on all the way. (on the female side) Probably one few out of many, let's hope.It's those small attention to details that worry me about stuff made in china.Overall though, a great value for a quality cable.", "id": 692}, {"review": "A needed accessory for any vocal recording, period. My only gripe about this model is why the straight bracket part needs to stick out so dang far, since you can bend the arm out in any position anyway.", "id": 46}, {"review": "Does its job. Good solid construction. Support cords seem to be of good quality. Knob tightens well. Comes with thread adapter. Smooth silver satin finish. Affordable price. 'Nuff said. Just buy one already!", "id": 393}]