[{"review": "Replaced a stock fender speaker in a modified Mustang Lead II cabinet that I now use connected to a Hughes and Kettner amp.  This speaker dramatically improved the sound of the cabinet, and sounded good using the Mustang II amp as well.  This speaker seems to take some of the sizzle and shrill off the high-end to make a nice even sound.  I'm quite pleased with this speaker.", "id": 276}, {"review": "Nicely made and well-padded guitar soft-case purchased to protect a Jasmine S34C NEX Acoustic Guitar.  The guitar fit inside the case perfectly, and a zippered pocket on the case allows for storage of picks, stings and other flat items.  Very nice product.", "id": 400}, {"review": "Years ago I owned an original edition TS808; I loved that pedal and used it for years on stage.  Eventually I sold it many years later, but I always missed that pedal, so I decided to give this reissue a try. My verdict: Awesome - It sounds just like I remember. The TS808 just has that 'certain something' that really brings out a nice smooth overdrive sound, especially when it's to enhance the overdrive sound you may already have.", "id": 447}, {"review": "For what it does and how I use it, this is the hot setup!  Great for a quick practice and really sounds nice.  Wide overdrive and tone range.  The delay feature is basically a simple slap-back echo (I'd much rather have a chorus in there) but for price and the sound I'm quite pleased.", "id": 546}, {"review": "I've played the guitar for a number of years, some of them professionally, and during that time I've owned guitars by Fender, Gibson, Ovation, B.C. Rich, Yamaha and Applause. That said, admittedly, this guitar was purchased with the intention of it being a cheap, expendable guitar that was reasonably playable, that I could take with me when I go camping. While my expectations weren't all that high due to guitar's price, upon reading other reviews and having experienced Takamine's quality, I decided to gave this Jasmine a try.  I'm glad I did - what a nice guitar it turned out to be! Out of the box, the fit and matte finish were impressive. The neck action was nicely set up, the intonation is spot-on and the guitar has a rich sound and tone.  The tuning pegs work smoothly and the guitar stays in tune nicely.  Note that I changed strings from the set provided to a set of extra-light gauge strings just as a personal preference and that the guitar features a black pick guard not shown in some product photos. The Jasmine S34C NEX is truly an impressive guitar for the price.", "id": 183}, {"review": "Simply a nice assortment of picks to try.  Worth a purchase just to experience the differences a simple pick change can make.", "id": 773}]