[{"review": "I purchase a set of these, and first off, the case itself is worth 10 dollars. It is a quality heavy cloth case with a felt/velvet lining. The harmonicas are almost unbearable to play as soon as they arrive as they reek like plastic and oil, but after leaving the case open 2 days, they barely smell, and they are still airing out. I love how light they are due to the plastic cases, even if they aren't super loud. They are a great buy for the money, as I simply wanted a cheap set to mess around with and try out different keys. The notes are slightly difficult to bend, but the reeds are still loosening up. All the notes play but a few of the higher ones needed a little encouragement with overblowing and lightly breaking them in a little, but the harps all sound great after 5 mins of break in. I am quite happy with the product, and they honestly could be much worse for the price. The blues and set is only 10 dollars more with metal casings and probably better components, but these were good too. I would recommend to anyone who has a decent harmonica in C but wants to experiment with other keys... Good buy", "id": 293}, {"review": "I would recommend this mic for any application from home studios to a spare mic for any musician. They use a heavy metal casing that appears durable, and the cord is decent enough for live sound, but a very slight hum was present with my guitar/harp amp. I would pay this price for just the element! It is truly a great buy, and I would use it for armature work any day. I use it for harp (harmonica) and it works great, and it sounds smooth with vocals too. I would recommend it to any friend, and I already have... Worth every penny!", "id": 690}, {"review": "This pedal sounds great with my fender excelsior with it's 15 inch speaker and also very good with my 1960's danelectro tweed amp with it's bright weber ceramic 8 inch speaker. I can use the entire range of the tone knob to go from aggressive growls at the low end to screaming lead tones at the other end, and it never sounds harsh. The clipping is sweet and musical, with a sound very reminiscent to cranked amplifier stacks with their front ends being pushed with overdrive pedals. Sometimes I feed this with my SD-1 or my Danelectro D-2 overdrive and it just puts it over the top. FOR THE PRICE, these pedals are outstanding. The QC may not be perfect, and there are duds out there, but I would say that it is worth the risk, as the circuits in these are just like vintage pedals although they do use cheaper components and boards and such. As long as you dont literally stomp down on the pedal and you dont drop it down the stairs, it will last long enough to make it worth your while. Also, the blue LED is somewhat bright and annoying, but it is a good indicator so I guess it does it's job. Overall, rock on!", "id": 280}, {"review": "The regen control goes to very strong deep levels that will rumble the floor at the lower end (My fender excelsior with it's 15 inch speaker rattled the walls) of its sweep and can give a very cool effect. I notice very little tone suck with the pedal bypassed. Also, the speed know has a great range with 5+ second sweeps to super fast leslie and univibe like tones. The depth knob does it's job. It doesn't have a manual knob to move the sweep, but I leave the depth all the way up most of the time so it's no big deal. For the price, this was perfect for trying out a discreet flanger pedal instead of the one built into my Vox modeling amp.", "id": 316}, {"review": "This thing sounds great with my tube amps, both with my 2 watt danelectro amp from 1962 with it's 8 inch speaker and my 12 watt excelsior from fender. It has a good range of overdrive levels. It is clearly a vintage style effect that is good for classic rock and dirty lo-fi stuff like The Black Keys, The White Stripes, and garage band like stuff. It is good as a light tone shaper and boost to put a distortion effect into feedback heaven and into total over the top sputtering fuzz. I love mine for the price, and its a good mix up compared to my modded SD-1 and my overdriven tube amps. It's different and just worth having to mess around with. Just be a bit gentle and the thick plastic case and switch will last. Also, the blue LED is very bright. Thats either an annoyance or great. Rock on!", "id": 355}]