[{"review": "Though I'd warn if you don't know about audio this does not mean you can place your mic right in front of you and have the pop filter magically de-esse the whole thing, but between the pop filter and a slightly off-center placement it seems to keep the majority of erroneous pops and esses's from making an appearance in any way.", "id": 46}, {"review": "Title says it all. Good quality for home or studio use, but not sure how it would survive if it were to be taken on tour. Still for the price you get a nice adjustable stand that can be manipulated to get basically any mic position you'd want, from overhead for drums to fret level for guitars, above or below vocalists depending on the tone you're hunting, etc. Versatile and great to work with.", "id": 279}, {"review": "When you're looking into a quality cable you wouldn't expect to find such quality for this price range. The construction is solid, well insulated cording, and having done some test recording with it I will definitely be purchasing more of these as the studio expands.While there may be more expensive cables out there I feel that for the price you are getting something of a higher quality than you would expect. Didn't notice any defects and no static/noise-bleed despite being around lots of other audio equipment, monitors, etc. Even touring or in a mobile studio application I wouldn't be worried about this cable failing or noise bleed.Only regret is not picking up a few more at this price, but I'm sure to order more for future expansion.Not worried at all about using this cable as part of my signal chain and was relieved to have it shipped out and arrive in a timely manner.Quality product, quality vendor.", "id": 692}, {"review": "My only gripe is that once in a while after it's been on for a long time it seems to drop out / stop working in windows 7. I've tinkered with my usb power-save settings, etc, and it still seems to be an issue. Not that big of a deal as it doesn't do it when actively being used, but about once every other day I have to unplug the USB and reconnect it. Could be my system, could be the pre-amp, otherwise no complaints.Though be wise and download your drivers from the website, not the included software. I don't even know what is on the software but I think it's a full version behind what you'll find on the website.", "id": 801}, {"review": "Enjoyable mic, has a decent frequency response range, nice patterning to not pick up too much ambient room noise. I usually have to do some post-processing on vocals, but in the genres I work in that's not exactly a rare thing. Either way sounds way better than I would expect for a mic at this price. Haven't tried it for drums or guitar *yet* but I'm impressed with it's ability to accurately capture vocals. While it doesn't have the warmth that some mics relay, I prefer it that way. It leaves a really clean, if slightly cold/flat feeling, that can then be warmed up in post production nicely.Good value for the sound, no complaints with the shock mount. Though make sure to be cautious with your mic placement, get a pop filter, and if you have a room with lots of ambient noise don't be shocked if it picks some of it up. All in all a good deal.", "id": 642}]