[{"review": "I never had one of these until I had to twist each tuner around 60 times to change a string.  But that's not a problem any more.I used to go through my hardware drawer at home to find wire cutters to trim my string ends.  But that's not a problem any more.And I used to hurt my teeth sometimes pulling tough bridge pins on my acoustic.  But that's not a problem any more either.All solved by one simple tool which is inexpensive and fits easily in my case.  So I'm a fan.  You'll be too.", "id": 94}, {"review": "I've been playing over 30 years and got one of these for my 7-year-old because he wants to play guitar like daddy does.  For $100 it's an OK starter guitar for a kid (and I guess really short people who can't play a regular Fender), but not something I'd recommend to anyone else.  And my kid thinks it looks cool, so he'll be more likely to stick with it.Even though it has a laminated body, the headstock and unfinished neck are decent wood.  The frets are crowned OK but have some sharp ends to them, and I feel silly investing the cash to have them fixed.  It's light and easy to handle.  The hardware isn't bad, with a stable bridge (good idea not to put a floating trem in this), 5-way blade switch, solid jack and strap anchors, and smooth knobs.  The pickups are not top notch but work well enough (a decent replacement set would cost more than the whole guitar does, so I'm not complaining).  It has a nice red paint job.On the down side, besides some sharp fret ends, it required a few truss rod and bridge adjustments to bring the action close to where it should be.  The fretboard uses cheap rosewood and in one spot has some extra glue showing around a fret.  The nut on the one I got is sunk lower on the treble side than on the bass side, so the low E string is farther from the fretboard than the other strings.  It has one small pit in the red finish.  It has no paperwork or owner's manual.  The tuners are kind of choppy.  And the body/neck flexes so if you put too much pressure on it the whole thing will go out of tune.It comes strung with Fender 9's, which combined with the short scale makes the strings loose and easy to press down, so it's good for a kid just starting out.  I actually enjoy messing around with it because the pickups have a punkish scratchy sound.  But as soon as he gets bigger we'll ditch this for something better.", "id": 152}, {"review": "These EXL115 .011 gauge D'Addarios are good strings at a good price.  They sound nice and bright on my Epiphone Sheraton II and particularly twangy on the lower end of the scale, which I like.  I'd rather get these and replace them periodically than try to make any kind of old strings last a long time.  The strings don't break either.", "id": 156}, {"review": "I haven't measured signal throughput so I can't comment on that.  But where this cable does impress is how easy it is to handle.  This thing simply will not crimp, will not kink up on itself, does not get twisted and has no tension in it.  It's the easiest handling cable I've ever dealt with, a real pleasure when you've got all kinds of wires running all over.  It's like a floppy noodle but light and sturdy, and the jacks are strong and stable with no loose connections.I have a 10-footer with one right-angle connection, and the right angle is a perfect fit for the jack on the bottom end of a Telecaster.", "id": 168}, {"review": "I recently bought this (May 2011) to use on both my acoustic and electric and it works fine.PROS:  Non-oily, water-like consistency; leaves no residue behind;  slight non-chemical odor that doesn't linger on your guitar; removes smudges, fingerprints, etc. and leaves a nice shine; comes with a large lint- and dust-free, fast-drying cloth (black); less expensive than most other guitar polishes.CONS:  The pump sprays in a very wide area, so be careful to avoid spraying strings, pickups, etc.The polish in the bottle works well and the lint-free cloth works well too.  I can't see spending more for Gibson or Dunlop polish kits when this work just fine.", "id": 194}, {"review": "I bought these to beef up the bottom end of a Telecaster that came from the factory with a set of Fender 9's that topped out at .042 on the low E, which is just too small for good twangy bass.  I've been using them for a few months now and haven't broken one even though I can bend the high E to touch the D string.  I use D'Addarios on my other guitars but tried these Ernie Balls just for the hybrid mix and there isn't a whole lot of difference.  D'Addario sells a similar set called EXL125 so maybe I'll try those next but for now these are good.", "id": 240}, {"review": "I wanted a portable headphone amp but bought this instead because it was only a few bucks more and offers a ton more features.  Though it's not perfect, it's like having a room full of guitar effects and different amps.PROS:  32 amp models, 16 cabinet models, effects + thousands of available presets = TONES GALORE; good software for managing tones and creating new ones; can be used in front of an amp (in case you want to know how a modeled Mesa/Boogie would sound coming out of a real Vox); lots of connectivity; compact enough that I keep the unit, the cable and the power supply in my case; no tech problems at all; built-in noise gate and tuner; easy-to-use tap feature.CONS:  There's a learning curve and you will need the manual to know stuff like how to change amp models; manual is a pdf file; hard to keep track of preset tones on the unit (though you can rename and re-arrange them with the software); presets based on famous songs don't always sound right; minor background hum; uses 4 AAA's in a few hours and the manual says don't use rechargables (though it doesn't say why); for legal reasons, the unit uses generic amp names (check the manual to match the amp model names to the amps they're based on); with everything plugged in the whole setup becomes a little unwieldy; doesn't sound as nice as a good pedal and a Marshall half stack (no kidding, right?  And I still don't sound like Alvin Lee).As an inexpensive effects box that also works as a portable headphone amp, this thing is cool.  You won't get bored with it but you will need to learn how to use it.  Master some of the amp/cab models and how to tweak them for gain, reverb, delay, etc. before you dive into the presets.  And once you've got the presets you like best, use the software to put them all in one place so you can find them easily.The Line 6 Pocket Pod Pack includes a patch cord, power supply, USB cable, CD, cheap ear buds, and MP3 player cable.  The Pack is 150 new, so if you're going to buy the power supply then just get the Pack.  If you buy used then the manual describes how to do a factory reset so it's like new again.", "id": 427}, {"review": "I've been playing for over 30 years and these are perfectly fine guitar picks.  Not special but not disappointing either.  As long as your hands don't sweat a lot you'll be fine with these.But a real \"assorted\" pack of picks should be more than just assorted colors.  A real useful assortment would be a pack with different thicknesses.  I like to experiment with different types of picks.  These \"assorted\" picks are really all the same, just different colors.", "id": 574}, {"review": "I've been playing for over 30 years and now have three different electronic tuners, so I'm a good judge of the Snark:PROS:  It's chromatic so it's good for every tuning job; no need to plug it into your jack; ambient noise doesn't affect it; great sharp, colorful display; reacts quickly; small enough to fit easily in my case; cool blue color; built-in metronome; powers down automatically to save the battery; transposes up to four steps if you're using a capo; will even identify major chords.CONS:  Works better on acoustics and semi-hollows than on solid bodied guitars; made me realize that three of my strings need intonating (or is that a PRO?); metronome is visual only; manual says that long-term use of the clip in one spot can damage some guitars' finishes; big blue thing on your guitar looks weird.Now that I have the Snark I have officially retired my other two tuners.  This is easier to use, easier to carry around, you don't have to unplug from your amp, it works on acoustic or electric, and it's chromatic.  And it's cheap.  Definitely recommended.", "id": 706}, {"review": "I ordered one of these (from MF) and had to send it back because it was damaged and the latches didn't all work.  Even in perfect condition it's still a subpar case.  But the one I got had two ripped corners on the lid, and from those rips it's easy to see that the edge of the lid is just very thin cardboard all around, and the black outside covering provides little protection to keep that cardboard from tearing.  As for the latches (buckles), there are three of them and on the one I had only one worked to keep the case closed.  The other two latched, but they rattled and provided no tension at all to help keep the lid shut.Disregarding those flaws it's still obvious that it's not a good case.  The hinges look like they could fall apart or come off at any moment, the handle is not comfortable to hold, and the whole thing bends in a way that makes you wonder if you would be better off with a gig bag.  It also won't stand evenly on end (if that's important to you).On the positive side it's light, it does fit a Telecaster ok, and the inside is a decent plush lining with a small storage compartment.  But do yourself a favor and spend another $25 and get something better.  I have a Musician's Gear dreadnought case and this doesn't compare to that one at all.", "id": 751}, {"review": "I bought this recently for $40 to replace the old cardboard case my acoustic had been in for decades.  For $40 it's an awesome deal.  But objectively, when compared to an Epiphone 335-style case I bought last year for $81, it's deserving of 4 stars (which isn't bad, just not great):PROS:  Decent build quality; four buckles (one locking) and three hinges; very nice plush lining; not heavy; knobs on bottom so it stands on end; knobs on side and back so it's never directly on the floor; fits a dreadnaught well.CONS:  Not easy to close and takes some work to get all the buckles lined up and snapped shut; the one locking buckle wouldn't stop anyone; the big front and back body panels flex more than they should; exterior covering feels somewhat cheap; the handle is hard plastic and not padded.So for $40 it's a great deal and a big step up from unlined cardboard, but it doesn't measure up to a basic Epi 335 case which is stronger and has better hardware and finishes.  It also had a strong chemical odor, but leave it open to air out for a while and that mostly goes away.", "id": 753}, {"review": "I got this for my Epi Sheraton II:PROS:  It fits perfectly; it's \"fur\" lined and has a decent sized internal compartment; it's solid and the hardware is sturdy; it has one locking latch (out of five), but nothing that would stop a real thief; it has two knobs on the bottom that allow the case to stand on end without tipping over, two knobs on the side for when you put it down on its side, and three knobs on the back that allow it to lay down without being completely on the ground; it's relatively thin.CONS:  It's heavy; the handle is positioned oddly and at an angle; it has some \"Made in China\" characteristics.I've had several cases and this is one of the nicest.  On a personal level, I'd prefer it didn't say \"Epiphone\" on the outside.  But since it does it's a good place to hide a $3000 Gibson 335.", "id": 157}]