[{"review": "OK... I am a pro musician & rely on gear that will stand the tests of the road. I was using an old Ibenez Chorus Pedal (one of the first to hit the market) of which I did not use much basically due to it's used for certain songs. I upgraded from using 2 separate pedal boards to a single unit & decided to buy the Boss CH-1 Super Chorus to add to the collection. After my first gig I removed the Ibenez Chorus Pedal because of the tonal superiority of the Boss unit. I am certain there are units that may boast of being better but, I have found through my 40+ years of playing that more money is not always better.Great tones! Easy operation! And it is the best bet for the money!", "id": 33}, {"review": "As a pro musician, I am always on a quest for better tone to expand and comply with different gig situations. I had a bad experience with a few Compression Pedals through my years only to toss them in the closet & give up on the thought.When I upgraded my pedal board, I decided to give the idea of adding a Compression unit to give my G&L; American Legacy (Stratocaster style guitar) more sustain at lower volumes. Boss is the company that dominates my effects board... I rely on their Chormatic Tuner, Digital Delay (2 of them), Line Switch & Direct Box almost every night (for gig & Practice).With a somewhat negative attitude going into this I had a great surprise to find that I really, really like this unit. It did what I wanted & then some! Great tone & sustain oozes from this little box & stays in the \"On\" position for most of the time I am playing my electric guitars, especially any Stratocaster styled guitar I own.", "id": 34}, {"review": "As an \"Old School\" Guitarist introducing new gear into my rig always makes me nervous. With a somewhat massive pedal board filled with individual Boss pedals which is often too large for some of the venues my band gigs at & definitely too large for our practice studio (and a bit too heavy to lug around).I researched every multi-effect unit on the market today & decided the ME-70 was the best way to go for me mainly for the \"Manual\" settings. When I received the unit, it came out of the box ready to go (other than installing batteries) and worked exactly like I had my \"rig\" shrunk down into a rugged small package.COSM- With the amp simulation & Pre-Amp portion I don't need to carry an amplifier any longer because this unit has the ability to clone my coveted tube amp collection with the twist of a knob.Effects- Boss is \"THE BOSS\" of effect pedals in my opinion... this unit combines everything I need & then some in a single unit with the ability of individual tweaking. I do not venture into the unit's ability to remember settings because every venue I gig at has different acoustics & constant tweaking is required to achieved the tones I want to hear.", "id": 582}, {"review": "This jumper cable is a decent cable used for jumping from one unit to another when longer connections are required & a 10 ft. cable is too long. I would not depend on it for night after night abuse but, it just may last longer than I think. Planet Waves does make good products.", "id": 663}, {"review": "If you are playing a guitar that costs several hundreds to several thousand dollars, why would anyone buy a cheap guitar strap to hold it up. I have friends who think strap-locks are the best invention of the century but, I believe in buying a quality guitar strap & Levy's produces some of the best on the market. I own several acoustic & electric guitars... for the most part, I have a strap for each one except the pieces too valuable to take to a gig. Every strap is a Levy's...I'll call myself a veteran pro guitarist (I don't believe in using the word \"old\") who gigs about 12 - 15 days a month. This strap is comfortable to wear & strong enough to hold up my Gibson Les Paul Standard without any worries of dropping it. I've watched friends & band-mates constantly adjusting or reattaching their straps... I offer my advise to buy a quality strap & find most continue to use crap straps. BUY IT... You will love it!", "id": 484}, {"review": "JJ Tubes are the best sounding vacume tubes & the only tubes that go into my vintage & boutique amps,", "id": 687}]