[{"review": "When I bought these I was looking for pop filters to use with a pair of condenser microphones to help keep the wind pops from ruining a recording.  Once these are in position they work just fine, the problem is that getting them into position can be harder than it looks.  The device clamps onto a microphone stand and then you adjust the goose neck to get the filter where you need it.  The filter and the goose neck are fairly heavy and as such it was often a struggle to get the filter where I wanted it and to keep it there.On the plus side, the device looks nice and professional and it has held up over three years of use.", "id": 46}, {"review": "I use my Shure SM7B mainly for podcasting and voice work and it performs extremely well in those applications.  I also use aHeil PR-40 Dynamic Studio Recording Microphoneand you can check out that link for my review on that item. Both microphones are dynamic microphones and both give my voice a very warm, natural feel.One thing, well actually two things, the Shure SM7B has that the Heil PR40 does not is a set of two switches.  One for bass rolloff and one for mid-range emphasis / presence boost.  While both of these switches can be useful, I prefer to keep the mic flat and let any outboard processing / EQ handle adjustments that need to be done.  If you don't have outboard processing, both of these could be helpful to you as the bass rolloff really does help keep low frequency noises (for example, someone bumping the table) to a minimum and the presence boost does help certain voice ranges cut through the mix a bit better.When I reviewed the Heil PR-40 I said that it was the best bang for the buck out there and the Shure SM7B may be changing my mind a bit.  While the PR40 is about $70.00 cheaper than the SM7B here on Amazon at the time of this review considerations must be made to the fact that most PR-40 users will want to use a shockmount (about $100) and pop filter / windscreen ($15 - $60) to get the best results out of the microphone.  With the SM7B the shockmount is built into the microphone and does a surprisingly good job and Shure includes two different foam windscreens (one for normal use and one for ultra-close up use) with the microphone.  So the bottom line is the Shure SM7B with all the accessories is probably going to be less than the Heil.Another thing worth mentioning is that like the Heil PR-40 the Shure SM7B is built like a tank.  It is a heavy microphone and in my opinion just looks very cool whether it is mounted on a boom or on a desk stand.  Both microphones perform about the same as far as rejecting any off-axis sounds and both are excellent microphones for voice and podcasting applications.The SM7B takes a little more to drive it than the Heil PR-40, so you'll want to make sure that you have a decent mixer / pre-amp that can handle the microphone.The bottom line is the Shure SM7B is a very high quality microphone and I would highly recommend it.  If you're comparing it to the Heil PR-40 most likely the thing that will make the difference to you will be the aesthetic differences and the price because the performance of these two is very, very close.", "id": 136}, {"review": "This is exactly the item I needed for my podcasting rig.  It holds my Behringer mixer along with my compressor and my vocal processing box.  It lets me move the whole thing easily out of the way when I need to use my table for something besides podcasting.The stand is easy to assemble and is very well built.  There's nothing bad I can say about it, if you need to hold some audio gear then have no reservations about picking one of these up.  Highly recommended.", "id": 322}, {"review": "While I have heard that these devices can be great for recording concerts and have heard some great recordings to back that claim up my review will be focusing on my main use which is podcasting.  After using the Zoom H4N for a few weeks I've found it to be a very versatile tool that should be in any podcaster's arsenal of gear.I mainly use the H4N to record my podcasts using a Allen & Heath ZED14 mixing board.  I usually do a two person podcast where I am in one location and the other person is brought in via Skype.  Using the Aux sends of the board and the 4 track mode of the H4N I can record myself in one channel, the other person in another channel and all of the sound effects and music supplied by my iPad into its own stereo channel.  This makes editing a breeze as everything is on its own track.The sound quality of the H4N is excellent and it is very easy to hook up external microphones to the unit.  You can hook up either two XLR microphones or two 1/4&#34; jack sources (or a combination) to the bottom of the unit and there is one 1/8&#34; input on the back of the unit that will accept a stereo microphone or any line level stereo source.  It's the combination of these that lets me record the podcast onto the 4 separate tracks.The H4N will also let you record using two attached microphones and the internal microphones at the same time as well, which could be useful if you're looking to capture some background noise if you are recording something on location or say to mix the crowd reaction to a soundboard feed.Overall this is a great device for podcasters both in the studio and out in the field, letting you produce high quality recordings in both environments.  Five stars without a doubt.", "id": 581}, {"review": "I've owned a bunch of tuners over the past 30 years and this one is the best I've ever had for an acoustic guitar.  It is easy to operate, has a nice large display that you can easily see and it's small enough to carry anywhere.  It is fast, accurate and the battery seems to last forever.  Nothing to complain about here, 5 stars all the way!", "id": 706}, {"review": "When I ordered these I wasn't expecting a whole lot since the price was under two dollars for a nearly 10-foot cable.  It turns out the quality is quite excellent and these cables are not flimsy at all.  I plugged them into the mixer and waited to hear some static, interference or buzz to explain the low price and all I got was a nice, clean signal.  Highly recommend these to anyone with a mixer that needs an insert cable.", "id": 9}]