[{"review": "I carry this in my bass gig bag so I can plug my phone into the mono aux-input on the back of my Genz Benz bass head. Handy for rehearsals when the band needs to listen to a track while working out an arrangement (my bass cab is full range fEARful 15/6/1). Before picking this up, I used a couple of cables / adapters to go from stereo 1/8&#34;  to mono 1/4&#34; and it often seemed I never had quite what I needed on hand.", "id": 10}, {"review": "Update: The right angle switched end started developing crackling issues and is now intermittently cutting out. I've had it just over a month, so Amazon won't help me. Despite the lifetime warranty, Amazon has only offered to let me pay shipping and to give me a partial refund. Despite being an \"authorized retailer\" for Planet Waves, AMAZON DOES NOT OFFER EXCHANGE UNDER THE PLANET WAVES WARRANTY beyond the standard Amazon 30 day return policy. Amazon support referred me to the manufacturer. I've emailed Planet Waves, but the instructions for the warranty are to return it to a dealer for exchange. I don't have a dealer within 100 miles of my home, so unless the manufacturer comes through, this one is quickly becoming unusable and it looks like it might cost me to resolve it.I frequently switch instruments and this makes it easy to do quietly. I've used cables with the G&H; quiet plug (which also works well), but the switched connector on this has an advantage over the G&H-; you can use it as a mute and tune with a head stock tuner without unplugging your instrument. The cable itself is a bit stiffer than I'm used to, which makes coiling for storage very easy, but it can quickly become a twisted mess on stage if you more length than you really need. The little elastic cord keeper strap works better than I could ever have imagined. I've never given the sound of a cable a thought, being a bass player who doesn't use much for effects and who plays mostly passive instruments. But using this with my Genz Benz Shuttlemax 9.2 and fEARful 15/6/1 cab, I really notice a pronounced difference in clarity and dynamics. The sound is much more alive with this over any of the other cables I have from a variety of manufacturers (Hosa, Proco, Whirlwind, etc). I've never had to warranty exchange a PW cable, but others tout the easy swap at any PW dealer as a great reason to buy them. I like knowing that. ** EDIT: AS STATED ABOVE, YOU WILL NOT BE ABLE TO EXCHANGE IT THROUGH AMAZON BEYOND 30 DAYS **", "id": 32}, {"review": "Super low capacitance- on par with or better than many of the more expensive cables from Mogami, Canare, etc. The connectors are fantastic and they come with Planet Waves' super-handy elastic cord wrap. These are outstanding guitar cables at a VERY good price. I used to only buy cables with serviceable connectors, but with these, I don't see the point. The lifetime exchange warranty also makes the DIY repair thing kind of pointless too (of course Amazon's return policy is still 30 days, so be aware of that- you'd need to mail it back to the MFR or take it to another dealer to exchange - that is if you ever had to).", "id": 195}, {"review": "Pretty disappointed in the color. As the review title indicates, what I received is more of a 'black chrome' or dingy stainless color. These are simply not going to work with the MOTS pickguard I purchased them for. Perhaps they would blend in better on a black, black pearl or tort pickguard.I ordered another package from another vendor and got the same result. Perhaps it is a large factory shipment that is 'bad'. Some are very dull looking. Very disappointing, really.", "id": 215}, {"review": "My only complaint is that it doesn't fold up smaller, but otherwise this is an excellent stand. I have to concede I'm a bit spoiled by the super light weight and much more compact folded dimensions of myK & M Memphis Pro Guitar Stand. However that light weight comes at the cost of a slightly more fragile build. The extra heft of the Hercules has the advantage of slightly better stability when you remove the instrument from the stand (the K&M; tends to want to bounce backward as the weight is removed if used on a padded carpeted floor). Despite not folding up quite as small, the Hercules is simpler to unfold and adjust (one action for legs, one action for height, whereas the K&M; has three separate legs and two vertical sections / clamps). I do realize that I bought the one without the folding yoke and am not considering that aspect when comparing it to the K&M.; Length and girth folded would still be quite a bit larger than the K&M; (large enough that I won't try carrying it in my gig bag pocket as I do the K&M;).I'm also not convinced Hercules' trade mark pivoting finger yoke is all that necessary on this type of stand. The back angle and the fact that a good portion of the instrument rests against the padded legs means it would take so much force to knock an instrument off of it that it's knock the whole stand over. No big deal, just more parts (and weight). I think I prefer K&M;'s yoke, as it automatically adjusts inward to the width of the neck as weight is applied. The Hercules has a fixed width yoke with pivoting \"gates\". Both work perfectly well with my Fender and similar bass head stocks.I've had two of the K&M;'s and the second was a bit of a disaster. It was defective in more than two areas. Defects happen, but one highlighted a weakness which concerns me a bit, and lead me to try the Hercules(I won't go into all of that here, see my review on that product). Aside from the potential weak spot of the yoke, the Hercules should prove to be far more durable and tolerant of my occasional clumsiness. I'm glad I purchased this one and I think I'll get plenty of use from it. But I should mention, it did allow me to better understand and appreciate the strengths of the K&M;, mainly its awesome portability (despite its slightly more fragile nature).In the interest of further comparison, I've got anUltimate  GS100 Support Genesis 100 Guitar Standon order, and will review it against this and the K&M; as well. I opted for the GS-100 without an automatic closing mechanism over the GS-1000 which has one for the reasons I stated above- I don't believe it is strictly necessary. The reviews of the GS100 are also more favorable, and the GS100 is cheaper (which suits my cheapness.", "id": 337}, {"review": "It'll do for setup work, and the price is right. I wouldn't recommend it for live use or for anyone who changes keys every song, its too fiddly to adjust and get firmly set. I also wouldn't recommend it for anyone just starting out. A spring clamp type capo would serve better. This one is probably best for somebody who rarely needs to use it, and just wants one one hand or to keep in the case as a back up.", "id": 346}, {"review": "Bought two for a shockingly low price that I couldn't beat anywhere- even at double the price. Quality cable, sturdy  user serviceable connectors, well constructed, and 6 months of daily use with no issues. What more can you ask for?", "id": 419}, {"review": "Excellent strap for the money. The leather is thick and supple. In fact the materials are so thick, that it can be a little tricky to get the adjustment tail setup.A note about length- Some might find the standard Levy's strap length too short, so be aware what you need and note there are XL versions of these. For me, many straps on the market in this price range are just too long for me, including those from Franklin, Dunlop (BMF wide), and Mono (even the short model was about an inch too long). I'm a bass player and when standing, I prefer my bass to be at or just above waist height. A few basses, I prefer higher. I'd suggest if you have a strap which places your instrument where you are most comfortable, measure button hole to button hole and be sure you're ordering the right length.", "id": 480}, {"review": "The box contained a bag with just the bottom half of the stand. The top section with the mic thread attachment was missing. Sent it back and did not reorder.", "id": 653}, {"review": "This is a single layer fairly thick strap of sturdy leather with a suede back. At full price of 16.99, it is a solid deal. Any lower, and it is a steal. Leather straps are a little tricky to buy online; You can't feel it or see the exact one you are purchasing, and every piece of leather is different. Most of the time with leather straps, you get the quality you pay for. This one appears to be an exception to that rule. But if you are looking for buttery soft fine Corinthian leather with gold stitching, you need to understand that you'll have to pay more. If you want one made from Wild Buffalo Leather or Free Range Mastodon Hide, you'll need to hitch a ride in the Tardis. If all you want is a solid deal on a basic leather strap that won't let you down, this is a safe bet. Oh and tight strap button holes? That's a good thing in my universe, as gravity is often as irresistible as the lure of time travel (on this Planet, anyhow).", "id": 659}, {"review": "Excellent price. Excellent tuner- with one flaw. Using it couldn't be simpler, and it has excellent contrast. I would say it was the best clip-on tuner I've had a chance to use, except that it broke the first time I carried it in my gig bag to a rehearsal. One of the little fingers that holds the \"ball\" in the \"socket\" on the back of the tuner broke off, so the tuner and the clip are now separate pieces. This model works only by vibration unlike the red one, so without the clip, it is not very useful (it is possible to hold it against the head stock and still use it, but it isn't very convenient). I would just super-glue it together at a good angle, but I have to put it in different positions on different instruments. I've seen a number of complaints elsewhere about this same problem, so I would call it a design weakness.Despite the negatives, I would buy another if they beefed up the construction or sold it with a hard protective case.Update 4/4/13: Added back a star. I'm still managing to use it after hobbling together a fix involving a rubber sink washer. Even with a slightly compromised mount, it continues to provide excellent results. I recently purchased a replacement, the SN-8(B), but found it really disappointing. So much so I may send it back. I also tried a Planet Waves Mini Headstock Tuner, which no matter how much I try, I simply cannot love. So I just ordered another one of these. Despite the ball socket issue, it is still one of the best tuners I've ever used. For the money, I can afford to keep a couple on hand.", "id": 706}, {"review": "Compared to the SnarkSnark SN-1 Tunertuners, I really like the low profile / leave it on the instrument design of this tuner. The Snark goose neck is easily broken, and hard to keep safe in a gig bag. This works much better in that regard. This one is fairly bright and easy to see in all lighting conditions. It mounts very positively and seems to sense all strings fine.  Tuning accuracy? Hard to say- it just indicates high / low / on pitch, really. I prefer the more precise and wider scale +/1 readout of the Snark. They are much more precise- nearly good enough to intonate an instrument. But this is probably good enough for most, just to get dialed in at the rehearsal or gig.The negatives, and why I can't recommend it are as follows. The battery cover on mine fits very loosely. I worry the battery will fall out very easily. I may end up gluing it in place. It isn't immediately obvious where the battery goes or how to open it, and there's no indicator which way the battery goes in (+ is up I think).  The second fault is that once it is on your headstock the string note letters display perpendicular to the user- that's right, sideways.  On a bass, I don't really need it to tell me which string I'm plucking or tuning, but I still find myself craning my neck sideways to read it. It wouldn't be so hard to read either if the letters weren't so highly stylized, but then turn it on its side, and it is just unreadable - for me, anyhow. I just can't for the life of me work out why they designed it this way.", "id": 785}, {"review": "I must first state for the record, I hate strap locks. Hate may be a bit shy of the mark, actually. I've never met a set I liked in any single way.  I've only ever dropped an instrument that HAD strap locks on it. In fact, EVERY instrument I've owned with strap locks has suffered a gravity attack caused by the very device intended to prevent such misfortune. Schaller type strap locks tend to come unscrewed- even with Locktite. When you install them, you are compressing the nut and washer against a compressible material (leather, nylon, etc), so it is never really tight. Plus there's only about two threads on the slim little nut, and if they aren't a really tight match to the other half, wear very quickly (especially since you have to tighten them so often). Duncan type often suffer from 'non-positive lock syndrome' if not regularly cleaned and lubed. Then there's the fact that unless all of your instruments are equipped with the same brand of lock buttons, your strap is only compatible with the ones which match. And then there is the the metal-on-metal clankyness. Yuck. Oh, and and the cost. Moving on.Why are these little Elliptical End Pins so brilliant? They are NOT strap locks. If you orient the widest points horizontally when you install them - as you should, then in order to put your strap on and take it off, you will need to turn the strap 90 degrees to the instrument. This isn't something you are likely to do inadvertently while reaching for your beer onstage. Sometimes the simplest design is the best design. And they're pretty, too.Downsides? I will say the screws supplied with these are pretty short, but then I would also argue there is no reason to not use the screws holding in the original strap buttons as long as they fit tightly. If they don't, using smaller or shorter screws is not the answer- especially considering if the screws cut new threads, you're pretty much- uh, screwed. The washers these come with are pretty small too, so I just used the screws and felt washers that came with the factory buttons. With a brand new strap, they can be a bit tricky to get on, but just as tricky to get off (which is good). That tight fit could cause some increased wear on the strap, especially if it is made from cheap materials. With older straps, just as with any traditional strap button, you need to develop a good habit of always checking the positive seat of the strap, but it is very easy to verify, and again much less likely to slip than a traditional button. Mechanical strap locks actually require just as much diligence to ensure they are still securely fastened and working properly. But with strap locks, if there's a problem, you'll have to grab some tools to fix it - or replace it entirely. Talk about a false sense of security. With PE's Elliptical End Pins, you just put the strap where it should be and you're set.If you are one who is taken to doing back-flips, or find yourself frequently using your strapped instrument like a hula-hoop onstage, then these probably won't save your precious instrument from the gravity goblin or inertia monkey's worst intentions. But if either of these antics are your norm, you might be better served by a permanently attached strap, or perhaps therapy.Since writing the review above, I've ordered several more sets to use on all of my basses. I'm done with traditional strap buttons and don't imagine ever going back to metal on metal strap locks.", "id": 786}, {"review": "Edit: I've had to downgrade my star rating a bit, so I've revised my review- full explanation below, but in short, this just doesn't work as well for me as the SN-1.Background- I have the original SN-1 as well, and have had it for a couple years. The ball socket on the back of the tuning head broke fairly quickly when I forgot to remove it from the headstock before putting it in the gig bag (Protec Contego semi-rigid hybrid case with a little more room around the headstock than your average padded bag). I rigged a repair that has worked OK, but figured a replacement was in order. However other than the broken socket, this has been one of the best tuners I've ever used. Very quick and intuitive. Bright and easy to read in all lighting conditions. Fast response on all strings, including the low B on several five string basses. Despite what I feel is a weakness in the design (the fragile socket), I still felt so good about the functionality of the product that I ordered another, this time the SN-8(B) \"Super Tight\" tuner. I decided to go with another model in the hopes that a newer model might be a little better reinforced at the ball sockets (hence the \"super tight\", perhaps?).Out of the box, the SN-8 is almost identical to the original, save for the obvious color differences. Then clamp appears the same and doesn't seem to have any greater clamping force that I could detect. Turning it on though, the display is quite different. Basically, it is much more \"to the point\". The indicator bars either side of the center pitch (\"in-tune\", dead center) are much wider and fewer, meaning a less granular and less precise display, but one that is very easy to read at a glance in any light. This could be a mixed blessing, but the up side is it is brighter, simpler, and potentially quicker for on the fly tuning. The downside is it is not granular enough to say, intonate an instrument's bridge. It also seems to respond much quicker, which I am realizing is also mixed blessing, and here we have the missing star. The speed also means it responds really quickly to all input, meaning it seems to want to constantly change the note it is sensing. It seems much more twitchy than the sn-1. Unless you are able to mute every other string fully, it will jump between notes frequently. This is also one of my (many) complaints about the Planet Waves Mini-Headstock Tuner too.  I've found that attempting to tune with loud background music or other instruments blasting through a PA will cause my instrument to vibrate at other frequencies - even if I successfully mute all other strings, making tuning with the SN-8 that much more difficult. The differences here between the SN-8 and SN-1 are quite noticeable. For that reason, I just ordered another SN-1.I can't say how this tuner would work for other instruments, as I am a bass player. I'm not sure there is or isn't a defect or flaw here, perhaps it just didn't live up to my expectations (set high by my awesome experience with the original). Simply put, my sampling size is too small to say for sure or proclaim this a bad product.  All I know is that it just isn't working very well for me. If I saved the packaging for this one, I may consider sending it back in exchange for a second SN-1 or perhaps another model. If not, it'll probably be the one I hand others when they want to borrow my tuner ;)", "id": 811}, {"review": "Strings are so subjective and perform so differently depending on the instrument, I have a hard time reviewing them. I have them on an older MIM P bass and am quickly falling in love with them. I tried GHS flats on this bass previously- about all I can say is meh (too rough - they feel more like half rounds, just not the right tone on this particular instrument). I've got another P bass (fretless) with Labella Jamerson's on it (which are still my favorite flats), but these are a close second. Add to that they're half the price of the Labella's, and we've got an easy winner. They're silky smooth, and probably more versatile than the Labella's as there's plenty of top end for a wide variety of styles and music. My tone knob has never been more useful!", "id": 664}, {"review": "I've only spent a few hours with it, but so far, it is fantastic. I wanted a simple grab and go recorder for songwriting sessions, jams rehearsals and gigs, but I also wanted the option of just capturing a line source (such as from the DI on my bass amp). Bingo. Toss in the Dual Mode, overdub, phantom power, ability to run off USB power, and it is a total winner in my book. When you select the recording format and encoding or resolution (WAV + bit and resolution, MP3 + bit rate, etc)- each setting indicates how much recording time you have for the inserted card. I also love that it uses full size SD cards (microSD can be used with an adapter of course)- they're much easier to label and keep track of than a bunch of pinky-nail sized micros. I'll update this review after I've had some more time with it.", "id": 800}]