[{"review": "I bought this to get the grime and finger prints off of my Les Paul before putting it on eBay to sell. Worked great. Didn't harm the finish at all.", "id": 81}, {"review": "Polishes well. You could probably buy a microfiber cloth from somewhere else and it would do the same thing, but this one works well.", "id": 184}, {"review": "Ernie Ball is the standard for guitar strings. I tried switching to some other strings for a few years such as the GHS boomers and D'Addario. I have to say, I only had a pack of Slinky Strings during my last setup and I'm glad that's what I used because they play great and sound amazing.", "id": 226}, {"review": "I use this amp for playing in my small apartment and it works great. The clean and distortion channels both sound good paired with the Danelectro Model 59 M.", "id": 302}, {"review": "This is one of my favorite music purchases in a while. Cleans up your gear's appearance tremendously. Very easy to use and lots of extra cable length.", "id": 312}, {"review": "This one is probably closer to a $150 guitar. The fit and finish is quite nice but at the end of the day it's just like most of the other made in China guitar. From the reviews I was really hoping this was some great gem for only $200, but I'm not at all impressed. One thing that bothered me is that these guys make everything from guitars to jet skis - which usually means they're a jack of all trades but a master of none.I recently bought a Johnson JG-610-N, a Johnson JG-620-N, a Bristol BD-16, a Jasmine S35, and this Yamaha. If I'd only played the Yamaha I'd probably think it was a pretty nice guitar, but having tried all of these side-by-side I can definitely say it's not at all amazing. The Bristol blows this thing out of the water, and not just because it's $50 cheaper, it plays and sounds better. The Johnson guitars both have a little higher action, not a lot of highs, and a cheaper fit and finish. The Jasmine is nice but I haven't spent enough time playing it to give a true review.The Yamaha FG700GS is definitely neat to look at, and has decent mids, but doesn't really have a great high to low end punch. Now, it it quite a bit wider at the bottom so it has some more body, but, the sound range overall wasn't great. The Bristol has great highs and plenty of deep lows in comparison. Also, the fretboard felt a wee bit thicker on the Yahama, though putting them next to the other guitars it looked about the same.Can't help but think that the reviews here are a bit \"hive mind\" where everybody buys into a hype. Maybe I got a dud guitar, but I doubt it, they're all made in the same factory.", "id": 360}, {"review": "This is perfect. No buzzes, no hums, no nonsense. It's just a simple to use universal power supply for pedals. Save yourself hundreds of dollars and get this. I'm so glad my friend introduced me to this product!", "id": 428}, {"review": "Nice little amp stand. I wish it looked a little classier but i guess it's probably for people that like gigging or a music room. Helped a lot with vibrations in my apartment building.", "id": 517}, {"review": "i'd say these are a pretty neat thing to have in your pick collection. i don't use them all too often because they're a bit too stiff though.", "id": 614}, {"review": "Great little amp, but get a tube amp if you're serious about playing guitar. It will sound a lot better and it's not too much more expensive. Solid state just isn't the same.I'll also say that it's quite difficult to get a natural sound out of this amp without a lot of tweaking. Even then, you won't get a great clean tone. The Fender Champ X2 is a great alternative to the more expensive and desiralble vintage Fender Vibro Champ. Go with Quality and save yourself a future purchase (resale vale is great on the X2 as well).", "id": 718}, {"review": "Just use a smartphone to record stuff. This is a really weird, not very intuitive little device that has been antiquated by the iphone and other smart phones. Not really worth the $75 - I returned mine.", "id": 755}, {"review": "Probably the best kapo out on the market. Very high quality and a sleek look. Easy to use, what more could you want?", "id": 26}, {"review": "These are good, quality strings that will last on your guitar for many months to come. Probably my second favorite after Ernie Ball.", "id": 156}]