[{"review": "Very easy to install, rock solid, and in my opinion, look much better than Schaller locks.Grab a set, you wont be disappointed.", "id": 44}, {"review": "Hold a tune very well, and sound good. The seem to have a bit less tension than other brands strings of the same gauge, but thats ok.If you dont wipe them off after playing, they wont last long. But I always do, and I change strings often, so that isnt an issue for me.Overall, some of the best strings available.", "id": 156}, {"review": "Back plate has a \"greenish\" tint, and is single ply, not 3-ply as advertised.Color wasnt as advertised, its more of an \"off-white\" than a vintage cream. But I guess its close enough considering the price.Shipping took far too long. (Not sure if Music123 or USPS is to blame for that, but Id go with USPS)Besides those minor faults, the items fit well and look good.My 2006 Strat now has the look of a '57, without the huge price tag.", "id": 222}, {"review": "Im using this with five pedals and it works great. No added noise, no signal loss, and saves the cost and hassle of constantly replacing 9V batteries.Comes with a nice assortment of adapters for use with just about any brand of pedal out there.probably not the most durable power supply available, but for the price, it cant be beat.", "id": 428}, {"review": "V5 = 4 starBugera customer service = -5 starsLets be realistic, this is a very inexpensive tube amp. Nothing more, nothing less.Its price reflects exactly what it is, and thats a good thing, and also not so good.First off, the amp shipped with bad tubes. (microphonic)Not a big deal, it happens all the time. But ...Bugera was no help at all, their customer service is by far the worst Ive ever dealt with.They are clueless, arrogant and condescending.I bought replacement tubes and solved the issue, but thats not the point.This experience alone will probably stop me from ever purchasing another Bugera/Behringer product.Now about the amp itself.Its ok, at best. It has no headroom, even on the 5w setting. I realize a tiny combo wont have much, but this thing has nothing.It clips far too easily, and forget about running an overdrive pedal into it. You will only get a muddy, garbled mess.Clean tones are ok, but dont expect Fender type cleans, they arent there.Think of Marshall cleans, or even Vox.The speaker isnt worth the paper its made from.I plugged the amp into a Celestion 1x12 cab (just for comparison) and it was a whole lot better.Its built very well, even compared to many amps costing far more. If youre looking for a \"vintage\" tube amp, but either cant afford or cant justify the price of a good one, you should try a V5.Im the latter, because I only play at home I simply cant justify $1K or more for a good tube amp.The classic overdrive sound of the 70s is all over this amp. If youre looking for a late 60s - 70s \"cranked\" amp stack tone, well, its here. But only if you crank the master and keep the preamp set low.Turn up the preamp and all you'll get is a flat, flubby \"farty\" unusable tone.I love and hate the V5, though the price is unbeatable, its shortcomings (no headroom/horrid overdrive) are hard to live with.You sometimes what you pay for, and in this case, if you want that vintage 70s tone at \"bedroom\" volumes, you cant go wrong with the V5.", "id": 618}, {"review": "Yep, I said it, BETTER than a Tubescreamer.This pedal has a wider gain range, far wider tone range and is much quieter than my mid 80s 'screamer.The only thing it seems to lack is the &#34;smooth creaminess&#34; of an old 808, but I can easily live with that..This is an amazing TS clone, and for the price, cant be beat.", "id": 728}, {"review": "This is supposed to be an Fulltone OCD clone, but to me, it sounds a bit better than the OCD, and worse.Has more low end and a smoother mid that the OCD. Thought isnt nearly as dymanic as the OCD, that may not be a good thing though, depending on your taste.If I turn the gain up past 9 o'clock, the pedal sounds more like a fuzz than an overdrive, and kills the dynamics.Thats a good thing and bad, as I like a fuzz tone, but thats not what I bought the pedal for.Overall I can live with it, its well built, sounds good and the price is unbeatable.", "id": 795}, {"review": "Good quality, seem durable enough. Sure there are better cables out there, but for the price, these are hard to beat.", "id": 805}, {"review": "Very transparent, with great sustain and a hint of &#34;dirty&#34; boost if you crank the knobs to max.Built well, sounds good and does what you'd expect.", "id": 834}, {"review": "Does everything you'd expect it to do, as well as a couple of things you might not like.First, when run before the amp, it adds a bit of treble to the tone, and a hint of distortion.Not to the point of being unusable, but you guys playing with the &#34;Fender clean&#34; tone might notice. I certainly did.Playing with overdrive or distortion makes this issue unnoticeable, as you would imagine.Ive noticed that when using the pedal in an effects loop, the treble boost / distortion isnt there, or at least not noticeable. In my experience, of course, YMMV.Those are minor complaints though, as the pedal works well, has more than adequate delay times (up to 600ms) and is built well.I strongly suggest using this with a 9v adapter, because this pedal will eat a 9v battery in a matter of minutes.Overall its a great deal. No, its not as pristine a delay as a Carbon Copy or Boss DD, but its a fraction of the cost of those pedals, and I doubt anyone but you will notice the difference.", "id": 731}]