[{"review": "i play metal / hard rock and have used many different strings, these give the best tone and depth you need to play hard music", "id": 93}, {"review": "I have had other string winders, but this had the string cutter on it too. It is awesome. I broke a string on stage and instead of having a big floppy string, with just a quick squeeze it looked good. HIGHLY reccomended", "id": 94}, {"review": "I have many expensive cases for my guitars and recently started playing bass,  but not too serious just wanted a nice little case for it. Boy was i surprised, this case is awesome, great quality, fits bass without any problems and the storage inside is great. Definetly reccomend this case", "id": 149}, {"review": "singing and playing menas you dont get to bend down and pick up that pick you just dropped. I loved this holder, its small enough to fit in your pocket and when you go on stage just throw it on the mic stand. loved it but i forgot it at a gig, thats the down side of it being so small, easy to lose, but it is awesome", "id": 210}, {"review": "I ordered 1 just to try it since it was so cheap, the first one arrived in non working condition, wires inside werent even soldered, so i ordered a replacement, plugged it in and it didnt work either, the second wasnt soldered either.I know its cheap, but i expected it to at least work, do not buy", "id": 777}, {"review": "I was excited with how easy it was to set up, and it makes my music room look so much better with guitars hanging up instead of just sitting on the floor or on stands", "id": 779}, {"review": "Very nice tone, very nice metal sound, very crunchy and deep. Well worth it for the price, on par with other way more expensive pedals. Definetly buy the power supply with it though, it just makes it better and easier to use. Very nice product overall", "id": 434}, {"review": "i had no issues with this, got it so i could tune on stage while playing without making lots of noise. works great, does exactly what it says, definetly get the power supply with it, so you never have to worry about a battery. i said but in the headline because i only used it 3 times.", "id": 443}, {"review": "if you have never recorded vocals with a pop filter you don't know what you are missing. This one works well, gets rid of a lot of the little sounds and all the pops. only bad thing is when it doesnt stay in place, but its usually fine", "id": 842}]