[{"review": "When i bought this, i didn't think it was going to be as good as it is. It seemed a little plastic-ie from the photos, so i didn't think it was going to hold up very well. It actually really surpassed my expectations however. The winder itself works quite well, and has slots for multiple-sized tuners. It was a little wobbley on my guitar, but still worked well. The wire cutter was able to cut the thickest guitar string with little problem. For 7 dollars, it's a really good deal!", "id": 94}, {"review": "Well, i just got started playing guitar, and needed a tuner. This thing works well so far, but i didn't have the proper 1/4 inch connector yet to hook my guitar straight into the tuner, which i think would have made it work better. So i used the built-in microphone to tune my guitar. Had no problem with the first through fourth strings, but it had a very hard time picking up the much lower fifth and sixth strings. However, i found that the other strings were very well tuned when all was said and done, and i am happy with my purchase.", "id": 624}, {"review": "I'm a beginner harmonica player, and this was perfect for me! I am able to practice with it easily, and it didn't cost me a fortune as some of the more professional harmonicas are.", "id": 826}, {"review": "To be clear: I am quite the newbie guitar player.After i managed to break a string on my electric guitar, i decided to try and tackle replacing the strings myself, as most guitarists do. Things went alright, but on trying to tune the thinnest string, it broke. I just figured it was something I did, and wasn't the products fault, so i grabbed another string from another pack and that one went on fine. Overall, i've played quite abit with these strings, and have yet to break another one. Pretty good sound quality, and i like the idea that they pack the strings in a moisture-resistant package to prevent corrosion.", "id": 156}, {"review": "There are other guitar straps that are nearly the same quality for half the price. The thing about this one is that it has a pocket to hold a few picks, which is quite useful. I also like the leather ends, because they dont shift and move around quite as much as my old plastic-ey one did. Overall, i think these are abit much for seven dollars, but im happy with the purchase.", "id": 285}]