[{"review": "Recently I switched from a Blackstar HT-5 to a Fender Mustang III V2 amp. Although the Fender is a great sounding amp, you don't get this natural warmth that you get with tubes there's this liveliness that's missing. So, although my cleans sound good, they aren't great. Although my overdrive sounds good... it's not great. Although my distortion... well you get the picture.Since adding this pedal was less expensive than buying a new amp I decided to give it a try. This pedal adds the same kind of sparkle to your sound that you would get from using a clean boost on a tube amp. I believe some people call it &#34;pixie dust&#34; ... that little bit of magic that makes your sound come alive.Interestingly enough, I don't leave this pedal on all the time. But when I stack pedals, or use certain effects like chorus, a shimmer reverb, or any effect with the exception of maybe a leslie... it's pretty awesome.It works different than an EQ... and if you have a tube amp - a clean boost may do the same thing... I think it really adds life to solid state amps.", "id": 300}, {"review": "I use to use a cloth to clean my strings... this now rests in my guitar tech bag as a very useful tool.Easy to open, clamp on the strings, run it up and down and your strings maintain a clean and clear sound longer! The only thing that I worry about is running the plastic over the frets. I understand that it's only plastic, but I wonder if it will decrease the life of the frets over time...I don't know... if I see an issue, I may update this a year or so down the line.Until then? Excellent solution!", "id": 543}, {"review": "I have run sound for several large churches, providing services for both live sound and television broadcasting. The way that you have to mix for each of those is vastly different, especially when applying vocal effects. I have also run a small recording studio for the last 12 years.The 80/20 rule says that if you can get 80% of the sound you're looking for with 20% of the work, be satisfied. This Mic Mechanic (MM) is more like 99% of the sound with 1% of the work.I actually use this more in a studio setting than for live sound. Primarily because it solves SO many problems that you face as a sound engineer.1) Adaptive tone. The MM continuously listens to your voice and adjusts the compression, gate, EQ, and de-essing. Even when recording dry vocals, at a minimum, you should at least set your compression, then in post production, add parametric EQ to place your vocals where they need to be set.Now? I hit the tone button, and all that is done for me. It makes a dynamic mic sound great! It makes working with a condenser mic easier.2) Reverb. Most home recording enthusiasts have problems applying reverb. They either use too much or too little. With this, when you it equally between wet and dry, you get the right amount of reverb to bring recording to life. I recorded a vocal with club, room, and hall reverb. Each one sat just right! When you solo the vocals, you can tell which is used. In the mix it was more subtle. Good Job!3) Pitch correction. I have to admit, my own vocals aren't perfect. When you record your own vocals, and you're like me, you'll hear a \"chorus\" sound in your headphones. That's because you're hearing you own vocals and the pitch correction through the headphones. This takes a second to get use to.When set in the center, you can still do your vocal gymnastics, slide into notes, and it seems... natural. It pulls you to the closest not in the chromatic scale, so if you're way off, it will make your vocals sound out.I'm not a singer, but this has renewed my joy in singing!", "id": 849}, {"review": "If you're going to use this as an insert effect into any amp, the first thing you need to do is turn off the amp model.Although I liked the presets in the MS50G, none of them worked in my rig. The first thing that I did when I brought it home was to make a different single patch for each effect. The big question is &#34;Why?&#34; especially since it's designed to handle up to 6 effects simultaneously. The answer is... I like my overdrive, distortion, and compressor, but I couldn't make up my mind on delays, choruses, flangers, fuzz... and it's always nice to have options for additional over drives and distortions.This is the 4th pedal on my board sitting behind a ModTone Lemon Squeeze Compressor, TC Electronics MOJOMOJO overdrive, and a Wampler Sovereign distortion.I give it 5 stars because it accepts pedals well and it serves so many different needs. Normally, I have it set as just a chorus pedal, but occasionally I use it as an additional overdrive or distortion. It's great to be able to plug in whatever I need and know that the sound quality is going to be great!It takes a moment to level match each patch so the transition is smooth, and at some point I may take the few remaining slots and make them combinations, but as of yet, I really haven't had the need... a great utility pedal and a must if you're just getting started on your pedal board and you're not sure of what pedal you want where. This will help you figure things out... and if you're not careful, it may find a permanent home!", "id": 862}, {"review": "This compact looper sits as the last effect in my effect loop. It doesn't take a lot of space on my pedal board and it's simple to use. I've used the Boss RC-20 and the Digitech Stereo Jam Man. Although the others have more features, I like this little pedal.It took a little time to get use to the one button operation, but I find this to be very reliable. I've owned mine since the day they came out and I have had no issues.", "id": 869}]