[{"review": "Last week I ordered a Guardian Electric Guitar Stand (A-Shape, Black) Price: $10.99 from Amazon based on an average 4-star review.  I read the reviews first and placed the order, for a cheap, collapsible guitar stand for my electric guitars and bass.  When I got the stand and opened it for the first time and tried to put my Fender Jazz bass on it - lol - no way.  Worthless, and it's now holding my son's 3/4 size classical guitar (barely).Undaunted, I ordered this Musician's Gear stand.  Less expensive than the Guardian, it holds my Gibson CS-356 Custom with no problem and I would trust it with any and all of my electric guitars or basses.  The bottom piece that supports the body of the guitar rotates, and that's a little strange (hence 4 stars instead of 5), but with a little care you can put a guitar into it and remove it with little or no attention to placement. For $8, you can't beat it.JM Tepper", "id": 519}, {"review": "I bought one of these for a vintage Fender Showman that doesn't have built in reverb.  Put a battery in and plugged it in.  Very simple.  But the sound was horrible!  No setting delivered an effect that sounded anything like any kind of reverb I ever heard or would want to hear.  The closest I could get was a cheesy delay or echo effect that sounded awful.  On the other hand, the reverb from my Korg AX-100G (that I was using on another rig) was great.  Maybe my DR600 was not functioning properly, but I don't think so.  I think that's the way it really sounds.  So I got a return authorization from Amazon (very easy - never fails), put it back in the box and UPS picked it up the next day and I got a full refund.JM Tepper", "id": 545}, {"review": "This is my first experience with a \"high end\" guitar cord after playing for longer than I'd like to admit.  For many years i've been playing with any old shielded solid core cord without regard for much besides price.  In prep for an upcoming gig, I bought 2 Spectraflex Fatso 18' right angle cords.  I find them to be very well made, with shrink tubing sealed strain reliefs at the high quality plugs, thick and heavy duty cabling (but not too think nor too heavy), and best of all, very quiet, presumably because of superior shielding.  They were what I consider expensive (about $38 each), but for me, well worth the price, and considerably less than many other high end cables I found and read about.  I imagine that they will last for years.  I think I will eventually replace all my dozen or so cords of various lengths with these.J.M. Tepper", "id": 587}, {"review": "I've been playing rock and blues for over 40 years. I've owned a number of amps over the years including a 1960s Ampeg 40 Watt combo, and a pre-CBS 100 watt Fender Showman, and my latest, a Crate 5212 50 Watt tube amp that I bought about 10 years ago.  I also have a small Peavy 50 Watt solid state combo.  The Crate has always sounded great, and it's what I use exclusively in my basement studio, but it  weighs a ton and the clean channel has always had a habit of fading in and out (despite numerous repair attempts), so I've been using the Peavy when I play out.  The last time I did, I was really unsatisfied with the sound and decided to look for something else.  I own a Line6 pocket Pod and love it so I looked into the Line6 amps.When I found that I could get a 75 Watt modeling amp with a looper and a more presets than I could go through in a lifetime for less than $300, I ordered one from Amazon, sight unseen and unheard.  Out of the box I was amazed at just about everything.  The clean amp models are crisp and clear, the dirty ones thick and rich.  The effects that I have played around with so far are amazing, and I cannot detect any difference between them and my digital delay, phaser and overdrive pedals that cost about the same as the whole Spider IV 75. And the thing is loud!  Very loud.  As I get more experience with the amp, I'm sure that I'm going to want to tweak the built in presets to my taste, but even right out of the box the sound is pretty awesome.I'm sure that a lot of pro purists out there would laugh at the idea of a 75 Watt solid state combo with 1 12\" speaker as their main amp, and if you've got $1800 to spend and a roadie, I guess they'd be right. But for the money, the sound, the size and the very light weight (36 lbs) alone make this a fabulous deal. Add in the modeling and the effects (high quality individual floor pedals or rack devices to replicate these effects could cost thousands of dollars just by themselves), and compared to my $750 Crate VC5212, at $300 the Spider IV 75 seems like an almost impossibly large gain in overall function. I doubt that I will use my Crate again (except when guests come to jam).And then the less than good...It doesn't come with a foot switch.  You have to buy one if you want to be able to use the looping in any realistic way and/or take advantage of the 4 channels on the fly, and to upload new firmware to the amp.  And of course you really want to do all if that (and more), so a foot controller is essential.  I opted for the FBV Express Mk II, the smallest and least expensive model with a pedal.  It lets me access all 4 channels as well as the looper and acts as a volume/wah controller.  It was another $100.  It is really essential, so in my mind the price of the Spider IV 75 is really just under $400.And  it doesn't come with any manuals to speak of.  All the manuals are available online for free, but of course you have to download them and print them.  And these manuals are essential to access all but the most basic functions of the amp. If you do not have access to a computer and a printer (I guess there are some people somewhere in the world who do not),I guess you're SOL.  The \"Advanced Guide\" is the essential one for using the amp, and is only 3 pages long. That's too short to explain everything you need to know in enough detail, and it's not particularly well-written. There'a another manual for using the free downloadable software that lets you edit the presets at a low level that is another 21 pages long.  I have not explored it much yet, but I suspect that it will be written similarly.  Once again, if you do not have a computer with an internet connection, there is a bunch of stuff that it is possible to do with the Spider IV 75 that you will not be able to do.My guess is that it would have probably added $150 to the list price of the amp for Line6 to have included a pedal and hard copies of the manual, and at $450, the amp would seem less attractive to many, so Line6 opted to handle things the way they did. Bottom line is still that this is still an unbeatable deal.Very HIghly Recommended.JM Tepper", "id": 620}, {"review": "I was looking for a portable fold-up stand that I could take to gigs and searched around.  Found the Guardian at Amazon and thought for $10, how could I go wrong?  Oops! Wrong.  The stand is sturdy and folds up nicely, but I found it next to impossible to get my Fender Jazz bass to stand up in it.  The lack of an extended support for the neck means you have to try to balance the guitar very precisely against the apex of the stand and pray that no one gets near it or that the wind doesn't blow.  This is OK for a lightweight acoustic that you don't care too much about, but for for an electric guitar or bass, no way.I just ordered a different one with a tripod base and a neck support.  Live and learn.", "id": 625}, {"review": "I'm a guitar player who owns several electric and acoustic guitars.  I learned a long time ago that guitar-like instruments ought to  be hung by the neck, as one finds them in a music store, to minimize neck warpage, and all my instruments are hung.  This is probably not so important for something as lightweight as a ukulele, but I also thought the instrument would double as wall art.So when my wife unexpectedly brought me back a nice electric-acoustic uke from Hawaii, I immediately went shopping for a wall hanger.  There are more expensive ones out there, but this wooden String Swing turned out to be perfect.  Easy to install, holds the uke perfectly, and the whole thing looks great on the wall.  Call me a satisfied customer.JM Tepper", "id": 788}, {"review": "This is an essential accessory for the excellent Line 6 Spider IV combo amps,  For more details, see my review of the Line 6 Spider IV 75 watt combo.  The FBV Express Mk II is the least expensive pedal to give one full control over all basic and essential amp features. This pedal should have been ( or be) included with the amp but it wasn't.  Anyway, if you are considering buying the amp (which is great), you really will want to have this pedal, even though it costs 33% of the price of the amp itself.With the FBV Express Mk II you can store the 4 amp channels, each of which has its own settings for model and all effects, as well as control the 14 second looping ability of the Spider IV.  The pedal also adds a volume/way pedal (the wah pedal is OK but not as full-throated as a Cry Baby or other stand-alone wah wahs).  Without the pedal, you will not be able to access looping and channel switching in real time while playing (which is the whole point of this thing) unless you have more than the standard compliment of 2 arms, equipped with one  hand each.The pedal also interfaces with a computer to allow deep editing and storing of all of the effects of the Line 6 Spider IV combos through a USB port.  This feature alone makes it a must-have for taking full advantage of the amp.J.M. Tepper", "id": 621}]