[{"review": "This pedal, used in conjunctions with a host of others on my board ('The Labyrinth'), does what it claims to do and more. It seriously boosts the instrument signal from my Tele at a mere 50% level setting and makes the subsequent MXR Distortion + pedal crackle with goodness and increased sustain. I've purchased a host of Behringer guitar pedals during the last year (used, I might add) and am happy with every single one of them. Don't let the cheap price fool ya. I've been using all manner of guitar pedals in my work since the 1970's - yes, I'm \"old\" -  and these stack up against anything similar that more expensive manufacturers have to offer. I'm just glad that I'm getting most of them for under $50 before the world figures out how reliable they are and Behringer jacks the price of everything. Oh yes, I use a OneSpot 9v multi-adapter to power everything, so I cannot comment on how quickly these pedals plow through batteries. GOOD STUFF!", "id": 382}, {"review": "For the money (CHEAP!), this is worth getting. The loop feature is quite good, the delay/echo entirely satisfactory. Not as good as, say, a BOSS unit, but they cost 5x as much. Great for everything from slapback to long delay, with heap-big repeats available. The plastic housing might not stand-up to the road. Having the 9v adapter input on the side behind the in jack, rather than the back, seems wise. I've read some negative press about Behringer pedals, but personally cannot complain.", "id": 488}, {"review": "This inexpensive pedal kicks ass, provides everything from subtle spring reverb to VAST cathedral-like reverb. The 'Space' setting is unique in that it adds an interesting modulated overtone a couple octaves above the sounded note, providing a strange harmony. Some people pick on Behreinger because they're stuff is (still) cheap. I admit that two of their pedals (of the 10 that I have bought) underwhelmed me. This one is a keeper!", "id": 508}, {"review": "I've been using and abusing pedal effects since the 1970's.  [...] , running all sorts of things through them, chaining them in all sorts of configurations, and have endured many 'wall wart' pedal meltdowns over the years. I said all that b/c I don't want to come off as condescending. I've learned that the single most effective way to power pedals properly is to have an infinite number of 9v batteries, or to be very careful to match pedal inputs with correct adaptor outputs. Check the polarity of the tip - is the tip positive or negative? You'll fry a Boss pedal in a flash if you plug a hot positive tip into one. Make sure the polarity matches (most pedals want negative tip adaptors, except Digitech which want 1/8\" plugs). Make sure the voltage matches. A 3v adaptor into a 9v pedal won't power it. Checking that these things are right will save you some $, and some of the Behringer pedals (I use about six of them on my board...see product links) are \"polarity fragile\", and will break right away with the wrong adaptor. I fried a BBE delay the same way. Happy Effecting!!Behringer SM200 Slow Motion Effects PedalBehringer DD400  Guitar Delay Effect PedalBehringer CS400 Compressor Sustainer Ultimate Dynamics Effects PedalBehringer ADI21 V-Tone AcousticBehringer PB100 Preamplifier/Volume BoosterBehringer PH9 Classic 90 Phase ShifterBehringer US600 Ultra Shifter/Harmonist Ultimate Pitch Shifter / Harmonist Effects PedalBBE TWO TIMER DUAL MODEDigiTech DGR Grunge Analog-Distortion PedalElectro-Harmonix Micro Q-Tron Envelope Follower PedalJim Dunlop M104 Mxr M104 Distortion +DigiTech RP155 Guitar Multi-Effects Processor", "id": 509}, {"review": "From the product description, I expected something far more robust than this unit. By and large, I've had great experiences with Behringer pedals, but this reverb unit is the wimpiest I have ever used in 40 years of playing - no stronger than the reverb in a 5w First Act amplifier.", "id": 545}, {"review": "if all you want is amp-like vibrato and chorus, here ya go, and it's cheap and cool looking (bigger footprint than a Boss pedal). The 'Hue' control gently affects the tone.", "id": 551}, {"review": "This is the best octaver I have ever played through (I bought my first one in 1980), and you would be a dope not to get one now before they become expensive. THREE umm... density/timbral/tonal choices [chorused, only octaved signal, 50/50 mix clean-octaved signal] PER setting, which ranges from -2 to +2 octaves. Quiet and tiny footprint. You'd be dumb not to get one while they're cheap.", "id": 850}, {"review": "WOW! If you want 5 minutes of no-nonsense, clean looping and overdubbing,...the tc electronics DITTO pedal will not disappoint! I have been exploring the fringes and outer limits of guitar FX for over 30 years and this one has, in just two days, become one of my Top Five 'Gotta Have' effects. It is so simple that a five year old could make great loops, and it add ZERO addition sound to your signal. Placed at the end of your pedalboard, which is easy to do because of the DITTO's tiny footprint, the possibilities for live stunts and grooves is mind-blowing. And you can't beat the price. I've uploaded a 5m workout that I recorded on my 2nd day using the DITTO if you'd like to hear it - a solo improvisation for Telecaster and reverb. [...]", "id": 869}]