[{"review": "I have had several MXR pedals through the years ... I have always found their quality to be very good for the price ... in fact, some of their pedals exceed the competitors' products for less than half the price ... (to each his own and certainly there are higher levels of quality out there but just because it is priced more doesn't mean it is that much better)If you need a little tone sweetener, this pedal can deliver ... with flatter EQ's it is fairly noiseless ... but as with all EQ's, if you boost certain frequencies pretty high, you will get some noise ...Simple to use and I particularly like the lighted LEDs for each band ... this feature makes this unit a good choice for the stage ...As with all MXR pedals, it is built solid and road-rugged ...For the price, this is a nice pedal, simple to use and built to last", "id": 182}, {"review": "Compression/sustain wise, this unit is decent but I cannot abide the noise ... I tolerated it for a while but wound up pulling it for a cleaner compressor ...", "id": 186}, {"review": "This thing will test most all the cables a musician will use ... rugged, reliable and simple to understand ... for the price, it is hard to beat ...", "id": 318}, {"review": "I wanted to use these cables for my acoustic/electric guitar.  They are a little short for that appicaton (my fault though).  They seem to be built well but I'd say in comparison to other cables I've used for my applicaiton, the sound is average.  These will work in many applications and might be satisfactory to most.  If you are a performing musician, you would do better to look at higher quality cables for best sound quality and lowest noise.", "id": 591}, {"review": "I really like this tuner.  I have always liked the Planet Waves tuners for ease of use and accuracy.  This mini tuner takes all I like about the larger Planet Waves model and makes it ultra compact.  It fits nicely on smaller intstruments such as mandolin and any instrument with headstocks that don't readily accept the larger tuners (banjo, Telecaster etc.).  I currently have 2 of these and find them very reliable and accurate.  Easy to read.  Easy to see.Another winner from Planet Waves.  (almost forgot to mention one other thing that is nice about this tuner is its stealth ... it can hide behind the headstock so you won't be concerned with it being always clipped on and it won't interfere with the look of your instrument).", "id": 785}, {"review": "If you are an electric guitar player, you know how it is ... you think you are finished with your pedal board but in a few weeks you are back at it searching for another effect ... but this means trial and error and a busy wallet ... the solution may be this Zoom MS50G ... this unit is like having 50 stompboxes to use on demand without having to change out your board ... here are some the things I like most about this pedal:1) Small footprint; same size as most single stompboxes of today2) The digital effects are very, very good .... most have an almost analog quality to them3) Ability to create and save your own patches, ordering them for stage use4) Good tuner included; I found it to be very accurate and easy to use (if you already have a tuner, then you can open up another slot!)5) Great price ... considering 50 effects, this thing costs no more than a single stompboxThe unit is pretty easy to use once you get the hang of it; however, I will say it takes some work to get a handle on everything and the manual isn't a great deal of help.  But with just a little work and resolve, you'll be dialing in some new sounds.I have been very pleased with the capabilities and the sounds from the MS50G ... Zoom has a reputation of creating quality effects units at very reasonable prices; they've done it again with this pedal ... I highly recommend it if you have one slot on your pedal board but don't know which pedal should fill it ...*one thing to note that was frustrating at first:  most of the OD's and Distortion's are preset with the levels way too high for output to a tube amp ... once you put these pedals in your own patches you can permanently save them with appropriate levels ... just be prepared to cut the levels down right away when trying out OD's and Distortions or you will likely get some very unpleasant feedback ...", "id": 862}, {"review": "Well, MADE by Elixir and DEVELOPED with Taylor Guitars ... these strings were designed for the new 800 (Rosewood) series guitars that came out this year (2014) ... the promise is a &#34;bolder high end, fuller low end&#34; ... I am a long-time Taylor owner and favor their 800 series (Rosewood/Spruce is my favorite combo in tone woods) ... I have almost always used Elixir Nanoweb Phosphor Bronze lights on my guitars ... I like not only the tone but the feel and longevity of these strings ... I have never had any issues with Elixir Nanowebs ... I recently picked up an 812ce First Edition 12-Fret ... such a fine instrument and it came with the Elixir HD's ... took some getting used to as far as feel (due to the slightly higher gauges of the treble strings - E, B & G) ... but as far as sound, they are great ... the D, A & low E strings are no different from the regular Elixir PB Lights so I am not sure about the claim of &#34;fuller low end&#34; ... compared to what?  Unless the extra string tension of the treble strings also contributes to a little more bass response ... I am not sure how these strings will perform on guitars other than Taylor's but what anyone should notice is more volume and clarity from the treble strings ... that is what I notice most from the HD's compared to the regular ... I still find no fault with the regular Elixir Nanaweb PB's but will most likely continue to run the HD's on my 12-fret ... I may also try them on my older 814ce just to see if there is any difference/improvement ... so far I find the set well balanced with good clarity and sustain ... try them out and make your own decision ...", "id": 899}, {"review": "This is a very simple boost with a small footprint that fits nicely on the pedal board ... I like the simplicity and the ability to set the dip switches to my liking ... I find that with humbucker pickups it adds just the right, very slight tone coloration that both fattens up the sound and gives it just the right sparkle ... I don't use it much with single coils since they don't seem to benefit as much from the coloration or the treble boost ... it is a good pedal to have on board when you need that little something extra to get the right tone ... built solid ... a quality pedal that should hold up well ...", "id": 643}, {"review": "I am a long-time musician with lots of experience with tuners and stringed instruments ... wanted to like this ... but ...First the positives:- Looks great- nice, easy to read display- the screen pivots in almost every direction to suit your needs- the clip seems sturdy- tuner is compact- nice priceNow the significant disappointment:- inaccurateThe settings were on A-440 but every time I tuned an acoustic instrument with this thing, the tuning was sharp ... I tested this not only by ear but against other tuners ... very disappointing ... I have used the old Planet Waves tuners for years and had settled on them as the best choice for the price; however, since D'Addario now owns Planet Waves products, they have discontinued the tuner I like and only offer the NS Mini Tuner (it has its place I guess, but I much prefer the larger one ... too bad they made this decision IMO) ...I haven't settled on my new tuner of choice yet so for now I will keep using my old Planet Waves models ...Bottom line, no matter how nice the Snark is in many ways, the primary function is to help the musician tune accurately, not only string to string but to a standard A-440 ... having failed that requirement, it is useless for me, especially in a band situation ...", "id": 762}, {"review": "I am a long-time musician who has been through a lot of capos; some that I hope to never see again :) ... fortunately, things have changed for the better ...What serious guitar players have always needed is a capo that is smart and small, durable, quick change, one hand operation that also has the right tension to make sure there is no string buzz or detuning ... for a while, you could get quick change or tension adjusment, but not both in the same capo ... the last several years have seen manufacturers attempting to provide these key features in one acceptable capo ... now there are many choices out there at various price points and frankly, it gets confusing ...So why this particular capo?  First Planets Waves is a name I have come to trust to provide quality accessories at reasonable prices ... this NS Tri-Action Capo is built sturdy but it is very light and unobtrusive on the guitar neck ... one-hand changing is a cinch and it has a well place adjustable spring tensioner ... so far, this capo covers all the bases in a simple design as well or better than anything else I've tried for the price ...One thing I did not expect is that, because of the design and tensioning, I can use it on Tenor Guitar, Banjo and Mandolin as well ... while I prefer a smaller capo for these other instruments, in a pinch, I can just clip on the NS Tri-Action and keep playing ...I am the kind of guy that when I find something in the instrument world that works, I stick with it for years ... it is possible that this capo may become my favorite ... I just really like the look, feel and features of this smart design ... looks like Planet Waves hit the mark once more ...", "id": 843}]