[{"review": "The Beta 58A along with the original SM58 are industry standards, that's well known. As a general purpose workhorse for live vocals they are by far the most popular tools out there. Quality venues throughout the country commonly stock these as their go-to house mics. In fact, I noticed Betas all over the place at a small theater (with a high-end system) that I played at just recently.I had used the old 58 for years before moving to the Beta and there is certainly a noticeable difference between the two. The Beta is definitetly hotter, with a more sensitive response. Your vocals will cut into the mix strongly and with more clarity than you might be used to. Mids and highs are picked up perfectly when singing a few inches away and there is a subtle low frequency roll-off to avoid that boomy, muddled sound you typically get when hitting low or quiet notes up close. You definitely need to stay within a close range though as the pickup pattern is very tight. This is a good thing because extraneous noise and feedback is effectively rejected.\"Built like a tank\" is probably a bit overused when describing products but Shure's vocal mics truly earn that title. They can take an enormous amount of abuse and never falter. Toss it around, drop it, bury it under other stuff, etc., NO problem. When you are maintaining a bunch of music gear, it's nice to have tools that you never worry about. For that reason, I'd highly recommend getting a used one if you can find a deal. Chances are, its in working order no matter what.", "id": 23}, {"review": "I've been using these 2.0s as my primary pick for years now and I love them. The way the material surrounds your finger tips is unique and not found in a flat pick. They're very easy to keep a grip on and allow you to go after the strings confidently.You will however find that there is a sweet spot in the life of the pick's tip. When you first use them the business end is extremely pointy, sharp almost. After playing a bit, the tip begins to round off and is perfect for a long time. Eventually, it really rounds out and you'll want a fresh one. I typically lose them before they wear out and they are so nice, you won't care.", "id": 66}, {"review": "I've been using Nanoweb and Polyweb (no idea what the difference is) Elixirs consistently for years now on my Martin Jumbo Cutaway.I periodically try out other brands whenever I see something that might compete, especially when another \"extended life\" or \"coated\" string is released. I would happily bail on Elixir at $13 a set if someone offered a cheaper option that worked as well. In fact, I was quite optimistic about the $9 D'Addario EXPs until I heard their tone begin to evaporate after a few days like any other string. Nothing that I've used up to this point has gotten close to challenging the quality of the mighty purple box.The sound you get from these on Day 1 is crisp and beautiful as expected. That's not where Elixirs kill the competition though. It's after 20 hours of play that they show their strength. You will still hear fresh, bright tones from them when any other set would have already crossed into the dead zone. In fact, I typically start breaking them before they begin to sound too dull. I play relatively aggressively and use palm-muting constantly, allowing skin oils to eat right through the strings at the bridge.Saying that the tone lasts 3.5x longer (as stated on the box) might be a stretch but there is no question that you get at least double the life out of these at less than twice the cost of alternatives.If you are an occasional player or a music shop owner, these are a no-brainer. The coating is extremely effective at combating the effects of time and oxygen exposure. For the everyday, aggressive player you will simply get better tone and longer life.One nit-picky point of criticism: the packaging is an issue for me. WHY would any manufacturer still utilize tree-killing paper envelopes that allow strings to get stale? I'm seriously asking! I've got to be missing something here. A shred of plastic sealed around all 6 strings is greener, more cost-efficient, and it keeps the strings fresh (thank YOU D'Addario, I'll never leave your electric strings). I would happily buy Elixirs in bulk if I had faith in their shelf-life. Complaints about these snapping prematurely are probably valid, happening when someone gets a set that's been sitting around for a while. Think of them as a perishable and buy them from places that move a lot of units (like Amazon :)", "id": 103}, {"review": "I ordered one of these because I like my other Planet Waves Capo a lot (I believe its the older metal version of this, not the &#34;Lite&#34;). However, this one just does not screw down enough to hold down the strings, especially down at the lower frets where the neck is a little thinner (on a Martin jumbo acoustic). It will barely bend the strings down behind the fret but not enough to prevent buzzing. Your fretting hand will naturally push the capo back and out of position quite easily when playing open chords too.I'm not sure why the plastic version has this issue when it appears to have an identical design to the old metal one. It doesn't seem defective as no parts are bent or missing as far as I can tell. Unless I just happen to get one with a shorter than normal screw, I wouldn't recommend it for any guitar without a thick neck.My recommendation is the classic Kyser capo thats more dependable and quicker to apply and remove (it also attaches to your headstock effortlessly when not in use). If you are looking for the screw-down style, I would look for the older version of this and avoid the &#34;Lite&#34;.", "id": 304}, {"review": "I decided to try out the M5 in order to add some more effects options while replacing a tuner and analog delay on my pedal board. While I haven't explored all of the sounds yet, I have found some useable ones.You really need to start off by finding and dialing in the effects you like and creating your own presets. Flipping through all of the categories and individual effects is not really practical for any live performance situation. Also, factory settings are almost never where you need them to be on these devices because the source signals from different instruments vary so much.Here are some that I've personally found to be appealing so far:Delay: Analog w/Mod- a nice sounding Memory Man style delay once you dial it in to not overwhelm your source signalReverb: Room- standard adjustable digital delay, not truly authentic by any stretch but does the trick when played over other musicEnvelope Filter: Tron Up- a Winner! fully functional and authentic envelope follower, FUNKY!Synthy: Seeker- a very cool filter for single guitar notes.Octave: Bass Octaver- One note below only but quite effective especially for loopers.You will also find (as expected with a multi-effects pedal) many unpractical, downright silly-sounding noise makers. Not to say you won't find a use for them here or there but they really exist as filler unless we're talking about a 4:20 headphones session ;) Also, don't depend on any strong distortions from this unit unless you're using it as an addition to your amp's lead channel.Construction seems pretty sturdy other than the \"Model Select\" button which is a multi-use knob with push-down / turn action and is cheapy-cheap. It's awkward and uncomfortable to use, fortunately you only really need it while setting the unit up. I already dislodged it from its proper vertical position once while making presets.Having the choice between True-Bypass and DSP is a really nice touch (and unheard of on stomp boxes) as people have different needs here depending on your signal chain.The tuner is quite functional if a little tough to read from standing position. I do miss my KORG Pitchblack with its big bright display but this one does the trick and saves me another pedal connection.I personally wanted things like octave, envelope, phaser, etc. available to me on stage without having to buy and wire in all those pedals for occasional use individually. The M5 is serving that purpose. The sounds will probably not cut it for the audiophile or analog purist. They should also not be depended on as any basis for your overall tone. Just a large bank of fun accents to add here and there in a very manageable and affordable package.", "id": 756}, {"review": "I've been using a standard size Pedaltrain for years and was tired of the adhesive on the pedal side of the Velcro strips inevitably coming loose after being moved around a bit. I use it to keep 3 pedals in place: a Line 6 M5, a Seymour Duncan Twin Tube Classic, and a Live Wire A/B Switch. The first two are pretty heavy and bulky. I needed something substantial to keep them in their spots especially during transport in the case, being carried vertically, with other electronics and a bunch of cables on top of them.I decided to try out the Power-Grip and have been extremely impressed. First, I stripped the old Velcro stuff off of the pedals and board and cleaned the surfaces thouroughly. It all came off pretty easily. I then applied one strip of Power-Grip to each of the bottom 2 panels on the Pedaltrain and individual pieces to the bottom of the pedals. I then let everything sit for 24 hours as recommended.After attaching the pedals, I was amazed at how well everything was secured. The pedals are only being held by the one strip on the higher panel, the other strip is just padding under the bottom sides of the pedals to prevent metal-on-metal abrasion. However, you can confidently hold the whole thing vertically and shake it aggressively without anything going anywhere.I also appreciate that you can pull pedals off of the board to move them around (with some effort) and the grip will release without the adhesive budging even a bit.The grip also bonds to itself, unlike Velcro where you're keeping track of male and female tape when replacing it.I would recommend following the manufacturer's instructions and applying this stuff to clean, hard, non-porous surfaces. I've heard that the adhesive doesn't work on rubber, wood, etc. Many pedals have rubber padding / feet on the bottom but I've had no trouble prying that stuff right off before putting the tape on.You will appreciate the stability, security, and convenience this stuff provides. Get a few rolls as a meter doesn't go as far as you'd think.", "id": 765}, {"review": "For $13, its hard to say anything bad about this gadget. It's accurate in any sound environment, easy to read in any light, very portable, and will tune any stringed instrument. The visual metronome with no click or beep is pretty useless but that's a silly extra that doesn't interfere with anything so no problem.", "id": 811}, {"review": "I've been using Finger Ease for years and always will on my acoustic and electric guitars. It has multiple uses:-Cleans off residual oils and buildup from your hands, extending the life and tone of your strings-Lubricates strings and neck for faster and smoother playability, though this effect does typically wear off after an hour or so-Works decently well as a polishing agent to rub off finger prints, etc. from the top, sides, and back, will not harm most finishes (as far as I know)I usually just apply it before playing but using it after could definitely be beneficial as well.I did read that the compound is conductive and should be kept off of your pickups to avoid interference. I'm not sure if this is true as I've never noticed any problem when the spray gets on my humbuckers. However, I typically try to keep it off of electronic  components in general just out of common sense.For under ten bucks, the can will last you awhile.  Just order a few at a time and find free shipping, you'll find yourself wanting one in each guitar case all the time.", "id": 173}]