[{"review": "My axesEpiphone LP Studio deluxe plustopFender MarauderTakamine G320Squier Standard StratSquier Standard PJ bassBeen playing 20 years.I had a Squier bullet and it was a cheap guitar I didn't care about that I could keep next to the couch to play rocksmith with. But it got old and I wore the frets out so I needed a new cheap guitar for rocksmith. I picked up the LP special 2 in black at Guitar Center for $130 and they kicked in free strings.Bought it for a game, but soon found myself using it more than my other guitars because it sounded so good, played so well, and had a killer tone.My LP Studio had it's pickups replaced with the Zakk Wylde 81/85's which made for good metal but it lost some of that bluesy tone that passives have. Imagine my delight when my inexpensive epiphone had great sustain, tone, and playability. Considering this thing is almost the same prices a Bullet Squier, it is easily twice the guitar for that price. You literally cannot find a better guitar for $150 than the Special 2.....Sound: 5/5Two passive humbuckers have a great sound with glossy highs, deep lows, and they put just the right amount of dirt on a tone for a gutsy clean or distorted sound.The pickups were wax dipped and did not have the microphone feedback effect.The pickups are high output and feel like AlNico more than Ceramic. Not sure which they have.So much sustain for a bolt on neck. I was shocked.Build Quality 4/5I did have 1 problem with the high E tuner. I didn't notice in the store but the string peg was 1/4\" up out of the headstock. When I discovered this I loosened the string, whacked it with my fret hammer and it popped right in and stayed that way.Intonation required no adjustment.Action was exactly the way I like itNeck was straight with no fret buzz or excessive bow.The finish was perfect. No nicks, blemishes, just oily black goodness.Neck was flush with no gaps or seams, and professionally shimmed. Damn good for a bolt on.Hardware is typical for the price but does the job, stays in tune very well.Back bending headstock and 3x3 orientation mean no string trees which makes tuning much more stable.The bridge is similar to my LP Studio with the tunamatic setup. Individual strings may be intonated but action is done with two nuts, IE can raise one side higher or lower but not individual strings.Weird having the toggle between the volume knobs but I soon got used to it. No pickguard and it doesn't need one. Lots of relief between strings and body. You won't find yourself hitting the pickup housings or body with the pick. Makes it easy to clean too!Truss rod is behind a nice body color plate.Frets were smooth, rounded, and played nice. Could use a little buffing for silky smooth but not rough.Neck plays fast but the nut took some getting used to. I would catch it on my hand when fretting at the top, soon got used to it and it wasn't an issue.500k pots and side body 1/4 TRplug keeps the cable out of the way.Overall 5/5Came with hex keys for setupCame with an awsome poster with all the Epiphone guitar modelsCame with a nice bumper stickerNo manualBody was packed in foam shroud with foam blocks, about the same as any other $150 guitar.Summary: This guitar is the best bang for the buck of any instrument I own. It sounds good enough to gig with out of the box. IT's well built, plays well, and if you treat it well it should give you years of great music. The frets are medium jumbo's and a little deeper than a fender meaning they should last longer before needing re-fretting than a typical Affinity or Bullet (2 squiers in this price range).I would say this guitar is suitable for all styles of music. I did blues, metal, country, and pop. The pickups are humbuckers which means they are darker and higher output than a Fender, not as much of those nice Fender bell like tones and chime but it makes up for it with power and clarity.One thing I like about Epiphones and Gibsons is the volume pot is not close to the bridge. This makes it VERY easy to palm mute and play with high gain. I lay my pinky and the knife edge of my hand lightly across the strings right where they hit the bridge and it makes a nice mute but on my Strats the damn volume knob is in the way.As an experiment I took the pick up pole scews out of the bottom pickup to see if I could get a single coil sound out of it. What happened was a mess because of the parafin wax which got EVERYWHERE. The tone was a little brighter and output a little lower, still no hum but you wouldn't fool anyone into thinking it was a single coil. I ended up putting the screws back in.I will likely put my LP Studio stock pickups back in (hell yeah coil tapping here I come!) and move my EMG 81/85's in this LP Special 2 and make myself a nice little metal guitar.Do yourself a favor, buy this guitar even if you already have a better guitar. It's cheap enough that you won't care if you bang it around a little, and good enough that you will enjoy playing it for many years.", "id": 31}, {"review": "Cheaply made and thin leather leave a lot to be desired. At least it's long enough for even the lowest slung of guitar postures. This should accomadate a bass as well due to the extra length.I am comparing it to $10 guitar center straps which have double leather ends which are much sturdier than the ones on this Ernie Ball strap, which are thin and single ply. I wouldn't trust this strap without a strap lock.", "id": 74}, {"review": "The winder makes a loud and ear piercing squeaking when winding fast. I tried unscrewing it and putting a little oil on the screw head but it didn't make much difference. I hope it goes away with use.The string cutter works like a champ. I was using a set of flush cut nips but they kept getting bent trying to cut the hard nickel and steel of guitar strings. These work much better. They don't cut the string they shear it off. I've done 3 sets of strings and no noticable wear on the cutter.", "id": 94}, {"review": "Not a drop in replacment for many Fenders. I installed these on a Fender Marauder and needed to drill holes in the head stock. You can't see it really well in the picture but there is a metal plug on the bottom next to the screw hole that needs a hole to fit into.I sweat some bullets and used the smallest drill bit I own, and stuck a piece of tape 1mm from the tip so I wouldn't drill too deep. It is important to make the hole STRAIGHT in line from the screw hole so they don't go on crooked. I also had to drill the screw holes about 2mm deeper because the screws that come with this go deeper into the headstock.Now that they're installed I can attest that the guitar holds it's tune better and it's easier to tune. Before it would not respond for many pegs until twisted too far then it would suddenly break lose and be too sharp/flat. That happens far less now.", "id": 115}, {"review": "I have 7 guitars in my cramped little bedroom studio and I quickly ran out of space to hold them easily. Floor space is dominated by my desk and drum set and I wanted my guitars to be out of the way and safe so they didn't get tripped over or dinged. Enter the String swing.I have 7 of them and I have hung everything from a Fender bass to a takamine acoustic with no trouble.The Y headstock holder pivots to accommodate asymmetrical headstocks like a Stratocaster. Just slip your headstock into it and the weight of the guitar finds it's own center of gravity.The base plate is an attractive open wood grain and looks like hickory. I didn't use the supplied wall anchors and instead drilled directly into wall studs.These are well worth the cost.", "id": 166}, {"review": "It's oil....what more do you want?Turn upside down, squeeze hard, use your &#34;man&#34; level strength and soon the tip will darken, apply liberally to your fret board in a back and forth motion. IMMEDIATELY wipe your fret board clean just to take the wet look away. Let sit for a few hours then dry rest of the way rubbing with cloth.It's okay to soak the wood as long as it's momentary. Don't saturate the fretboard and walk away, wood absorbs oil, too much oil absorbed = fretboard wood becoming swollen and buckling, losing shape and flatness. Not a good situation.Lemon oil isn't like other oils, it isn't very slippery and kind of makes things grabby. It's oil but it actually works more like a solvent, cleaning things and making them sqeaky clean....like your frets...hint hint.Just be sure to buff off all the excess and put a little string lubricant on your frets before you re-string and you'll be a happy camper.", "id": 234}, {"review": "They were a little too much for the Squier Bullet I put them on, even with the truss rod maxed out they bowed the neck.While I had em on though they played well and bent relatively easy for their thickness. More metal moving over a guitar pickup = hotter sound, more gain, and on a Stratocaster more glass and bell like tones.I've used Ernie Ball's Slinky line of strings almost exclusively for decades. They never break, they stay in tune after stretching, and they sound great. Lots of harmonics make for a textured and musical sound.Fun fact: Get yourself a mandrel for sizing rings and you can turn your old guitar strings into custom made jewlery. There is something to be said for giving a pretty ring that used to make a pretty sound RINGing out of your amplifier. :) A little silver lead free solder to hold several windings together and then buffed and they look excellent. :)", "id": 239}, {"review": "The good:InexpensiveContains most of the hardware you need, drum mounts, etc.works with 3/8 or 5/8Has a carrying caseThe kick mic has a good low frequency responseThe bad:Has locking clasps with included keys, that are too big for the key holes.Does not contain any of the cabling and you will easily spend as much on that as you did on the microphonesNo instructions on how to use the mounts, or little things like you can use plyers to remove the 3/8\" adapters from the mountsKick mic needs a mic stand, one is not providedThe ugly:The two condenser microphones are incredibly sensitive but at the cost of an incredibly high noise floor. There is a ton of hiss at any level setting and it will make your recording sound like a 1/4\" casette tape unless you EQ out all of the highs on the condensers to kill the hissssss.", "id": 689}, {"review": "Love these things.I feel a little guilty because I put a pair on my Epiphone Les Paul plus top. I also have them on my Fender Marauder and now I can easily swap straps between guitars and I'm secure in the knowledge it's not going to land on my foot.Yeah you could put one of those plastic Dunlop pick looking things on a regular strap to keep it in place but these look and feel so much cooler. They use a quick connect of the kind found in natural gas, and compressed air connectors. Pull up on the locking ring, slide it on and release.", "id": 682}]