[{"review": "I'm primarily a guitarist, but I keep an inexpensive SX bass around for when I'm self-recording and whatnot.  Since it isn't my primary instrument and I don't play bass live (well, not yet), it never made sense to invest in a bass amp.  I bought this to liven up the tone when recording, in the hope of removing some of the sterility of a bass plugged directly into a firewire interface.  It does the job; makes the sound warmer and more amp-like.Honestly, if you've been doing some homework about this thing, you should know what to think of it.  Behringer's build quality can be dubious sometimes, but overall their stuff produces sounds that should satisfy anyone who isn't a picky audiophile.  This box is no exception.  I've never personally played through a SansAmp, but I would hazard a guess that if you KNOW that's what you want, this won't satisfy you.  If you want something LIKE a SansAmp you could do a lot worse than venture the 30-some bucks on this little box.To my ears, it sounds quite good.  Get it if it fills a need for you and you're broke.  Knocked off a star for Behringer's usual build quality, although mine hasn't broken from gentle use yet.", "id": 378}, {"review": "Look at this pedal.  Look at what it does, and what it costs.  $30 for a tuner in a pedal form factor, and that's if you don't even try to hunt down a lower price.  By contrast, Boss's TU-2 is essentially the same thing in a more durable housing, and it costs $100 retail.Yes, the housing is made of plastic.  I don't know about you, but I generally won't be leaping with both feet onto my tuner in the middle of a set.  If you treat your gear with any respect whatsoever, it should survive.  And if it doesn't, so what?  It's cheap to replace.The other person on here obviously got a faulty model, which happens.  Mine's developed a touchy input jack over time (it's actually the earlier TU-100 model), but I don't know that it's totally unexpected on a pedal this cheap.  One star off for these kinds of quality control problems, just to be fair.  I own three other Behringer pedals as well, and they're still going strong.A tuner is an essential part of any musician's rig, and this does the job just fine.  Use the money you save towards buying a really nice stompbox that will actually affect your sound while playing.UPDATE: After having used a new tuning pedal for some time, I will admit that, yes, this is a subpar tuner.  However, I still stand by my original opinion that for the amount of money you pay, this isn't a bad investment.  For a guitarist just starting out, this would still make a good first tuner when you really want to spend your money on pedals that will affect your sound.", "id": 443}, {"review": "This is pretty much the ideal tuner, as far as I'm concerned.  It's true-bypass, brilliantly visible and easy to read on a dark stage, accurate, small footprint, durable, powers all your other pedals, and is under $100, especially if bought used...its virtues are many and varied.  If you've been using a cheap crappy tuner like I was, you'll notice the difference all the more.If you want a hyper-accurate tuner for some kind of technical work, the Pitchblack's tolerances might not be quite what you're looking for.  But as far as stage tuners go, it's got a tighter tolerance than the Boss stompbox.If you want a buffer in your chain, this pedal won't supply it, as it is true-bypass.If you want to hear your strings ringing out while you tune, this is not the pedal for you.  The output is muted while the tuner is engaged.  I prefer not to make my audience listen to me tune, so for me this is a non-issue.  Plus, I like being able to use the pedal as a killswitch.These are the only circumstances I can think of where there might be a valid reason not to buy a Pitchblack right this instant.EDIT: After some time with this pedal, I've noticed that when used to power other pedals, some of them don't like being daisy-chained from this pedal's power output, most notably tremolos.  But when the daisy-chain cable is connected straight to the power supply and the Pitchblack is powered like any other pedal, the problem vanishes.  Kind of strange, and I figured worth noting here, but I don't consider it enough of a problem to take any points off or recommend this box any less.", "id": 504}, {"review": "As a disclaimer, I am not a Big Muff connoisseur.  I've never owned one before this.  I also tend not to like fuzz as an effect.  I'd characterize this box as a cross between distortion and fuzz, maintaining enough definition for chord work.  If you're reading the reviews, you've probably already done your research on the features, but I'll cover them anyway.Three simple controls, Volume - Tone - Sustain, with the Sustain control being more or less a Gain control.  The enclosure is a smaller, pedalboard-friendly size.  The pedal incorporates two of the (supposedly) most popular Big Muff mods with switches, Tone and Wicker.  When Tone is switched off, the Tone control and its tone-shaping circuitry are completely disconnected.  In this mode, the distortion applies to the entire tonal spectrum evenly, and it also produces a significant volume boost.  The Tone knob does nothing.When Wicker is switched on, it removes three high-frequency rolloff filters that were added to the original Big Muff circuit to smooth out the sound.  Disconnecting these makes the sound a bit raspier and rougher, with a high-end frequency boost.I use this pedal running into a mild overdrive, the Catalinbread Dirty Little Secret, which \"conditions\" the signal.  I play with the Tone off and Wicker on, and even with the Volume and Sustain controls set fairly low, this combination results in a wonderfully thick, massive distorted tone that is still pretty smooth.If you're looking to get a Big Muff, and you're not a snob about which version, the switchable mods on this one are really great for experimenting to find your own sound.  Not to mention that, at this price point, it will be much cheaper than some vintage Muffs.  Highly recommended.", "id": 570}, {"review": "I am not a studio engineer, nor am I a professional musician.  I record songs in my home as a hobby.  I like to have reasonably nice gear in order to get as good a sound as possible in that setting, so if you're at or around the same level, you know what I'm talking about.  Will this compare to a mic that costs three times as much?  No.  Are you likely to find it in a high-end professional studio?  Eh...probably not.  Is it a pretty sweet deal at this price point?  Hells yes.I've worked my way up in terms of mic quality as my hobby has gotten progressively more serious, and this is the nicest mic I own right now.  The difference in quality between this and even a nice dynamic mic is immediately obvious.  I use it for recording vocals, and my voice (again, not a pro!) is finicky to record, usually sounding pretty muddy.  Even with nicer dynamic mics usually used for vocals (SM57 and 58) this was still the case.  But with this mic, my voice sounds much more clear and open.Admittedly, this is a very subjective evaluation, but then aren't all mic evaluations subjective?  You can go on all day about response range and EQ flatness, but what matters in the end is how the mic sounds in your application.  And to my ears, this mic sounds wonderful.My only real gripe is that the sensitivity pattern doesn't seem to be a super-tight cardioid, because it still picks up some sound coming from behind it.  Perhaps this is how it's supposed to be, but when trying to record both vocals and a loud electric guitar simultaneously, it can be a headache trying to jury-rig an isolation method that works.  I took off a star for this alone, although that may not be fair since I haven't used any other large-diaphragm condensers and therefore have no idea if they're all supposed to behave this way.", "id": 371}]