[{"review": "Hard to believe this was so bad. I have a Planet Waves locking guitar strap, which is a dream, and thought this would allow me to lock a regular strap. However, it is so thick that it can't really fit on a regular guitar strap pin with a strap, and when I tried to lock it, the two pieces came apart. Go with the Planet Waves Lock Straps.", "id": 261}, {"review": "What can I say? I started out with a couple of pedals, then a wah, then more, then a board for them, and sooner or later all those 6&#34; cords are either in the way, too short or whatever. I do like the male-male offset connectors to bring pedals together but sometimes on a board you've got odd distances. This kit does the trick, and truly was easy to use. Only once did I create a plug with a bad connection and had to redo it.", "id": 312}, {"review": "I admit I got this from Guitar Center on clearance, but over the past week or so I've had it, I just love plugging into it. I've got a great vintage larger amp, but would rather not lug it around for just small practice sessions, and I'm anticipating spending some time in apartment living, so I was looking for a small, tube-based amp. This thing gives great tone with both a Strat and a Les Paul clone, and an overdrive pedal works very well with it. Of course it's not too loud - that's the whole point! I should note that turned on it has a hum that my other amps don't have, but it's really low volume. Also, the tubes do take a minutes to warm up, and since it doesn't have a standby switch, you just have to turn down the volume knob before plugging in. But it just is great stuff to plug into something with solid tone without having to burn my ears (or those of anyone else). Great little amp.", "id": 618}, {"review": "The only reason I give this 4 instead of 5 stars is that I've noticed it's response is a little less than the original (bulky) Snark SN-1. I must admit I haven't checked out a new battery, as with my original Snark, a new battery made a big difference. But the size is something that cannot be beat (the original Snark is a little ungainly) and this tuner really fits beautifully on my Strat. I have a Boss Tu-2 stompbox tuner and am thinking of freeing up my pedal board real estate and using this instead.Overall, this is a definite buy.", "id": 893}, {"review": "I can't compare it (as others have done) with the OCD, but it simply gives me an overdrive that I love. I have several other OD pedals: Tube Screamer, LovePedal Kalamazoo and even a cheap Danelectro DS-1. The JF-02 is truly my favorite right now. I've been using it with a Strat and a Les Paul clone into either a Fender Vibro or a small Bugera V5. It serves up great tones into either one.", "id": 795}]