[{"review": "The name says it all. FAST fret = FAST fingers!  I played over 40 live shows from 45 min sets to 2.5 hr sets just this year on national stages.  My strings take a lot of abuse and slow down with all the sweat, grime, and dirt flying through the air. This stuff honestly works very well.  It is part of my regular arsenal.", "id": 72}, {"review": "I'm rating it 4 stars because although it is able to attach to most mic stands, it doesn't fit them all very well. Opening up for headliners, you basically get given most of your stage gear (minus your own instrument gear) so if you're given a mic stand that has a smaller diameter tube, this will not fit as nicely.  I was playing a couple shows and this thing would slowly slip down the pole (that's what she said).  Usually worked fine. I'll still recommend this wedgie.", "id": 210}, {"review": "I'll re rate this item if my problem is fixed but maybe this is normal??  I have a Vox ac30hw2x and I put this jj 12ax7 into v1.  I have a significant volume/gain reduction now.  I know it's the tube because I can put the stock ruby back into v1 and the volume/gain is back.  I haven't checked yet but I'd say there is a 40-50% loss in volume.  I was thinking maybe this is a higher headroom tube?? It's not stamped to be one so that's why I'm confused.  Is it typical of JJ to have more headroom? I'm not digging this tube so far so back in goes the Ruby.", "id": 228}, {"review": "Almost a perfect pic for me. I use a .73mm. Just wish it was more like a fender pic finish...that being fender seems to stick to your fingers better. This pic seems to have a coating that makes is slightly softer to the touch or something.  Still prefer this pic to the fender because this one holds up much much better- in comparison to fender mediums.", "id": 455}, {"review": "PEOPLE!  YOU NEED TO BE STATING WHICH AMP AND SPEAKERS YOU USE OR YOUR REVIEW IS POINTLESS!That being said, the reason is because every amp will cause the tube to react and sound differently.  Speakers will also create a very different sound with each tube choice. Type of pickups in your guitar will also cause a different outcome.Amp:  Vox ac30hw2Speakers: Celestion Alnico Blue 8 ohmPower Tubes: JJ EL84Pre Amp Tube: Tungsol 12ax7 in V1 and the stock Ruby tubes in the other 2 spotsHow I Set My Amp: Volume just before breakup and 12o'clock with bass and treble knobs (changes per guitar but stays close)Guitars Used: Fender Telecaster Deluxe 'Chris Shiflett' with stock pups, Gretsch Silver Falcon 2010 with stock Filtertrons, Gretsch Sparkle Jet Blue Pearl with stock Filtertrons, Fender Jazzmaster 65' American Reissue with stock p90's.I also purchased a JJ12ax7 to see how that sounded so will compare the ruby, JJ and this Tongsol preamp tubes.I found the Tongsol to give me the best tone over all.  Less bright but still keeping all the chime in this amp. It caused just enough high end roll off to give the warmth I've been looking for (to my ears). I found the JJ12ax7 to be much clearer but slightly harsher in the high end-maybe more Fenderish? I REALLY like the way the Tungsol makes my Jazzmaster sound.  It's heaven!  It gives me the perfect breakup point and perfect roll off of highs.My findings could and probably will be different from yours because of your guitar, cable quality, pick attack and style of playing. My best advise is BUY MANY different brands and TRY THEM ALL in your amp. they're not that expensive if you go with the cheaper ones.  Most likely you will buy a different amp at some point so keep the tubes to maybe use in that one.", "id": 514}]