[{"review": "Overall dimensions 6 3/4\" x 6 1/2\" x 2 1/4\". Very nice travel size. Sound is about what you would expect. It is basically a toy. If you use more than 2 (of 10 max) gain, it sounds awful. I turn guitar volume to max and adjust volume on the amp to desired level. Tone works nicely to filter the output over all frequencies. I am using it with a Fender Starcaster when I travel for work (hotel friendly). I think it's over priced but I think it looks good and it seems durable.", "id": 391}, {"review": "I probably could have found the same screw at the hardware store but these are OEM and fit perfectly. Recommended.", "id": 599}, {"review": "Used on my acoustic guitar.Pro:Removes friction for faster playing. I noticed immediate result after applying first time.Enhances string life and tone. Strings sound brighter now. I guess there was some mild crud buildup you can't see.Reduces finger noise. Not completely gone but lessened.Easy to use applicator. Wide applicator makes it easy to put on and not get it onto the fret board.Con:Packaged in a metal tin and the applicator went dry after 3 weeks. Has no seal and the little cap on the applicator doesn't prevent dry out.I don't believe I would buy again until a sealed container is provided.", "id": 787}, {"review": "I bought a couple of these two years ago. They are a sturdy but lightweight stand. The small footprint is nice for those with limited space. I use for both electric and acoustic guitars. I will say that the two I recently purchased are NOT the same as the ones purchased in 2011. The pictured product is the same but the actual product is not. The newer stands have a rear leg that is about half the length as the older model. The tubing is smaller on the upright piece and the body support. The body support now inserts through the base tube; the earlier design had a reinforced tube that accepeted the body support piece. The rubber feet are also smaller. These changes appear to make the newer stand less sturdy and stable, however I believe the stand will be adequate for most full size guitars. I didn't notice any offensive rubber odor others have reported. There may be a concern about damage to certain finish. I would simply wrap the rubber or replace it with an inert material.", "id": 813}, {"review": "This beginner level guitar is very good quality for the price. It's lightweight and has attractive but basic finishes. The biggest drawback is that the one I received required the action to be adjusted. The bridge needed lowered slightly and the nut held the strings way too high above the frets. The result was very sore fingers. These are easy fixes if you have the proper tools. Otherwise you'll have to pay a guitar shop to do a proper setup. Stock strings have a warm tone.", "id": 148}, {"review": "I had been using 12's on my S35 Takamine and they were over powering the chassis with vibration. The result was poor sound. Switching to these 10's made a huge difference in tone. It took a bit to get used to the lightness but now I will stick with them on this guitar. They are also easy to do bends which I like alot. I have never broke a D'Addario acoustic string.", "id": 198}]