[{"review": "A very strong capo..too strong for bigger instruments, but works good on ukes and mandolins and banjos with not too thick of a neck.  I have several of these capos, one for each instrument.", "id": 43}, {"review": "Simple, no frills, stand.  Only problem I've had lately is that the velveteen padding on top seems to get loose and keeps coming off.  A lil' glue will fix it, just haven't had time!", "id": 258}, {"review": "I like these humidifiers.  Works if you keep it with instrument in your case, and upkeep is minimal.  Work on all strings very well, but be careful, easy to fall out of case, so just be careful!", "id": 314}, {"review": "This strap is uncomfortable and too flimsy to feel good, also doesn't fit an instrument where there's no place to hook it .  I returned mine, as it just didn't fit well for my uke or mandolin.", "id": 352}, {"review": "It's very small.  It's a fabric stretchy capo, the old type, that's quite difficult to stretch and make stay.  It's made with an end that you stretch the fabric over to connect to hold the capo, but the end isn't very long and I don't trust it to stay while playing for long.  I'll keep it as a spare, just in case, anyway.", "id": 356}, {"review": "This mic is strong, reliable and produces the sound I'm looking for.  I used to buy all Shure products,,I'm switching to GLS..they are just great!", "id": 425}, {"review": "These stay connected, but aren't so wide that they change the style of picking.  I like them, and so does my music teacher.  We try to stay stocked in these picks.", "id": 503}, {"review": "This microphone pics up instruments quite a bit better than my SM57s. It's quite a bit stronger of a microphone also.  I am really impressed with this mic!  The only thing I'd like to see is that it would come with a cover (bag) like the Shure mics do.  Other than that, you save a heck of a lot of money for the same and even better quality!  Thanks a lot!", "id": 594}, {"review": "That's why I got this...I needed light without the heat!  It works fine.  Just sorry it's a little pain to keep taking battery out if I want to use the AC connection.  Other than that, it's fine, and pretty well constructed.  Seems to take a few bangs without problems!", "id": 681}, {"review": "Some items of GLS work great, others are awful.  Don't trust the products anymore.  It's unfortunate but I don't feel safe with their products, that they'll perform when I need them to..", "id": 692}, {"review": "I wonder if all these Snarks, no matter whether they are 1 to 12 , have all the same frequency ranges.  I have them all, and they all work great!", "id": 706}, {"review": "This strap is comfortable, has plenty of room to expand it to fit, and is just wide enough to continue to be comfy around you.  Perfect for uke or mandolin or banjolele, and even the extra thin travel ukes.  I really like it!", "id": 715}, {"review": "A little disappointed with the cable.  Pretty light weight.  Don't know why it didn't work, just shorted out.  Luckily one of the band members had another one.  Wouldn't trust it again, so I returned them.", "id": 745}, {"review": "I really think it doesn't matter which Snark you buy, they are all set up to measure tuning within any instrument's range.  It was cheap, and affordable.  One of the issues I've had with Snarks is that if you get the one with the vibe and the mic, the mic quits working, and you really only need the vibe anyway, so why pay more?", "id": 821}, {"review": "This stand is useful for small instruments..fits my tenor uke and violin just fine.  Any bigger than that, and the piece that holds the neck becomes too small (like a baby martin guitar), etc.  Hope this helps", "id": 702}, {"review": "Will work on any instrument.  You don't need the expensive ones, this works just fine..just wish the batteries lasted longer!", "id": 820}]