[{"review": "I've used quite a few strings out there and imo these are the best for feel, sound and overall quality. If you play Fender instruments you can't go wrong using their strings. Of course strings are a subjective thing so to each his own but I will say I used 2 different strings most of my life but was in a guitar store one day and picked up a Tele and was immediately impressed with the strings. I looked at the back and noticed they were colored ends so I thought they were D'Addario strings which I found to be odd considering it was a new Fender. So I did a little research and found that Fender was indeed doing the colored ends now as well. Been buying them ever since and love them.", "id": 89}, {"review": "Makes changing strings a whole lot easier. If you are a guitar player and are changing strings like I was without one of these, stop and get one trust me!", "id": 94}, {"review": "While I don't have a ton of experience with pedals, I really love this one. Keeps your guitars tone but you can add some fatness and a mild to fairly substantial crunch and adds some nice sustain. Although this is a tube-overdrive I actually think it sounds better with my solid state amp. It is nothing real drastic but that is exactly what I was looking for, a nice robust boost while keeping your guitar tones integrity. For the price I don't see how you can beat this pedal. I also have a Digitech Jam Man and it is awesome. No complaints with this outfit.", "id": 145}, {"review": "Only had it a few days but is working great and I like that it is true bypass. Price was outstanding and the tuning is spot on. The default tuning display is perfect for me as I've not been real impressed with some of the other top tuners out there. IMO you can't go wrong with this tuner, very pleased.", "id": 504}, {"review": "So far this power supply is great! Pretty compact and light, come with all the power cables you need and does the job at a far more reasonable price at the other power supplies I was considering. No complaints here!", "id": 852}]