[{"review": "Monster Cable is one of the things on earth we can count on!Seriously speaking all my cables are Monsters, yes they are pricy and sometimes very much, true.But they last really lifetime and I never ever had to complain or heard a friend complaining on Monster products.PEACE", "id": 126}, {"review": "...but it works fine for me.I used to connect a Orange Micro Terror Head AmpOrange Amplifiers Micro Terror MT20 20W Hybrid Guitar Amp Head (Standard)to a cabinet PPC108Orange PPC108 1x8\" Speaker Cabinet", "id": 494}, {"review": "the mat is only a few $ neoprene (kind of) mat, the neck holder thing is inserted in the tube that contain the mat... TAKE IT OUT very very carefully, I was only careful and the base of the neck holder broke a bit...In my opinion this thing if priced $15 or $20 less will be what it really worth on the market.P.S.The Wise Man Say:Do yourself a favor, use a long pillow over your desk to tune up/intonate your Strat or Tele and use this $$ to buy good strings! :D", "id": 571}, {"review": "...even a kid can use it with a guitar. I received 2 in a kool metallic-blue, but as far as I know you can't choose the color and it is bad because a match with the instrument is kool.My perplexity (this is why the 4 stars) is generally on electronic tuning, it happened to me that different brands gave a slight different tune, while 'all' should be perfect and perfectly the same... creepy isn't it?What we do now?  I do not own a grand piano to decide which is the right tune ...better go back to the diapason?", "id": 706}, {"review": "...what is the sound in the background of the hissssssssssssss? My guitar I guess, but who cares? I honestly bought this gizmo for the extremely good hisssssssssssssing nothing else.A question to AMAZON: Companies producing objects that are nothing else than a lemon shouldn't be prosecuted?P.S.I think it is \"too polluting\" for 'low cost' items to waste again in paper box, transportation, restocking work, refund work and so on. This is why 99% of the time I do not ask for my money back / BUT / sell this lemon on Amazon, online with other websites,  and in all the instrument shops worldwide in a total bad faith (while testing nobody in iRig noticed the overwhelming  hisssssssing?) well that is beyond me!", "id": 710}, {"review": "When I'm in a apt. I need an amp with tube (at least the pre) and a cabinetOrange PPC108 1x8\" Speaker Cabinetas small as possible, giving a decent sound and output (w/o annoying around) and Orange made my needs true!(I never ever expect to play at a stadium with this! Obviously)In my opinion, this is absolutely a decent Amp that respond to precise needs.", "id": 844}]