[{"review": "Taylor ships this guitar with these strings - and for a good reason!  They sound wonderful - right out of the box! Like with most/all 12-string guitars, lights or extra lights are most often appropriate - the feel of these Nanowbs is smoth and easy and the tome they generate, in tandum with the instrument, bring out it's best resonance and sustainability.Give 'em a try!", "id": 103}, {"review": "I have tried many types of steel strings.  My Taylor 355 came delivered with these - and though I have tried several others, I have returned to them.  Their ease of play (smoothness to fret and finger) and light but rich tonality makes them a good choice for your 12-string.  Haven't tried 'em yet?  Pick up a set - they ARE different and, in many ways, better than the more standard Phosphor Bronze strings that were the best before these came along.", "id": 110}, {"review": "I am an acoustic guitar addict. With five six-string and one-twelve, I play every day and, in a year's time, I go through a lot of strings. Over the years, I have come to favor the phosphor-bronze type as they seem to add something to the rich and warm tones of a good instrument. For a long time, I believed that brands of them were interchangeable so I bought whatever was available at the best price. No more. These D'Addarios are the sweetest, easiest to play and, not that this is the most important variable to me - the longest lasting - of any of the phosphor bronze strings I have used.There is a shelf of unopened sets of unopened Martins, Gibsons, GHS, Adamas and Elixirs (as well as other varieties of D'Addario strings.) I think it's time to sell them off. These EXP16s are superior to them all.I have small hands and my fingers are not terribly strong. To play as well as I am able, I require strings that respond to my touch and do not tear my fingers up. Sound-wise, I look for a blend of 'brightness' and 'warmth' on my strings thst enrich and punctuate the innate qualities of a good guitar. These D'Addarios do both things and do them well.Other reviewers have been somewhat critical about the 'slickness' of these strings - I simple did not experience that at all. As with ALL guitar strings, they should be wiped with a dry, lint-free cloth after each and every playing. Not doing so will quickly compromise the accurate resonance and vibrations of ANY string. As a bonus, the price of these strings is quite reasonable. I bought 6 sets and plan to use them all, both Mediums and Lights, for my stringed friends.", "id": 130}, {"review": "This new type and design of capos, manufactued in England (and warranteed for life) is truly wonderful.  Available in six and twelve string steel-string as well as a new classical version, they are all easy to use, solidly built and - perhaps most importantly, easy to put on and take off with one hand without having to retune!  For a musician, this is the most cricial element - that, and that it is 'kind' to the materials used in the manufacture of a good guitar.  I use mine on a Martin HD28 and have had no problems whatsoever. A great move toward a new generation of capos! Not cheap - but worth every cent.", "id": 266}, {"review": "A Little History:I have been a guitar player for forty-odd (some of them, VERY odd) years.  For the first thirty of them, I tuned by ear - starting by guessing at what a low E sounded like, then tuning the other five strings by fretting, listening and tuning.  I could never understand why the tuning often sounded perfect for one chord, yet remained `off' for others... it took quite a long time to get it right.  Then, about ten years ago, I thought I had figured it out.  The problem (I thought) was that my guesses at a true \"E\" were off - so I got myself an \"E\" tuning fork (320 cycles) and used it to tune the first string.  Then, I did as I had always done - fretted and tuned the other five. Not much better as a result - kept having to tune and retune for quite a while to get all chords to sound right.  During those years, I tried tuning all six strings to (what I believed was an accurately tuned) piano as well as by ear to tones available online.  Nothing gave me better tuning on the first try.  Then, I saw an ad for a Chromatic Tuner and lightening struck.The Realization:There have been many -  each of which has led me closer to what I have now - near perfect tuning on the first go `round!  First off, I realized that when we say \"E\", that is not just one note.  It is a range of literally hundreds - perhaps even thousands- of specific tones.  The same is true for every note.  This is akin, I guess, to the realization as a child, that no matter how many shades of `blue' are in a box of crayons, the chanced of having the precise shade you want for a specific drawing are rare.  Purchasing my first Chromatic Tuner (a CT440, manufactured by SwitchMucic and sold through MusiciansFriend.com) moved me a long way along the continuum of learning and accurate tuning.  However, that tuner had at least two limitations. Firstly, it's construction is rather light and flimsy - it works OK, but has a second limitation that conaused me to buy the Korg (for about the same price)  That is that the Korg has a built in tone generator and speaker allowing the option of tuning that way rather than having only the single option of having tones made by the instrument read and metered back to you.  Both tuners have plug-in for electric instruments, and, so far as I can tell, their accuracies are similar.  I prefer the Korg for the reasons I have mentioned.  Additionally, the Korg can be manually recalibrated for special tuning needs - and `remembers' the original tuning/tones so you can return to it for more `standard' usage. A nice, extra piece of flexibility. The LCD meter is easy to read and colored lights tell you, right away, whether you are sharp, flat (and by how much!) or right on!As a point of surprising interest, the tuning fork I had used for years turns out to be profoundly FLAT! A shock to me - given that I had grown up learning that tuning forks gave off perfect tones! I have saved it as a reminder that all things are not what they are promoted to be. I guess the round pitch pipe that Ms. Sweeny used to tune up the class in the 5th grade was probably not quite as precise as she would have presumed!And Finally:This is a marvelous little (and inexpensive) device - well constructed, accurate and flexible to allow for many different tuning need situations and circumstances.  I assume that there will be still higher places for my `learning curve' in this area to rise to - but for right now, this is it.  I am using it, regularly, on all my stringed instruments (two six-string Martins, a twelve string Epiphone and a frailing banjo.  The time it saves tuning the 12-string alone makes it more than it's own price!)If you have not discovered Chromatic Tuning (maybe I really WAS the last one to discover these things!?), I suggest you do so immediately and spend your time enjoying the pleasures of making music rather than sitting in frustration trying to adjust the tunings by ear so it sounds `really' right. Perhaps people with `perfect pitch' can do very nicely without a Chromatic Tuner - I am not one of them. Are you?", "id": 305}, {"review": "Hearing ourselves the way we sound to others is of the essence in music. This small, acoustic Behringer Ultracoustic AT108 amplifier gives the musician/singer the needed outside feedback to get things sounding right.No one hears themselves the way they sound to others. This simple reality must be understood and somehow corrected for by anyone recording music. This is why performers in the studio wear headphones while recording and why a small acoustic amplifier is a necessary piece of gear for an acoustic guitar playing, singing song writer. The Behringer Ultracoustic AT108 acoustic amplifier more than does the job.As the owner of eight completely acoustic guitars, I thought a lot for years about trying amplification. I probably never hesitated with ambivalence about any other purchase in my life. Much to my delight, together with a passive, inexpensive hole-mounted pick-up (the Seymour Duncan SA3SC Woody) , an inexpensive Audio- Technica vocal microphone and this Behringer AT108, I can hear a fullness and richness that actually makes good instruments sound even better!At least as importantly, it allows me to hear myself more the way I am heard by others who will not hear me, as I do in part, from the resonations inside my skull.One of the most universal and predictably shocking experiences anyone who records their own voice is struck by is how different it sounds when recorded than it does when they are singing or speaking it. The mechanics of this ubiquitous situation are not difficult to fathom.To hear what those listening hear, you have to arrange things so as to hear the sound coming TO you, not FROM you. That is where an amplifier comes in handy. It aims your own sound back at you so you can hear something a lot closer to what an audience would hear.When we 'hear' ourselves without any external amplification or direct audio feedback, we are 'hearing' a combination of the sounds being processed through our ears as well as those vibrations and sounds that are created by the vibrations in our heads. The people who hear us, only hear us through their ears. The two experiences are not the same.To discover how we really sound to others, we can go about it two ways. First, we can go ahead and record ourselves then listen and be astounded at how different we sound from how we thought we were sounding while recording, or we can put our practice through electronics - either through an external amplifier or through headphones, so that we can hear ourselves more closely to the way we will be heard by others.As an acoustic guitar player, I recently invested in a small, specifically acoustic amplifier, the Behringer Ultracoustic AT108, and have found the results to be simply astounding as I can now, for the first time, practice my songs until they sound the way I would like them to sound to others before recording them.For a small amplifier that successfully replicates, electronically, the deep richness of an old tube acoustic amplifier, this Behringer AT108 provides amply volume for both the instrument and separate input voice, along with a three section equalizer, to provide the self-accompanying guitarist with the sound of what s/he really sound like to others. It can, initially, be a rather shocking experience!Technically, this AT108 is at the low end of the famous Behringer line. Although the company is based in Germany, this box is built in China to their specifications. Solidly built and encased in a brown vinyl wrapping, it sports:- 15 Watts of Power amp output,- An 8\" dual-cone full-range loudspeaker with 4 Ohm impedance and a powerrating of 20 Watts,- Inputs for an instrument (1/4\" TS mono connector,) a microphone ( BalancedXLR) and for CDs (1/4\" TRS stereo connector,)- A headphone output connector ( 1/4\" TRS stereo connector, and- Three (Low, Mid and High Range) frequency controllers.The unit measures approximately 13 X 14 X 7 inches, weighs just over 11 pounds and is easily portable. It comes delivered with 13 feet of instrument ready plug-in cabling.Finally, to answer a question I had that caused me to hesitate for years before buying a small acoustic amp, it does NOT make an acoustic guitar sound, in any way, like an electric guitar. The sound is that of a deepened and amplified acoustic. The natural tones are enhanced, not rendered tinny or 'electrified.'It is at home in a room when you are alone practicing or on a stage in a small venue. The 15 amps pack a wallop and it can blast pretty loudly for its petite and easily portable configuration.At a current on line retail of somewhere between $75 - $95, an entire enhanced world of acoustic playing, practicing and listening is now open to me. The Behringer AT108 just might turn out to be one of the smartest investments I have ever made on behalf of my acoustic guitar playing, singing and recording.", "id": 398}, {"review": "I have used many clip-on guitar tuners. They are a wonderful innovation and certainly easier to use than the older rectangular chromatic tuners that do not attach to the instrument. One of my favorites has become the Planet Waves clip on. I have several of them and use them often on many guitars. Based on this experience, I was anticipating a better experience with this new Mini Headstock Tuner than I wound up getting.It tunes nicely and, so far as my ear is concerned, accurately. Others found it awkward to attach - I did not. It is small and unobtrusive but easy to read. Those are not problems. What is wrong is simply the cheap and fragile the construction of the device.This fragility is conspicuous in both the difficulty in removing the battery cover and, more importantly, in the too-delicate manual clamp used to fasten it onto an instrument.The fundamental issue is that in lieu of the spring clips that we used to attach other versions of the Planet Waves tuners to the guitars, this one has a basic manual expand and contract clamp. This clamp is made out of thin plastic, is difficult to adjust and I expect it to break after only a short time. Consequently, I cannot recommend this tuner if the user needs to be moving it from one instrument to the other.If the need is for a tuner that attaches to ONE instrument and will, essentially, live there, it is nice little tuner which remains functionally invisible to all but the player. If you need to move the tuner from instrument to instrument, you would be well advised to spend a few more dollars and stick with the clip-on versions of Planet Waves tuners.November 28,2011 UPDATEHaving used this tuner for a while now, I have found that it has a good purpose. While this tuned does have mobility issues as I initially noted, I have been surprised (and pleased)to realize that they are wonderful 'permanent' tuners for acoustic guitars! They are so small as to be unobtrusive and nearly invisible. I leave them on my 12-strings and one of the 6's. A non-built-in-built-in tuner at this price cannot be beat. Based on this belated realization, I have raised the product rating to 4-stars.", "id": 785}, {"review": "Having played guitar for 45 years, I have tried and used many, many capos. Back \"in the day,\" it was a bar of plastic held in place by a length of elastic. It didn't work very well but it is what was available to me. Later, some technology was applied to the need for a ubiquitously necessary accessory that would hold all six strings firmly in place (and in tune) as it was placed up and down the neck of the guitar WITHOUT doing anything to damage the fret board or finish of the guitar's neck. Many 'good' capos have been made. Until now, perhaps the best options have been G7 which fails in its 'softness' that allows strings to slip, and SCHUBB which, unfortunately, 'snaps' into place in a way that can injure the neck of the instrument.This new NS TRI-ACTION capo from Planet Waves accomplishes both requirements consistently and effectively.Designed by Ned Steinberger (the \"NS\"), the Tri-Action works on a trigger/spring/lever mechanism that works all the way up and down the neck, fits perfectly on the first attempt, holds all six strings firmly in place and does so in a way that causes no abrupt jolt to the neck of the guitar. Both the G7s and the SCHUBBs are better known, more commonly used and more expensive. This is one of those rare instances where what you get is NOT what you pay for. D'Addario, the famous string maker that produces the Planet Waves line of guitar accessories)has done a remarkable and welcome job on these capos. Any guitar player who has gone from one to the other (capo) over time, searching for the one that really does what it is supposed to do all the time, will find this new capo from Planet Waves a welcome tool in the quest to produce clear tones and great sounds on a six-string guitar.", "id": 843}, {"review": "I am,  primarily, an acoustic guitar player who acquired my first electric just about a year ago, a Gibson Les Paul. What I am finding is that the situation with electric guitar strings is very similar to that with acoustic guitars. Most name-brand strings are just fine, but some are markedly different than others. A few are actually a notch-above the others. These NYXLs from D'Addario are definitely in that 'notch above' category.I find them easier to play, better sounding and more reliable in holding their tuning than the six or seven others I have tried. I plan to stick with them.  A few comments about each area:Playability:These NYXLs bend easier and take less of a toll on the tips of my fretting (left) hand than do most of the others. Of course I have callouses that have been developed over the years and feel permanent - but heavy playing can still make my fingertips sore. These strings seem less 'cutting', even after a couple of hours of constant playing. THey also 'squeak' less when I slide up and down the neck.Sound:The sound is crisp and rich at the same time. Most electric guitarists who I know tend to prefer one of these qualities over the other and choose their strings accordingly. I prefer a blend of both - just as I do for my acoustic instruments.  These NYXLs provide the closest blend that I have been able to achieve of these two different but complimentary characteristics, andTuning:Tuning and re-tuning can drive a guitar player to distraction.  Even some really good sounding strings don't hold the tuning very well and even after only one brief riff, need to be adjusted by at least a quarter tone. These NYXLs are holding the tuning FAR better than the others I have used. Less time tuning = more good time playing!All-in-all, I found no flaw in these strings. There is always something new coming along and D'Addario's formulation that uses high carbon steel alloy in the manufacture of these strings seems to make a considerable and positive difference.  UNtil someone comes up with something better, I expect to stick with them!", "id": 897}, {"review": "I had used Elixer strings for several years on both 6 and 12 string guitars. Somehow, I had gravitated over to other brands including Martin and D'Addario.  I got a set of these strings as well as the Phosphor Bronze design through the Vine program and chose to this set out on a Seagull Artist Mosaic rather than on a Taylor, Martin or Gibson. The result is outstanding - So much so, that I am beginning to restring all 7 of my acoustic and acoustic-electric guitars with Elixers again.I have also tried the new Phosphor Bronze strings in this series on a Gibson and had fine results.  Because I did not use both sets of strings on the same guitar, it is not possible for me to really compare/contract the. These strings play as smoothly and easily as do the Phosphor Bronzes and seem to add a good deal of depth to the already resonant mellowness of the Seagull.Elixer definitely still has the edge. Thanks to Bob Taylor and his crew for collaborating on something that benefits all guitar players - no matter what it says on the head stocks of our instruments.", "id": 898}, {"review": "I had used Elixer strings for several years on both 6 and 12 string guitars. Somehow, I had gravitated over to Martin PB about a year ago (when I acquired a new Martin... Surprise!) I got a set of these strings through the Vine program and chose to try them out on a Gibson Songwriter Studio Deluxe CE RATHER than on a Taylor or Martin. The result is outstanding - So much so, that I am beginning to restring all 7 of my acoustic and acoustic-electric guitars with Elixers again.They are even smoother and easier to play that I remembered them. Of course, these new strings have improved the technology which becomes more and more important to me as my fingers age right along with the rest of my body. The sound is sweet and warm and the Gibson has never sounded better - played plugged-in or unplugged.Elixer definitely still has the edge. Thanks to Bob Taylor and his crew for collaborating on something that benefits all guitar players - no matter what it says on the head stocks of our instruments.", "id": 899}]