[{"review": "Well thought out unit that does what it says it will, drop all that POP! I really like the way the clamp connector is rubberized to protect the finish of your mic stand. And being that it is rubberized, it allows you to adjust the filter to the mic without having to loosen everything up because rubber has an inherent &#34;give.&#34; And this is where the flexible arm allows you to fine tune the filters proximity to the singer, allowing you to do what you do best -- Sing! And then; and now for the really important part: everything stays where you last left it. Hell, even my cats can't do that, and they're porcelain.", "id": 46}, {"review": "This mic stand does everything it says it will, and is adjustable in every conceivable way. In fact, the boom has a really nice adjusting lever, making it easy to loosen and tighten. The only drawback I found is the tripod configuration of its feet, making it easy to forget where you parked your big feet during live performances; especially when you're emotionally invested and the crowd is urging you on. I would much prefer a round base. Other than that, it makes for a great home/garage mic stand when you or your band is just kickin' it. 'Nuff said.", "id": 279}, {"review": "Does what it says with no whining whatsoever, really quiet producing absolutely no audible hum. Very small footprint, too! Would I recommend it? Yes. I would.", "id": 485}, {"review": "I use this soft flexible cable between my 48 volt phantom PS, and the mic connector to my system because it need not be long to do its job. No audible hum detected when using this mic cord, either. Feels solid, and will probably last for many years to come.", "id": 556}, {"review": "What I like about these spongy little things, besides protecting the internals of the mic, is that you can pick a color that reflects your mood according to the song you're singing. Just like a pink jail cell works to impart a sense of calm to the incarcerated, so too can a colorful mic cover. And my neighbor kids just love 'em during our singalongs!", "id": 806}, {"review": "These cables are flexible without feeling cheap, and have solid end connectors. And, they produce no electrical noise like my old ones do, which is why I replaced them. I suspect these cables will be a round for a long time to come, which was something important to me when making my purchasing decision. These mics cords have solid construction going for them, without the high dollar cost.", "id": 169}, {"review": "These little mic connectors are just what the doctor ordered, allowing me to spare wear and tear on my systems mic jacks; I simply unplug the cord from the adapter instead. And, they produce no audible hum into the circuit. They are unbalanced jacks, though (note the single black band at the end of the plug,) so if you need balanced jacks for your system (those with two black bands,) make sure you take that into account before ordering. By the way, I have both and there is no audible difference whether singing or recording. Just saying...", "id": 249}]