[{"review": "While the Shure SM58LC Shure SM58 Vocal Microphone seems to be the running staple for live performance vocals, and rightly so due to its comparative value and amazing quality in sound and craftsmanship, the Beta 58A needs to be given its due. The Beta 58A is an amazing dynamic microphone that might alleviate some of the stress associated with its more cost efficient cousin. That is, the Beta 58A, in the confined live scenarios in which I have utilized it, has demonstrated a much broader sweet spot and completely eliminated some severe feedback issues. For vocalists that like to pull back from the mic a touch to really belt those sustained high (or, really, any) notes the Beta is a dream. This same effect helps if one is experiencing sibilance or \"popping\" complications and needs to sing past the microphone as opposed to directly into it.While I wish that I had a better understanding from a sound engineering standpoint so that the technical specifics could be expounded upon, I can confidently say that the Beta 58A is the best vocals microphone that I have ever utilized aside from higher end condenser mics in an isolated environment. Quite honestly, I would not be at all surprised if the Beta compared well even in confined recording situations. The bottom line is that the Beta 58A might be more expensive than its popular cousin, the SM58, but it is worth every penny. Anyone who has the opportunity should give it a chance to demonstrate its superiority. Six out of five stars!", "id": 23}, {"review": "This instrument might actually be in a class of its own. That is, it would be extremely difficult to find a guitar in this price band that comes even remotely close in terms of quality; not only with regard to craftsmanship, but certainly the sound it produces. The Applause exceeds expectation whether it is unplugged, amplified, or even run directly through a mixer. Beyond sounding comparatively spectacular, it is far more durable than perhaps any other hollow-bodied instrument on the market due to its components and design. The electronics are reliable and the instrument is accessible, or playable, to even the most novice of musicians. This guitar is the ideal instrument for a beginner or a younger musician, simply because it is cost efficient, durable, and as easy to play for the price as one might be able to find anywhere. Even experienced guitarists will almost certainly appreciate its action, sound and durability if not only for the purposes of practice and travel. This is an exceptional value and an excellent instrument.", "id": 296}, {"review": "After having played the Yamaha YPG-535 88-key Portable Grand Piano Keyboard in a showroom and loving it, I was torn, wondering what all I would be missing out on if I went with the more economically priced YPG-235. I now own the 235 and it appears as if I am missing out on twelve keys. That is, I am not experiencing even an ounce of buyer's remorse after opting for the cheaper 235. This is a lovely keyboard with more beautiful voices than I will ever know what to do with and extremely user friendly functionality. Of course, my opinion should be taken with a grain of salt as I will be the first to admit that my experience with other products of this variety is extremely limited. As such, it might be best to say that, for a novice, one could not ask for a better instrument for the price.So what is the difference between the 235 and the 535? Based on my previous comparative shopping, I have come up with a few differences. First is the obvious fact that the 535 possesses 88 keys, while the 235 has 76. The 535 also includes a stand, sustain pedal, and power adapter, which must be purchased separately for the 235. While I am unaware of the specifics, the 535 also has greater storage capacity and capability as well as a few more voices. Beyond these definitive differences, having now played both models, the 535 also wins out with regard to aesthetics in that it looks and feels to be of a slightly higher quality, from its display to the apparent craftsmanship in assembly.Why buy the YPG-235? If price is not an issue, go ahead and get he 535, it is a beautiful instrument. However, for those on a budget or for those who simply do not need 88 keys, purchase the 235. Like the 535, the 235 possesses piano style Graded Soft Touch (GST) keys, which are not exactly weighted but occupy that perfect gap between pure synth keys and weighted. The feel is perfect for one who is used to standard synth-style keyboard keys yet longs for a little more control without sacrificing playability. The 235, like the 535, also features USB connectivity and general MIDI compatibility, as well as almost all of the same high quality voices, which separate both the 535 and the 235 from many other models in their price brackets (besides the pianos, the multitude of stringed instrument voices are amazingly realistic). While it is unfortunate that Yamaha decided to not include a power adapter with the 235, theYamaha Survival Kit D - Accessory Kit for Yamaha YPG-235 & YPG-235 Keyboardswhich includes a power adaptor, extended warranty, and a couple of other low quality extras can be purchased relatively cheaply. In my opinion, the YPG-235 offers the buyer more bang for their comparative buck. Again, the 235 sounds great, feels great and is hard to beat for the price!", "id": 688}, {"review": "I have been using an old elastic-bar capo for years because the last spring capo I used did not have nearly enough tension. When I first applied the Planet Waves Tri-Action Capo I thought \"here we go again.\" There was ample tension E-G but B and E were buzzy as all get out. Not expecting much, I adjusted the tension. It took a couple of tries to get it just right, but now the capo works as if it was made specifically for my guitar... zero buzz across the board. That in and of itself, makes this capo a five in my book. Add in the facts that the release mechanism is a breeze (on and off), it looks nice (I have the black version), as well as its comparative ease on the wallet, and this capo is a rock solid five star product.This capo also has a pick holder. The feature can actually be a little awkward because of its placement in the context of the capo's overall size and shape, but it is there if you need it and it does not detract from the functionality of the capo itself.Get this capo!", "id": 843}, {"review": "I like them, but these strings are probably not for everyone. The EXP16s do provide a crisp, bright sound almost leaning towards metallic. This tone is actually refreshing on my old shallow-bodied Ovation. However, I have to imagine that on a dreadnought or jumbo this sound might be quite different.While I was not expecting it, my favorite aspect of the EXP16s is the playability. The play is a little more elastic than I thought it would be, and they are amazingly easy on the fingers.The only downside that I experienced with the EXP16s is the fact that, while giving once on the guitar, they are a little brittle off the guitar (I almost snapped my E getting it set up). Other than that, the strings are just a little squeaky. I personally like a little squeak, but at the current price point, I don't think that it would be a deal breaker even for those who don't.", "id": 130}]