[{"review": "This cable seems like it will last me for a while. As it is only being used to connect a DI box it will not get abused as much as the vocal mics always do.", "id": 5}, {"review": "...unbalanced guitar cable is notoriously noisy especially around florescent lights. These are no different. I would prefer to use cables with better shielding but cannot justify the expense considering how rarely these things get used.", "id": 6}, {"review": "I still operate in an analog environment quite often, so I end up using lots of inserts. I have 8 channels of compression, limiter, gate and expander, plus various EQs and effects processors that need to be routed and applied to specific channels. I have an insert snake that I use as well, but the individual insert cables (of differing lengths) that I carry are lifesavers that make me a more efficient soundman during setup and a more flexible soundman during the show!", "id": 9}, {"review": "I use this to mic snare drums and sometimes guitar cabinets. It works as well as most mics and is more durable than most. I have used this in the studio when nothing else was available and it worked fine. As long as I run sound for a living I will keep some of these mics.", "id": 19}, {"review": "This mic works better for some people than others. That being said it is the first mic I put in a lead singers hand upon meeting them. If it doesn't sound good then I try something else. I have no complaints it is my GO TO MIC.", "id": 20}, {"review": "Decent stand as long as you aren't abusing it. With any discount item, a few shortcuts were taken to keep the price in line. I don't plan on moving it so it works for me.", "id": 138}, {"review": "I got these because I work as a live sound engineer and they sometimes come in handy used as interconnects between guitar pedals.", "id": 181}, {"review": "This is another adapter that I rarely use and now that I have a digital mixer I am not sure if I will ever get much use out of them with my rig. Traveling about to use some other rig though you never know what you might run into so I plan on keeping these little artifacts for a while longer.", "id": 248}, {"review": "I have been using this tester for about a year to test out my XLR cables and those that I come into contact with at work. It works but does not detect all faults (only non intermittent ones), it comes in a durable enough housing and is compact enough to take everywhere.", "id": 318}, {"review": "Plugged 'em in to my PA's Yamaha mixer and tried out my effects processor and they sound great! Better than the Nady Starpower mic I also bought from Amazon. These seem like they will last and I plan to buy these as long as they stay the same price.", "id": 405}, {"review": "I've used these at every gig I have run sound at for 2 months and so far they have passed the test with flying colors. They allow me to concentrate on other more important things than the reliability of my cables.", "id": 423}, {"review": "I have had to use these because the stage was so wide you could not use anything shorter. Most stages in bars, clubs and restaurants are small enough to use 25' mic cables and reach the stage box of the snake, but not all. These GLS Audio cables have been transparent and sturdy for the 2 months that I have been using them on an almost daily basis. I have performed many setups and tear down with these cables and there is no indication of any problem coming up any time soon.", "id": 426}, {"review": "There's nothing wrong with this stand, but for the life of me I cannot imagine how a manufacturer could manage to screw up an plain old straight mic stand.", "id": 515}, {"review": "I have used these mics more than any other in my mic arsenal. The kick mic's base is beginning to fall apart, but I have used these things on the road all this (brutal) summer and the sound is still the same... I have other more expensive mics, but often use these in clubs as a backup (when the drummer doesn't have a favorite or bring his own kick mic). While it cannot stand up to say (my favorite) the D112, it does the job and the overheads are the easiest o.h. mics I have tried yet. The tom mics work on guitar cabinets and the mounting hardware is still in one piece (except for the kick mic mounting bracket) after months of use. I would suggest these mics as a backup for your expensive mics.UPDATE: Now that I have been using them for a while I can say they are reliable, durable and sound good. My AKG drum mic kit sees more action than the Pyle's, but the Pyle mics are always on hand to mic guitar cabs, percussion instruments like congas and whatever else needs mic'ing. The kick drum mic's mount is falling off, but considering how many times these mics have been hit by errant drum sticks and dropped by inexperienced technicians, they are in great shape. These mics have more life left and I have gotten a good amount of use out of them to this point.", "id": 689}, {"review": "It is so small that it cannot hold all mics. If you have a big lopsided kick drum mic  with a skinny neck and akward COG(AKG D112), this stand will not be able to hold it up. It can however hold up the Audix D6 and it can hold an SM 57 up to a guitar cab if its the right height. I love this because it has allowed me to mic things in really really tight spaces. I would never have had room to use full sized instrument mic stands in some of the tiny stages I have seen this summer. This thing takes up very little real estate, I have put this thing in the pocket of my jeans before!", "id": 708}, {"review": "I have played it with the strings it came with and as a guitarist for 20 years I can attest to the fact that this is a great practice guitar or for taking to the James river. I used to take my $700 Ibanez electric acoustic down to that river and it was sometimes a scary thing. The Ibanez is heavy where this Rogue is light as a feather and it did not cost a lot of money. I want at least one more of these to carry around with me everywhere I go. When it dies i will buy another one. You cannot use this for performance of any kind, but for yourself, friends and family around the campsite or wherever, it is perfect!", "id": 726}, {"review": "Some of the stands I have purchased are hollow, some are solid (at the part that screws together to adjust the height of the stand). The hollow ones are a PITA because they are easier to strip and bend. All mic stand inventories I have bought from (budget lines) have this issue. I wish they would specify exactly what you are going to get in your box.", "id": 815}, {"review": "As the digital realm and the audio realm become one things like these will become increasingly rare. You will always find a place that does not keep up with the times though.That alone is a good enough reason to keep stuff like this around for now.", "id": 249}, {"review": "I used this for a while, but now I have the behringer 8ch rack mount and this rarely gets used. Also, every single bass guitar amplifier that has been on stage when I was the soundman had a balanced direct output right with xlr connector right there on the amp. I still use this for practice at home.", "id": 378}, {"review": "This amp did a good job for its rating. It was my backup amp for a QSC GX5. I sold it after using it for about a year or so.", "id": 496}]