[{"review": "I play guitar and keyboard and, sometimes, I need to quickly put guitar on my back to play keyboards. I would not do that without this straplok.", "id": 44}, {"review": "I put this in my Fender MIM Stratocaster. I want to change that &#34;poor&#34; string guides that came in MIM by the American Series string guide. So nice...", "id": 115}, {"review": "This acessorie is well builded and don't change the guitar's pitch. No damages guitars neck. It's so easy to use", "id": 116}, {"review": "I put this pickguard in a MIM White Blonde Stratocaster, and guitar looks so great. I didn't need any kind of adaptation to put in my guitar.", "id": 217}, {"review": "I have a Fender Stratocaster MIM with standard white pickguard, which I changed by a black one. Then I decided also change others white pieces, and this Fender Accessory Kit fit perfect in my guitar. I didn't need no adaptation to install it on guitar.", "id": 222}, {"review": "I'm using this pedal like a clean boost for leads, and I'm very happy with it's sound. Uncolored +20db of clean gain...", "id": 372}, {"review": "This gear is for who wants a versatile overdrive pedal. It's go from light overdrives on channel 1 to heavy drives on boost channel. With mini trim pots you can add some flavor to the sound.On the other side, you can't use boost channel without drive channel.", "id": 441}, {"review": "I bought this unit for a friend, and I could compare with others overdrives I already have. I think the MXR Badass Custom Modified Overdrive or Way Huge Green Rhino are better choise.", "id": 446}, {"review": "This unit is like a old blue jeans. Problaly exist betters pedals, but it's produce the vintage overdrive that match with everything...", "id": 447}, {"review": "I like a lot this pedal. It's has a deep overdrive. I'm using 18Vdc to supply power, and it deliverys a fat overdrive. I'm using a TS808 in front of OCD...", "id": 453}, {"review": "Very good tunner, with bypass switch. I think it's a good choise for any pedalboards. I changed this for a TC Electronic Polytune.", "id": 504}, {"review": "This unit produce a warm and vintage sound of a analog delay. It's not so &#34;digital and bright&#34; delay like Boss DD3 or DD7. Mod switch adds a perfect &#34;chorus&#34; effect for 80's Metal Ballads sound.", "id": 507}, {"review": "This tuner is wonderful. You can tune all strings in same time. It's halpfull in stage, because you don't need to test each string individually.", "id": 650}, {"review": "With this power supply you can offer to your pedals 9Vdc, 12Vdc, 18Vd or 12Vac. I'm using 8 pedals conected to this power supply, and I don't have any kind of noise or hum.", "id": 713}, {"review": "I bought this unit because my amp doesn't have reverb. But I discovered that this little pedal can give you greats sounds. Even when I use a reverbed amp, I turn it off and use my Hall of Fame.", "id": 748}, {"review": "This single pedal unit has a lot of  amazing and suprising effects. A lot of overdrive/distortions, filters, modulations, delays, reverbs, all carefully modeled. I put M5 side-by-side with the &#34;real one&#34; with a A/B switch, and don't heard differences. I'm using in musics where I need programed delays (like U2 or Pink Floyd) or when I need a specific effect - I only use Tremolo in 1 music, and this gear help me to save my money.", "id": 756}, {"review": "I had used some Boss CE-5 and CH-1 and substituted them with this unit. It's has a cool analog/vintage sound of chours.", "id": 767}, {"review": "You can set up 3 delays configurations, what is a interesting option to use on stage. Tap function also helps a lot. All type of delays are sounds beatiful...", "id": 856}, {"review": "It's a well build daisy chain DC power cable. It has good lenght between two plugs. You won't have difficulties to plug your pedals.", "id": 192}, {"review": "This pedal is great help on stage. It's fast and accurate, and with polytune &#34;option&#34; you can easily find which string is out of tune.", "id": 889}]