[{"review": "I've only used the string winder so far, but it works well so far. I use it on my guitars and my banjo. The other things look like they will work well, but I haven't used them yet so I can't say for sure. If not then I'll update this review (if I can).", "id": 94}, {"review": "I haven't used it a lot yet, but I really like it so far.. Much easier to put on than the 30 year old capo I was using, and it works for my guitars and my banjo, without putting them out of tune. It seems to be solidly made as well, and not too much pressure as others said.. My old capo put a lot more pressure than this does :P, and was much heavier. I'd assume it was made out of Cast-Iron or something instead of Aluminum.", "id": 116}, {"review": "Well, I ordered 2 sets of these, and 2 sets of medium strings when I got my first banjo, as I didn't know what gauge strings I would prefer. So far I like the light strings better for clawhammer, which is mostly what I play. Easy on the fingers and sound good, to my ears at least...Not much else to say about strings :P. Would recommend them.", "id": 255}, {"review": "So, I ordered this to learn to play the banjo, because of the price and good reviews. It was delivered yesterday, and the first thing I noticed was that the neck was loose, and the strings were easily an inch or more off the fret board. I looked to make sure it wasn't warped or cracked, and it wasn't.So I scoured the internet to find my problem, and most results said to tighten the metal rod in the banjo pot. So I took the resonator off, and found that it had an inch gap between the neck and the body, and naturally that scared me, but I tightened the metal rod, and it brought the neck down to the body, and brought the strings down to the perfect height.Now it's a very beautiful instrument, and it sounds pretty good too, Granted, It's not a Gold Tone or what have you, But it sounds at-least like a banjo that costs 2-3x this much. The only thing I would change is the tuning pegs, as they are made out of a cheap plastic, they don't feel like they will break any time soon though, I just prefer metal tuning pegs. (the part that holds the strings is still metal, I'm talking about the things your turn with your fingers to tune it is plastic)So, I'm debating on rating it 4 stars or 5 stars.. I'd rate it 4 because of the scare it gave me at first, but I think I'll rate it 5 stars because of it's looks, sound, and price. Yes, the reviews are right guys, don't be skeptical, But be warned that you may have to do a little TLC on it, as I did with the neck. No worries though, Now I'm learning my new favorite instrument. (Also, the strings that came on it are pretty decent, but new strings sound a bit better)", "id": 649}, {"review": "I bought it to tune my guitars and my banjo, it works good on all of them and is very accurate. I also used it to tune my uncle's mandolin for him because he couldn't find his tuner. Other than that theres not much else to say :P, I haven't used the metronome so I can't comment on that.", "id": 707}, {"review": "Well, I don't really know what else to say.. I ordered them for the guitar, Though I won't be using them for the banjo. (I prefer the sound of clawhammer banjo)The thumb picks fit my thumb perfectly, and the finger picks only needed a tiny squeeze to stay put. They feel kind of alien right now, as it's the first time I've ever wore finger picks, but I'll get used to them eventually :P.", "id": 640}]