[{"review": "This is a really nice item and I got two of them.  Unfortunately one of them did not thread properly into the base and I had to force it which has created a little wobble.  That's the problem with mail order. Sometimes on a cheap item its not worth the time and expense to exchange it. Oh well so far its working OK with the my old classical (beater) guitar I have hanging on the faulty one.  The other unit seems to be rock solid. Oh and by the way these hooks are too skinny for a classical guitar.", "id": 166}, {"review": "I was not happy with the sound of these strings. The EAD steel wound strings sound dull and the nylon GBE strings sound tinny. For an extra $2 I bought the D'Addario EJ45 Pro Arte and got a much, much higher quality sound out of my 40 yr old Yamaha G-60.  Spend the extra $2 its well worth it.", "id": 201}, {"review": "It does what its supposed to. I really like that the bottom is adjustable and gets the guitar higher or lower off the floor as needed.  A great price and a good item.", "id": 258}, {"review": "I got the $50 standard black on black case.  The case arrived within 2 days via UPS during the middle of the Christmas rush! Wow! Very fast shipping and it was adequately packaged and there was no sign of the box being abused in anyway. Regarding the item itself, I am bit lukewarm. I have a $500 Washburn and wanted something more than a gig bag for going to and from gigs and practice sessions. And I got that. Its lightweight, plenty of room in the gear box and on top of the guitar head.  However, the fit is a bit loose and I don't have the sense that this case will stand up to much abuse over time.  So if you have a pricey guitar or are planning to load you guitar in a truck with other gear, or might ship your guitar or take it on a plane, this case is not the one you want to buy.", "id": 320}, {"review": "This is a great item because it is small, lightweight and portable and it clips on anywhere (guitar, mic stand etc.) At the same time, because it is so lightweight it is prone to breakage if you give it hard use and don't pack it carefully when traveling etc..  The clip that holds the paper to the corrugated plastic clipboard is very strong.  The clip that goes to the mic stand is also strong but if you leave it on the stand for months at a time it will weaken and start to slide if you put more than 1-2 sheets of paper on the clip board. This doesn't happen tho if you remove the clip at the end of the gig, day etc.  For this price it's a good buy in my opinion and with a little care, you will get more than your money's worth out of it.", "id": 520}, {"review": "This is a good item and has served me well.  However I just upgraded to an Intellitouch PT10 for a bit more money and its a much more convenient and really easy to use.  The Korg runs off of ambient sound and gets interference from background noise while the Intellitouch is a clip on and uses vibration to 'hear' the note.", "id": 634}, {"review": "A great item for the price. Comes in two pieces and is easy to assemble. You only need to put in the two screws that attach the head to the stand. Each screw has a wing nut that you tighten by hand. It took me about 3 minutes to put together with no directions. It looks to be very solid and goes much higher than many other stands. Its also pretty lightweight and as I said the head comes off with two screws if you want to break it down for traveling. I am very satisfied with my purchase.", "id": 696}, {"review": "I've owned four of these over the past two years and after 6 months of light use (4-5 times per week) the first two malfunctioned. What I mean is the screen became so faint you could hardly see it and putting in a new battery didn't help.  My current one I bought in July and so far everything is holding up. Knock on wood!  They are cheap .....so I guess you could look at them as a disposable tuner but you'd better have a back up cuz they break when you least expect it.", "id": 707}, {"review": "This is the new and improved Snark. The display is much more readable and after several months of use display is still bright. I found with other models that the display faded and was not renewed even with a new a battery. The only downside to this one is that the bars on the display are so thick that the string has to be more out of tune before it shows up on the screen. So the display is very readable but not as accurate as prior display screens. However the price makes them a good deal even with their minor flaws.", "id": 811}, {"review": "I like this product. The screen is big and easily read. The meter is responsive and lets you know via a the needle, the note (sharp or flat) and by the background color going green to red. It takes 2-3 seconds to 'hear' the string but then it locks right in for all notes, even the low E.  It's really easy to use and I'm really happy with it. Its so much better than my Korg CA-1.  The only suggestion for improvement would be another swivel. It takes a minute or two to figure out how to attach it to the guitar head and have the screen in the right position. An additional swivel would make it perfect", "id": 627}]