[{"review": "This is a fine cable at a decent price point, nothing exceptional mind, but it gets the job done well enough.", "id": 5}, {"review": "Its affordable and it works.  Its a nice little adapter for your low impedance cable to your high impedance input.", "id": 12}, {"review": "This is a standard on my peral board along witht he Blues Driver.  This little yellow box is the most bang for your buck you are going to find in an Over Drive pedal.  It is tough, sounds like fire, and will serve you well.  For $50 there is seriously no better deal.", "id": 38}, {"review": "These are stylish and fit perfectly on my guitar.  They are even and not warped like the stock ones were.", "id": 80}, {"review": "I needed some little, easy, and portable guitar stands for the stage.  This does it perfectly, well.  While being light and portable.", "id": 91}, {"review": "Hey it does its job for a cheap price.  I use it put mh guitar and Harp Mic through the same rig.  It does that.  It is plastic and Im not sure its inputs are the most efficient setup, but again it works.  Which in the end is my concern.", "id": 375}, {"review": "This is a warm analog delay with a great deal of range.  Its warm and the modulation sounds great.  This is not a digital delay the echos will not be exactly what you play, but that is why you get an analog delay, so you hear the part just a little to the left.  Get it, it is tank tough and endless hours of fun.", "id": 507}, {"review": "This is a simple analog chorus.  Its straight forward and perfect for any board, and guitarist, that needs a little chorus from time to time, like myself.", "id": 672}, {"review": "The first power source that is fun.  It can take the edge off of a distortion of OD pedal by rolling off the voltage.  I have yet to use it with a fuzz but I hear it sound sick.", "id": 760}, {"review": "First it tunes very accurately. Second its low profile, I keep it tucked under the head stock, the crowd can't really see and I it is completely usable if I need to quickly tune during the set and my ears aren't cutting it.  Third, buy it if you are looking for a new tuner.", "id": 785}, {"review": "I ordered two of these cables and they arrived on time and as advertised.  They are excellent quality, clear tone and a great look.  I was actually impressed with the room that the cables gave my tone and the clarity they have.  For Price and Quality these are top notch.", "id": 875}]