[{"review": "My old pair of JBL Studio Pro computer monitors finally gave up the ghost. At the time, mid 1990's, these were the best you could expect for computer monitors. I do mixing and voice overs, so I needed the real deal. After extensive research and listening, I decided on the M-Audio BX5a deluxe. For the price they can not be beat! Punchy crisp bass, smooth highs and great mid range. They are also very accurate, I hear things just the way they are recorded. They also bring to light subtleties in old CD's that I have never heard before! Also the wood construction, gives these speakers a warmer resonance than others made out of plastic or metal. If you have a studio on a budget, and need the best speakers for under $500.00, buy these. Remember, they are studio monitors, so the audio is going to be very directional, so use them for monitors. Great speakers for portables, like an Ipod. One note, you need a really good sound card to get the most from these babies!", "id": 502}, {"review": "I have used many microphones, from  expensive Neumanns, Sennheisers, Sure, AKG to the less expensive Berringer B2 Pro and Sony. I spent over 8 years in professional radio and 30 plus years doing voice over recording and sound mixing, so I have heard and used all types of mics and I have to rate the Blue Yeti at the top of my list for many reasons. First is sound quality, all the patterns have a smooth, open sound, the cardioid pattern has added richness for voice over work, comparable dare I say to a Sennheiser or Sure. The sound in all the patterns was not colored or muted at any frequency level, which what is I was expecting in the stereo mode, but in that pattern, voices sound great and an acoustic guitar sounded rich, plucky and natural. Next is the construction of the mic and stand, from the pictures I was expecting plastic, nope, it is made of very solid metal , except the buttons and switches. Third is the versatility, you can record almost anything in any type of circumstance not just adequately, but with excellence, try that with a $2,000.00 Neumann! The set up could not be easier, just plug it into your USB jack and let her rip. I only paid $100.00 on Amazon,a true bargain, for what is a top notch piece of gear, where the engineers of this product really took their time to design something of real quality and looks like a piece of art. The Yeti also stands up to audio processing, where I have to say all of the other mics I have used for under $200.00 show their weaknesses. The only thing I would like to see is a shock mount made for this mic, it is just too big for all of my other mounts, but the Yeti does not seem to pick up as much vibration from the table as other mics do (I also use a slab of 1/4\" neoprene padding to absorb some table shock), and the Yeti has no real audible self noise. If you want a great microphone at an incredible price, the Blue Yeti is the one for you!Addendum 9-30-2011My complaint about the shock mount has been resolved, with the Blue Radius, which I received a week ago from Amazon, which I love. Makes this great, and I mean great microphone even better. I have done side by side comparisons to the Neumann U87, the Sennhieser D421, the Lawson L47, all top notch and very expensive studio mics. The Yeti sounds as good. Of course you have to learn how to work a microphone properly to get the right sound. I cringe at some YouTube demos of this mic, some of the folks are not using this, and I'm sure other mike's correctly to get the best sound. Also the more I use the Yeti, the more seasoned it becomes, in comparison recordings done a year ago, the Yeti seems to get a smoother sound, as time goes by.", "id": 644}, {"review": "Nice and thick, the adhesive is very strong. I have used it on microphone electronics to shield out RF noise. If you don't have the shielding grounded, or in a continuous loop, it won't work. If you hear hum, it's not the shielding, it's your technique.", "id": 694}, {"review": "This is a very well built stand, even with its slim design, which also comes with a nice carrying case. Very good for light, portable set ups. Also holds a big mic, if you position the legs right; completely open with the mic parallel to a leg. That said, do it wrong and plunk. Will not likely stand up to a gusty wind, so use it indoors only. Paid $7.99 for it. Would give it 5 stars, but I know user error, will cause a less careful person, to crash some mics. Good for kick drum and cab mics, by the way, anchor it down with a sand bag, if using it for this purpose.", "id": 708}, {"review": "I just received my Blue Radius Shock Mount, and I was immediately floored by the the size and looks of the unit. It reminds me a set piece from Fritz Lang's \"Metropolis\", the rings around Saturn or something built by Tesla. It's a beautiful thing, certain to impress anyone who might sit in front of it to be recorded. Certainly beats the homemade 4 inch PVC pipe and bungee cord shock mount I previously had made and my Yeti mounted to. What is impressive about this mount is you have full and clear access to the the Yeti's 3 knob's, mute switch and USB/Headphone plugs on the bottom of the mic, whereas my homemade version gave me fits with knob access. Once you screw the Yeti into the machined shock mount base, there are teflon or maybe white delrin washers which allow you to swivel the mic easily to access the back knobs or move it toward any position, say a guest speaker with great ease. The build is hefty, machined aluminum rings with stainless steel mounts and screws. The elastic suspension bands are not going to fly across the room, as they do on most shock mounts, because they are not threaded on hooks, but securely fastened to brackets, then the holding screws. The Radius also allows you to mount the Yeti on a boom stand, upside down, which I have always been told is the best way to mount a condenser type mic so dust and moisture (spit) does not build up near the capsules or internal electronics, it just falls, as gravity allows.Does a shock mount make a difference in sound? To my ears, yes, especially if you are recording into say, a laptop on a table, the fans and hard drive are going to vibrate, coloring your overall sound with unwanted hum. Although the mic stand the Yeti comes with does an O.K. job of dampening vibration, it is not going to give you as much isolation as the Radius, which will be noticed when the gain controls are turned up. There is also the science of unwanted resonance from instruments, rooms or cabs vibrating your stands, that's why you see most professional studios using shock mounts, you just get a cleaner sound. In a test, the Radius works like a charm, even from pounding on my mixing desk. A 9.0 earthquake is not going to cause any vibration.On the down side, just to play Devils Advocate, The Radius is huge, and may nor be suitable for tight spots or portability. That said, the Yeti is also a big microphone, and once mounted, may add six inches to the overall space you will need to use this setup properly. Next, when you un mount the Yeti from it's built in stand, you are going to have gaping screw holes in the side of the mic. I fixed that by screwing the old Yeti stand screws back into the holes, which actually looks kind of neat to me. To some maybe, it will look like bolts in the Frankenstein Monsters neck, but I think it all fits together. Next, smaller base microphone stands will want to tip, either angle the Yeti plus Radius back, or get a bigger stand, this is the one I have and would highly reccomend, theSamson SAMD5 MD5 Desktop Mic Stand. Lastly, this mount will only work, as far as I can see, with a Blue Yeti or Blue Yeti Pro microphone, maybe some other mics will work, but not likely.In conclusion, the Radius is an easy set up, works great and makes a Yeti look retro/futuristic sexy! Yeah it actually looks really cool, like a spaceship blasting off or landing, take your pick, I know people coming into my studio are going to say, \"What The heck is that, and where can I get one!?\" I may tease and say it's and award or art piece.Addendum 12/13/2011If you thread another shock mount into the Radius, you get double protection. It also looks great to talent in your studio. Over Kill or Uber Cool, you decide. See Pictures.", "id": 780}, {"review": "First of all, let me say, from some of the pictures I have seen posted of this Pop Filter, when put on a Yeti mic stand, the clamp will fit on the stand as pictured. This is a design flaw, not with the Pop Filter, but with the Yeti stand, as this filter has been around long before the Yeti came out. Blue, or a clever do it yourself person, could easily fix it, by drilling more holes into the side of the clamp mount. Then you could move it forward and simply screw the side mic mount screws into the stand. There are many great pictures of other clever fixes, as well.  Since I have mine hanging upside down, on a boom stand attached to a Blue Radius Shock mount, this is not an issue for me, but I will say it is a problem Blue should fix. (I have written an addendum on the bottom, for a great fix.) Other brands of filters will give the same, if not more problems. I am not going to knock any stars off, because I'm reviewing the filter itself, which is superb and how it works for me.Now for the meat. This is a studio grade, high quality product, all metal, except for the two tightening knobs. The dual screen design eliminates any plosives, P's and B's for example, better than any screen I have used so far. This is especially true when, the screen distance is about an inch from the Yeti capsule screen, and you are 4 to 6 inches away from the unit itself, which I have found to be the Yeti's sweet spot in the Cardioid pattern. Next the silk screened Blue logo also helps you find the sweet spot, if you place it in front of the capsule area. I like the idea of a metal screen, especially if you are transporting it, you won't have to worry about snagging,or runs, as you do with the cloth filters. Speaking of old cloth filters, I have a Neumann, which is about 12 years old, a very nice screen as well, but it does not cut the pops as well as the Blue, especially if you get closer to the mic and screen. Also when reading copy, or maybe music, I can see over and through the Blue filter, much better than the round 6 & 1/4 inch jobs Like the Neumann. You can contort the neck of the filter in any position easily, cheaper filters I have used in the past, will creep back into unwanted positions, the Blue behaves. The Blue Pop is absolutely transparent, no muffling, as with foam filters, The curved design of the Blue Filter also protects the sides from plosives and possible proximity errors of a poorly placed screen or none at all. The screen is a solid build, as are all of the Blue products I have used so far. It also fits the look of the Yeti and Radius Shock Mount like a glove. Surprisingly, I paid a little over $30.00 on Amazon, a real bargain in my mind, for such high quality. This filter is for all the Blue Microphones by the way, and I am going to use it on my entire collection of mics!10/7/11 AddendumIf you need to use the Yeti as a table top mic, especially if you are using a shock mount and pop filter (any brand), I would suggest buying aSamson SAMD5 MD5 Desktop Mic Stand, which works great for this set up!", "id": 200}, {"review": "It does what it is suppose to, cut vibration and well I might add. Much better than a standard clip on a mic. This one is not going to break if you take the mic on and off, since it's rubber. If it does break, has a lifetime warranty. Had a Shure SM58 on a table, on a stand in this clip, pounded on the table, only picked up the tap sound my hand has making, and no sub harmonics vibrating though the table. Moved the mic off axis, pounded again, absolutely no noise. Can't ask for more than that.", "id": 247}, {"review": "This is just what the doctor ordered. I bought three and am purchasing 3 more. All of these units threaded nicely into all of my stands and microphone holders. If I switch one mic to another stand, it could not be easier, just a press of a little button. With different shock mounts on different mics, I don't have to worry about re-threading the mounts each time I change mic stands. The time it saves is also invaluable. No problem with quality control on the 3 I now have, and I have no complaint with the build. Great for the studio, where I use mine, would think It would be clumsy for a performer who takes a mic on and off a stand, use a clip for that.Addendum:I love these so much, I have bought one for each mic in my locker, and each stand. That's a total of 12. None of them have failed after almost a years worth of use, the best invention for a mic since the shock mount. These will save you time, guaranteed!", "id": 271}]