[{"review": ".I BOUGHT A UKULELE  TO GIVE AS A PRESENT.  I KNEW THE STRINGS THAT COME EQUIPPED  ON NEW MUSICAL STRINGED INSTRUMENTS WOULD BE OF POOR QUALITY SO I PURCHASED THESE MARTIN STRINGS AS A REPLACEMENT.  I'VE USED MARTIN INSTRUMENTS FOR MANY YEARS, AM FOND OF THE MAKE AND QUALITY OF THE MARTIN PRODUCTS.  THIS WAS AN EASY CHOICE FOR ME. THERE ARE OTHER EXCELLENT STRINGS AVAILABLE.  THIS JUST WAS MY CHOICE THIS TIME.", "id": 45}, {"review": "I BOUGHT BOTH THIS STAMP FOR GUITAR AND ALSO ONE FROM THE SAME COMPANY FOR MANDOLIN, UKULELE, BANJO.  I'M PLEASED WITH BOTH STAMPS. LARGE ENOUGH TO SEE, USEFUL TO STAMP CHORDS ON MY OWN MUSIC SHEETS AND OTHER MUSIC THAT DOS NOT HAVE GUITAR CHORDS SHOWN.", "id": 361}, {"review": "BOY, WAS I SURPRISED AND PLEASED WHEN THE BANJO ARRIVED AND I TOOK MY FIRST LOOK AT MY NEW PURCHASE!  THE INSTRUMENT IS FAR SUPERIOR THAN I WOULD HAVE IMAGINED FOR THE PRICE I PAID FOR IT.THE WORKMANSHIP AND QUALITY OF THE FINISH IS REALLY FINE.  I .RECOMMEND IT WITHOUT HESITATION TO ANYONE WHO WANTS GOOD VALUE FOR THEIR MONEY.  THE PACKAGE WAS REALLY WELL DON E AND ARRIVED IN GOOD TIME.  I HAVEN'T LEARNED TO PLAY THE BANJO YET, BUT HAVE PLAYED UKULELES, GUITAR, TIPPLE, AND LUTE SO I KNOW A GOOD INSTRUMENT WHEN I SEE IT..", "id": 649}, {"review": "I BOUGHT THESE FOR THE SOPRANO UKULELE I BOUGHT FOR MY LITTLE GREAT NIECE.  I DON'T NEED TO USE THEM MYSELF.  I ALSO HAVE THE SAME QUALITY STRINGS ON MY BARITONE UKULELE.  THE STRINGS ARE VERY GOOD. IF YOU HAVE A INEXPENSIVE UKULELE, THE USE OF THESE STRING SHOULD IMPROVE THE QUALITY OF THE TONE OF YOUR INSTRUMENT.  IF YOU ATTACH THE NEW STRINGS CAREFULLY, THE TIME FOR THEM TO SETTLE DOWN AND STAY IN TUNE SHOULD NOT TAKE VERY LONG..", "id": 698}, {"review": "BOUGHT THIS SN-2 SNARK TUNER AFTER I BOUGHT A UKULELE SNARK FOR MY LITTLE NIECE  I WAS SO PLEASED AT THE EASE OF ITS USE.  I MAINLY WANTED THIS FOR MY BANJO BUT I ALSO NOW USE IT ON MY BARITONE UKULELE, A GUITAR AND IF I EVER GET INTO THE SPIRIT I MIGHT JUST TRY IT ON THE OLD MANDOLIN THAT MY GREAT AUNT LEFT ME. . THE SNARK IS SMALL, VERY LIGHT WEIGHT, AND SUPER EASY TO USE.  IT'S A VERY WORTHWHILE PURCHASE.", "id": 707}, {"review": "MY THUMB GOT SORE!  I HADN'T PLAYED ANY OF MY STRING INSTRUMENTS FOR SOME TIME.  THE FINGER TIPS ON MY LEFT HAND WERE NO LONGER CALLUSED AND MY RIGHT UKULELE STRUMMING THUMB WAS TENDER FROM BEING OUT OF PRACTICE.  HENCE MY PURCHASE OF THESE FELT PICKS.  THE PICKS ARE FINE.  THEY ARE USEFUL.  MY ONLY COMMENT IS THAT I REALLY LIKE A FELT PICK THAT IS THICKER AND A LITTLE SOFTER.  THESE ARE GOOD BUT DIFFERENT.", "id": 775}, {"review": "I'VE ALWAYS TUNED MY UKULELES BY EAR.  NO PROBLEM.  BUT I RECENTLY BOUGHT A SOPRANO UKULELE FOR MY GREAT NIECE AND KNEW I  COULDN'T ALWAYS BE THERE TO TUNE IT FOR HER.  I WAS LEARY ABOUT THE USE OF THE SNARK DESPITE READING MANY FAVORABLE REVIEWS PRAISING IT.  BUT I'M NOW A CONVINCED SNARK USER..  SO SIMPLE.  SO EASY TO USE.  SO ACCURATE.  SO LIGHT.  PLUCK A STRING AND TUNE IT TO THE DIAL, AND EUREKA .-  SUCCESS.  BUY ONE - YOU'LL LIKE IT.", "id": 763}, {"review": "YES, DEAR READER, THIS STAND WILL WORK AS A GOOD SUPPORT STAND FOR NOT ONLY MY GRAND CONCERT SIZE ACOUSTIC GUITAR, FOR  MY FIVE- STRING BANJO (WITH RESONATOR), AND.ALSO  FOR MY BARITONE UKULELE.  THE STAND IS.STURDY, PROVIDES GOOD SUPPORT, AND LOOKS GOOD.  I AM PLEASED WITH MY PURCHASE. AND WILL PROBABLY BUY ANOTHER JUST LIKE IT FOR MY BANJO. THE PACKAGE ARRIVED IN TIME AND WAS PROTECTED BY AN ADEQUATE SHIPPING CONTAINER..", "id": 883}]