[{"review": "I have tried a few and this is the one I settled on if you need a multi-tool.  The cutters rip through bass strings like butter and seem to hold up.  The winder is nicely balanced and the grip is good.", "id": 94}, {"review": "This is a great pick for all those that use picks, but need a softer sound occasionally.  Much easier than getting your fingers all tangled up.  The only negative is the way they seem to be packed here.  They come in three colors and the colors stand for soft, medium, hard.  They also come in 3 and 5mm which is the size of the grip thickness (where you grip the pick.)  The white is soft, the medium grey is medium, and the dark grey is hard.  I use the white and medium grey in 3.1mm and find that easy to adjust too.  They are soft and they do wear fairly quickly, but you just keep playing them or do a little cutting to sharpen them back up.  You get a nice soft tone and, just like using any other plectrum, you develop a picking style to get various tones (double bass, acoustic, finger style, etc.  I use the soft picks for a smooth tone, and the medium pick for a deep jazzy sound (think Motown.)  I never leave home without at least three of each in my gig bag.For a real trip, if you are able to finger pick, try out the Jam Cat pick holder sold here.  It is so easy to switch from finger to pick in an instant and it is always there when you need to rock it up a bit.", "id": 245}, {"review": "Tested by the guitar mags to be the best strap lock available.  These are basically the same as Schaller strap locks.  They cost less money and I think the parts are interchangeable.  It is still best to keep them seperated as to their original manufacturer (disclaimer.)  I know that the Fender buttons will work in the Schaller strap portion of the lock.", "id": 607}, {"review": "I am a bass player and most winders don't work very well with the large tuning keys.  This one works better than anyone I have tried.  None of them work as good as I would like.  Once you learn to loosen up on your grip you will get better results.", "id": 683}, {"review": "I'm a bass player and so I don't deal with cut picks much.  These picks are really hard and last forever.  I did not notice any additional string wear or damage.  These would probably better suited to guitarists.", "id": 686}, {"review": "I play bass with these and they have a unique tone.  The scratchy surface gives it a really gritty tone for rock music.  Makes Rotosound strings really sound off.  I have not found that they are so hard on strings that the strings were out from use rather than the picks.  It does take a bit of use to get good with them, but it is worth it for when you need that really growling tone.", "id": 804}]