[{"review": "This is what all distortion pedals are judged by.  Adds thick creamy distortion, enhances harmonics, and maintains great attack and definition.  Sounds awesome.  True bypass.", "id": 232}, {"review": "Thought I would give this pedal a shot since it was inexpensive and sounded really good in the online videos posted for it.  Pros:  Very good sound quality, many options for echo to suit every individual taste, bright blue & flashing red (for tap tempo) LED's, stereo - dual out/in operation, tape + analog + digital types of delay = awesome, guitar signal \"smooths out\" when engaged, and class A bypass.  Cons:  Volume decrease by a hair when you engage the pedal, signal becomes a little bass-ier (but it sounds good) with the analog echoes, batteries go FAST (get the adapter).All in all, it was worth the money.  Comes with a warranty too, so no reason not to try it.  A lot of options available with this good-sounding pedal.", "id": 509}, {"review": "If you want to increase the amount of gain and distortion in your tube amp, drop one of these in the V1 position (the tube closest to the input jack of your amplifier).  Easy to do, and you'll notice an immediate increase in distortion.Placed one in a Fender Blues Junior.  Before when the master was down and the pre-amp/volume was all the way up, I could barely get some overdrive.  Afterwards, it had plenty.  Night and Day difference.Good sound too... Not harsh, adds harmonics.  Very lush sounding.  Tung Sol knows how to do it.", "id": 514}, {"review": "Bought this as a supplement to my other amps (to record blues tones).  I first saw it in a big box musician's store while there was a \"blues guitar session\" going which is a public jam session open to anyone.  They had a lot of tube Fender amps plugged in.  I was surprised when I plugged into this amp away from that group, turned it up, and started playing... It sounded just as good as those other amps.  The two employees that worked there and two other customers couldn't believe where the sound was coming from... even the other players checked it out.  I don't understand how Fender has managed to keep this amp a secret for so long... poor marketing maybe?  I don't know, but if you want a blues or blues-rock amp with some great vintage tones, check these out.  Pick up a used one.They sound like a tube amp because, essentially, they are.  The amp sounds big and warm from the tubes, not thin and tin-like.  Has GREAT overdriven tweed, blackface, and bassman models.  A couple of the Marshall settings aren't bad either.  This amp sounds better than the Super Champ to my ears (tried this out at the store as well) which makes sense since it's a class A amp as opposed to class B... warmer and more articulate.The speaker is decent but this amp also sounds great using an external speaker cabinet.For home jamming and recording blues without driving everyone nuts, this amp is a God-send.  Check one out and you'll want it.", "id": 553}, {"review": "No loss of initial tone with this pedal which was #1 on my priority list as I love the sound of my guitar and amp.  The &#34;hall&#34; setting is phenomenal.  Transparent in your signal chain when off as well!  Love it.", "id": 748}]