[{"review": "First off; let me start by saying I bought this guitar because it was only $100 and I was board on my deployment and wanted something to brush up on before I return home.I DID NOT: expect good quality, sound or comfortably from this guitar.I DID: want something cheap I could toss around and use out here in the desert without worrying about it getting beaten up or trashed.When I unboxed this guitar I was floored! The hardware is much higher quality than I had expected by far. The strings it came with weren't complete crap, but I swapped them out for my favorite set of strings: Ernie Ball 2406 Ernesto Palla Nylon Black and Silver Classical strings. The guitar sings beautifully; the tone is rich and vibrant.It's quite comfortable to play, I have no problems playing up to the 16th fret without this guitar having a cut away. I'm not a big fan of the pick guard that has the Epiphone 'E' on it, so I will probably end up removing it; but the sunburst is really nice looking. I have received many compliments on the look of it already.OVER ALL: this guitar is a really great instrument for the price tag. GET IT!Also; I'm buying a hard case to take it home, or shipping this guitar back home to myself because I want to keep it as part of my collection. My original thought was to buy this guitar and leave it out here at the Rec tent for other people to use after I'm gone. Even if I do decide to leave it out here; I'll be buying another one when I get home!", "id": 53}, {"review": "I've seen Joey Jordison from Slipknot playing on a metal folding chair before, so i'm going to say right off the bat that you can play sitting on just about anything. It's pretty hard to make a crappy product when it comes to Drum Thrones, so with that I'm going to say you're either going to get a great product or something that you can't even use. In this case, you can look forward to getting a great product here! The stool is very sturdy, no rocking, no swaying, no moving at all. Very comfortable... in fact, my girlfriend grabs it to sit on every time she comes into my studio to hang out with me. Worth the money, great product!", "id": 139}, {"review": "it does what's it's suppose to do... holds a mic, pretty much what you see is what you get... works very well.", "id": 179}, {"review": "This pad is great for midi VSTi's, Drums, Queuing, and it's got great action! Works great with Ableton, Reason, FL Studio, Cantabile Performer and a whole bunch more DAWs and hosts.The software is a little lame and doesn't always work properly... but you don't really need it that much anyways... so it's whatever..", "id": 628}, {"review": "I bought a set of these from Amazon's warehouse deals page with a discount because of some expected damage. They showed up in pretty good shape though to my surprise!I was expecting some damage to the items, but hoping that between the 2 of them that i would be able to salvage enough to put together one full stand. I bought these because I needed ONLY 1 stand with good height on it for mounting my 32\" LCD Hitachi Flat screen to it. I use this TV in my studio so that everyone can see what's going on when we record and work on music. I needed something that was going to be sturdy and hold the TV high enough that everyone in the studio would be able to see it all the time.Both stands showed up in good and working condition. They go up to about 8' tall and are perfect for mounting speakers onto, although I use it to mount my TV about ceiling height which is about the same weight as my speakers if not more. They work GREAT! I'm going to add some pictures of my creation when i get around to it, give me about a month....", "id": 655}, {"review": "I wasn't expecting much from this case; I bought it on a deployment to take a guitar back home with me that I had also order off Amazon that was of better quality then I had expected. This case is sweet! I love the black and crome, it looks great and the inside is well cusioned and really smooth. If you need a case don't even think twice about, this is a great one at a great price.", "id": 859}]