[{"review": "I recently ordered this ukulele and 4 others while researching products for my senior adult choir at church as I wanted to give them a few options.Okina UK100 Soprano Ukulele with Rosewood Fingerboard - NaturalDiamond Head DU-150 Ukulele, NaturalMahalo U-30OR Painted Economy Soprano Ukulele (Orange)Lanikai LU-11 Soprano UkuleleKala KA-15S Mahogany Soprano UkuleleThe Okina, Diamond Head and Mahalo were all under $30 at the time and within $2 price of each other.  Of the three, I thought that the Mahalo was the best offering both visually and in terms of tone quality.  The Okina had a poor sound quality even compared to my own 20- and 40-year-old ukuleles (which had the original strings).  A string upgrade to Aquila strings helped significantly, but even then, the Okina still had a far worse sound quality at this price level.The Diamond Head and Mahalo both sounded better even with the stock strings and each includes a very nice (for this price) little gig bag.  Incidentally, what the Mahalo product description says is a \"color-matching brown gigbag\" ended up being black, but black is pretty standard gig bag color.  The Mahalo has the most \"island\" look to my eyes and the best sound.  Much of the sound can probably be attributed to the strings which are more substantial than the Diamond Head's.  That being said, it still makes financial and practical sense to get the Mahalo since it's so near the same price (compared to the  Diamond Head) and has better strings already installed.  I've also reviewed the Lanikai and Kala on their own pages.", "id": 589}, {"review": "I ordered this product to review for possible use by members of my senior adult choir at church.  It was ordered with a little trepidation after reading some of the previous reviews.  I found it to be excellent for the price and so far, have had no problems with the zippers.This product is described as a \"Soprano Ukulele Gig Bag\" and that is exactly what it is.  A \"gig bag\" is *not* a rigid FAA-approved flight case, nor is it a semi-rigid polystyrene \"case\" with soft covering.  Reviewers that don't believe this is sufficiently padded are looking for something other than a \"gig bag\" and don't understand the term.  You wouldn't put your reading glasses in a soft, padded case and expect to be able to sit on them would you?I don't know if some other reviewers tried to fit concert-sized ukuleles or other larger sizes into this bag, but I found that it fits the soprano size perfectly.  It is *very well padded* for a gig bag, having extra padding at the base of the instrument (where the bottom strap button would be if you have one) to cushion the bottom if you hold it standing on end.  It also has a nicely padded handle.  I received it in a box with other items and it was packaged well.  (Ukulele not included.  They cost a little more than this.)", "id": 593}, {"review": "I ordered the Hola! and the Snark SN-6 to preview for my senior adult ukulele players at church.  I've spent the last week or so tuning a large group of 20 or so ukuleles twice a day to allow them to &#34;settle in&#34;.  I've used both of these similarly priced tuners and have found them both to be excellent.  I can't really tell any difference in the accuracy of either one.  They are both contact tuners, meaning that they pick up the vibration of the instrument rather than relying on an external microphone.The Hola! is definitely the best choice of the two in that it's more versatile, easier to use, more durable looking, and easier to store.  The Hola! lies virtually flat and takes up less space in every dimension than the snark.  It comes in a plastic sales container that can be reused to offer further protection if you feel the need.  The Snark's curved display arm (which you can't really see in the photo) is slightly more delicate looking, in addition to the fact that it extrudes farther.  I found the Hola! display to be bigger, brighter and generally easier to read.  Honestly, most of these differences are minor especially when considering how inexpensive these tuners are.  The really important difference is the &#34;tuning mode&#34; feature on the Hola!.Hola! offers very simple operation with one button for power and for switching between its 4 modes of function.  You can select &#34;chromatic&#34;, &#34;guitar&#34;, &#34;bass&#34; and &#34;ukulele&#34; modes by briefly pressing the power button (as opposed to a long-press for power on/off).  This is an especially important feature if the user is not an experienced and knowledgeable musician.  Imagine trying to tune with a an 88-key piano if you don't know anything about the notes on the piano.  &#34;Ukulele&#34; mode is like using a piano with only 4 notes.  Use &#34;chromatic&#34; to tune your uke differently than standard or tune other instruments.The snark *is* superior in it's rotating display which can be turned and rotated in almost any direction.  If turning your head *at all* is a deal-breaker, get the Snark.  I found the Hola!'s display to be more than sufficient.  I'm currently using the snark on my guitar.The Snark comes with a baggy and a reclosable, cardboard box.  I have no problem with it, but the Hola! stores better.  I don't really see this as a true ukulele tuner without a &#34;ukulele&#34; setting.  It's a chromatic tuner.  It very well may be sized differently from their other models to fit better on ukuleles.  Other than that, I'm not quite sure what makes it specifically a &#34;Ukulele tuner&#34;.", "id": 763}, {"review": "I recently ordered 5 different ukulele models while researching products for my senior adult choir at church as I wanted to give them a few options.Okina UK100 Soprano Ukulele with Rosewood Fingerboard - NaturalDiamond Head DU-150 Ukulele, NaturalMahalo U-30OR Painted Economy Soprano Ukulele (Orange)Lanikai LU-11 Soprano UkuleleKala KA-15S Mahogany Soprano UkuleleThe Okina, Diamond Head and Mahalo were all under $30 at the time and within $2 price of each other.  Of the three, I thought that the Mahalo was the best offering both visually and in terms of tone quality.  The Okina had a poor sound quality even compared to my own 20- and 40-year-old ukuleles (which had the original strings).  A string upgrade to Aquila strings helped significantly, but even then, the Okina still had a far worse sound quality at this price level.The Diamond Head and Mahalo both sounded better even with the stock strings, and each includes a nice (for this price) little gig bag.  The Mahalo has the most \"island\" look to my eyes and the best sound.  Much of the sound can probably be attributed to the strings which are more substantial than the Diamond Head's.  That being said, it still makes financial and practical sense to get the Mahalo since it's so near the same price (compared to the  Diamond Head) and has heavier strings already installed.  I've also reviewed the Lanikai and Kala on their own pages.On an almost irrelevant note, the Diamond Head was the only instrument of the 5 to arrive in something close to actual tuned-up string tension.  It takes several days for these nylon strings to stretch and settle in, but I didn't have to retune the Diamond Head so much because it was already virtually in tune.  This would not be my primary concern with purchasing an instrument for myself but may be a significant headache-saver for a non-musician parent purchasing a ukulele for a young child.", "id": 840}, {"review": "I ordered the Hola! and the Snark SN-6 to preview for my senior adult ukulele players at church.  I've spent the last week or so tuning a large group of 20 or so ukuleles twice a day to allow them to &#34;settle in&#34;.  I've used both of these similarly priced tuners and have found them both to be excellent.  I can't really tell any difference in the accuracy of either one.  They are both contact tuners, meaning that they pick up the vibration of the instrument rather than relying on an external microphone.The Hola! is definitely the best choice of the two in that it's more versatile, easier to use, more durable looking, and easier to store.  The Hola! lies virtually flat and takes up less space in every dimension than the snark.  It comes in a plastic sales container that can be reused to offer further protection if you feel the need.  The Snark's curved display arm (which you can't really see in the photo) is slightly more delicate looking, in addition to the fact that it extrudes farther.  I found the Hola! display to be bigger, brighter and generally easier to read.  Honestly, most of these differences are minor especially when considering how inexpensive these tuners are.  The really important difference is the &#34;tuning mode&#34; feature on the Hola!.Hola! offers very simple operation with one button for power and for switching between its 4 modes of function.  You can select &#34;chromatic&#34;, &#34;guitar&#34;, &#34;bass&#34; and &#34;ukulele&#34; modes by briefly pressing the power button (as opposed to a long-press for power on/off).  This is an especially important feature if the user is not an experienced and knowledgeable musician.  Imagine trying to tune with a an 88-key piano if you don't know anything about the notes on the piano.  &#34;Ukulele&#34; mode is like using a piano with only 4 notes.  Use &#34;chromatic&#34; to tune your uke differently than standard or tune other instruments.The snark *is* superior in it's rotating display which can be turned and rotated in almost any direction.  If turning your head *at all* is a deal-breaker, get the Snark.  I found the Hola!'s display to be more than sufficient.  I'm currently using the snark on my guitar.", "id": 846}]