[{"review": "I've been playing guitar my entire life. And I've tried almost every pick there is. After hearing how great it is, I decided to buy it. It felt really small at first, and i kinda was dissapointed. I put it down, and didn't use it for quite some time. For some reason i decided to pick it back up, and after a few minutes i came to like the pick. Days after using it, i got accustomed to its size, and I became much more efficient with picking. And I no longer had to worry about the pick slipping. I can't really go back to normal sized picks now.. haha. That's like the only downside I can think of. There are many dif versions of this style, so buy em all, and try em out. If these don't work for you, you can always buy the V-pick.", "id": 67}, {"review": "There's not much to say about this product, except that it works. It makes my strings last longer. Sometimes I get lazy owning so many guitars, and 20 minutes per &#34;well done&#34; restring adds up. This is a great way to put that off and keep jamming for as long as possible. It's small and conveniently stored too. I recommend trying it out!", "id": 72}, {"review": "I use earnie ball strings as my backup strings. They don't have as nice and clear a tone as my d'addario or curt mangan strings, nor do they have the life expectancy, however they are cheaper and really easy to bend. Since I can't afford to restring with the more pricey strings every single time, I go with these when I'm practicing. They do break alot when I play some crazy solos, which blows, and is the main reason why I'm not giving them 5s. (No it's not my technique, I've never broken a string on any other brand strings I've tried.) When I'm in the studio recording, I prefer, like I said before, D'addario or curt mangan strings, however to save money, I practice with these strings and I think it's not a bad method, as I go through strings like doritos (I eat doritos alot).", "id": 98}, {"review": "I decided I wanted to hang my guitars on my walls instead of having them take up space via floor stands. Just find a stud and drill in the screws they'll hold just fine. I'm really bad when it comes to stuff like this so I had my brother help me. Just make sure you know what you're doing because I thought I did when I really didn't at all.The wall hangers look really nice in person, and they keep the guitars held in place very nicely/safely. The only thing you should have to do extra after purchasing and installing these is creating a makeshift wallpad for behind where the guitar is hung; if something happens that makes it hit the wall, it won't damage the guitar or the wall.This is as legit as it gets if done right, though; I've had my guitars hung via String Swing for months and I've had no problems or concerns. I am very pleased with the cheap alternative to floor stands. It saves room and makes the room look cooler.", "id": 154}, {"review": "I love these picks, especially in this gauge. They are a bit thinner than the jazz 3s, so if you master em, you can in theory, play faster ;) They have a good grip, and a nice texture. The tone it gives isn't bad either.", "id": 341}, {"review": "The previous reviewer obviously got a defective case. The case I got works incredibly well, and always keeps the guitar well protected, and my back comfortable while carrying it. It has a lot of space, and it looks pretty good too. I'd recommend it to anyone!EDIT* I've had 3 good years with this bag, and it has still yet to rip on me.", "id": 468}, {"review": "This pick is def not one I'd use to solo with, but its def a good pick for slower, more acoustic oriented guitar-work. Whenever I play a song consisting solely of chords, i break this guy out.", "id": 503}, {"review": "I am a musician who needed budget home studio equipment. Paired up with a nice pop filter, this mic is able to produce some amazing vocal recordings. You'd be surprised to find out how many famous youtube musicians or podcast creators use this mic. It took me some time to get the hang of miking amps, positions and vocal distance, but I am truly getting more than my money's worth for what it's putting out. Check out some demos of quality on youtube if you need further convincing. I am very glad I made this purchase.I've owned this mic for 2 years if you're curious about durability.", "id": 525}, {"review": "I'm so glad I was introduced to this via my guitar coach years ago. It's cheap, yet works better than most tuners that require a plug in that end up costing around slightly more. It's been awhile since I've had it, and still have no complaints or issues with it. I wholeheartedly recommend this!", "id": 707}, {"review": "Lets be honest, it must be pretty hard to mess up a cleaning cloth. It either cleans or it doesn't. This cleans/polishes all of my guitars great. Just make sure the strings are off so that this doesn't get caught on them. This is a brand I've come to trust.", "id": 184}]