[{"review": "This adapter cable for stereo mics to work with small DV cameras will function but with caveats.First, it's construction is pretty light weight. That means you will have to be \"gentle\" with it when using it. That's something none of us in the broadcast production field want to worry about since our gear gets pretty beat up.Second, the adapter only has a one foot in length cable on it. This is pretty short and may not reach to wherever the mic input jack is on your camera. That means you would need another short XLR mic cable to extend from the mic to this adapter.So just be aware that this may work fine for some and not work at all for others. I went to Sam Ash music and found a similar adapter cable, heavy duty, and with a longer cable for the same price. It pays to shop around!", "id": 8}, {"review": "In the immortal words that John Cameron Swayze used when hawking his Timex watches during the early days of live television, the Shure SM58 Vocal mic fits perfectly into that same category.Before I found a career as a film and television sound recordist and mixer, I played in rock bands and did live sound mixing. One of the very first mics we truly fell in love with was the SM58. Introduced by the Shure Brothers Company in 1966, the SM58 quickly rose to become the industry standard in rugged road mics that actually sound good to the ear and are nearly indestructible.The mic capsule is of cardiord (heart shaped) design which helps reject sound from either side. There is a 4K bump in it's frequency which helps vocals cut through stage noise. Construction is rugged, frequency response is 50 to 15,000 Hz, and the capsule sits internally on a foam shock mount to help isolate it from handling noise.We used to joke about the SM58 in that if you needed a hammer and you couldn't find one, just grab one of these, they are that tough. I've seen some of these on the road that you couldn't believe still worked, but they did and sounded great.The cage style pop screen gives the SM58 not only it's distinctive look, one that influenced many other mic brands from the day it was introduced, but it's part of the functionality. Internally lined with a layer of acoustic foam, the cage helps keep vocals pops from getting to the dynamic mic element. As a frame of reference, theShure SM57LC Shure SM57 Cardioid Dynamic Microphoneis the same exact mic and capsule, but without the pop screen.Shure also sells a Performer series mic, theShure Beta 58A Supercardioid Dynamic Microphonethat looks almost identical to the SM58 but uses a totally different mic capsule and transformer and has a different sound so try before you buy.The Shure SM58 is still considered the industry standard of live performance mics today and for the price, they really are a good deal.", "id": 20}, {"review": "You can't have too many adapters if you are a sound guy. This handy gadget converts a balanced or unbalanced mic cable to an unbalanced 1/4\" jack. Simple and it works. I've got a couple in my kit and they do what they say and come in handy when working with unknown equipment.", "id": 248}, {"review": "The Shure XLR Female to Male 1/4\" Adapter is simply another one of those fix it gadgets that a sound mixer has to have in his kit.I've got a bag of them and they work just like they are supposed to.Now this one as pictured is the mono version, which you would use to take a balanced or unbalanced mic down to an unbalanced 1/4\" jack. If you need to keep a balanced feed or if you are running stereo or two channel in a single cable, this adapter will not work for you. You'll need the TRS (tip, ring, sleeve) balanced version of this adapter.", "id": 249}, {"review": "Considering that the SM57 was introduced to the world in 1967, a year after the Shure SM58LC Shure SM58 Vocal Microphone, I guess the 58 gets Batman status, relegating the 57 to that of Robin. But that's not really a fair assessment considering the 57 and 58 were developed at the same time, and except for the 58's acoustic foam lined cage pop screen, the two mics are identical electrically.The SM (Studio Microphone) 57 was designed to begin it's life in a recording studio, as a dynamic microphone used to mic the ever increasing volume of rock and roll amplifiers, drum kits, etc. In that capacity, it had no use for the pop screen of it's cousin the SM58, still one of the most sold vocal mics in the world to this day. So the SM57 slimmed down and even though it's still a fine vocal mic, you'll see it used mostly mic'ing instruments, which it excels at.One of it's long time and most important roles has been the official podium mic for the White House. A pair of SM57's is always seen on various White House podiums for press conferences and there is even a VIP bundled kitShure SM57 VIP Dual Microphone Kityou can buy for this exact type of use.The SM57 is an extremely rugged mic, built to tough standards and can take lots of road abuse. That's one of the things that makes it popular with touring bands and sound companies. And on top of that, it's just a great sounding mic for the price.There is a Performer SeriesShure Beta 57A Microphonethat looks very similar to the SM57 but the Beta 57 has a different mic capsule and transformer and sounds different. So make sure you try before you buy.Bottom line is the Shure SM57 is one tough road mic that sounds awesome and is not overly priced. A best value for sound companies, home studio recordists and touring musicians.", "id": 19}]