[{"review": "Yes, these strings are amazing.  I discovered these on my new Taylor and now I've put them on all my gits.  They really are the better string.  I was a fan of Ernie Ball on my electrifieds and D'Addario on my acoustics, but no more, I'm only using these.  They are brighter in tone to me and that really brightens up my acoustics.  They bend easy so they are nice on the electrics.  They do, however, seem to take a little more breaking in than other strings...but it's worth it.", "id": 106}, {"review": "I was using a Kyser capo, until the spring action loosened up to the point it wouldn't hold all the strings down.  I thought I'd try something else out and settled on this one.  It's easy to take on and off. It's tight enough.  The main positive is that the part that lays against your strings is longer than a kyser so I think it will fit even the widest fretboards.  I don't know about a 7 or 8 string though.", "id": 116}, {"review": "I bought this to go with my Shure SM58S.  It fits the mic well.  No odor.  Effective at suppressing pops.", "id": 178}, {"review": "I'm an amateur musician and songwriter and this has been very helpful for songwriting ideas.  I haven't studied music formally, so I can't recall what a C#7 looks like versus a F#7 so when I discover a chord shape it's easier for me to diagram it than to look it up on the web.  This helps.", "id": 361}, {"review": "For what this does you can't go wrong for the price!  I have a small recording setup and play guitar (and bass) with friends.  This little mixer gets both of those jobs done right.  Sure a more expensive mixer might be able to tweek your vocals or instruments more, but all I needed was a way to mix up to 4 inputs at at time and out put to my speakers and laptop for recording.  It does all of those jobs well. There is no hum when the unit is on.  I have two small grips though..and they are minor...the EQ isn't that great and the volume to the headphones is lower than I like.  Maybe I'm going deaf.", "id": 368}, {"review": "What makes a good cable?  One that works.  I've had these XLR cables fail because the pins get loose, so I hope this doesn't happen to this one.", "id": 556}, {"review": "So the problem with most reviews is that people generally review things as soon as they get them when they are still in the honeymoon phase about it.  I've used this in my jam lab for 4 years and use it every time I play electric (about 5-7 hours a week.)The unit itself has held up well.  No problems with case or pedals.  All switches, knobs, plugs, & display work fine.  It doesn't have a on/off switch but that's minor.  It's low profile and is easy to switch by foot.  I have it going into my mixer which works fine.  No feedback or buzz from it.I like the recording software, Cubase, that came with it.  I didn't think I'd use it much but I do.  It's fun and easy to record my own songs.  Cubase is a little quirky and will often tell me that there is an error and it needs to close, but I've learned nothing happens and it's fine.I don't use the looper much as I have it before my Digitech Jam Man.  Which, if you don't have, you need it!  The drum presets are fun to use.  It's a blast to set a drum track, loop a rhythm, then jam on top of it.  Isn't that what it's all about?My two gripes are the tuner and clean presets.  The tuner is not very accurate and I use a cheapo tuner that works much better.  Also the tuner is supposed to be silent but it isn't.  Some flaw I guess.  Also the clean presets; like acoustic and clean bright sound cheap and weak.  I don't like them at all.  The distortion presets are awesome from some tube overdrive to massive fuzztone.  They rock.  I use alot of the other ones as well.IMHO this the \"must have\" addition to your set up.  It's not for professional use...but when I turn pro I'll get something better.", "id": 590}, {"review": "I have an Epiphone Dot and I installed a Bigsby V5 on it.  I could not find a gig bag for semi hollow body guitar so settled on this one due to the price.  And a previous reviewer said his Dot with Bigsby fits.  Well it fits, but just barely.  The guitar fits snugly in the plush lined case.  I have to turn the arm of the Bigsby around, facing down, to close the case.  I think the case probably pushes the arm down a little bit even in this position.  I probably wouldn't store my guitar in this case for long periods cuz I'd worry about tension on the strings.  Otherwise I like it.", "id": 157}, {"review": "I'm a total beginner so I don't really know if my review will be useful.  I have nothing to compare these too except my Lee Oskar.  They sound good to me...that's what's most important right?  These do have a kind of nasty &#34;new car smell&#34; to them, but I'm leaving the box open to see if airing them out helps.  It's not a big deal, but it's the only negative I can find with them.  Rock on bro!", "id": 293}, {"review": "This is certainly a step up from the Hohner Piedmont Blues Harmonica Set that Amazon sells.  I have that one too.  I thought it was O.K., but I found that some of the harps don't work well and the gawd-awful smell!  Actually it went away after awhile, but in the beginning the plastic odor made me light headed.Anywho....This is a nicer set.  All harps work.  They feel substantial. No smell.  Pay the extra money and get this set.**UPDATE**  The letters designating the key wears off pretty quickly.  A nusisance.", "id": 693}]