[{"review": "Sure there are fancier Tremolo pedals out there, but I've always been a fan of the Boss TR-2. It's got a more mellow and vintage Fender Tremolo output, and suits my playing to a T. Pair this beauty up with an Electro-Harmonix Cathedral Reverb pedal, and get lost for days. Definitely worth the reasonable cost!", "id": 39}, {"review": "It winds! It cuts! You really can't go wrong here. Another really well-made product from Planet Waves that will become an indespensable part of your guitar setup.", "id": 94}, {"review": "Unfortunately, the first one of these I ordered from Amazon arrived with two of the bottles having leaked their contents all over the place. Take two! The second set I received was in great condition, and I'm really surprised with the amount of product you get for the low cost. This kit literally has everything you will need (except new strings of course...) to keep your guitar looking and sounding great.", "id": 95}, {"review": "I've always been a fan of these Fender Classic picks. They just feel right, wear very well, and make a nice sound in conjunction with a good set of strings on my Telecaster. I also think the price is pretty fair.", "id": 117}, {"review": "I don't know who designed the leg feature of this thing, but they need to go back to engineering school. When you unlock the legs to put them into their useable position, they're quite difficult to pop open, and once opened into place, you can see distinct spots where the paint has worn off, because the fit is too tight inside the upper body of the stand.It'd truly be nice to come across a good stand like this that used button locks to hold the legs in place, and that had more of an upright angle for the guitar. I just don't like the features of this stand at all.", "id": 132}, {"review": "After trying out a few other styles and brands, I settled on this stand, wanting something that would keep my 50s Telecaster from taking an unexpected fall. The overall design of the stand is great, but I had to return my first stand, as there were severe quality issues with the finish. There were at least 3 spots where the black finish didn't stick to the metal, and I essentially had bare metal spots sticking out. The neck portion was also sitting cockeyed about 15 degrees to the right, once it was clamped down to the main stand body. Disappointingly, the replacement unit I received also has this issue, but only about 7-10 degrees worth. I'm going to use this stand in the meantime while I try to find something of a nicer finish, and truly worthy of my guitar.", "id": 133}, {"review": "This is a great pedal to have in your setup, for those times you want a clean sound that will cut through the mix, yet will not just sound blaringly loud and undefined. I used a Boss compression pedal for many years, and the Dyna Comp was definitely a refreshing step in the right direction. It just sounds more organic, and less sterile than the Boss Pedal. I also think in this case, less is more, as far as the controls are concerned.", "id": 137}, {"review": "I absolutely love using these strings (10-46) on my Telecaster and Stratocaster. They just lend to that awesome Vintage tone and seepage that people like me go nuts over. If you're looking for a replacement set of strings, you simply cannot go wrong with the EXL sets here on Amazon.", "id": 156}, {"review": "What a great little stand. I love using this thing when it comes time to polish my guitars or to change their strings. I also like the fact it folds up, taking up very little space when its stored away. The rubber pads are plentiful and molded to the plastic, so there's no need to worry about one coming loose and marring the finish of your guitar neck.", "id": 163}, {"review": "Sure it's a bit pricey, but I think having a top-notch power supply for your pedalboard is priceless. Just being able to do away with a power strip or two full of wall warts is amazing in itself. The fact thing this cuts down on floor noise AND conditions your power supply too? Sign me up. Pair this up with a Pedaltrain board, and you've got yourself a sweet setup.", "id": 209}, {"review": "I've ordered two of these kits in the aged white, and each one has had severe scratches and scuffs all over the tremolo cavity cover plate. Literally to the point where it looks like someone dropped them on a concrete floor, accidentally stepped on them, and then decided they were good enough to send out for sale. The knobs, covers and tips are all in great shape, however.", "id": 222}, {"review": "I'd say if you own a guitar with a rosewood fretboard, this should be a mandatory purchase for your prized possession. Just one bottle of this should last years and years. I also like the fact it utilizes a dabber to prevent spills and accidents. I used this the other night to &#34;feed&#34; the rosewood on my Telecaster, and this difference was night and day.", "id": 234}, {"review": "Sure it's a few bucks more than the standard Crybaby, but totally worth it. Built like a tank, but make sure to apply a little bit of white lithium grease to the gear pieces once a year or so to keep things smooth and reduce wear on the inner workings.", "id": 323}, {"review": "I decided to get this tweed strap for my 50s Telecaster Classic, but when it arrived, I was a bit let down. The tweed finish is cool enough, but the strap is very thin, and the strap ends are pretty poor quality. If they truly are made of leather, I feel sorry for the hide they came from. The leather is so hard, you almost need fingers of steel to get the eyelets spread far enough apart to get them around the guitar strap locks.This is decent for the time being, but I am definitely going to keep my eye out for something more suitable to my guitar. Feels like wearing a $10 Casio with a $1300 suit...", "id": 353}, {"review": "I was previously using a Rocksmith USB Cable, but wanted a specific cable for my iMac. This unit definitely fits the bill, and from what I can hear when playing, has an even lower latency than the RS cable. I was getting a little unwanted slapback with the RS cable, but this unit seems to have taken care of that. It's also quite nice to have a headphone jack right up front for quiet practice times.The software that comes with this Interface is a joke, and is about as useful as an AOL disc. Since I use Logic Pro X and MainStage 3 it wasn't a loss to me, but if you are buying this interface for the fact it comes with &#34;Amp Tones&#34;, you might want to look somewhere else. I couldn't even get the software to load on my 2013 iMac.", "id": 418}, {"review": "To me, there's not too much depth you can go into when describing guitar picks. Either they feel good in your hand, or they don't. Either they kind of &#34;disappear&#34; when you're playing, or they feel like a hindrance. These Dunlops get it just right. Enough grip to where you're not fumbling all over the place, and they somehow get out of the way of your playing. They're right up there with the Fender Classic picks, as my all-time favorites to use.", "id": 455}, {"review": "Dunlop always makes top-notch products, so when it came time to find a slide, I knew where to look. This one produces a great tone, and is well-made. Like the other reviewers mention here, you might want to invest in a slide case to prevent this thing from getting smashed to bits. For general home use though, I wouldn't worry about it too much though.", "id": 456}, {"review": "I bought this bag mostly for practice sessions here and there, or across town. It's a decent build quality, but I wouldn't feel comfortable assigning it to gig duty. It's got a fair amount of padding, and a nice storage array, but once again, I personally feel this bag is more suited for a 12 mile trip to practice or lessons.", "id": 468}, {"review": "After returning the Pedaltrain Jr (too small), I received the Pedaltrain 2 with Soft Case, and it fits the bill perfectly. I am using a Voodoo Lab Pedal Power 2 Plus unit, and had some minor issues getting the plug-ins to line up with the cutouts on the board itself. As the other user here mentions, the cutouts on the board are slightly too close together. You can center the Voodoo in such a way to make sure both plugs are useable, but the overall install is not 100% in-line.I did not run into any connector issues mentioned by the other user review here, using the Voodoo Lab Pedal Power 2 Plus system. All connectors that came with the Voodoo Lab Pedal Power 2 Plus, fit perfectly, and there are no clearance issues. One quick PRO-TIP: Leave the Connector Brackets slightly loose when installing your Voodoo Lab Pedal Power 2 Plus, as this will let you make fine adjustments, once the Voodoo Lab Pedal Power 2 Plus is dropped into the back of the Pedaltrain. Once this are lined up to your liking, or as close as possible, based on the narrow cutouts, then you can tighten your brackets screws all the way down, and then use a punch to mark your indented drill holes. There is a pretty decent video on Youtube by Pedaltrain, which will help with the process. My only small complaint is that they don't use a center punch. You should always use something to create a starter divot, especially when working with soft metals.Overall, this is a great pedalboard. I am running Boss TR-2, Boss OD-3, MXR Dyna Comp, MXR Phase 100, Dunlop Crybaby, EH Cathedral Reverb, and EH Stereo Memory Man w/ Harzai, and there is plenty of breathing room. Nothing is cramped, and there is plenty of space for patch and power cable routing. The board I received came supplied with plenty of soft-sided velcro. There is another review here where the user states they didn't receive enough velcro. I cut 4 22&#34; strips for each of the cross bars, and still had about 6&#34; of soft-sided velcro left over.", "id": 544}, {"review": "These little patch cables have been indispensable since I used them to set up my pedalboard. They're durable and tough, yet provide a high level of flexibility when it comes to using them in tight spaces inbetween effects pedals. I previously had been using some Fender Tweed patch cables, and they just weren't flexible enough, even though they looked cool for days. So if you're looking for a great patch cable for your pedalboard, look no further my friend.", "id": 578}, {"review": "I ended up ordering this cable to connect my bottom row of effects to my top row, on a Pedaltrain 2 board. It's the perfect length, and the very slight bit of excess can be zip-tied against the Pedaltrain, leaving a total stealth install. Since then, I've ordered these patch cable in other lengths, and they've done a great job of cleaning up the look of my pedalboard.", "id": 663}, {"review": "Even though I have a tuner in my pedalboard setup, and one on my iMac via MainStage 3, the Snark is indispensable. It's perfect for those times when you don't want to drag out a bunch of gear, and just want to noodle around, even without an amp. I use this little guy for electric guitars, and could see it being perfect for acoustic guitars, as it barely takes up any room at all in a case or gig bag.", "id": 706}, {"review": "I used to use a Schubb Capo, but started using the Dunlop Trigger a few years ago and never looked back. The fit can be a little tight, especially higher up on the fretboard, but I personally like this, mostly for the fact there are less moving parts (compared to a Schubb) and the fit is nice and secure.", "id": 116}, {"review": "As some of the other reviews state, you barely need any type of guitar cleaner when using these microfiber cloths. I've found for the best results, use a wax sealant product, and then use this cloth separately and afterward to clean your guitar. The fingerprints and smudges lift off effortlessly.", "id": 184}, {"review": "I used to be that guy that lost about 30 guitar picks a month. I bought three of these Dunlop Pick Holders, one for each of the three gauges I find myself constantly using, and they've more than paid for themselves in the short time I've had them.", "id": 233}, {"review": "I only had this board for a day, after realizing it was a tab too narrow for the pedal setup I wanted to create on it. I do have to say though, Pedaltrain makes rock solid products. Sure, you could probably fashion your own pedalboard, but why bother? This thing has a great finish that will make your pedal array look pro.", "id": 588}, {"review": "I ended up ordering this cable to connect a 535Q Wah into a Dyna Comp on my Pedaltrain 2 board. It's the perfect length, as the 1/2 foot cable was just a little bit too short. Since then, I've ordered these patch cable in other lengths, and they've done a great job of cleaning up the look of my pedalboard.", "id": 662}, {"review": "The concept of this guitar stand is great, and I thought it would be perfect for my two Telecasters...That is until I get the stands in place and put the guitars in them. The stands have a very deep angle, and from what I could tell, the guitars were sitting about 40 to 45 degrees back.It just looks silly, like your guitars are trying to slip out of the stand, or are in a slow-motion fall backwards. It also ends up taking up WAY too much space, as the stand has to be set out from the wall or corner quite a bit for clearance purposes. I ended up returning these stands, but would definitely buy again if they produced a more upright version.", "id": 883}]