[{"review": "Don't even hesitate buying this thing. It's everything you need. It's a pop filter. It clamps on to anything that isn't over about an inch and a half in thickness.It gets the job done. Buy it.", "id": 46}, {"review": "I'll keep this short and simple, I do alot of radio work, and saw the price of this mic of eBay (I wanted to use Paypal) and got it. 60 bucks for something I'd have easily have paid 100+ for, and with the included shockmount, it's a total steal. This obviously won't match top quality condensers, but for speech atleast, I find it to have a wonderful crisp tone with a warm sound to compliment your voice. It just has that smooth radio sound you hear on stations like NPR, which I just love. It sounds fantastic and with a proper interface, possibly the best condenser I've tested that's under 150 bucks.", "id": 159}, {"review": "These cans were decent, back when they were just above 100 bucks. They've inflated to 160 and that's just ridiculous. There is better in this price range. The SRH840's for example on eBay for 120~ bucks new, does everything better than these cans. The M50's have really punchy bass, and extremely stringent highs, they're very loose in the low end, and their mids are recessed. That combination makes for a fatally tiring listening experience. The pads are pleather and terribly uncomfortable, whilst having an almost starchy texture to them. The headband clamps onto larger heads and lacks decent padding underneath. These phones are also terrible in regards to any soundstage at all, which means for gaming, these will be pretty terrible. They do some... SOME... new genres alright, but their extremely aggressive presentation makes these phones just hard to listen to. They also can't do lighter genres like Jazz and Classical due to their poor positoning. There are much much better monitors in this price range than these, the Shure SRH840 as I've said before totally outclass these headphones in all areas.Stay away, don't fall victim to the noob hype.", "id": 458}, {"review": "I just purchased the mic stand for my desk at home. It does the job well. If you're looking to do some desktop podcasting or internet radio, then, it's perfect. Many adjustments to get just the right position. It's definitely not a performance mic, as it does feel a bit filmsy, but, you won't notice the flimsiness except for when you're adjusting it. Adjusting it is a tad tedious, but, you can get a really good position with the microphone after a couple minutes.I've mounted my Samson Q1U Dynamic Cardioid USB microphone to it. It works well for sure. Then, I attached the standard pop filter, and the microphone started tipping it over. Make sure the boom is aligned with a leg extension, or it will tip over if there's too much weight. Just find something semi heavy and find a way to attached it to the existing counter-weight, and it will be excellent. So this mic won't play nice with your large condensers + pop filters + shockmount at the start, but, just find a good counter weight and all will be well.It looks great, and will definitely be easy on the eyes in any room. It was a good investment, and all in all, you definitely get what you pay for. If you're hesitant on attaching a lot of stuff to it, then, I would recommend shelling out a couple more dollars for a sturdier stand.But atleast for me, it does the job, and does it well.", "id": 77}, {"review": "Does it's job extremely well, produces high quality audio and is fantastic for recording your microphone or guitar or what have you without any fuzz or latency. It's built like a tank, and it's nice and solid. This interface is an amazing piece of beginner kit that will not disappoint.", "id": 639}]