[{"review": "This is the best little guitar pedal adapter I've used, and I've used many over the last three decades. It's exceptionally quiet, which many are not, and it puts out 9.6 volts, which will drive your pedals a little more solidly than all but a brand new alkaline battery. And you won't have to buy a new one every dozen hours!I've used this on a splitter to drive three pedals, but at four and up I can hear the current drop a bit. Still, that's a good thing because it reminds me that tone comes from my fingers, not a box on the floor. But it sure is nice to have some Gilmouresque delay, and a little extra gain driving the tubes, and this is the best 9v adapter for pedals available that I know of, including the Boss ones. Dan has released some cool, well-made pedals in the past 15 years, and this little wall wart is a worthy companion.A very good deal at 15 clams.", "id": 40}, {"review": "We geetarists are a funny bunch: we'll change out pots and caps and pups from our axes and amps all day long, and spend a fortune doing it. But sometimes we could make more tonal difference by just spending five bucks!Case in point: pure nickel strings. Time was when that was all there was...and gee whiz, that was a time when good guitar tone ruled. Coincidence? Nope. These things just sound better, if by better you mean warmer and with a subtle feel that your fingers will convey to your brain in milliseconds. If you're used to wrapped strings, and you like to play blues or classic rock or pretty much anything but metal, these might be all you need to make your rig sound a whole lot sweeter and smoother and just more musical in general. Especially if you use tubes.Tubes and pure nickel are like Gilmour and Strats or Angus and SGs. They just fit.I'm not nuts about Fender acoustic strings, but I like their normal electric strings fine, though Ernie Ball Slinkies have been my go-tos for many years. But these Fender pure nickels are very very nice, and at 4.75, they're a real deal. Most pure nickels run nearer to ten, and these sound pretty much the same, and I don't seem to break many of 'em neither. If you're used to mixed alloy, pure nickels might seem a little \"dull\", but wait a bit and you'll find that the harmonics are still there when the alloys have faded. Plus the feel is just smoother and nicer under the fingertips. Try a set and see what I mean. It's subtle but it's beautiful.But the main reason I love these is for playing at VOLUME! I turned my modded Hot Rod Deluxe up to call-the-cops levels (the neighbors are getting used to it by now), louder than the drummer by a good chunk, and I got: less squealing, warmer tone by far, and full chords, triads and double stops that felt and sounded smoother and grinded with more harmonic warmth than any alloy string I've ever used. I think there's an electrical cohesion between pure nickel and good pups and tubes that is simply sublime. Check out BB's tone on the legendary Live At The Regal to hear what I mean. That's the stuff.So, if you haven't tried pure nickels, spend a buck or two more (or maybe less!) than you normally do and give these bargain-priced nickels a try. You might find that you're a convert within seconds. I know that my ears sure love them when things are really cranked up; those Zep and Jimi riffs just sound and feel so much more right with pure nickel. And digging into some Otis Rush or Billy Gibbons licks is like night and day. The bluesy stuff just begs for pure nickels.Hell of a bargain at less than five bucks.", "id": 88}, {"review": "After all these reviews I expected the Greatest Strings Ever, golden strands of Glory that would last for a year with sparkling tonal perfection!Instead, I got a decent set of .10's that lasted a whole hour before the D snapped at the neck pickup. I use a PRS with a Wilkinson bridge that rarely breaks strings, and I pre-stretch them gently but completely. Plus I tune down to Eb for vocal and breakage reasons, so I break very few of my normal strings, Slinky .10's. Ergo, a break in one hour from a thick string under minimal tension, tuned down, is unacceptable, especially when these strings cost three times as much as most all other electric strings.As for the tone, it's definitely bright and almost too edgy, but nicely zingy all told. Yet one negative I've noticed after about 8 hours' loud playing with a drummer is that these things seem to vibrate more widely than most strings, making them harder to tune. Sounds odd, I know, but when I replaced the D with a Slinky D (replacing singles ain't cheap either at triple the price, please note), I've since noticed that it tunes faster and in a tighter range than the Elixir strings.So, I must say I'm summarily unimpressed so far with Elixir electric strings.What's the good of string lasting a long time if it breaks fast?Especially when it costs three times more?And what's up with the tuning thing?And why do these cost so much more, anyhow? Is a micro-thin coating of siliconish stuff really worth two bucks extra each string? Not when that string is toast in 50 minutes, zero doubt there.Anyhow, I've got five Elixirs and one Slinky on my main ax now, so as they age I'll get a good feel for how the Elixirs stay in tune and hold their tone, and I'll report back here in a while. And by the way, that Slinky D sounds almost exactly the same as the Elixirs, tonally. So much for Magic Elixir Tone.Don't get me wrong, I really do want to love these, as I hate changing strings, but geez guys, how about some quality control?If I'm going to pay triple the price, then is it crazy to expect triple the quality? Or heck, even just a little better...PS If you look at the D'Addario reviews (I love their acoustic strings), they respond to many of the reviews and questions. I hope that Elixir will do the same here and address my questions.[Edit: And now, after only six hours' of playing on that guitar, the B string popped at the same place as the D, neck pickup. Once again I ask: what good are strings that \"sound good three times longer\" if they break three times faster?][Edit: 10/31/12. Come on! After four more hours, the A string went. I only play that ax one or two sessions a week, and the next time I joked to the drummer, \"Which one will go today?\" He said he's amazed the G is still on, as he plays too and knows the G takes the most tension. An hour later, guess what? Yep. So that's four broken strings in less than 20 hours' play. Seriously?Not only are these not a good deal for 9 bucks, I'd be bummed if they cost 3 bucks. The only plus I can think of at this point is they sounded good when new, but dang, unless you play totally smooth jazz or some such, I'd stick with Slinkies or D'Addarios. Unless I got a \"bad set\", which seems kinda lame for triple the normal price. In any case, these Elixirs were just not worth the money.][Edit, 3/3/13: I called Elixir and told them about the multiple breakage, and they sent me another set. That set has taken a few four hour hard rock sessions with no breaks yet, thought the tuning issue remains. I'll add a star for good customer service and the hope that perhaps my first set was a dud. But honestly, at this price, there should be no duds at all.]", "id": 107}, {"review": "I've been using Slinky regular nickels for over 20 years on my electrics, and love them. I've tried various coated strings etc but always come back to Ernie for sound and value. But on my acoustics, it's been D'Addario J-16s since day one, and still is. Never had one bad set, out of over a hundred. I adore the sound and the reliability.So why have I never tried their e-git strings? Because the Slinkys are perfect. But I must say: so are these. I just put a set of 10's on one of my Strats, and they are as snappy yet not-too-bright as I could want. They really complement the single coil tones, especially the 2 and 4 out-of-phase positions, so if you're a Strat fan and love that tone, give these a shot.One thing that was odd but not a problem was how long these are. A few inches longer than most electric strings, in fact. No idea why, but if you have huge posts and like mega-wraps, here's your puppy. I only do a triple wrap max, so it's just more to cut, but hardly an issue.And no matter what the coated string fans say, those might stay clean longer,  but that brand-new-string ZING only lasts a few hours on any string, coated or not. So if you're recording and need maximum harmonics and overtones, or playing big gigs where tone is everything, I say stick with uncoated strings, and aside from Slinkys, these are the best I've played.", "id": 868}, {"review": "Always looking for that elusive perfect capo, light yet strong and dependably firm?You just found it.This is an exemplary capo. No surprise, as it's designed by Ned Steinberger, who understands what it means to strip a guitar down to the basics. It's made of serious aluminum and the spring is super-solid. The tighten feature means you can put it on your guitar and then tighten it so well that it won't come off again until you loosen it. No slippage here! This also lets you move the capo further behind the fret so it's even less in the way of your hand, a very useful feature which most other one-hand capos can't offer.It's an easy on-in-seconds design that is as slim and simple as it gets. The rubber is well-bonded and looks unlikely to pull off for years at least, unlike many cheap capos. It sits well on any six-string, though is not flat enough for a classical. But most of us use capos mainly for acoustic and maybe a bit of electric (unless you're Albert Collins, who always used one and would have loved the tightening aspect here), so this will cover all your basic capo needs.It's got a little slot for the D'Addario brand tuner, but I use a Snark and these two go together well; put on the capo, activate the tuner on the headstock, tune it up, and away you go, perfectly in tune in seconds while using a capo! If you've ever suffered onstage while switching frets with a capo, this is a godsend combo. The capo also has a little pick slot, which will comfortably take up to about a .73 mm pick. It fits .60 picks perfectly, by the way.This NS Artist Capo is well worth 20-25 bucks, and since I got it my Shubb and Kysers have sat lonely in the corner.If you haven't ever experimented with capos, try them out. They can really change the way you play your guitar, and may help you find you sing better than you think, as we all have our best keys, and a capo can help you find yours. I love playing bluegrass licks in G while capoed at the second fret, for instance. The extra zing and crisper tone make me play different licks and it's almost like another instrument. This goes for every fret, pretty much, up to about the sixth, where it gets a little cramped.All in all, this is the best capo I've ever used, especially for this quality at this price.", "id": 894}, {"review": "4.6 starsMy main concern with adapters like this is sound quality. The A/D is often weak, and there is sometimes too much latency for it to be useful for multi-tracking. Apogee covers both areas well with this little puppy; the A/D is quite smooth, and it transfers the signal near perfectly. And little it is, not much bigger than the jack. If Bon Scott only knew...But small though it may be, there's plenty of signal processing power in there, and while it doesn't stand up my best outboard gear, it offers very clean, clear sound transfers from guitar, bass, keys and line mics, so that you can do good-sounding entire tunes on your laptop with only the JAM as interface. Which is yet another step forward in high-quality home recordings. I like the thought that we're getting closer to folks releasing things entirely by themselves on their own sites, and not paying Crapple a huge chunk of profits for merely hosting a file. Record companies and file hosts are increasingly anachronistic due to tech like this JAM, and maybe soon enough we'll see artists keeping ALL of the profits from their art. Imagine that!This offers very close to studio quality, but keep in mind that even with 24-bit it is solid state. Once you've used a good tube preamp you know what a difference in warmth in can make. I ran this through one of mine and the A/B made it very obvious that old school studio gear still has its place.Speaking of Crapple, the ads for this suggest that it is for iStuff only, which is not true. I ran it on 7 Ultimate and it worked a charm, so don't be fooled by the typically proprietary ads, which Cook and co. probably insist on: &#34;Don't mention anybody but us! Offer no alternatives! They must stay in our universe!&#34; Well, you needn't, this works with almost anything, so don't be fooled by the ad copy.The only negative I can find is that it is a little chintzy in outer build, making one wonder how good the internals are, and how long they'll hold up. A stronger, more solid sleeve would have been nice, especially at the price of 130. But it does sound good, though as it may be used for portable purposes, you might want to wrap it for transport in a little hand towel or such to make sure shocks don't mess with it. Take care of your recording equipment and it will take care of your music!", "id": 895}, {"review": "I play guitar and bass, but the gitpicker in me envies full-time bassists because they almost never break strings, and bass strings hold their tone far longer than guitar strings. The price has also come down to where you can spend well under a hundred bucks a year on strings and always have fresh tone rich with harmonics. You don't know how good you've got it! And these D'Ad's are very good all-round strings, though they make a lot more noise than flatwounds and even \"normal\" nickel wound, so they're not for sloppy fingers.Very nice for funky players and those who want more definition and edge, these FlexSteels ring nicely and I like that the bottom E is a tad thicker at 105 than the usual light set's 100. Because these are pretty bright, that extra oomph is nice. And I'm a big believer that the amp can fix string issues much more easily with bass than guitar, so merely dialing out a little treble or even rolling off the volume a bit on your bass will take care of that. But if you're popping and slapping, these come through loud and clear. I really like the feel of the low E when I thumb pop with these.I play a P-bass with my index, middle and thumb, and these punch nicely at that scale length. The pickups also like them, and they get plenty loud, with full definition and plenty of top end, but not brittle. With a Trace Elliot or other high-def amp, these would be very unforgiving for all but the most exact players. I bet Marcus would kill with them.I think these are perfect for funk, and excellent for almost all rock styles. Obviously flats are better for jazz, but these make a good all-around string and for less than 20 clams they're a great deal.", "id": 896}, {"review": "I love small amps and have played many of them over the last 25 years. I still own a few, my favorite being the first Super Champ from the early '80s; Rivera nailed that one. I naturally prefer tubes for that true tone, but tried one of these out last year at a pal's place and was sold within two minutes. I bought one six months ago and after playing it almost daily since then I can say without doubt that this is the most versatile solid state practice amp I've ever used.For the money it's a crazy deal. I have never once used the included online stuff or the Ableton software, so those add even more value to this package, no doubt. All I wanted was a warm up amp with real tone, and this is that and plenty more. My all-time favorite tone is the clean glassy Fender late-'50s/early '60s sound, typified by the Bassmans and Twins and Deluxes of the pre-CBS era. That tone needs tubes to really sing, but to my amazement the amp modeling of this Mustang comes amazingly close to that sound without tubes. You'll always miss that tube sag but the crispness and snap is all there, especially on the Bassman settings. My Strats sound so damn good through this on clean settings, and my PRS absolutely smokes with real lease-breaking volume on Super-Sonic (dial the gain way back for a nice low-throttle roar).Having gain, volume and master lets you dial in a TON of tones with each amp model, and the two separate effects knobs let you add chorus/tremolo etc plus various reverbs/delays etc, though I find myself keeping everything totally clean as time goes by; if I can't get the tone I want with my fingers then I need to learn how to is my motto. And this amp is so accurate that I can.Above all, this Mustang is MUSICAL. For a small amp that's a real feat, but for 100 clams it's a near miracle. Add a built in tuner (the most useful \"extra\" ANY amp can have), good effects, great amp models, the software and more online amp models (which I'll get around to one day but so far I get all the tone I need from the amp as it is), plus 20 watts for lots of headroom, and this is a straight up steal for a bill.The only thing missing is serious bass at volume, but this is an 8 after all, not a 10, so you'll always miss some of the real bottom. But what's there is solid and tight and only craps out at top volume; only with a rock drummer will you need more roar than this provides. You could easily do quiet jazz and folk gigs with this puppy.All told, the Mustang I is easily not only the best value practice amp of them all out there now (Crate and Line 6 etc don't come close), but paired with a mini-Strat this would be the absolutely PERFECT beginner's set up for a kid looking to play anything from the Beatles to Metallica and everything in between.Can't recommend this highly enough to anyone who thinks real tone can't come in a small solid state amp. It can, it does, and it's cheaper than I can still believe.Fender truly went to 11 on this one.Leo would be proud!", "id": 718}]