[{"review": "Not a lot to say, works great as a shockmount!I think the best part might be that it also works with Behringer C-1s. Those are great mics for what they cost, but the clips they come with break easily and replacements are hard to find. That makes this shockmount a great option for people in that boat as well. Hooray!", "id": 393}, {"review": "These cables have been solid; we use them in the studio every single day, and have held up so well compared to many others I've ordered for less.Yes, $70 on cables seems like a boring way to spend that money, but don't be fooled: nothing makes you looks stupider during a recording session than a blown cable. Not only do these hold up and sound great, I've found that when working with a complicated studio setup, I'm always surprised how helpful the color-coding actually ends up being. For the price, this is totally worth it.I use these with the following to really color code my studio setup:Color windscreens:GLS Audio Mic Windscreens MicrophoneColor electrical tape:B004ZZVHGWColor patch cables:B003VYBNHGDefinitely worth it! Makes a huge difference!", "id": 424}, {"review": "Be careful; I have a small recording studio, so we put our cables through a lot, and these guys just don't last. They were fine for the first few months, but then they started to die like a murder mystery. Seriously, one after another they would just go, for no apparent reason.Fine one second, and then it would just go horribly staticky. I actually had two blow at one time, and thought my PA was shot. Thankfully, it was just these cables. NOT GOOD. Spend a little extra on another brand. These have been my favorite:GLS Audio 25ft Cable Cords", "id": 465}, {"review": "Wow, I will never buy another SM-57 again. I can't believe I'm writing this, but it's ture. I am so psyched that I found this microphone, it's perfect.But seriously, the sound quality has never once disappointed me. In fact, and it might just be in my head, but I now prefer to use this when micing my guitar amp. But everyone else has talked about sound, so I want to talk about build quality.It's solid, has some weight to it, and the plastic at the top feels exactly right: so far, it hasn't come loose in the way that SM-57s do. If I handed this and a SM-57 to my grandma who doesn't know any better, she'd probably guess that the ES-57 was a bit higher-end. I continually look at it and can't believe I only paid $30 for it.Get one. Nah, get a bunch! Sell your SM-57s for $60 and turn them into two of these. Magic!", "id": 594}, {"review": "This is a pretty decent thing for practicing your guitar through your iPhone or iPad. But if you want to use it for any recording at all, even demos, I strongly recommend going for the iRigHD. The HD sounds waaaaaay better, and the build quality is great. This guy, not so much. There was always a bit of noise with my old iRig, and it seemed to get worse over time. It also felt kinda fragile and chinsy. If you look, you can usually find the HD somewhere for $80; a $50 difference is significant, but the jump in quality (and likely longevity of the product) is definitely worth it. I upgraded and would absolutely do it again.", "id": 710}, {"review": "Definitely the best combination of price, durability and sound quality that I've come across. Plus, the tweed look really grows on you.  Ordered a bunch for the studio, and a bunch more for home. Holds up well, even after being yanked and crushed and stepped on. Do it!", "id": 875}]