[{"review": "I bought a set as they were recommended to get the tone I was looking for on my 7 week old guitar. Installed as usual and tuned them. They sounded good when played open but compressing them was nearly impossible. My capo could not even hold them. I set the guitar aside for a few minutes and heard the wood creaking. When I looked the face of the guitar was bowing up and the bridge was pulling up and back as if they were trying to pry it off. I released the tension on all the strings as fast as I could and left it. I returned them and got some lighter ones but to no avail. The body is cracked around the bridge and it is useless now. Use at your own risk!!!!!!! I personally wouldn't give a nickel for them.", "id": 104}, {"review": "It works great, not much I can say beyond that.", "id": 394}, {"review": "I have bought 5 of these now for me and a few friends and they work great. I am sure they will wear out in time so I have a couple extras but you can't beat them.", "id": 603}, {"review": "Got them in 3 days and love them. So much cheaper than the stores and they are the same thing.", "id": 779}, {"review": "Not much you can say. The headline says it all. It works well. Shipping takes time but for the price, who cares. If you need it now, go local but if you have time to wait, this is perfect. I ordered two just in case. But it is nice and does not damage the guitar finish at all.", "id": 802}, {"review": "Great strings, I use Ernie Ball strings on all 7 of my guitars, both acoustic and electric and never had a complaint. I have experimented with others but always come back to them.", "id": 396}, {"review": "I saw this tuner in the local music store for $30 and decided to order it here for $11. Within 5 minutes I had my guitar tuned and it sounds perfect. I compared the plug in tuning to the microphone tuning and it was identical! I honestly expected some variance but it was dead on. I have never heard my guitar sound so good. I am super impressed with this little thing. If ever I need another one, this is the only one I will get.", "id": 624}]