[{"review": "I chose these strings based on reviews I have read on the website. I was definitely not disappointed. This string sound great on solid body electric and hollow body. I have a Dot Studio and the resonance is great for rockabilly. My son loves them for metal. We will continue to use Beefy Slinky strings!", "id": 98}, {"review": "I have enjoyed my Protec Strap. I was surprised how well made the leather harnesses are and I have had no issue with them stretching on the strap posts of my Dot Studio. One note would be that these straps are probably better for your lighter body styles - strats, teles, sgs - heavier guitars will tend to start digging into your shoulder after an hour or so. Having the pick pocket is a neat feature. I am just finishing up rebuilding a LP copy and I will be getting another for this guitar net week.", "id": 285}, {"review": "I am very pleased with the quality of this stand. It is actually better than my other two and costs a lot less. It shipped on time and the packing was good.", "id": 519}, {"review": "I read the reviews on Ernie Ball strings. I have to say that I love the strings. They have a rich sound that brings my acoustic alive.", "id": 85}, {"review": "My son had his eye on a vintage harmonica that my great uncle used in Europe during WW I. Needless to say, I did not want to pass this on to him yet. I figured he could start simpler. I read the reviews of the harmonicas and saw nothing but positive about this instrument. It has a great tone. Its construction is solid. I am sure this will give him years of entertainment. This is not a toy - a great addition to your mouth harp collection.", "id": 421}, {"review": "I spent a lot of time on Amazon reading reviews - comparing prices. I wanted an amp that would have overdrive and I also wanted some power. There are so many choices from the small portable units (I was afraid they would sound like toys) to the big units (They would sound great but I couldn't afford them). I am thrilled with the Starcaster. This amp delivers a huge sound and the overdrive sounds great for grunge and metal while you can also play crisp clear rock or country through it. If you want a small amp to take anywhere and be able to show your rock star image - this is the one for you.", "id": 467}]