[{"review": "This installed easily. A nice feature is ability to unclip the shoulder pad from the mounts on the instrument.  When the pad is installed the strap is very comfortable and eased any shoulder pain I might have had with earlier straps.  A keeper for sure.", "id": 101}, {"review": "This works better than the QK10B model by the same company.  Slim and easy to install though longer than the QK10B.  Since the cut out and button are on only one side of the two parts, you might have to rotate a mic boom, etc., to achieve a proper position after connecting the two parts.  My use was for an IPad clamp attached to a mic stand.  It worked well and I put two of these in place so the stand could break down for packing in a gear bag.  This unit wiggles a little but not as much as the QK10B so the little bit of movement is acceptable.  This looks to be well built and should be reliable. The long haul will be the test.", "id": 271}, {"review": "I've had this for several years. It has worked flawlessly. It has done a pretty good job with many recordings, especially in the field. Zoom has now upgraded this unit and has other models on the market that are superior.  At the time this first came out it was one of the best on the market in its price class.", "id": 463}, {"review": "I have the older version of this as well this newer one.  The older one is more responsive to various instruments that can be hard to tune this way, like banjos, mandolins.  Sometimes this new one just won't &#34;hear&#34; the string being tuned unless it's 'encouraged'.  That wasn't the case with the first model.  It's not as completely accurate as some other headstock tuners but it will get your instrument quite close and then your ear should dictate.  The buttons can be easily confused until you are certain which one does what without looking at it. You could find the tuning being done several semi-tones below standard because you inadvertently touched one of the arrow buttons.  The older model has only two little buttons and not as many settings or choices.  And these won't clamp positively to some headstocks due to neck thickness at the nut, spacing between the tuners or the quantity of other things people want to clamp to the headstock.  But if you get it well clamped, it will stay there in the case or in use.", "id": 785}, {"review": "This holder grips the IPad tightly so a sudden fall is not an issue.  The rotation to vertical is good but it would be nice if it went both left or right.  Because the arms don't collapse it's a bit bulky to transport in a gear bag but its positive clamping offsets that issue. I've seen some with folding arms that have dropped IPads suddenly because something came loose.  Where I fell down was not ordering the K and M clamp arm that comes as a package under a different order number.  I've since seen that arm in use and it would improve the versatility of this unit, though the package is pretty spendy. I could not order that arm separately.  I mounted this holder onto a short mic stand by using two mic stand quick releases - one for the holder and one for the mic stand boom arm. Then the whole thing breaks down quickly to stuff into a bag.", "id": 793}, {"review": "Not too much to say about a cable.  It worked out of the box...no shorts or noises. The jacket on the straight plug was partly unscrewed and that's a continuing problem with these cords.  I use some thread-lock on them.  I find the right angle plugs useful for lots of things.", "id": 419}]