[{"review": "If you are looking for really authentic vintage tones with tube warmth, this is a fantastic amp for you.Fender has done an amazing job with this amp.IN this AMP, you have:All of the benefits of tubes, warmth at all dynamic levels, as well as a lot of touch sensitivity to your playing.The CHAMP Circuit.  Forget the fact that you have Digital amp models built in too, you also have a 15w Champ tube amp with a 10 inch speaker.  It's not exactly a '57 champ reissue, but it is the same circuit with all of the character and spanky tone as any Champ out there.  (People who like a great Champ tone, would pay more than $299 for a great 15w Champ amp.)Add to this, 16 Digital Presets.  Fender gives you Digital models through a Tube Circuit of Tweed Amps, Blackface Amps, Hot Rod Amps, as well as Metal Amps, A Jazz amp and an Acoustic sounding Model.Add to that some preset digital effects including Reverb, Delay, Vibe, Trem and Chorus.  (Each one has several choices as well as a knob to increase or decrease the presence of the effect.)Everyone who reviews this amp raves about the how authentic and interesting the Digital Models are... and they are absolutely right.But this amp breaks new ground with the simple fact that you can switch directly from playing a song with a Tweed or Hot Rod tone directly to an authentic Champ amp.  Not a model of a Champ Amp, the real deal!The implications of this amp are really huge.  I'd love to see Fender do the same thing with a Pro Jr. or even a Blues Jr. Amp.  Perhaps they might go that direction in the future depending on the success of this amp.  who knows.  But what I do know is that this amp is simply bursting with character.The Digital PresetsFor me, the highlights are the authenticity of the Tweed, Blackface and Hot Rod tones.  I really feel like channel 10 sounds like a clean blues jr coming through the 10 inch speaker.  The tweed tones are syruppy and awesome.  The Blackface clean sounds like a Princeton, and I even think they were trying to emulate a Deluxe Reverb on channel 5.As Far as Volume...People ask, is it loud enough to gig with?  Sure.  It can get loud enough over drums etc.  But, I'd mic it anyway.  I get my best overdriven tones in the midrange of the volume.  Mic it and you can play it anywhere.The Only downsides...As much as Fender tries to throw a bone to metal heads, this amp really doesn't give Metalheads that much to work with.  It would be a great practice amp for any guitarist, Blues, Metal, Jazz or Country...But the Metal tones are not going to be as big and rectified as you would want them if you want to chug through some metallica riffs.Lack of a Mid Control.  I'm not sure that I understand why you'd have an EQ with Treble and Bass with no Mid control.  Personally, it's the EQ knob that I would use the most, but if you are switching between Digital Presets you have to work with the Treble and Bass to find the sweet spot for your mids.  To my ears, it's not in the same spot on all presets.  That one knob would make this amp a lot quicker and easier to use for someone like me who likes to bounce between presets.This amp is cool and unique. Which is why it will be the first digital modeling amp that is still worth something when Fender releases the next big new thing.  Line 6 and Vox tube/digital combos have really fallen quite flat and have no resale value after the next generation comes out.  Fender has found a sweet spot of value, quality and usability.  This is going to be a rare technological achievement that people will still hang on to and be happy with 10 years later.Truly a unique and versatile creation.", "id": 561}, {"review": "I bough this amp for my 9 year old son who is learning guitar for his Christmas present.  I thought that since I love Fender guitars and since he has a mini Squier we'd like to get something in the Fender Family.  I seriously expected a cheap imitation of a Line 6 Spider with a Fender logo slapped on it.  I should have had more faith in Fender.I am blown away by the sounds that come out of this amp.  The AMP models are far more real and interesting sounding than any modeling tool I have ever used.  The amps don't sound digital or processed, they actually sound overdriven when you crank the gain.  You would swear that there are tubes in this thing when you listen to it.  I can't get over the Bassman, the twin Reverb and the Deluxe.  They sound so full and strong.My biggest compliment of the Mustang is that it is the ONLY modeling amp that has great sounding Vintage tones.  Line 6 has tons of metal stuff, and a lot of weird niche tones.  Vox has never really made great modeling stuff.  Digitech sounds super processed and the vintage tones are terrible.If you play Blues, Rock, Classic Rock, Country, Funk etc... This amp is for you.  There is just enough metal or heavy sounds to have a few choices for Modern Metal, but Metalheads might be better off with the Line 6 stuff.The other great thing about this amp is how easy it is to tweak the tones using the amp controls.  By looking at the controls, you know right where you are and what you have to do to edit your sound.  You don't need to dive 5 levels deep into an LCD screen in order to make great sounding tweaks.But if you like to go deep, you'll love the Fender Fuse software.  It is easy to use and there are countless user submitted tones to help shape your sound.The fact that Fender not only included FUSE with this amp, but also the Ableton recording software that is also pretty user friendly and fully usable without having to pay to upgrade anything, is just frosting on the cake.I am a father of 4 who normally has to practice at night and being able to have an amp that can get quiet but still sound amazing, with the added features of a headphone jack and an AUX in, I can play whenever I want.  I am actually selling my nice Tube amp and using the Mustang as my only amp for now, and I feel like I am not missing out on any features or downgrading my sound at all.The value of this amp is amazing.  People will shell out 2-3x as much for a Line 6 modeler, but the vintage tones will not sound anywhere close to as good as the Fender tones.", "id": 718}, {"review": "As far as amps that model vintage tones.  This is the best.For my ear, Line 6, Vox, Crate, Digitech etc are nowhere near the Fender Mustang if you are comparing Vintage tones.I have played amps and effects from many companies, as well as many of the 'hybrid amps' that combine tube and digital tones, and if you are looking for the best recreation of Vintage Blues, Rock, Hard Rock, Country tones... the type of tones that you get from some of the famed Fender amps, the Mustang Series is as good as you are going to do.I originally bought the Mustang I for my 9 year old son to be his first practice amp and when we hooked it up for him, I could hardly let him play.The tone editing is easy through the controls on the amp.  It is easy and straight forward to see what you need to do to tweak your sound just by turning knobs.  When you add the Fender FUSE to the mix and start to download new tones from the web and tweak it with dozens of stomp boxes and effects that are free to play with and try and keep on your amp this is an amazing value. (not to even mention the Ableton recording software that comes for free with the amp.)The reason I love this amp is because of the faithful recreation of the great Fender amps like the Bassman, Deluxe Reverb, and Twin Reverb.  I have never heard a digital sound replicate tube amps even close to this well.I have heard several people say that they would never buy this amp because it is not a tube amp or because they are not computer savvy.For the Tube amp snobs...Nothing is going to match the sound of a really great Fender Tube amp.  But if you want to recreate great fender amps at low volumes the Mustang will be a great practice amp for you. OR... if you want to bring an amp to practice that weighs a fraction of what your Fender Tube amps weighs, the mustang is a great choice.  I am selling my only tube amp now that I have the Mustang II because I don't gig and really need an amp that I can practice with at night while the kids are in bed.For the Non-Computer folk...There is plenty to keep you occupied on this amp without ever plugging it into a computer.  And if you want to give it a try, it couldn't be easier to download new sounds and tweak your favorite tones.For the Metalheads...This amp probably is not for you.  Go try and buy a higher gain Line 6 or the Vox ADT series of hybrid amps to get some really heavy tones.  There are some decent metal tones to download on the FUSE, but the real strength of this amp is Vintage tones.Let me make it clear!  I played my son's Squier Mini guitar through this amp and it sounds really amazing.  I have a Fender Strat, Squier Tele and a Les Paul and they all sound amazing in this amp.This is the first piece of guitar equipment that has given me absolutely NO buyers remorse.  Unbeatable value.  A great toy.  A perfect practice tool.  You can't beat it.", "id": 719}, {"review": "I have to admit.  I have not tried this pedal with any other guitar besides my Strats.  But this pedal gives me everything that I want.The best way that I can describe the sound of the OCD is Quality and Character.As a Clean DriveWhen you uses this pedal with less drive as a clean boost for your tube amp, you will notice that it delivers a very strong character from your guitar and is very sensitive to your dynamics while playing.As an OverdriveI have loved the Ibanez TS9 because it allows a strat to keep a vocal type of midrange while having singing trebles.  When you add drive to the TS9, it retains those characteristics which is why it is the industry standard for strat guitarists who want to keep their stratty character and get the quality sound of a tube amp.The reason why the OCD is my preferred pedal over the TS9 is that it does not let the low end distort as early.  The TS9 allows you lower notes to distort earlier and seems to then amplify the signal.  The OCD gives you the fattest low end with tons of tone.  If you like blues or hard rock, you will notice that this feature is exactly what you wanted to give your playing a really strong character. You gain boldness and when your low end does gain some crunch, it is the biggest baddest tone that you could dream of.I use this pedal with my HSS strat and through a blues Jr III and use the clean boost for the coolest clean tone ever.  It allows your playing dynamics to drive the amp, not some arbitrary clipping from your pedal.  When I am playing heavier blues or rock stuff, I just turn up the drive and have the boldest and highest quality sound that I have ever played with.The HP/LP switchShifting into HP is almost like a gain boost.  I have heard it described as switching from an American Fender-y sound (LP) to a British Marshall-y sound (HP).  I guess this is a decent description.  I have found that I get a thick ballsy sound in the LP and I don't lose any quality in the HP.  It feels like you get a boost in your midrange.To conclude, I would have to say that this pedal is the perfect mix of ballsy overdrive with quality tone.  If you have a quality amp and a quality guitar, there is no reason to try and save $30 by buying an Ibanez TS9 or TS808 or TS9dx.  This pedal will make you a lot happier than those will if you like to keep your low end intact and not allow it to break up too early making it whimpy.", "id": 453}, {"review": "ConstructionThis Amp certainly looks sharp. It is not nearly as heavy as I would expect a 100W amp to be, but seems well put together.ControlsThe III comes with a 2 button Foot Pedal which feels very solid and works perfectly. (You can expand to add an optional 4 button switch that Fender sells separately and also includes in the IV and V.)On the amp, you have separate EQ knobs (Treble, Mids and Low) you have a gain, a volume, a Master Volume and a Reverb. Along with these, you also have an LCD screen that tells you which amp model you are using with witch pedals, presets, delays and reverbs. You also have separate buttons for changing Amp models, reverb, delays and modulation effects. The large knob on the top actually scrolls through presets, and once you press it, you can go into deep editing of the amp models, effects and presets.The controls are intuitive and easy to use. It is a great mix of visual digital feedback as well as tactile knobs.Comparing to other amps:The Fender GDEC 3 does not have as much deep editing available on the amp itself. You need to use your computer to edit and download settings properly. But on the Mustang III, you do not feel that you are missing out on editing functionality by not keeping it plugged into a computer.I don't know of another amp that has controls that are both as intuitive and as powerful.The Sound (Most important)Let me first compare this amp to what Line 6, Vox, and Peavy have offered in the past. All of the companies that have gone heavy into the amp modeling offer endless numbers of sounds and effects... BUT... How many of those sounds are useful for guitarists who are learning and trying to create sounds based on music that has inspired them? Line 6 offers tons of sounds... most of them are what I would call \"niche\" sounds that are only useful when recording a weird intro, or some crazy effects laden sound. What I find with Line 6 is that their vintage tones are very digital sounding and sound over processed. They don't sound overdriven, they just sound distorted. Also, Line 6 offers oodles of sounds for progressive rock, metal, and maybe even some weird jazz fusion. These sounds are unique and interesting, but the vast majority are of no use to someone like me who is learning to play the songs that I love and looking for useful rock, blues, and metal tones.What I can say about the Mustang III is that the tones do not sound digital or overly processed. The Vintage amps have some great overdriven types of sounds. These are very passable sounds and fantastic models of the Real Thing. You can find the actual base amp models in memory banks 88-99. By playing these sounds you get a real feel of what you can do to the amps. A few of the sounds that are simply amazing to me are:'57 Champ This amp model sounds so convincingly cool just like a little 8 inch Champ. Tons of character and tone. You can get some really cool vintage type blues sounds through this amp model. Think the Jimi Blues cd. The presets that use this amp that Fender created are all really fun and sound amazing.Fender Bassman Wow! You can get some great bold rock sounds out of this amp model. It has the recognizable tone of the Bassman modeled really well. Big Bold bottom end with some singing highs.'65 Deluxe is a fantastic all purpose amp model. Throw an overdrive pedal on there and play some great classic rock/blues. Or leave it alone for a beautiful clean tone.The British Amps are all good models of Vox and Marshall type amps. They are all bold and in your face. Just play one ACDC riff into the 70's amp and you'll recognize the sound.As far as the Vintage tones go...I dare you to find anything that models vintage tones this well anywhere. If you play rock, blues, Country, hard rock or Jazz, you have so many great choices. People who play in churches will love the variety of clean tones for your lighter stuff and good overdriven rock tones for faster paced songs.What surprises me is that Fender has strongly marketed this amp for people who play heavy music. I was worried that the heavier amp models would not be nearly as good.I was wrong. The 90's stack can get nice and grungy or crunchy as you like it. I'm pretty sure that this is a Mesa Boogie type of model. This is certainly your Metallica amp.The 2000 metal is for all of your nu metal needs and can be pulled back a little to play some cool thrash sounds too.The BIG bonus for heavy guitarists in my opinion though is the SuperSonic. This amp has a lot of great character and you can make it bluesy or really make it heavy and bold to play metal, thrash or whatever. If you overdrive it with a built in pedal, you can get some great raw and heavy tones out of this. I play some metal and hard rock as well as the classic and blues stuff that I like. I personally will play all of my heavy stuff on this SuperSonic amp.The fact that you can take any of these basic amps and layer effects and pedals on them gives you absolutely infinite combinations of tones. You can have one guy who sets all 100 presets with vintage tones, and another guy who has all of the presets filled with metal and thrash. It is limitless.I would, without a doubt choose this amp over ANY modeling amp out there for practice and fun.I own a pimped out MIM Strat, and a off-the-rack Classic Vibe Strat and Tele as well as a Les Paul style guitar. They ALL sound very cool on this amp. The Classic Vibe 60's Strat really impresses me through this amp. So versatile with so many great sounds and such a high quality sound. I am really loving it!This amp can play really really loud with it's 100 Watts, but you can also play it with great tone at very low volumes. (I have 4 kids and practice at night, and this amp is perfect.)Fender Fuse and Ableton SoftwareI have to admit that I really don't feel a lot of need to dive too much deeper into sound editing than what I can do manually on the amp. However, You'll find amazing tones all over the Fender Fuse. The system is super easy to use and store on your amp. As with any open online forum, you will have to wade through tones that you don't love and aren't described well. But you will find some gems too.I have not had time to dive into the ableton recording software yet, so I will have to save that review for later.The FINAL WORDI am a Father of 4 who needs an amp that sounds great at low volumes. I like Vintage tones as much as Heavy stuff, so I like a variety of tones. I hate overprocessed guitar tones. This amp is perfect for me. Perfect. The amp models are great, and the factory installed presets are a great variety of usable sounds. It comes with a built in tuner, tap tempo effects, a two button footswitch, an effects loop, a digital interface, deep editing computer software, a headphone jack, a usb port, recording software, and moreAt $299 This amp costs less than effects pedals that friends of mine have purchased. I have a $300 strat that I love that sounds beautiful through it. After buying it, I have listed a Tube amp and several effects pedals that I have loved because I no longer will play it.There is no better modeling amp for my needs!", "id": 737}]