[{"review": "I LOVE this mic as an indoor studio mic.  I would not use it in a location with a high level of background noise as it is omni-directional and picks up quite a lot of extra noise.  But when the conditions are quiet like in a studio, this mic ROCKS. Clean, warm sound that picks up natural bass really well.  Good for vocals (singing), or instruments like a guitar or piano. Also have used it for some minor podcasting and it worked very well for that too!Comes with a dB limiter (-16dB)switch, right on the mic.  Works really nicely at limiting background noise.I would highly recommend this especially at the price.  Comes with a decent hard case and SWEET shock mount.  Very happy overall.", "id": 268}, {"review": "I used this to create a custom sound card on my macbook pro when using Traktor Scratch Pro.  Did not end up doing what I needed with it, which was to be able to preview (there is a new toy on the market for that now) but it was good for adding additional channels to my limited macbook pro sound card.Good in a pinch!", "id": 569}, {"review": "Pretty simple, not much review needed for a cut and dry product like this.  Good quality XLR cable that works 100% fine.  I'm happy with this purchase.", "id": 692}, {"review": "This is a very simple product, and, as others have stated, you could probably just 'DIY' one pretty easily....but for this price, why bother??? Under $10 and this thing is as good as ones that range from $20-50.  I don't think the material + the time it is going to take for you to make one (about 30 mins-an hour, more if you have to go out and buy all of the materials) is going to be worthwhile versus just ordering this bad boy online and...voila! It arrives two days later, no fuss no muss (assuming you have Prime, because, well, who doesn't these days? ;) )PLUS this will look good on camera.", "id": 842}, {"review": "Can't complain about a price like this!!! Does the job just fine for what it is, not really anything more you could ask for.  Comes with the proper attachment pieces that you need for most (if not all) microphones, folds up nice and small.  Happy all around!", "id": 684}]