[{"review": "From the other reviews I wasn't sure what to expect but this is a nice stand for the money. I use it and my granddaughter uses it as well. It is sturdy, easy to fold away and easy to setup. The leg spread can be adjusted for space if necessary. I highly recommend it if you are looking for a good valued stand.", "id": 257}, {"review": "I really like this stand. It has a nice wide leg base and well padded neck and body holders. It is a nice solid tubuler style guitar stand and either my electric or acoustic guiter fits well in it. I highly recommend it to anyone looking a stand for their guitars.", "id": 258}, {"review": "This strap looks better in person than on the computer. It has a nice soft feel and doesn't scratch the neck like the belt straps do and the color goes well with a varity of instrument looks and colors.", "id": 273}, {"review": "I tune both my acoustic and electric guitars with it and it appears to do a good job on both. I didn't think it would pick up the vibration on the electric very well but it does and without it being attached to the amp. It appears to do a better and faster job than my old seiko electric guitar tuner. I would have gave it a five star but being a beginner and not having developed a good musical ear yet I don't know if it is tuning the guitars as well as some other unit. I would recommend it to anyone looking for a good inexpensive tuner.Update: The more I use this tuner the more I like it. It is easy to read and use and doesn't appear to be as easily broken as other reviewers say theirs was. Of course I am careful with it a keep it put away when not being used.", "id": 706}, {"review": "It's not a thing of beauty so if looks is what you are after then this wall mount isn't for you. If you are looking for a solid, easy and convient place to hang your guitar where it won't get stepped on or kicked over then this is for you. It works great to hang a standard size guitar on. There is a little wiggle room left so a oversize may fit but I am not sure. It has a soft foam cover over the steal arms to protect your guitar, hangs by the neck where the head stock curves out so the tuning pegs aren't bumped and hangs straight, just touching the wall with the body. I recommend it.", "id": 779}, {"review": "This appears to be a good sturdy capo with a strong spring and a rubber appearing pad on back to protect your guitar neck. It looks fine and works well on the neck to hold down the strings, just as it was designed to do. It looks and fits just as shown in the picture. I recommend it.", "id": 802}, {"review": "I used this a couple of days ago to change strings on my electric guitar (Fender Strat). I was suprised in how well the little wire cutters worked. The end that turns the machine tuners is a little loose feeling but it still works well, you just have to be a little carful about not allowing it to slip and to not over tighten the strings. I highly recommend it.", "id": 94}, {"review": "I cleaned and oiled the fretboard on my straocaster the day after I received the product. The cleaning product worked very nicely but the oil was hard to get out through the applicator. The fretboard turned out nicely though so I decided to give it a 4 instead of a 3. I have to say though that I believe a big bottle of eye glass cleaner to clean the fretboard with and a good furniture polish would work just as well. Since you only use a small amount the kit will last a long time so it isn't a bad buy. Just remember it isn't recommended for a maple fretboard and could damage it. If you want to use this type of product then I recommend this one.", "id": 96}]