[{"review": "This works fine, although the mount is a bit weird to me... but I see that most are the same.  As a pop filter it works perfectly and I was not able to hear any clarity loss or sound coloring.  Just pop filtering through black pantyhose !! lol", "id": 46}, {"review": "These are nice, I like the 1.14 rigidity and these are just fine for me... you will wear them out on acoustics though if you are a more aggressive player as I am.  Once these are worn, as with most picks, they sound considerably different.  Much more grainy and tin-y but that may be a plus for you?  I also like the side edges for a real mellow and / or speeding picking style.  They stay in your fingers well.", "id": 54}, {"review": "It's a pick... everyone has their preference, but I happen to like the 1.14's a lot and the &#34;powder-y&#34; grip on these is a real bonus.  It take a bit to wear that off but they are still good when they are &#34;clean&#34; as well.", "id": 65}, {"review": "This is a really nice strap.  It's very thick and feels like it's well made and high quality for a non-bank breaking price on a strap.  Looks cool and vintage, I am a fan of many Dunlop products and this one does not disappoint at all.", "id": 172}, {"review": "For the price this is a pretty nice strap.  It's thin but does the job well. The simulated leather end pieces are noticeably &#34;cheap&#34; but its a guitar strap and has not failed me yet :)", "id": 353}, {"review": "I needed this for my Jazzmaster that has a front face input.  Sounds fine, although that guitar is notably &#34;humm-y&#34; with the single coils, I don't feel this cable added any more noise in the line.  Looks cool and sounds good to me and great price, I actually bought 2 !!!", "id": 492}, {"review": "This is what these things should cost and this is how they should work.  I will be trying this out in a chain of effects (as the single power supply) so I will report back if it cannot do that.  Works as expected for 1 to 1 pedal power.  Enough said.", "id": 521}, {"review": "I really like this one as a pre to my Fender Superchamp X2 head, especially on the distortion channel.  It really adds some nice tone and lots of overtones... the only thing to be careful of is the tone knob as that is a HUGE sweeping circuit.  I was not able to get it even close to 1/2 way without it being just ugly, but that might be preference.  Also of note is that I ran my Fender Mustang bass guitar through this (active pickups) and I loved the grit that it gave the sound.  This is a great pedal for the $$ and it feels heavy and solid like any major brand.  Very nice work Joyo, I will be buying more of your pedals for sure.", "id": 794}, {"review": "I really liked this one.  I bought the Crunch Distortion at the same time and these are complimentary to each other as well as nice standalone.  I very much like how Joyo has reproduced some great sounding pedals for amazingly low prices and seemingly high quality for the average guitarist that just cannot afford to spend thousands on these overpriced \"boutique\" pedals.  I will continue to buy these products from Joyo until I find something wrong with them and at present I have nothing to bitch about at all here.  Sound wise this is a big phat heavy sound.  As an example, this is the JF-02 and JF-03 on guitar and the JF-03 on the bass as well running through the clean channel of a Line 6 Spider:[...]Buy this/these pedals and all things from Joyo, they are worth every penny.", "id": 795}, {"review": "Great stand, holds my mid sized keyboard up very well.  Not sure how it works for some behemoths but for the basic setup its fine.", "id": 272}, {"review": "I like this pedal.  Its rugged and has a great range of tonal capabilities and rips for hardcore metal.  That being said, the blue LED while cool looking is actually blinding and I found myself placing a finger over it to just see the friggin' knobs for adjustments.  I guess that is a pretty weak complaint but IMO it's an impediment more than an enhancement.  Also the Gate and Scoop buttons feels pretty flimsy to me... which is not expected at this price point.  A moot point because I am not using the Gate at least as IMO it was &#34;weird&#34; in its Gating execution, sounded kind of like a very rough algorithm is being used instead of a nice smooth curve.  But all in all this thing tears it up in terms of pure shredding tone.", "id": 638}]