[{"review": "This original plug fits the purpose perfectly! Quality and precision! The plugs don't take up space (couldn't be smaller) and the wiring is pliable and easy to rout in and out of spaces on your pedalboard. Keep away from the cheap imitations that rob you of space and are hard to work with! Make sure what you receive is a One Spot product in its original packaging (check images).", "id": 192}, {"review": "Looks great, feels great, and works great! The leather is soft and adjusts to the contour of my shoulder and back comfortably and securely. great! I love it!", "id": 484}, {"review": "I ordered this plug because it is advertised as a &#34;1 Spot&#34; brand plug. It is not what I received. Instead I received a generic plug  for eight 9v connections that would definitely fit the purpose, but a really cheap version. The plugs on this generic version are larger than the 1 Spot and the wires are kind of stiff plastic. The original 1 Spot plug has much smaller plugs, great for saving space on a pedal board, and the wires are soft and &#34;rubbery&#34;, again making it easier to work with on a pedal board, specially if you're working with a pedal board like Pedaltrain where you can intertwine wires in and out between bars. I informed the seller about the issue and was told it was a mistake and that they would send me the correct one. In my email to them I included an image of the original packaging of the 1 Spot 8 Plug to make sure there would be no mistake, but to my amazement they sent me another compatible plug. I emailed them again for a refund, which they promptly did. I can say, that they did respond quickly and they refunded my money. I imagine that those who order this plug without ever having worked with an original 1 Spot plug, wouldn't know the difference because although it is a really cheap version it does have eight 9v connectors. I strongly recommend, spend the extra two or three dollars and get the original 1 Spot 8 Plug.", "id": 486}, {"review": "Amazing! I plugged this little gadget into my Strat, put on my headphones and wow I was super surprised! The sound is amazing. You can adjust the amount of gain and volume to fine tune your sound whether your playing through humbuckers or single coils. I love the sound I get on either my Strat or Les Paul. Best of all you can practice as loud as you like without bothering anybody. I plug this little monster into my compressor and from the compressor to the guitar and the sound is amazing. I really like the sound and the fact that it is totally portable and independent of power (runs on two AAA batteries). The digital delay effect is activated independently, (same little switch just one extra click) which is fine, but you can't adjust the speed or mix. That's OK though because the factory setting works just fine if you want a touch of delay. All in all, I highly recommend this Vox AmPlug Lead Guitar Headphone Amp for its sound and price. One small con, its made of plastic and seems a bit fragile.", "id": 546}, {"review": "Well made, sturdy, and adequate for use on a pedal board or just to connect various pedals via the traditional way.", "id": 578}, {"review": "Nice quality plug. I used this plug to connect my lower row of pedals on my pedal board to the second line of pedals. Works great and no noise! The shielding on these Planet Waves cables are great.", "id": 663}, {"review": "These original bullets are great for my Strat. They are made specifically for the Fender tremolo bridge and fit perfect. The strings sound great and hold up to the &#34;whammy&#34; just fine. Sound great and look great.", "id": 667}, {"review": "First off the pedal is constructed of metal and feels really durable. Turning the knobs on the pedal reveals the the smooth and efficient quality of the pods. The pedal &#34;gets along&#34; fine with no interference with the other pedals on my board. The sound is exceptional and can be adjusted  within a wide range to one's liking. I can't say it's my favorite pedal, but it sure does play a nice role on my pedal board of various effects.", "id": 675}, {"review": "Wow, does this stick or what! I installed a small pedal on my pedalboard with just a small piece of this &#34;Power Grip mounting tape&#34; on the top and bottom of the pedal (HOF reverb) and one afternoon I stumbled or better said kicked my board by accident hitting the pedal right on and man it didn't budge! Had I known this before I would have installed all my pedals with this Power-Grip wonder! Need sticking power? This tape will definitely fill the requirement.", "id": 765}]