[{"review": "I love these pick holders.  They're easy to get on and off.  They hold a nice amount of picks.  And you get that rock-star feel (throw picks at the audience).  A must for any gigging guitarist.", "id": 70}, {"review": "It holds all my acoustics perfectly.  It's light but stays in place okay.  Rubber pieces are soft enough and seem like they'll last a while.  Two really nice things about this design: 1) it folds up very nicely and becomes pretty small, 2) the all black and slim arms/legs design makes it look nicer in a room.  It pretty much disappears when you put a guitar on it so I'm able to have it out without offending my wife.  :)", "id": 92}, {"review": "This strap replaces another one just like it which I use with an acoustic guitar for giving lessons.  For stage I like something heavier.  Good quality.  The holes work with my strap buttons okay.  My lower button is an output jack for an after-market pickup which is wider than a normal strap button.  But this strap works okay with it.  It just takes a little more force to get it on which I'm sure will go away over time with use.  Great price for a simple strap at around $5.", "id": 208}, {"review": "Now I can create charts no the fly quickly and have perfectly straight lines.  5 frets allows enough room for more complicated chords or even scales.  A must have for guitar teachers IMHO.", "id": 361}, {"review": "I've used a few different strap lock systems and this is by far my favorite design (not to mention the most affordable which must be due to its simplicity).  To use these, you put your strap on your guitar (as usual) then put the locks on.  Rotate the smaller piece until the holes line up then slide the lock on above the strap.  Once the lock has passed the head of the guitar's strap button, rotate the smaller piece again until the holes do not line up (close position) which should be about 180 degrees from open position.  Very simple and works very well.I have not used any lock system that's perfect.  Every one that I've used failed at one point or another (came off unexpectedly).  These work exceptionally well.  What I like about this design is that it doesn't require any modifications on the guitar or the strap.  You can use the strap you like without adding anything to it and you don't have to replace the guitar's existing strap buttons.But they do stick out a bit (to keep the strap from sliding off) so if you're concerned about looks, you might want to try another system that's more discreet.  Also, I tend to use thinner leather straps that have thinner ends.  These will likely not work very well with thicker straps that tend to take up most of the height of most strap buttons.", "id": 261}, {"review": "I bought this tuner primarily for my wife who plays harp (I play guitar).  She has been using my guitar tuner which works okay but cumbersome.  I was hoping this tuner would clip on the top of the harp to make it easier for her.Unfortunately, it doesn't fit on top of our harp.  The tuner is rather small which is nice for transporting but the clip will not open wide enough for the top of the harp.  It does, however, clip into the sound hole okay.It tunes the harp fairly well.  I only had problems with the top 3-4 strings which I had to pluck a bit harder for the tuner to pick up.I also tried it on my acoustic guitar and it did the job perfectly.  (Clipped it to the top of the headstock)Tracking is very, very good for a tuner at this price.  I was able to play the strings, tune them, and watch the meter follow the note.  Display is very easy to read and lights up nicely.  I was tuning in a dim-lit room and was able to read it perfectly.  I'm sure it would be great on a dark stage.The only other drawback is that the display needs to be positioned within a certain range.  Otherwise it gets a big hard to read.  But positioning it is very simple since it swivels easily.4 out 5 only because of size (not fitting on harp as I hoped) and display legibility depending on angle (I had to reposition it maybe 2 times in order to tune the whole harp).", "id": 707}]