[{"review": "Had the old stamped one and was upgrading all the chrome some I put one of these on.  They work perfect and look good.  You get 2 in package (with screws) so I have a spare.Update I only had one on E/B but went ahead and added one for G/D.  Works and look great!!!  google \"stratocaster string tree placement\" if you are unsure of where and how to install.", "id": 115}, {"review": "Only Lasted 2yr.  I have a lot of cheaper cables that get more use/abuse than this one that have outlasted it.", "id": 123}, {"review": "Perfect OEM.  ONE WORD OF WARNING, if you are not good at soldering and/or you don't have a good iron, don't try this yourself.  The contacts are very thin and will burn up in a hurry.  I recomend readingThe Fender Stratocaster Handbook: How To Buy, Maintain, Set Up, Troubleshoot, and Modify Your Stratif you are unsure.", "id": 214}, {"review": "They have slightly more of a nickel finish than chrome and look way better, and they give u some spares.", "id": 215}, {"review": "I was a little disappointed.  Don't know if it's a QC problem or if I just got some rejects but out of 6 pots, 1 was out of spec (315k) and 2 were almost out (289k, 205k).  1 was right on the money and the other 2 were within 10%.  They are CTL's so I'm a bit confused.  Other than that they work fine, they have the nut, washer and cap included (no knob).  I will be upgrading the caps.", "id": 216}, {"review": "Was upgrading the chrome on an MIM. Perfect fit.  Used Switchcraft jack.  Includes screws and 1 washer(for the jack).  Looks great.", "id": 218}, {"review": "These are great lights for music stands.  If you need a good blackout light theMighty Bright 52010 Pedalboard Light, Blackhas a red light that works great for dark stages.  Because they are LED the batteries last a long time. Some of the Mighty Bright lights also have an AC adapter option but this one doesn't.", "id": 388}, {"review": "I was upgrading all the chrome on a MIM and put this on.  Looks better than the plain one.  Includes the screws.", "id": 475}]