[{"review": "Costs about 2x as much as some cheap capos, and it's worth every single penny.  THis has a strong clip, yet does not damage my concert or tenor ukulele necks.  It won;t budge once you clip it, and it's low profile.  Made of metal, it should last a lifetime.I took off one star only for one thing: the hand clip portion of this does sometimes get in the way of fretting because it sticks out from the neck quite a ways.  Some other capos, like this oneJim Dunlop 7828 Russell Banjo/Uke Capodoes not have anything that you can hit your hand on when fretting.  Sometimes I try the Kyser on the opposite side, away from me, the player.  But, it seems to still hit my hand on some chords, just different ones.  That said, I can work around it, and it's a lifelong capo of fantastic build and keeps those strings from buzzing at all on all my ukes. If one was to have large hands, as I do not, this interference may be even more of an issue to consider.C ya.  Happy strumming.  Mahalo.", "id": 43}, {"review": "I used this on the side of a wooden bookshelf for my ukulele.  It's attractive.  It's well made. It's fork is a tad large for the ukulele  It has rubber o-rings that slide, so I can bring them in and the uke does fit then.  But then, even the three inch deep uke is close to the bookcase (or wall, if you use it there).  The uke hits when I put it in the hanger, so I put a felt pad where the uke body hits the bookcase.Many uke players simply nail a single nail in the wall and use a loop off string from it around the uke head and tuners.  This is much less expensive, holds very well, is even more low profile than this hanger, and never drops a uke. Consider it for your needs.I'd not buy another of these for a ukulele.  It likely works fine for a guitar, though.I deducted one point for the fact that, even though it's adjustable (the o-rings), and advertised for ukes, it doesn't work well for them.  And it's heavy and not stylish, in my opinion.  I have the Hercules wall hanger (mechanical gripper) for my electric guitars, and it's fabulous (for guitars; overkill for lightweight ukuleles, maybe).Hercules Stands Wallmount Guitar Hanger GSP39WBUpdate 9/7/11: the more I use it, the less I like it.  I find that friction tuner ukuleles do not fit on it well at all, and the tuners hit the fork and it can make your uke out of tune.  So, for small instruments (you'd have to try it yourself with mandolins and banjos), this is atrocious.  For guitars, it's not as good as Hercules.", "id": 154}, {"review": "This is a cheaply built cable.  It has basic ends, they screw on but seem to come loose and need tightening frequently.  The only truly redeeming feature of this cable is it's tiny length : 3 feet.  I use it with my Honey Tone Belt portable ampDanelectro N10A Honey Tone Mini Amp in Aqua, so the cable has to be short.  The amp is on my belt. I use it, thus, just like Jackson and Cole, reviewers below.  Like Jackson, I have a RISA solid body electric ukulele.Let me say, three feet is short, very short.  If you want to put the amp down on the floor, you'd better be (a) short, and (b) siting right over it, because when you find out how limiting three feet cable really is, you'll recognize that you can only use this for one thing: a portable amp, close to or on your body.I suppose you could use it to connect a couple of guitar pedals and not have too much cable, but them again, most connector cables are even shorter.Glad I have it only for the purpose I intended.  Wish it was heftier, stronger, better looking, like my other guitar cables.", "id": 512}, {"review": "I used these on my ukuleles, and they worked well enough that I bought tow more pairs.  They hold a regular strap well, and work particularly well with the leather strap attachment from a Uke Leash (google it, those are fabulous!).cheers.", "id": 598}, {"review": "Bright tone.  If you have a dead sounding ukulele, as is sometimes heard in laminate ukes, or you want added volume, the Aquila strings are second to none.  There are other wonderful strings (Fremont flouros, Worths, etc.), but Aquilas remain the pinnacle of affordability and enhanced sound.  If you own a less expensive ukulele (under $300) and it came with \"no-name\" factory strings, or strings known to be of lesser caliber than the Aquilas (strings such as Martin, GHS, etc.), please just try a set of Aquilas, and you will hear a major difference.  There are internet videos showing the painstaking process of making these Nylgut strings in an old factory, owned by a middle aged couple, in Italy.Winners.", "id": 698}, {"review": "I bought an Ibanez Concert size uke.  The body is 2 inches wide (less than the 2.75 inches stated for this stand).  My uke does not fit well in the stand.  Why?  The twin forks at the base that hold the instrument are both too narrow, and the curve downward from the stand is not proper for this uke.  Thus, any uke that is concert size or greater.  So, most ukes don't fit well.  They fit, just not well.I did, and you will likely need this advice, remove the bottom fork, turn it upside down, and reinstall it (no tools required).  Now the \"curve\" of it is upward, and the uke better sits on it.  The fit is improved.  Not great but better.  One stand can't fit all instruments, but my full size guitar stands hold most all guitars.  This small stand does not hold most all ukes.Although its neat how it folds up, like the video here on Amazon reviews, it is very heavy for its size.  This is not a lightweight stand.  At all.  Surprisingly heavy, and not one that you will be lugging around day to day in your uke gig bag, trust me.I wish I got the Hercules standHercules GS402B Mini Stand. All Hercules stuff is superb, and my friend has one for his uke and says it's sublime (I don't own it, myself, so I just present this so you can research it and it's reviews on Amazon). I own other Herc stuff, and it's all ideal, and for a few bucks more, I could have had that lifelong-use stand instead of this one.  Oh, well, for once, I got cheap.  And got burned for it.All in all, not great, this tiny stand.  One stand fits NOT all.  Perhaps a violin or something would be better on this stand, but I think the general shape of it is less than ideal for most instruments.  You may think you can bend the lower forks, but it's hard to do, will require a vice, and if you see on the Amazon pictures, the lower fork just sits in two plastic grooves, so if you splay it out like it should be, you'll change the way it fits in the grooves, and thus it won;t work at all.  It's just an imperfect design. My take on it, your mileage may vary.  Bye bye.", "id": 702}, {"review": "I'll just say, newbie to ukulele, no idea how to tune it, instructions online say GCEA, I put this on the head, plucked each string, tuned the machine head until it said dead on, and that was it.  I keep this clipped to my ukulele standInstrument Stand for Violin, Ukulele and Other Small Instruments(see my reviews of it, it's so so, the stand), and just turn it on and tune the uke before I take it off the stand.  ONly time will tell how these little nickel watch battery style battery lasts, I find them a bear to buy, but time will tell.  Anyhow, I concur with the reviews on here, glad I listened to them, and for any brand new ukulele players out there, this is the one to get.  C ya", "id": 707}, {"review": "The Planet Waves Guitar Rest works for ukuleles!  I just got one, and have used it for a few days, and it's the bomb!  I can set my little ukuleles down now without fear of falling over.  This product is a rubber disc with small \"arms\" in a gentle curve that nestles against the edge of any surface, and you can set your instrument against it, and voila, it doesn't fall over!  Here at home, I use it on the second shelf of a bookcase, and my concert sized ukulele fits like a glove, heel on carpet, neck in Guitar Rest.I'm going to buy a couple more for my ukulele cases, because I can use them at one of my uke parties.  If one sets a tiny ukulele on the floor, for instance, to take a whizz, they're just small enough to go unseen and have someone step on them.  Here, I just find a spot near wherever I'm sitting, and it becomes my \"lean\" spot, and I can even set my beer can on the round part on the back!  Coaster uke/guitar holder.  It's quite immovable once it has some weight against it from the instrument.  I could carry a metal stand with me, but it wouldn't fit in my ukulele case--this Planet Waves product does.  A winner.", "id": 746}, {"review": "I own several tuners, and two Snark-2 tuners, which are great (except they're not low profile like theKorg Pitchclip Chromatic Clip On Guitar Tuner - Korg PC-1--please see my review of that tuner).So, since I needed another tuner for my ukulele, I ordered this time a Snark-6.  This one says, specifically, for a ukulele.  I wanted to try it compared to the Snark-2Snark SN-2 All Instrument Clip-On Chromatic TunerThe Snark-6 and Snark-2 are identical, except for color.  The Uke tuner here is gloss black, and the Snark-2 is matte red.  Otherwise, the size of the dial/face, the clip itself is precisely the same.  So, there's nothing more ukulele relevant about the 6 versus the 2.  The tuning is chromatic, so it's good for any specific instrument (mandolin, guitar, uke, banjo, etc.).So, choose whichever color you prefer, and go for it.  Sweet tuner.  Superb graphics on the dial, colorful accurate, and inexpensive (but not \"cheap\" build, like the Korg).  Highly recommended tuner.", "id": 763}, {"review": "Used these for years on son's electric guitars. No fuss. Mechanics do not seems to wear out, still gripping. No way at all to knock the guitar off the wall. No neck damage to axes. Mounts well, but try to find a stud, certainly. Keeps the guitar far enough away from wall that brushing against it does not hit the body to the wall.No complaints. If you're going to drill your wall, is it really worth it to buy a simple fork style wall hanger with no means to keep your guitar on it if it gets bumped when for a few bucks more you can get the undisputed champion of guitar wall hangers. All 5 star reviews on this baby. And I agree, and I add to that total.  5 stars", "id": 289}, {"review": "I have Snark uke and guitar head mounted tuners, see my reviews.  When I use my music stand, I just want something in front of me that does not need mounting that also does a great job.  This is that device.I leave it on my stand, and can hit the silver front mounted button with one finger, and it's on, and I can play my ukulele and it will register and provide the same clear electronic dial and acurate tuning of the Snark head tuners.  In addition, this one has a metronome.  I like this very much, and may well buy another.Enjoy!", "id": 732}]