[{"review": "this is my first petal of  any kind.  I had read that the Wah shoud be your first so I went with that.  glad I did.  this Wah petal is so much fun.  you can make as many cool sounds as your imagination will allow.  It is hours and hours of fun.  the sounds are great.  I have had no problem with performance.  it works as it should.  I highly recommend this petal.  it's price is attractive as well.", "id": 41}, {"review": "I like these pics.  I use a variety of thickness and this are moderately thin.  good for fast strumming, etc.  they feel good in your hand and are easy to hold onto.  I would buy them again.", "id": 83}, {"review": "this little stand is great.  I am looking at it right now, across the room, holding my Zager guitar.  it is light, non obtrusive, holds the guitar well, and it is portable when Mr. Guitar and I take a trip together.  I highly recommend it.  keeps that guitar off the bed, floor, table or anywhere else it is not really suposed to be.", "id": 92}, {"review": "I bought this to bring my fender strat with me on airplane trips.  I check the guitar in baggage with this case and it seems to protect it just fine.  the it is very good for a Stratocaster and there is a little extra room inside for tuner, picks, tuning forks, capo, etc.  and..........the price was very good.  best I could find for this time of hard case.  The only thing that is sort of weird is that most employees at the airport are constantly asking me if I have a gun in case.  If you need basic protection of your guitar, this will do very well.  I do not know if it will fit other guitars.  I have heard that some are too long for it.  but.......for the Fender stat, it works just great.", "id": 131}, {"review": "I tried these strings on my Zager guitar.  the are certainly ok and play fine.  they are nothing far and above the original strings provided thru Zager.  just a little cheaper in cost perhaps.  maybe they will last longer.  I had some problem with my original strings as the high strings started to rust in the case due to the humidity I put in there for the guitar wood (I live in hot and very dry Arizona).  these have not rusted, so far.", "id": 198}, {"review": "these are good. I dont see that they are any better than other basic strings in their price range.  they all work well.  length of being brillant is somewhat limits, but it appears to be in most of these level of strings.", "id": 225}, {"review": "I have been using these strings for a while now.  they are consistent, sound good, have a good life, and are very well priced through Amazon.  They are crisp and vibrant when new and this lasts for quite a while.  I will continue to buy them by the dozen for my electric guitars.", "id": 226}, {"review": "i needed a simple music stand to hold my music and notes when practicing in my room.  this does the trick just fine.  it is light, sort of cheap, etc., but it does what it needs to and it did not cost me an arm and a leg.  I wouldnt recommend using it for concert or stage performances but for at home, practicing, it is just fine.", "id": 257}, {"review": "I am a believer that if you have a musical instrument, it has to be out if you are going to use it regularly.  with these sturdy stands,  my guitars are out and around the house and they seem to &#34;talk to me&#34; every time that I walk by.  this encourages, if not compulses, me to pick them up and play them for 5-15 minutes at a time.  these stands are inexpensive, light, and hold the guitar well.  I would not recommend them for heavy, on the road, stage work, but then again, most of us are not on the road nor the tour.  we are just playing for the love of it.", "id": 258}, {"review": "I am a basic player and just starting to explore the possibilities of using a slide.  this one works fine so far.  it is rather heavy and I like that.  I also like that because it is metal, if you drop it on the floor, it is not going to break like my glass one did.  Be sure to get your correct finger size before ordering however.  otherwise it may come too big or small for your chosen slide finger.", "id": 340}, {"review": "works well.  the glass is a much softer, more subtle sound than metal.  it works on my pinky finger.  would have to have a much larger one for my ring finger and I dont have particularly large hands.  Just don't drop one of these on you tile floor.  they explore quite nicely that way.  I keep mine in a protective case when I am not using it.", "id": 456}, {"review": "this strap works fine on my Fender Strat.  it is reasonably comfortable.  I was disappointed in that it does not fit the pegs of my Zager acoustic.  otherwise,  it works for a lower priced leather guitar strap.", "id": 481}, {"review": "works very well.  I have to of them.  each does a little different thing,  they are great for traveling, or late night need to play stuff, when the rest of the family has no interest in your desire to get better.  the sound, effects, etc., are adequate and are good as you need without the real amplication.", "id": 546}, {"review": "I really like this tuner.  it works very well.  once you understand what you are supposed to be looking for on the tuner (ie., the moving black squares to no longer move),  then tuning is a simple and accurate thing.  it works great on all of my guitars, acoustic and electric.  comes in a very cool metal box which protects it nicely when traveling or not using it.  it cause a few bucks, but I think it is so much better than the other less expensive clip ons, that it is worth it.", "id": 711}, {"review": "this is very inexpensive and works great for my home-wanna be purposes.  it is not superloaded with heavy delay, etc. but it definitely gives you the effect.  it links well with other pedals.  the Battery wears out pretty quick and it does not come with a 9 v plug in.  therefore, I would recommend spending a couple of bucks and get a standard 9V plug in on Amazon or at a local electronics store and not worry about the batteries always going dead.I like it enough that I will probably get a few more of this company's petals as the effect is good and the price is right.for my limited purposes, this works great.  if you are a pro gigging or on the road, you probably want to get a more versitile, heavy duty and expensive delay petal.", "id": 716}, {"review": "this tuner works great.  it is easy to see and accurate for basic guitar tuning.  I use mine all the time between different alternative tunings.  I liked it so much, I bought one for my grandson who is learning to play guitar as well.  a great investment unless you have a perfect ear.", "id": 818}, {"review": "I am not hard on cables.  I typically just plug them in to my guitar, dont move around much, and play for an hour or two a day.  this one seem to perform just fine.  no buzz, and/or other noises noted.  I have several of them and they have all performed well.", "id": 6}, {"review": "these strings are different and really quite nice.  the high strings are thinner and thus much easier to play and bend.  the lower strings retain the depth and sound of my usual strings.  I really like them.  only possible difficulty is that high E etc might tend to break a little quicker due to being a thinner string.  I have a bunch of these on hand for my  strat and my Epiphone as well the standard Earnie Balls", "id": 240}, {"review": "this is the 2nd tuner like this that I have purchased.  it really is dependable and works great for basic tuning of my guitar.  the battery lasts a long time as well, which is not true with all little tuners like this one.  all in all I am very happy with this purchase.  small price to pay to be in tune.  I would highly recommend it if what you are looking for is a dependable, inexpensive way to accurately tune your instrument.", "id": 706}, {"review": "great for carrying with you.  works as it should.  good price.  I would recommend it if you need a table top mic stand or one just off the floor about a foot.", "id": 708}]