[{"review": "If it's good enough to track Tom Petty's vox on the heartbreakers albums, its good enough for the rest of us. Sounds great on amps and perc. Dropped one from a 12 story building a few years back into a parking lot and it barley dented the housing and still works 100%. My drummer still uses it on his kit and I never told him haha (hope he doesn't read this review!) It's a shame the new mics coming out (wireless stuff they make: IE Presentor, PG seies, digital series etc) are such flimsy pieces of garbage. This is the last of the cool from Shure.", "id": 19}, {"review": "Donr be fooled by the imitations... should be their slogan. There are some real junky ones out there and these are great, love the washers, life savers. Thanks!", "id": 22}, {"review": "Think it sounds like a trash can lid? No, it doesn't. It sounds like a crappy china which has it's place (in the rehersal studio for one...). Want a really good china? Spend more money. That's how it works. Great for practicing. Small diameter gives it a shrill overtone. Poor on recordings (unless you're looking for that... there's always an application). For $20 though, c'mon. What do you want? Anyone giving it less than 3 stars is a pretentious wad. It's $20. It was made in the remote hills of Wuhan China where they've been making cymbals of sorts for more than 3,500 years and you got one for $20. Or go buy a K Kustum and quit your sniveling. I say get one! get them all in all sizes and you still spent less than an actual professional china. boyah.", "id": 144}, {"review": "Did a ton of research out there b4 I bought this. I can't BELIEVE that so many manufacturers are asking for hundreds for freaking sheets of bent metal! What a racket it is. If I could make one I would. This one was cheap and does the job. Dunzos.", "id": 269}, {"review": "The only flaw is the rubber gaskets in the joints These deteriorate over 3 or 4 years. I go through these quite a bot but for $20-$30 you can't go wrong. Tubes are tough and sturdy", "id": 279}, {"review": "This is an overpriced item. That is my only complaint. There's enough reviews on here that state the obvious. It is small, it sounds good, and can keep up with a little jazz trio by itself which is amazing. HOWEVER I have to say I'm super uber pissed that the day after I bought this amp at sam ash for $450 it dropped to about $250. How does an amp just come down half price over night? I mean, what kind of scam was this company running if they can afford to stay in business and sell them half the price than they were originally marked at? It's like the blue blocker sunglasses. On TV They're sold for $80. 6 months later you can get them in the barging bin for $2 at CVS. This is not ethical business, this is trying to get as much as you can from your customers with no regard to true value.. PS the ambiance was a better feature than newer verb processors.Edit: Just read another guy who gives it 5 stars because it can be \"used as a weapon to knock someone out.\" Not sure if this amp deserves the 5 stars it is getting, and certainly not because it can bludgeon someone to death in an alley. I stand by my logically opinions of this item. ZT should not have sold this for $450 in the first place. It inadvertently turned customers like me off to the company name.", "id": 685}, {"review": "In writing a simple review for such a simple product there's only a few concerns you should have. 1. Would the adhesive dry out on this and 2. does it wear over time? The answer is it gets 4 stars. It doesn't dry out but I had to replace mine after 5 years because it eventually wore out. That's pretty good! Not perfect but pretty god!", "id": 73}]