[{"review": "This set is not for everyone! In fact, you might have to get the neck adjusted after installing this set.  While I can see rockers laying down overpowering riffs with these my goal is to get the lowest action I can on a jazz box.  No question about the quality, though, these hold up the same fine standards as the other Slinky sets.", "id": 97}, {"review": "I have finally discovered that the &#34;perfect set&#34; is a moving target. As arthritis creeps in I find myself playing heavier strings with a lower action, and these work in that respect. Another advantage of usiung this set is that it beefs up the treble side without making the bass side too boomey. (Telecaster, anyone?)", "id": 98}, {"review": "These perform well on single coils, specifically Telecasters.  Right now I switch back and forth between Power and Beefy, with Fenders being my next choice followed by D'Addario.", "id": 239}, {"review": "The Rate goes from barely there to a massively overdriven buzz tone. I'd consider the usable range from 0 to about 9 1/4. The real treat is the Tone switch. It's almost like having two stompboxes in one. The footswitch action is smooth, quiet and nearly effortless. The effect is there, then it's not. There are no audible artifacts as it switches in or out. It's hard to beat this box at any price. If the unthinkable happened I'd buy another one in a heartbeat.", "id": 377}, {"review": "..and that's a good thing. I wanted a tuner pedal that I could use under any lighting condition. My previous experience with Korg equipment made the Pitchblack a no-brainer.There's not much I can say that hasn't already been said except &#34;true bypass&#34; is nonsense. If your tone sucks when a device is not on then the problem is somewhere else, not in the effect. If you want to talk about unity gain, on the other hand, I'm all ears!", "id": 504}, {"review": "I bought these because they were an &#34;add-on&#34; offer and I'm glad I did.  I don't play uke but a friend turned me on to using them for bass. These are a little too soft for guitar (check out the Dunlops) but I'm going to make sure I have some of these around, too.", "id": 775}, {"review": "When I tried it out the first time the octave seemed to be intermittent. Noting that this product comes from China the first thing I suspected was cold solder joints.  I warmed up the soldering iron and opened 'er up and YES!  not only were there cold solder joints but there was a small piece of loose wire shorting components at random. Typical of quality control in the People's Republic of China. A little touch-up with the soldering iron and it's back to normal, whatever that is.  I'm a bit disappointed with the octave but I'm keeping it because it's a good fuzz (and I voided the warranty).  The Normal/Mid-Cut switch is part of why it's a great fuzz.I think I'll replace the Fuzz control with a pot that provides a wider range before going into supersaturation but the rest of the controls I'll leave alone.Dislikes:  quality of Chinese products is a crap shoot.Likes: it's a good, affordable effect", "id": 836}]