[{"review": "Good solid construction. It hooks onto the mic stand and works as advertised, i.e removes the pops from vocal recordings.", "id": 46}, {"review": "I've used these for more than two years but recently shifted to its big brother, the jazz 3 XL. Same thickness and feel /tone, but in a larger form factor. I would definitely recommend the XL version if rhythm+lead work is required. For strictly solo work with easy to achieve pinch harmonics, this one is better.", "id": 68}, {"review": "Grips the neck well and keeps the strings immobile even when strumming real hard. Feels a little awkward trying to put the capo on with one hand, but I guess that's how all of them are. Works very well on acoustic guitars", "id": 116}, {"review": "A snug fit for the POD HD 500. Knocked one star off because the weight distribution is a little awkward when using the strap on my shoulder.", "id": 165}, {"review": "I've been using this brand of strings for years. The super slinkys sound great. The 9 gauge is very easy to bend and on a good guitar will also sustain well. They last a long time if you wipe down after use. Better yet, get the Big Bends string cleaning wipes to increase the life of your strings.", "id": 227}, {"review": "A very good pedal that you miss only when its off. Super transparent and boosts your signal after all the degradation through your cables. To my ears it restores the high end and shimmer and brings back life to the note. Best used after all your pedals right before it goes into your amp.", "id": 372}, {"review": "Getting a proper pedal power unit (like Voodoo labs, DC brick, Ciok) is recommended. Even though this has a lot of outlets, each pedal may not receive enough power. I usually use this to power two or three pedals and most of the time it is ok. Any more than that, and you will have some loss of headroom in the pedals. May not power some pedals that have a high current draw.", "id": 428}, {"review": "I have been tempted to buy this pedal for a long time after looking at all the rave reviews.I already have an MXR line booster at the end of my pedal chain into my amp. This serves to give back the lost treble and shimmer after a long cable run. Replacing that with the EP booster did not have a significant impact on my tone. Yes it was a little colored, but not too different from the line booster.If at present you have no boost after your pedals and have a long cable run, yes definitely this pedal will make a world of difference by adding the top end back to the signal. I didn't find it magical though, because I've always had a boost at the end of chain and this was not much different.I am going to experiment with it in the effects loop to add a boost during solos.", "id": 643}, {"review": "For any usable tones while playing live, the best bet is to plug it into a tube power amp. Direct to mixer or running it through a solid state amp is very uninspiring.I didn't like the recorded tones either, much rather preferred Amplitube 3 if micing a real tube amp wasn't an option.That being said, it is good for practice and song writing. Used this for more than a year and finally sold it! That's the other thing with items like this, they lose value real quick once the next version comes out.", "id": 700}, {"review": "Very useful for acoustic guitars, electric and bass. If you don't have a pedal board with a tuner, this is invaluable to quickly tune up. Small form factor and can be thrown into a guitar case. Good accuracy compared to my Korg pitchblack", "id": 706}, {"review": "I have been through a few delay pedals trying to get the sound I want.1) Boss digital delay: I really didn't like the sound of the delay overall. No real positives to mention2) Carbon copy analog delay : Worked great for cleans. But totally muddied up my lead distortion tone (even though it was in my fx loop). I couldn't get the repeats to duck under the main signal3) Nova Delay : I really wanted to like this. Presets, tap tempo and a nice feature set. But the sound just lacked warmth. It was very digital soundingAt this point I wasn't sure what I wanted. Analog delays were warm sounding but too mushy. Digital delays were clear sounding but.. just too digital and uninspiring!I was debating springing an insane amount of money on the strymon timeline, when I found this pedal. Analog dry signal thru with digital delay !! This is what the magic sauce is in my opinion. Now my signal has the nice separation of the digital delay and my underlying tone is preserved. Set it to the 2290 type delay and its perfect. Sure, it doesn't have the presets and what not but for a good sounding delay, this can't be beat at this price range.Sure enough, when I checked the strymon timeline specs, I found out that it too has the analog dry through with digital delay. Just that its delays may be modeled better and it has a rich feature set. But $450+ for a delay pedal is just too much for me.Buy this if you are chasing tone, you won't be disappointed. Skip if looking for presets, tap tempo etc.", "id": 742}]