[{"review": "As the title says, it works.  The only reason I took off a star is sometimes it gets a little stuck and I have to use some force to get it off the XLR.  But, no issues besides that.", "id": 12}, {"review": "There's a reason every mic cabinet has at least one of these (and if it doesn't, it should).  This is a great all purpose dynamic mic, I use it for instruments, vocals, even field recording sometimes.  The SM58 has a frequency response that is supposed to be more tailored towards vocals, but that doesn't mean that the 57 can't handle a voice.  They're pretty much the same mic as far as I'm concerned, and for the average amateur recording engineer or home studio practitioner I think you'll find the same thing.  And if you're operating at a level where you refuse to use them interchangeably, then you probably already know what you're looking for.  I'll be getting a 58 to add to my personal cabinet soon, but if you're like me and wanted to spend more on a nice condenser before filling out your dynamic mics, you can't go wrong here.", "id": 19}, {"review": "This is a great addition to any stereo system today, assuming you still use your turntable.  Two passes with this brush will clean up any of my records and get them ready for play, free of any annoying pops or clicks.  It won't save a dirty record, you'll have to buy a cleaning solution for that, but this brush will easily take care of dust, hair, and other particles that get attracted to your LPs during regular use.  As another reviewer suggested, I do the first pass with the brush going with the record, as if I was spreading out paint or something like that, and that gets most of the surface particulate free.  The second pass is with the brush going directly against the motion of the record, and this cleans out the dust from inside the grooves of the record.  After that, your record will sound brand new again!There are definitely more comprehensive cleaning and maintenance options, but none that are this easy and this cheap.", "id": 260}, {"review": "This works exactly as intended, and is a perfect size for my MS2000.  Not really sure what the going price is on other stands, but I'm very happy with what I paid for it.  No worries of my synth falling over or anything like that, the only issue I had was with putting it together at first.  The picture in the instructions was kind of hard to figure out, because there are different sized bars that were kind of difficult to interpret.  But it was probably more of my error, and even with that it just meant I had to unscrew them and screw in the right ones.", "id": 272}, {"review": "I purchased the DR-40 for use in field recordings for found sounds and other sampling needs, and it accomplishes that very well.  The battery life is great, the user interface can be a little confusing at first but is very fluid once you get used to it, and the build quality is pretty solid.  My only issue is the internal mics, while crystal clear in terms of quality, can sometimes be lacking on the gain side of things.  In addition, they are VERY susceptible to wind, even if you just move the recorder while it is recording you will hear a rush of air.  I highly suggest picking up a wind screen at the same time and save yourself the trouble of having to make another delivery.", "id": 800}, {"review": "I desperately needed a real audio interface, I was tired of my toy Behringer 1 i/o RCA usb thing.  After reading reviews online, this seemed like exactly what I needed.  It's small, lightweight, and fits nicely on my desk.  It's got some solid pre's, and has enough for me to work with.  I didn't need the extra i/o enough to break the bank, so 2i2 is all I wanted.  I'm really pleased with this, the quality is great and the ease of use is just as great.  It handles line and mic inputs just as well, and the general rule of thumb sticks here that ~70% (about 2-3 o'clock on these knobs) is a good base level for the pre's.  Phantom power works fine, and the direct monitoring switch is really useful.  I don't like dealing with latency in Ableton, so to be able to just monitor directly when I'm playing instead of waiting for it to go through all that processing is great.  And the headphone volume and monitor volume are right next to each other...all in all I'd say the design of this is very user friendly.Some people reported driver issues with this, and I can't say I've really had any problems.  I'm using Windows, and I have to suggest using the ASIO drivers whenever possible.  I had some issues with iTunes where the audio would just stop and the level (in the Windows sound menu) was frozen at whatever had been playing.  All I had to do was disable and re-enable in the device, but that got kind of annoying.  I e-mailed Focusrite about it, and they were pretty prompt with getting back to me, but the problem kind of faded away so I never really figured out what that was.  I started using Fubar2000 because it supports ASIO, and I haven't had ANY issues with any program that uses an ASIO driver.  I have since started using iTunes again as well (still much easier to manage the library in there), and the problem has only manifested itself once or twice since then, so who knows.", "id": 801}]