[{"review": "I think that this pedal is a good value as an overdrive pedal but its speaker simulated 2nd output makes it a great value as a stand alone guitar preamp!I plugged it into my DAW and listened on my KRKs and was impressed by its sound.  The overdrive is quite good.  No, it can't hold a candle to my J. Rockett Pedals Alan Holdsworth Signature Overdrive but at $48.00, it's an absurdly good buy.", "id": 145}, {"review": "I share another reviewer's opinion about this pedal not being comfortable at certain treadle angles.  However, because there is very little output in those lower positions, I don't find it to be an issue.  In fact I rarely feel the need to use the full travel of the treadle when doing volume swells.  I thought it a bit strange that this thing specifies a 12 volt AC adapter yet can be powered by a 9 volt battery.  So... I decided to see if I would have any issues if I used my One-Spot AC adapter on it - polarity corrected, of course.  It worked just fine.  I usually power my looper with the same adapter so I built a splitter cable with labeled, polarity specific terminations and everything worked fine.  My curiosity didn't end there though.  I wanted to know if there would be any discernible difference if I used a 12 volt power supply.  I did it and the only difference I could find was that the power indicator LED was just a wee bit dimmer using the 9 volt adapter.  There was no change in the sonics whatsoever, nor was there a reduction in output volume that I could hear.  So what's up with the 12 volt adapter spec, Behringer?  Did you think you could fool all of us out here?  I give it four stars because even though you don't have to use the pedal's full sweep, it just not very comfortable in those lower positions.  I'll probably get used to it eventually.", "id": 212}, {"review": "The Eminence Patriot Cannabis Rex is probably the smoothest sounding guitar speaker I've ever heard.  Period.This does not mean that it's dull sounding or muffled at least, not if you hearing is still good.  I hesitated quite a bit before I decided to buy it and install it in my Fender Mustang II but my worries were for naught. Incredibly, it tamed the icepick highs without losing the shimmer and clarity of my clean sounds.  Yet, for overdrive sounds, there is very little fuzziness - just a big full and FAT sound that's articulate without being buzzy.  If you play metal you'll probably hate this speaker but if you like bluesy, classic rock and jazzy sounds, this is a speaker to seriously consider.  I turned my Mustang II into an open back combo and the Cannabis Rex gave the amp the low end extension that it needed.  I had to turn the treble control up a bit more but unlike most amps, it never got shrill or piercing, just buttery smooth and clear. It's also much more efficient than the stock speaker at 102db@1W/1M.I don't know how Eminence did it but I love it!", "id": 276}, {"review": "Behringer has had a somewhat spotty reputation among many professional musicians so I was a bit apprehensive about buying this unit but so far, so good.  The mic preamps sound pretty good - clean and relatively quiet. The knobs and slider feel smooth and well made.It also seems to send hotter signal to my JBL EON 510s and that's a good thing.The built-in effects are probably its weakest point.  I've heard some really cheap digital reverbs that are much smoother than this unit.I also wish that the Control Room knob and outputs were independent of the Main Output slider.  That would definitely make it a lot more practical but then again, it would also turn it into a 4 buss mixer.  So all in all, not too shabby for a $110.00 mixer but I probably wouldn't use it for recording.", "id": 369}, {"review": "Well, just got it, plugged in and here are some initial impressions.1. Pretty much what I expected - much more \"relaxed\" at higher volumes than the M1.2. Definitely much bigger and fuller sounding with its commensurate drawbacks.- slightly less naturally sparkly compared to the M1- will have to reduce the mids a bit via the Fuse editor.- although it has less overall sparkle, that also translates to smoother highs. I was actually a bit hard pressed to get it to sound buzzy. This is of course via the front panel only. I'm sure it can be done using the Fuse editor.3. It's supposed to be 7 lbs. heavier than the M1 but it sure doesn't feel like it. I keep looking at the M1 fiendishly wondering if there's a way to shoehorn a 12\" speaker in there.4. For the most part, the patches created in the M1 translated pretty well after the required firmware update, needing just a few adjustments here and there.5. I'm appreciative of the fuller more naturally extended low end as I won't have to crank the bass control as much as I have to on the M1. That of course translates to more headroom for the power amp.More from editing via Fuse - here are a few of the things that I found and liked.- The 65 Deluxe model sounds better with the 57 Deluxe's Cab and vice versa. The 65 has more headroom and works great as a clean spanky amp with the 57's cab while the 57 model's propensity to break up sooner works better with the 65's less sparkly cab. The 57 also seems to have more low end girth.- The Twin is a bit too icepick-y sometimes and it seems to pair better with the Bassman's cab.- The SuperSonic's Cab is a bit more muted at the top end than any of the other cabs and works well for sounds I use that have a bit more gain. It's good for keeping things from getting too buzzy. It's a very fat sounding Cab sim.- Both the M1 and 2 seem to respond really well with my Tex-Mex pickups. I have not played a guitar with regular sized humbuckers on these amps yet (my other guitar has mini humbuckers) but somehow I get the feeling that I won't like it as much as I do with the strat. I think this is understandable though. Since Fender has always been all about the single coils, I'm not surprised that the impedance relationship between these amps and my strat feels so spot on.So far, for 200 bucks... I couldn't ask for more.", "id": 719}, {"review": "This product has an extremely flimsy spring mechanism inside.  Upon receiving mine and assembling it, it broke immediately while I was trying to mount an iPad onto it.  It also has a fairly narrow angle of adjustability.  The metal parts of it seemed sturdy enough but the plastic parts looked and felt brittle.", "id": 831}, {"review": "If you only want to use this thing as a detune effect to add a static, non-oscillating, chorus like effect, it's fine for that.  As an actual pitch shifter though, this thing is awful.  All the pitch shift settings sound like they're 30 cents sharp. This is especially awful sounding when used as an Octave effect.  I suppose I could have opened it up to see if there was an adjustment pot inside but I did not want to void the warranty so I just returned it.  It's hard to believe that nobody at the company could hear how badly out of tune this pedal is.  I've read the same complaint about their Pure Octave pedal also. This is really too bad because all the other pedals for Mooer seem to be quite good.  I own their Reecho Delay pedal and quite like it and I'm also tempted to get their Green Mile pedal.If you're not that sensitive to pitch inaccuracies, this pedal maybe fine for you but I doubt that many will find this pedal to be satisfactory.One minor quibble about the rubber padding used at the bottom of these pedals.  It does not stick to the adhesive on ANY of the Velcro strips I've tried to use.", "id": 850}, {"review": "I had my doubts about the effectiveness of the blend knob but it is very effective indeed!  This compressor gives just the right amount of softness to the attack.  It never sounds &#34;thumpy&#34; or unnatural - but always musical.  I really think that this is what a guitar compressor is supposed to sound like.", "id": 866}, {"review": "I've just received my Mustang I and have spent an hour playing with it and the Fuse software.  This thing is outrageous for a practice amp and I've never heard anything like it in its price class and size!  With a good instrument mic and a decent monitoring system, I think you could probably gig with this thing.  One feature in the Fuse software that no one seems to mention is the ability to add an overdrive or compressor module \"post gain\" (after the preamp). This is an incredibly useful tool for controlling the overdrive characteristics of the amp models.  In effect, Fender has given this amp the ability to emulate power section saturation as the overdrive module sounds very different and much mellower post gain than pre gain (before the preamp like a normal stomp box).I don't know of any other dedicated modelers that do this except maybe the Axe-FX - and that costs about 20 times more.  Power section saturation is highly desirable and is the reason why we're seeing a lot of very low power tube amps like the Fender Champion 600 and Bugera V5 these days. Their problem is that they're pretty much useless for clean sounds at louder volumes - they don't have enough power for that so they're really only good for overdriven sounds.  Not so the Mustang I.  I think Fender has hit the perfect combination of flexibility and and simplicity in one package.  This thing sounds way bigger than it looks and way better than its price would suggest. It has the classic Fender sound and feel of many different Fender amps without the weight, cost and tube replacement needs.  What's not to like?", "id": 718}]