[{"review": "What a great device.  This is the first 'quick-change' capo I've owned.  I used to use those old stretchy things.  Since I play at some jams, it's important that I can change quickly and accurately.  Move it from fret to fret and the guitar stays in tune.", "id": 116}, {"review": "A simple device, yet so useful.  I hate changing strings without one, anymore.  Dunlop provided an inexpensive winder that's durable.", "id": 347}, {"review": "My band had no PA or mics or anything.  While I admit these are not the quality a band will work up to, they fill up the stands at an affordable price.  Not much distance--you have to &#34;eat&#34; the mics--but the sound is great.  Full range, clear (not muddy), and no breaking up of sound.  This is a great place to begin.", "id": 405}, {"review": "The bag is simple canvas.  It probably won't protect a steel ball from a marshmallow attack.  However, the stands are sturdy, fully adjustable, and look professional.", "id": 655}, {"review": "Works like a capo.  Nothing much to add.  My son searched for the odd colors so he could see his capo while on stage in near darkness.", "id": 807}, {"review": "I have four Snarks and one other brand.  The Snarks are dependable and have an easy to read display.  Tuning is quick and simple.", "id": 811}, {"review": "It's a great pick holder, but I'm not fond of the sticky background.  Something 'clip-on' would have been more useful.", "id": 233}, {"review": "When the unit first arrived, I was concerned because the box had been damaged.  It shipped in an envelop.  However, once I opened it, I discovered an undamaged Snark tuner inside.  In an odd way, this reassured me further, as it obviously took a beating and remained undamaged.  When I put in the battery and turned it on, it functioned properly.  It clips to my guitar strong and stays put.  It's easy to read, even when I'm on stage and the lighting is less than appropriate for reading a display this size from arm's length.  I'm very pleased with the unit.", "id": 820}]