[{"review": "I own lots of hosa cables they are cheap and quality is there. I've only recieved one bad cable out of around 50 or so. I use a lot of these guys and if they work when you get them, they havn't failed yet.", "id": 6}, {"review": "I own a mobile DJ company and have 4 ultimate TS-90 stands and i'm really not happy with them.  This product is simple does the job and is well priced.  They are a little heavy at 9 lbs per stand but i like the look and operation of them.  I've been happy with them so far.", "id": 329}, {"review": "My title says it all.  I didn't like the AC adaptor.  I did work very well and was strong.  I liked how solid it was.", "id": 376}, {"review": "These headphones are wonderful to wear.  They sound great.  But that's not enough now a days.  With the head band being connected to the outside of the muff, they fit your head so wide.  The pioneer hdj 2000 has the look.  Read my review on those though.  They are terrible.At first glance these things are serious pro grade, they are made of very durable components. Both ears swivel and they fit snug to the head. The head band isn't bad, it's a plastic material i notice that when i stretch it to see how flexible it is the pad on the top of the head starts to come unglued. Not really a big concern though. They have a long cord, and I'll talk more about it later. It ends with a spin on 1/4 in or a standard 3.5mm.The sound out of these things is pristine. It's not muddy and very clear. They have a good amount of bass.  Because of the over ear style they drown a lot of background noise out and they also don't leak noise like a lot of headphones do.Pros- Heavy duty- Awesome sound- Comfortable headband- Over ear design- Not worried about breaking when i through them in my bag- Always clear, never muddy, even at high volumes- Very clear left and right ear markings- Spin on 1/4 PlugCons- Heavy coil cord- Heavy (weight never got annoying though)- Looks", "id": 458}, {"review": "Can't say much more than the description.  It's a cheap box that works.  Nothing fancy and not for everyone.  If you just need a box that is cheap this is it.", "id": 606}]