[{"review": "I bought this because I wanted a cheap replacement cable for one that had a short. I'm pleasantly surprised with this cable. It's decent sound and decent build quality, for a good price.", "id": 6}, {"review": "I love BOSS pedals. I owned a DS-1 (Distortion) and a MT-2 (Metal Zone) for years, and loved them both. This one, is a good \"meet in the middle\" of those two. It's great if you want some really good bluesy distortion, or you can crank the color and get some thick distortion.As always, this pedal is very well constructed and sturdy. I love it.", "id": 37}, {"review": "I bought these to put on my really old Martin acoustic. The guitar still sounds amazing, and these strings certainly fit my budget, and provide a great sound.", "id": 59}, {"review": "Love Elixir strings! I bought my first pack, over 7 years ago and I've been hooked. They last, at least, twice as long as traditional copper wound strings, and sound even better. GET THESE! These make my cheap $50 acoustic guitar, sound almost as good as my Martin...no kidding.", "id": 109}, {"review": "It's not bad. It would be better if I bought one large enough for my finger. Still, I'd rather stick with a Copper slide.", "id": 281}, {"review": "This is not a top tier condenser mic, but it is well worth the 40 dollar price tag. It has 2 different pattern modes as well as a gain boost switch. The carrying case is also nice.Do not expect this to be MXL or even Behringer B-1 quality, but it's still better than no condenser, and is perfect for doing room acoustics or live mic'ing.", "id": 327}, {"review": "This is a great mixer if you are looking to do simple podcasting or solo music production at home. It's a great little unit. The only set back is that you can not use Condenser mics with this, without an external phantom power supply, as there is NO phantom power on this unit. You need to get the 802 model if you need phantom power, otherwise this will work fine with regular XLR or Hi-Z microphones.", "id": 367}, {"review": "I bought this to upgrade from a Eurorack 802 that I had. I'm quite please with the Xenyx 1202. Lots of inputs, phantom power, and it produces really great sound! I'm very happy with this little mixer.", "id": 370}, {"review": "This is definitely a must have for the home recording enthusiast, especially if you are using any of the XENYX or other Behringer brand mixers (it also works with other mixers as well).This is a great, inexpensive, way to  get your analog audio into your digital recording software. It works on Windows, Mac and Linux (at least it did for me).", "id": 384}, {"review": "I bought this after mistakenly getting the same model in a size 8. This one actually fits, and works great one both my acoustic and electric.", "id": 456}]