[{"review": "Have used it on a couple of ukuleles.  On my old dirty beginner uke that had been sitting in a closet unused for years it really made it look like new again.  I'm satisfied.", "id": 351}, {"review": "In fact it's beautiful and totally functional. The only reason it gets four stars is due to the fact that it doesn't come with a felt washer to protect your instrument and I had to fashion one myself.  I'd buy it again but they should really include a washer.", "id": 478}, {"review": "I have had trouble finding uke sized straps and have often had to use the larger guitar straps. This fits just right and looks just right.  It's well made and not too expensive.  I just wish I had found them before buying all those guitar straps.", "id": 715}, {"review": "But it's a real step up from the effects on my Vox Mini 5 amp so I'm only going to complain too much.  It actually cost more than the behringer amp I'm running it through which seems a little odd to me.", "id": 748}, {"review": "The action was a little high for my taste.  The strings are not good and need to be replaced as soon as possible. Why do they sell an instrument with crap strings? That is a total mystery to me because it really detracts from the initial impression of the instrument.  Otherwise it's well built and works.  Really it's a three and a half star IMO, it's not as nice sounding or as playable as my Mahalo hardbody which was about the same cost and came set up with perfect action and with aquila strings.", "id": 814}, {"review": "However I have found that there are much better prices out there if you just do some basic searching.  Usually I do. My bad.", "id": 830}, {"review": "Very happy with it considering the price point.  I'd buy it again in a heartbeat as long as you don't need a hard case.  Great for the knock around uke though.", "id": 845}, {"review": "I've had an old beginner Ukulele sitting in a closet for years.  I have much nicer ones now and decided that rather than lend them out for playing I'd fix up this beginner uke as a loaner.  I took off the strings and realized how dull and dry looking the fret board had become.  I used this product and it really soaked it up fast.  Now it looks beautiful again.  Very satisfied with how it worked.", "id": 234}, {"review": "I just play at home with friends. It works well so far on all my ukuleles.  However every time you touch your instrument it's going to transmit that sound into your amp so it's nothing I'd be using on stage if I didn't have to.  Still it seems to be a good value but truth be told I haven't had it long so it could crap out on the longevity issue. Time will tell.", "id": 759}]