[{"review": "I have a Fender T Bucket acoustic guitar and I put heavy guage strings on it. As beginner these strings were not good for me. I tried these and they blow away the heavy guage strings. Good quality. Glad I bought these.", "id": 85}, {"review": "When I first installed these tuners my guitar would still go out of tune. Mainly the second to the last string at the bottom and I later learned it was the wrong tuner and the string tree was too blame. Sometimes I just don't pay attention to the obvious;)It turned out that there are 3 short tuners and 3 long ones. The long ones go on the top 3 strings, the short ones the bottom 3 strings, get that because I had them on incorrectly. And even worse, I was using the string tree which is the part that holds down the 2 bottom strings. The string tree(google guitar string tree and you'll see one) was actually making the strings not stay in tune with the locking tuners. I know silly but I was not paying attention.The reason you use the short tuners for the bottom is so the guitar will stay in tune! The string trees get in the way and when you whammy the strings go out of tune. Please take a note of that.Overall a good product.", "id": 387}, {"review": "Guitar bag fit over my Fender T Bucket guitar. Cheap price and does the job. It has just enough padding and heavy duty nylon to protect my acoustic from being scratched. Worth $24.", "id": 442}, {"review": "For those that want to record(I use Adobe Audition) this item is good for recording.I use to use my sound card. This provides a smoother sound and I don't have to worry about hissing when I record.You can just plug in your guitar or bass.Here is a letter I wrote to Tascam:On humble advice I would forward this email to all of your subsidiaries any retail store that sells Tascam USB audio devices! Anywhere in the world.Just today I got the new Tascam US-100 USB audio interface. It of course uses the Windows audio drivers. A nightmare occured. When I plugged in the device Windows XP had the usual \"detect USB device\" come up. But to my horror it wound up saying \"A hardware problem occured your hardware may not operate properly\" something of that sort.I spent over 4 hours trying to figure this whole thing out and I read the manual it came with. Tried all sorts of things oh brother! It still would not install. By the way this happened with a previous USB audio device, not made by Tascam, that did the excact same thing on my computer.But to my luck I found out what the problem was! Thank God for the website that had this on a blog!:In the c:\\windows\\inf folder there must exist two files:wdma_usb.infwdma_usb.PNFIt is really the .inf file that is important. Some software  seems to knock these out by renaming them to:wdma_usbinf.bakwdma_usbpnf.bakI simply found the files, opened them and renamed them to the proper names. And lo and behold when I restarted my computer the Tascan US 100 worked!Its easy to rename the files you just open wdma_usbinf.bakwdma_usbpnf.bak and  then save them as wdma_usb.infwdma_usb.PNF.Its that simple!!Anyone who works customer service for Tascam should know this. Like I said it happend with a previous USB audio device that I had and I woulnd up selling it at eBay cause I was so frustrated.I'm happy with the Tascam US 100.I hope this helps if your audio does not work on your computer. And it did the same with a USB phone.", "id": 639}, {"review": "Despite the sensitivity of a compressor microphone I still use this to record heavy metal guitar. Only thing is I use a small amplifier, only a fifteen watt Line 6 spider 3. I can keep the volume down so the neighbors do not hear my guitar. Anyways, the only thing is when I use recording software I have to not record the guitar too loud. And oh my it records good! Now I no longer have to record straight into my computer where I get all loud over compressed guitar sound. I can record with drum loops and with the microphone it goes into the computer and I no longer get the loud over-compressed guitar sound that I never like very much. Glad I purchased this. For those who would try this for guitar, remember this is a sensitive compressor mic and you will get a very loud recording you will not like. So you just record as quietly as you can. This mic is sensitive! But oh boy I like it! Man I can play for hours and the guitar goes way better with the drum loops. And as I said before the amp is not gonna be loud enough to bother the neighbors. A good buy well worth the price.", "id": 644}, {"review": "I initially thought that these would be very wimpy sounding. I was wrong. They have a great tone with my metal distortion pedal. I have a Schecter Hellraiser with EMG X Series pickups and they go great with them. They are easier to bend too which is great. I no longer use heavier strings like I use too. These will be my mainstay.", "id": 396}, {"review": "I paid only $29 and it is small and convenient. I was impressed with the sound.At first I played it with my Line 6 15 watt amp. I didn't like it cause of the squealing. But then I read how you use it and all that. Boy! It worked great.I use it with a Tascam US 100 USB plugin to my computer and I get a good sound for practice.I still like my Line 6 amp though for more sounds and sustain. But this is a bargain and small.You can use this with any USB audio interface.If you like AC/DC you would like this. There are different amp sounds you can get.Cheap and convenient I'am not disappointed.My opinion is that it sounds best with a USB guitar audio device such as Tascams US 100.", "id": 471}]