[{"review": "to much string for my beginner fingers but seemed to be the real brand and a decent price.i would reorder in 9's or maybe even 10's next time", "id": 98}, {"review": "I've been learning for a little over a year and have had this capo for about that long . Though my playing still isn't very strong , the capo still is. I don't use it hardly at all but when I do I usually end up playing around with it quite a bit. My point being it gets tested more than the amount of times I use it. It's simply engineered of fairly heavy duty design so I don't expect any issue at anytime soon.", "id": 116}, {"review": "Ok reviewing something's I just don't see the need. Ok that being said , I searched for lowest costing 9v adaptor that met or exceeded the am required to run my pedals...this came up first and is IMO all that one would need to run a pedal or other guitar add ons. I dont know what else to say..... The cord isn't very long but not overly short either, I have another brand adapter and it is about the same length and size etc. ok for now that's all I got, I may edit later on down the line.", "id": 521}, {"review": "These were the strings I started on a year ago ,and have tried a few different brands in this time frame. They hold up IMO as well or better than most brands I've tried ,especially for the price. I probably change my strings more than necessary so I have gravitated to finding the lowest price strings of at least decent quality. These fit that requirement well.", "id": 679}, {"review": "I'm a raw and green beginner who is about the slowest learner ever.am 43 almost 44 and have been learning since 42 almost 43. That being said using the looper was an eye opener. I bought it as a learning aide , to loop a progression and then try and run some pentatonics over the progression. The thing that opened my eyes is listening to the looped progression I played. There's no denying your mistakes when you hear them while not playing. Let's just say I'm not as close to being a player as I thought and I would &#34;not&#34; figured this out for quite some time if not for the looper. So it is an amazing critic for us beginners . And if your like me ( and you experienced guitarist ) you saw all the demos online and know what you as an experienced player can use it for. It's an incredibly easy to use piece of equipment , after playing around with it for about 5or 10 mins you'll have the gist of it. From what I understand it's very basic compared to other loopers , i dont know anything about that but if your looking for just a simple to use looper this will definitely be to your satisfaction.", "id": 869}, {"review": "got a cleaner/polish/wax type ointment for every part of your guitar. comes with a small rag, and fret polishing pad deal....the fret pad is great and I didn't know about this type of thing till getting this kit. also comes with a step by step/stage by stage instruction pamphlet. worth it to get this kit and replace /add to it as needed.", "id": 95}]