[{"review": "Very nice, smooth, no sharp edges, not much bigger than the picks it's holding (it holds about 10 of my favorite thin Mel Bay picks) ... the only issue is, the spring clip that pushes the picks to the top, is a little too strong, and was warping my thin picks, but I just put one very stiff pick at the bottom of the pile, and it's fine.", "id": 167}, {"review": "It works great for five of my lower power pedal type items, including my Line 6 wireless receivers, Shure wireless receivers, and several other pedals like my Cry Baby, etc., all at once.  However, the transmitter for my Shure wireless in-ear monitor, which requires less power than any of the other two items combined, will not run, even by itself, when powered by the 1 Spot.  Switching power supplies like this can have a mind of their own, and there is probably some little quirk in the Shure transmitter circuit that this power supply doesn't get along with.  For most of my stuff it works great, and eliminates a bunch of extra power supplies and cords.", "id": 191}, {"review": "This pop filter is built like a tank compared to those cheap cloth and plastic versions that you get at the discount music stores, so it's a bit more expensive, but the quality and functionality is like night and day.  I use it in front of my Shure Beta 58A, and it's absolutely perfect.", "id": 200}, {"review": "I do live shows online, and my older Behringer mixer does not have the built in USB port, so these digitizers do a great job for me.  I constantly get comments about how clean and clear my sound is, and while I largely attribute that to the mixer, this digitizer is just as important a link in the chain.  Very simple to use, audio out of the mixer goes into this digitizer, plug the USB cable into my computer, my streaming software sees it, and people hear me.  I am definitely a Behringer fan.", "id": 384}, {"review": "I just used this for a gig on Monday ... it's solid, well built, nothing loose or floppy, it stands up straight (extending to almost 7 feet tall), it folds up easily, and is nice and compact when folded ... good enough for me.One further note, when I ordered this, I was thinking that I would be able to just unscrew the vertical section from my round heavy base (which is also an \"On Stage\") and screw it into this tripod ... that's not the case, as the vertical piece here is integral to the tripod base.  I'm not unhappy though, this stand works quite well.", "id": 501}, {"review": "I've had this thing for several weeks, and just now, when it fell off the table for the 100th time, I tossed it in the trash.  The whole thing is one piece of soft floppy rubber, it's not stiff enough for the part that cradles the guitar neck, and it's not heavy enough to stay put.  Even the force from the guitar neck makes it topple over.  Unless you glue this thing to the table, or something like that, it's useless, even worse than useless, it's in the way.Addendum:  I raised the rating a bit, after hearing from the distributor/manufacturer ... at least these guys listen.", "id": 746}, {"review": "I wanted to use this thing for a while, before I reviewed it (I now own five of them).  When I compare it head to head (so to speak) with other tuners, even the ones built into my Ovation guitars, I find that this one has a little higher resolution.  That is, when the others say I'm good, this one says \"no, you need to go one tick more\".  That's not saying that it's inaccurate, it's saying that this one seems to dial you in just a little bit tighter than the others, but it still does it very quickly.  Since I never take it off of the guitar, I went ahead and trimmed off the little tabs on the front of the clamping mechanism, making it even more unobtrusive.  You can barely tell it's there from the front.", "id": 785}, {"review": "I recently sent two of my Ovations back to the factory in Connecticut for re-work (I just plain wore them out), and they came back to me with these strings on them.  As soon as I took them out of their case and strummed them, I immediately called the factory and said \"thanks for the fantastic job on these guitars, and by the way, these are the best sounding strings I've ever played, what exactly are they?\"  I might experiment with the EXP15s, but by and large, these EXPs are my new strings.", "id": 130}, {"review": "I'm quite happy with any of the \"On Stage\" brand stuff I have.  Like I said, this thing is solid, well built, good quality, and they thought of all the little features you need ... jamb nut at the top, little nylon tip on the thumb wheel so you don't scratch up your post ... just good stuff.", "id": 143}, {"review": "Good quality, wired correctly, can't complain.  If you use the \"One Spot\" power adaptor, you need to have a couple of these laying around.  It's probably not practical, but I wish they made more sizes.  In one configuration, I only need two plugs, in another configuration I need three, and yet another configuration I need five, so I actually bought a few of the fives, and cut them off to the length I need.", "id": 192}]