[{"review": "I got this guitar at Guitar Center, i was scared to get this guitar from amazon because of a review saying it looked like a toy, so i wanted to see it in person, i saw it, i tested it out at guitar center and it was amazing, its better than my other les paul special ii, this guitar plays great, its set up very nicely, the pickups are very nice, the electronics work perfectly, i have no problems with it, but the guitar is very beautiful, i would highly recommend getting it, i just dont know if anyone elses will be the same, not all guitars are made the same right?", "id": 31}, {"review": "i like these kind of picks because they have some grip to them, normal picks i use slip out of my fingers some times but these dont.if you hate droping your pick while playing,get these.", "id": 62}, {"review": "I recived this guitar today(2/8/13)and its perfect. After I tuned it it sounded great,it plays well,and it does not hurt my fingers like my old guitar. This guitar is amazing!", "id": 148}, {"review": "it didnt hold as many i as thought(it only holds 8)but that didnt matter,now i finaly have some where to put my picks so i dont lose them.the pick holder also has a sticky thing at the bottom so you can stick it to your guitar or somthing.", "id": 167}, {"review": "I love the strings so far, just put them on my Jasmine by Takamine guitar today (2-20-14) and they sound amazing, very bright tone, I will be using D'Addario strings from now on, very pleased with them.", "id": 198}, {"review": "most guitar shapes and sizes fit on this guitar stand,it is easy to assemble and theres really not much to it but the fact that its a guitar stand,nothing special about it.", "id": 258}, {"review": "It sorta cleans strings but not fully, i dont even really use it anymore, i feel like i wasted my money on this item", "id": 543}, {"review": "this tuner is awsome,it tunes very acurately and i would recommend it to any guitarist or who ever needs a tunner.", "id": 706}, {"review": "This tuner tunes my guitars very well, it tunes them perfectly, and works well tuning bass guitar, very easy to use, very visible screen when tuning, clamps on nicely, and the red color is very beautiful you could say, all in all very good tuner.", "id": 707}]