[{"review": "Long story short, this string set has a strong metallic character, which distorts the natural sound of your guitar so much. Many people might like it, but for me, absolutely Noooooooo!I have a seagull guitar, so by its nature it sounds mellow, warm and mild with stock strings. So when my strings wear out, I got this. Now I feel like playing an EMG bridge on my fender/archtop's neck position, WITHOUT the power that an EMG pickup has to offer. Yes, it is that bad, you can't do this to guitars like Seagulls...Bottom line, I recommend this string set for people looking to boost distortion on their guitar. If you have guitars like seagulls or so, definitely avoid this string.", "id": 60}, {"review": "Works perfectly for me, it does got a nice made.Plus nothing could beat its price, so, get it!", "id": 208}, {"review": "Based on other reviews, I made my purchase. This is a great unit, it sounds good and loud enough.Two downsides, both are about the noise.1. I live on the 4th floor. As long as I turn the volume up, it acts like a radio.. I mean very loud radio background and I couldn't get ride of it. This is the only thing that annoys me, but I think it depends on where people live.2. When this is not properly tuned, it sounds strange and makes a lot of noise. (Other than the radio part.)None of these are major issues, as a mini amp you can't really expect that much, not to mention it's not expensive at all. Overall I like it and I would recommend it.By the way, this unit comes with a 9V battery.", "id": 303}, {"review": "No strings I've tried are like this, it doesn't have a strong character but work together with your guitar. My seagull now sound mellow with brightness! Also this string is perfect for finger picking, I love it!", "id": 409}, {"review": "The best deal for recording beginners. This mic can handle anything from vocal, guitar, drum, to all the other instruments.It's definitely flat and natural sounding, which I like. Just be aware it comes with a plastic shock mount, not a metal one like the AT2020 comes with. However, it's usable.", "id": 642}, {"review": "It was my fault not to check out it's measurements before purchase. But it's not the reason why I drop by one star. The reason is it's not designed properly.Since people stand and sing, this extendable table mic stand is still too short for people taller than 6 feet. I'm 5'11'' I can barely reach the microphone when I stand still.Also, it's way to tall if you want to sit and use it as a PC mic.As a result, I feel I'm  either too tall or too short...Build quality is fine and its price can not get beaten. Overall a four stars product IMO.", "id": 708}, {"review": "Had it for about two weeks and I'm about to return it now.Things that I like(d):1. It's a classic Fender and I was looking for something of good quality with great price.2. Sounds clear and crystal good, unplugged.3. This can be subjective but I think this BulletStrat is more comfortable than a Les Paul simply because it's wider and thinner.4. All the previous four ratings here on Amazon and even higher ratings on Musician's friend.Things I don't like much:1. 15th fret of lower E string is dead, and like always I take quality control into my rating account.(I don't want to bother go to a local shop for a fix, never mention that's $20 in addition)2. I couldn't figure out why the tune nob never changed the sound (like not a bit)? (I'm new to electric but my Les Paul does change tunes... in a much much more obvious way)3. Talking about plugged sound, it's no where close to unplugged. Notes are pretty mixed up and not separated/clear, very loud though.4. I don't know if it's universal, I ordered new and get it with dirty plastic cover with scratches. What's worse is, they place this nasty cover in between of the panel and the components upon it which makes it impossible to remove... (I', not even sure if I can call it a protective cover because it's pretty weak and thin.)This is overall an OK guitar, consider its price it can be made at least slightly better. For beginners on budget with less than $200, I would recommend go for the better ones with a little more price. For example, me, I got a SX Deimos ($175) Les Paul which I'm in love with now. Simply everything about it is better, and I finally get the feelings of an electric. I'm glad I don't need to stuck with this anymore.According to Amazon,3 Stars - It's OK4 Stars - I like it5 Stars - I love it3 Stars Checked, it really IS just an OKAY guitar to me.Thanks for reading, and hope people find their beloved guitars!", "id": 555}, {"review": "1. If you are totally a beginner and have nothing to begin with, get this guitar and a Vox amplug AC30. Use it with your headphones or home speakers.2. Don't upgrade until your skills improved and you become a mid level. Prepare $1000 for a tube amp and a good guitar with brand name pickups for upgrade. If your budget is below that, don't bother and save more.Speak from experience, I've tried a lot and did many research. This guitar with amplug just sound amazing! Plus, it can be your forever play around set which you will be happy with and bring them out. Guitars and amps below $400, yes there are good stuff, but you're more likely to get problematic things that will be replace by better things latter. For a budget around $1000, if you don't go professional, you will be happy with them forever. So do yourself a favor, one shot, no waste of time and money.This guitar is good enough for any beginners. Most under $400 guitars don't have good pickups, so why spend extra money? (Again, my bloody experience taught me that.I've spent time and money, way more than $1000) Free advice.I strongly recommend this guitar, it has no fault towards its price.", "id": 754}]