[{"review": "On Stage makes some very nice products.  This music stand has all the adjustments as one of our favorite older units.  Well made and the price doesn't put it out of range for the everyday musician.  Really am liking On Stage products, also bought 2 of their boom mic stands and they are excellent.", "id": 155}, {"review": "I even called Dunlop to see if these lok strap systems would work for an electric acoustic.  The guy at Dunlop told me \"oh yes, they have been specifically designed to work with electric acoustic\".  That is NOT the case.  I purchased multiple units, and it will cost me more to return to Amazon than it's worth.  But basically I know have hunks of plastic that I could use to make a sculpture!Because of the bottom pin being the plug in for electric pick up, the thickness causes a problem and this plastic do hickey will not fit.If anyone out there has a solution for securing the strap, please reply to this feedback.What really frosts me is that I called Dunlop and apparently their customer service folks don't know their products well enough to be recommending product.  It's called, TRAIN your people!!!", "id": 261}, {"review": "Bought these as the studio I was using had a very rough, taped together set of headphones and they told me most people bring there own.  Did a quick search for good quality studio quality headphones and settled on these for my choice.  I am not disappointed.  Excellent sound quality and I would pin them against Bose any day.", "id": 458}, {"review": "I got what I ordered.  However, if I had paid more attention, this is nothing but a standard power supply which I could have gotten much cheaper from a radio shack or like type store without the Tascam name on it.UPDATE 5-03-2012 after receiving comments and reading other reviews:I've gotten a comment and have read many comments and I don't know where the fault lies, but this power supply is NOT the power supply for the new replacement Tascam DR-07MKII.  The power supply for that unit is the PS-P515UIf you are unsure what power supply for which model Tascam recorder you have, go to Tascam's website and research it before buying it.The Tascam PSP520 AC Adapter/Power Supply For Mpgt1 is for and DOES work with the older Tascam DR-07 recorder.  I have been using this recording as a stand alone unit and taking a line out on a powered PA head using the this power supply and it works just fine and the quality of the recorder is excellent.", "id": 461}, {"review": "Only complaint is that the cameo is not as well done as shown in the picture.  Other than that the strap is of good quality.", "id": 479}, {"review": "Very pleased with this item.  It really gives the guitar a richer mid sound and definitely picks up more of the bottom.  Definitely projects more of the sound from the sound hole.", "id": 704}]