[{"review": "the string work well but did not give the mellow sound on my guitar that I was looking for. The shipping was quick and the strings were recieved in good order.", "id": 28}, {"review": "The string winder with a string cutter and pin puller is an excellent design. It will be very useful when installing new guitar strings with all of the items needed for the job.My only issue is the shipping charges for such a small item. The shipping cost were almost as high as the cost of the item itself making the purchase of this item an unfavorable purchase price for a single item. If you need an additional item on an order from this seller you need to check the shipping cost or you will not be getting the good price advertised for the item and may consider purchasing it elsewhere.", "id": 94}, {"review": "The pick holder work as described. I have not used the adhesive to attach the pick holder to my guitar yet but it stays attached to the head piece by sliding it between strings from the tuning pegs on the head piece. It is only sized for a standard size guitar pick so if you use small picks or large picks it will not hold your pick. It works well for standard guitar picks and will hold 5 or 6 picks if you like different thickness picks you can have a variety of picks that will store on the guitar or other pick instrument.", "id": 167}, {"review": "Received promptly and tested out with acoustic/electric guitar. The sound is much better than expected and the volume is loud enough for small room performances. The treble needs a little boost but with the three channel adjustments it can be made to sound fine. The small amp is just what I was looking for and the second channel for a mike is a big bonus, I haven't tried it yet since I can only play one instrument at a time but with an adapter for a 1/4 inch RCA plug it could also be used to amplify two instruments at the same time.", "id": 398}, {"review": "The sampler pack was a good variety of pick thicknesse and are useful in finding out what type of picks are most useful in playing various guitar styles.", "id": 773}]