[{"review": "Running 3 to 5 pedals on my board, this was a logical choice of power. The single transformer running into the board with the multi-plug was easy to set up and the small profile of the plugs, combined with the thin cables makes for a neat and uncluttered board. There is no lin drop of power and the devices are able to draw the current needed to work at their peak. Further, with the transformer being well away from the board, there is zero AC hum. What's not to like here?", "id": 192}, {"review": "There a hundreds of distortion pedals on the market today. Sure, some are said to be the best at this or that, but for me the RAT is the one that does it all. And at a great price to boot. This pedal is not new to me. I've had a few of them in the past, but the RAT 2 is just a great as the older \"vintage\" models. Goes from a nice bit of drive that is far better than a Tube Screamer, to a near fuzztone, with some warm, smooth creamy tones in between. Remarkable. No other distortion pedal can do it as well. I've been playing for 5 decades and have had more than my share of them. But the RAT delivers. No joke. It just does it all, and well.The Filter (tone) is set up where the tone gets deeper by going clockwise rather than counter clockwise. That might thow a few folks off, but it's a little thing really. The Filter is the core of it's tone and the Distortion control is very linear in how it increases the distortion. By going higher with the Distortion control, the volume only goes up a little. That's great as making changes while playing is less of a hastle if you just lean over and bump it up a bit, the volume won't go through the roof.100% silent switching. No hum. No buzz. And no loss or increase of your overall level when you engage the unit. Flawless comes to mind here. Easy to set up. Strong as a Tiger tank. And just flat out gives you what you want without all the fuss of 6 or 8 knobs for you to mess with. And the three that are there all glow in the dark like all the RATs of the past. Kinda cool if you ask me.If one wants a good distortion pedal that will perform without issues, get yourself a RAT. If you want to impress your friends with how much money you dumped on a \"boo-teek\" pedal that sits in the RAT's shadow, buy that high dollar unit and you can at least \"Look Good\" while you play. But your tone will still stink. Its up to you. Me? Its a no brainer. I go with the RAT....", "id": 232}, {"review": "I have 6 amps. One of which is a good tube amp, but with digital reverb. It fails to sound right. So. I researched reverb pedals and found the Biyang RV-10 Tri Reverb to be the best in design, tone, and value on the market. I was not wrong. Have had this unit for well over a month now and it still is amazing in how it produces just what was lacking with that one amp's pitiful excuse for reverb.This device, with it's three different reverb settings, is just right for any style music you play. The spring setting is really quite real in how it trails off and that doesn't happen in a digital device. Analog has that warmth that the digital fails to produce. The hall setting is wonderful. Rich, but not too over powering. The A/B switch is kinda a nice touch. Much like a bright switch or a presence enhancer. And the fact that it is stereo both in and out is just icing on the cake.Since it resides on my board, I have grown to use it even with amps I have that are built with good reverb. I'm so acustom to the great sound of the Biyang that I just use it for nearly every amp I own. It's that good.", "id": 699}, {"review": "Not every tune needs tremolo I grant you, but when you need one, this will do the job and them some. Simple controls. The LED pulses with the beat of the unit giving you a visual of the unit's settings at all times. 100% silent switching. In a FX loop, there's not a trace of hiss, hum, or noise in any form. In a chain running into an amp's input, there is a slight volume increase. Not much, but a little. No big deal really, unless you're a real tone freak. There is no change in tone or any form of loss when in use. Being a true bypass, it changes nothing when off either. The box is ultra solid. The jacks are all metal. The switch is stout. In short, this is a solid performing pedal that gives a nice clean, warm, tremolo that cannot be beat at three times the cost of this unit. It it anchored to my board! It is not going to come off because it's that good. Besides, how can you turn down a deal like this and get a pedal that has a crouching pitbull on it???", "id": 758}, {"review": "Small. Light weight. Stunning Fender Blackface looks. Warm tube power amp that is both smooth and responsive. The digital voicing is direct and easy to set up. The fact that Fender has discontinued this model was a shock to me. It is one fine small amp that begs to be used in the recording studio. The direct out provideds a simple and easy way to hook up to the board for signal to recorder/mixer and still give you the amp's skeaker as a monitor for yourself. What could be easier? And it mikes well too, by the way. The choice is yours there.With no LED display (cost increase if one was there) and the plain use of volume and tone mixed with the drive, it's so simple to dial in a great tone that it just makes playing fun, and practicle too. The voiceing models from the amp selection are quite good and true to the amp that it replecates. The Tweed, Blackface, and Marshall voicing are all well done and lend to the overall tone of this fine little amp.Love the reverb in the FX section. The spring reverb is so well done that I bumped the amp once and was looking for the \"spring chrash\" known from amps with the real spring reverb. It's that good. Once again, the controls are easy and direct. Never an issue to simply select a model and then dial it in with little effort. Who cares if it doen't have a floorboard with dozens of switches and such for channel selection? You want that, go waste your money on a Line 6 or something. This Champ is made for one thing. To give you the best possible tone and selection for the least amount of money and effort. I believe it has accomplished that well.Again, a shame that Fender has dropped this model from the line up of products. The super model is a step up in power and speaker size, but also the cost is higher as well. I'm just glad that I got one of these from Amazon. com when I did and will not part with the amp. Been playing for five decades now and I know when I have a good instrument or gear and when I don't. This model is a keeper to be sure. And I don't even like digital! How's that for an endorsement? It's that good for what it does....", "id": 553}, {"review": "Been playing for five decades now. Used to tune with a tuning fork. Then later, used a Boss TU-12 for years. Now the Snark comes along and the Boss tuner (reliable and true) sits in the bag with other accessories I use, but it has no need to come out. The Snake took it's place.No need to unplug from the amp, and then plug the tuner in. Fast and easy. The readout is easy to see in any light. Working off the vibration of the string via the guitar makes this an accurate tuner, as some pickups will have too great a signal for a standard tuner and give a false reading. Not with the Snark. Small. Handy. The list goes on, but I think you get the point. It works well. Very long battery life. Easy to see. Oh, and did I mention ACCURATE??? Yeah, I think I did.", "id": 706}, {"review": "The Joyo Ultimate Overdrive is simply a great pedal. Tone adjustment is precise. The bright switch is an added bonus. Having that in place lends to greater tones and harmonics from this pedal. Construction is first rate and there is absolutly no hum, hiss, loss of signal, nor any excessive coloring of your signal. In short you get 100% drive that has a very broad range to work from. Through a tube amp it just extends the sound to levels that were not possible using the amp's gain alone. Impressive! I can clearly see why so many have stated that this pedal is so good. It just is. I'm not one to argue over perfection, and neither should anyone else that plays guitar and cares about their tone and gear. This one is a winner, hands down!And I'm not a new player either, been at it for nearly 5 decades now. I know tone, and have had great, and not so great gear. This one is a keeper! It handles everything from easy overdrive to nearly all out metal (not a metal pedal though) but it gets that drive from those huge amps of the 70's right on the money. Versatile. Smooth. Easy to dial in. What's not to like here? Forget your \"boutique\" pedals and save tons of money and get a great pedal.", "id": 795}]