[{"review": "It is not a bad mic for the price ( If you want a real good one with studio quality mic it would cost over 600 bucks) but it is no comparison to a studio mic since I have worked in a recording studio. Now, you need to decide what you want, getting a studio mic alone does not give you the result you are looking for; it is like having HD TV and BD player but playing an ordinary CD. You would have to compliment the mic with many other products like a studio quality mixer, speakers and so on. If you are a home or hobby user, then go for this mic. This mic is quite good for its price. I would probably say, it exceeds your expectations.Arrived as promised in a frustration free packing. Also, make sure you buy a foam mic hood for the mic to save it from unwanted dirt and spit.The only reason I did not give 5 stars is , mine had a little dent on the body ( may be due to transportation) but it has nothing to do with the function but just the looks.", "id": 20}, {"review": "Received it in time, standard blister packaging but the cable stopped working after 45 days. Since I was out of 30 days return time, sent an email to the manufacturer but no response till today.", "id": 21}, {"review": "The mixer is good for the price but I had to return my first one soon after opening it due to some loose parts moving around inside. The packing way below average. As a matter of fact, it was the only outer box without any cushioning. After seeing those UPS and FEDEX delivery videos I would not pack a UPS or FEDEX shipping item in such a poor packing. However, the great seller ( I am referring to AMAZON) immediately responded and sent me a replacement along with a prepaid label to return the fist unit. Second unit too had the similar packing but no damages. Worked fine.", "id": 369}, {"review": "This is my 3rd set of cables I ordered from Amazon. I needed a lengthy cable for my requirement so ordered this one. The finish  is not bad on the outer PVC layer and coated zinc alloy body. Works fine with my mixer. My previous set of cables ( totally 4 cables) , each one of them develop some kind of problem after few months exactly on the same spot. I guess the inner strings somehow gets broken and stops working. I would see how this goes and update the review. If this one also would result in same condition, I would look for something better. The only reason I ordered the same ones again and again was because of the pricing. They are not expensive to replace.", "id": 692}, {"review": "Came in time, worth the price and fits perfect on to my mic. As an advice to every one using a mic whether it is a regular or condenser mic, always use this protection on the mic to avoid the body fluids getting inside grill and on to diaphragm. This is worth the investment for your expensive mic.", "id": 178}, {"review": "Do not expect a studio quality out put from this unit. That said, for the price it is an excellent product. Obviously, if you are looking for a studio quality mic you would not be here. This product does what it supposed to do and exceeds your expectations. For a normal use this is quite good. Feels little tiny but excellent gain. I would buy it again if required.", "id": 328}]