[{"review": "Put away your effects pedals, modellers, and software for awhile and get back to the earth - or at least the simple appreciation of what an electric guitar sound can be, straight off the axe with nothing but pickups, volume, and tone pots to shape it.For me the classic Pignose-and-a-Strat sound is the opening of \"I Looked Away\" from Layla, but I'm sure everyone's got their favorites.Loud enough to \"feel the air\" and coax a variety of natural-sounding distorted tones. Stick an SM-57 in front of it and fool a lot of people into thinking it's a tube amp. By working your guitar knobs you can get a clean sound, along with that \"barely breaking up\" holy grail of tone for many blues and rock players.By learning how much you can do with relatively little, you'll gain a new appreciation of the strengths and weaknesses of all the tone-shaping tools that have come along since.It might surprise those who take today's hyper-saturated, over-processed metal distortion for granted as the official, community-sanctioned guitar tone to discover the challenges and pleasure of touch and response with subtle dynamics and without infinite sustain.One bit of weirdness: When I began playing my Pignose I immediately noticed a buzz, as though something small was rattling around between the speaker cone and front grill. The four mounting nuts were easy to loosen and, sure enough, an extra washer had gotten caught in there during assembly. Fortunately it slid right out and there was no damage.Get the power adapter and save the batteries for when you absolutely have no choice.The first amp I ever had was a small Ampeg tube from the early 60's with a single 6 inch speaker, volume and tone knobs. I've no idea how many watts it put out - not enough for my parents to complain from their bedroom next door. With that baby cranked, I spent many happy hours in tone heaven. All these years (and amps) later I guess I've always been searching for that sound and the Pignose comes closer than any tube distortion, blues overdrive pedal or rat-ty box I've tried.For the money, you can't beat it.", "id": 76}, {"review": "I tried the EXPs on my Gibson L4 archtop because I play jazz single lines, small chord comping, and full chords more than I do on a Martin OM-1 and figured I'd get a better overall feel for tone and response.For years I've played Martin Phosphor Bronze mediums on both guitars and that's my reference: The D'Addario EXP lights show their difference mostly on the bass end where they're a good 7 mm thinner. The high E and B are 3 mm less and I can feel it but not enough to bother me. All things being equal I prefer heavier strings for tone but I play instruments I don't trust with truly heavy gauges.The first thing I noticed is considerably less \"new string clang\" compared to both the Martins and D'Addario's regular phosphur bronze strings which I've used in the past and still use for mandolin.While still a long way from sounding broken-in, the EXP strings sound as though they've had several days of good use. As a kid I perspired much more and would just rot strings like you wouldn't believe - on a humid summer day I could get rid of that clang in a hour.The tension on the EXP's feels very comfortable and considerably more flexible than the 7 mm difference should account for. I like to bend strings on acoustic in certain contexts, which can be tough with tight strings; the EXP's feel very easy - not electric guitar easy mind you, but fine for acoustic.The other quality that's noticeable is sustain. The strings I took off weren't completely dead and I wasn't expecting a dramatic difference, but it's noticable across the board, especially on small chord comping on three or four strings at a time.The tone also feels a bit more balanced across all six strings, but this is admittedly very subjective: I play with differently shaped and thicknessed picks for different recording contexts; some generate more percussive pick noise than others; sometimes I want it, other times no. The response of the EXPs sounds very consistent to my ears.I've had them on for a couple of weeks now, playing fairly regularly. Some of the initial clang is gone but the (desired) bright lively tone has not degraded noticeably.I suppose the real test of the EXP coating is how they sound beyond the point where other strings begin to sound dead. Maybe I'll update this review down the line, but for me, it's a false question because if the strings don't sound and feel good in the short term, who cares if they last forever!", "id": 130}, {"review": "The gauges are identical to Ernie Ball Regulars (yellow label) but the D'Addario's string tension feels stiffer, which is nice for slide playing. I like my action medium-low, comfortable for straight playing and bending, solid intonation for chords, yet not too much fret rattle for slide.I usually stretch the heck out of Ernie Ball's after putting them on because they have so much spring in them. I deliberately left the D'Addarios unstretched overnight and found they settled in nicely without much stretching at all. Their new sound is quite bright as advertised, but has far less of what I call `new string jangle', which is fine by me. As a kid, I'd sweat that off in an hour but these days, playing a number of instruments, it can last awhile.There's a string tension chart, handy for designing a custom set and each pack has a serial number.  I'll admit I'd never considered the possibility guitar strings were worthwhile targets for counterfeiting, but apparently that's the case and D'Addario provides a web site lookup to verify your set. If you do come across fakes, if you're willing to report it, they'll provide you with a genuine replacement for free.I've used D'Addario phosphor-bronze acoustic strings on guitars and mandolins for over 25 years and swear by their quality and consistency. I've used Ernie Ball's on electrics for even longer. Habits can be tough to break but, as my playing has broadened out from my rock roots, I find it interesting to experiment with different gauges and windings. Finally nailing a sound and feel you've been chasing after for years makes it all worth it.", "id": 156}, {"review": "Other reviews give an adequate overview of the kit and its potential so I'll just mention particular details: The kick pedal spring tension was set too tight, making the pedal hard to control and very frustrating to a beginner. Fortunately the thumbscrew and nut adjustment is easy and made a tremendous improvement in feel and control.The documentation is poor and, inexcusably, there's nothing better available online from Alesis: The steps in the graphical setup page are less than ideal for a single person assembly. The kit allows for tremendous flexibility in positioning the pads horizontally and vertically, yet you're pretty much left on your own to discover this. Experienced drummers will know what they want but I would have appreciated a suggested basic setup showing common variations.The control module's buttons and operation are described but there's no detailed guide to the preset kits or selectable pad patches. You'll just have to hear them and jot down your own notes.There seems to be an ongoing controversy over a firmware update to the controller module - whether it fixes an issue with the snare drum pad responsiveness when struck simultaneously with the hi hat, or is in fact the cause of an issue with the pad. I've noticed no such problem and, as of this date, Alesis has no such update on their site, which leads me to suspect their former patch may have been bad and/or they've updated units currently being sold.Speaking of the snare, the second outer zone for rimshots is nice but I can only get it to trigger while sticking from the outside. The technique of laying the stick flat across the head and lifting one end doesn't seem to trigger the rimshot (or perhaps I just haven't worked out the touch yet).I'm interested in a natural sound, probably close to a classic jazz kit, and a couple of the presets work for me. I also have Battery 3 and using the kit to trigger those samples opens up vast possibilities. Still, most of the time I just want to sit down and play and don't want to bother firing up the PC and loading software so it's nice to have two workable options. The headphone volume could be louder but running it into powered speakers and taking a headphone out from them solves that issue.Keeping the pads clean is easy with two soft lint-free cloths. Dampen one with a little warm water (wring it out well) and use a light circular motion to remove dust and dirt, then wipe gently with the dry cloth to take up any residue.This is my first experience with an electronic kit and, as others have mentioned, the sensation really is fundamentally different from an acoustic instrument, particularly when striking the cymbal pads. It takes awhile to mentally balance the soft thud or click (depending on which surface you strike) from outside the headphones with the sampled drum sound within. I wasn't sure I liked it for the first couple of weeks (meaning I probably didn't) but I've gotten used to it and have gradually begun to relate to the DM6 on its own terms, not as an imitation of an acoustic drum kit, but as something else with its own special characteristics.", "id": 609}, {"review": "The US-100 works fine for my needs: rough and ready audio tracking with 32-bit Cubase 5 on 64-bit Windows 7. My PC is for general-use with a non-studio configuration (no mixer, non-phantom power mics, headphone monitoring).If you're buying for a studio setup requiring phantom power or multiple inputs, you'll need a separate mixer and/or standalone phantom supply. From the mixer you can cable to the US-100's line input via RCA jacks on the back.There were a couple of hiccups during setup, but I don't blame the device. It uses stock O/S drivers that loaded right up. The documentation is minimal and only covers up to Vista, but it's accurate and you'll manage with Win7. On the Windows side make the USB AudioCodec your default recording and playback device to override any onboard or card-based audio and speakers (I have Realtek onboard and 2.1 desktop speakers).I'm using ASIO4ALL with Cubase and Cubase crashed a couple of times while configuring VST connections and I/O busses. Once configured however, it's been solid.I'd recommend checking out user forums for your particular software/platform to find similar gotchas and to set your expectations.On an XP machine, changing the default sound devices often means the hassle of toggling settings before and after launching the DAW. On Win7, once I unplug the US-100, the settings revert nicely to my desktop speakers. If I plug the US-100 back in, the settings revert again - very reliable. Even better, if I want to use Cubase strictly for MIDI, the software detects the change and I don't have to reconfigure connections or busses. That may be a function of Cubase, so again it pays to research your particular software.While the US-100 is connected, you'll hear nothing from your computer speakers and have to rely upon the US-100's headphone jack or audio out RCA jacks. This is where the balance control is very helpful. It's not a pan, it's a center position gain mixing the computer's output (from within your DAW as well as outside system sounds) with direct monitoring of your input signal. Very simple to use for overdubbing. Some people may prefer a hard left/right pan while overdubbing: I can live with the center mix though a switch to toggle a true pan would have been a terrific feature.If you do want desktop speaker playback after your tracks are done, there are a number ways to go: 1) Unplug the US-100 and restart your DAW. 2) Run a cable from the RCA outs on the US-100 to the mini-jack aux in on your desktop speakers 3) Run a mini-jack extension cord from the headphone jack on the US-100 to the aux-in.While using the headphone jack, the RCA audio outs are muted and vis-versa. Rather than having to pull out the headphone I would prefer a push switch that toggles the front to back output, but I can live without it.Again, the US-100 works great so long as your needs meet its capabilities. You can't rely on the product description or packaging to answer that. Fortunately there's enough user-information out there for just about any setup it shouldn't be difficult to track down.", "id": 639}, {"review": "I have a fully-weighted 88-key Alesis QS 8.1 and an M-Audio Axiom 61 semi-weighted and they're both fine when I'm just playing standalone or recording audio or MIDI. But I wanted something with a lighter touch for entering notation and experimenting with soft synth sounds, when my focus is more on writing and software than on playing, per se. The Alesis is perfect: I can grab keys effortlessly without feeling distracted by playing the keyboard 'correctly' - if that makes sense (it makes a clear difference to me).I opted for the 25 key strictly for space considerations and, while the down/up octave shift keys are easy and intuitive to use, I often wish I'd gone for a larger model to get wider voicings. I may trade it in for an upgrade at some point, but overall I'm very happy with the keyboard.", "id": 722}, {"review": "These picks are comparable in shape and feel to Grisman's Dawg Picks (and frankly, cheaper). The thickness and rounded bevel will absorb a lot of high end from your tone and, depending on how you play, this may or may not be acceptable.In my opinion, if you play with a relatively free and loose wrist, without anchoring your fingers or palm on the mandolin face or bridge, you'll get a woody, warm tone with plenty of definition and good volume. Varying the horizontal contact point along the strings can bring out a bit more high end. I play this way and am more than satisfied with the picks. (For guitar I prefer a 1 mm traditional tri-corner shape but that's a different review). If, however, you're really a fan of a biting high treble sound, these picks are probably not your best choice unless you're willing to put a sharper edge on the bevel with a file and fine sandpaper. In fact, a pack of 12 three corner picks can be an economic way to experiment with pick shape and bevel angle if you're searching for your ideal tone.If you support your hand by resting your palm or fingers on the mandolin, chances are your attack, tone and volume are generally softer and I think these picks will produce an unacceptably dull tone. Tweaking the shape may still leave you feeling as though you're not benefiting from the large mass of the pick and it's just slowing you down. For such a lighter stroke, I'd recommend the 1 mm tri-corner I use for guitar.", "id": 771}, {"review": "Compared to the nickel wound XL light gauges I buy in the 3-set boxes, the \"balanced tension\" XL set amounts to slightly lighter D and A strings (.025/.026 and .034/.036 respectively, which I can feel, as well as a slightly thicker B string .0135/.013 which, frankly, I can't feel).The XLs are comparable in gauge to Ernie Ball Regular Slinky (yellow). But if you're used to Slinky's, as I was for many years, the nickel wounds feel noticeably coarser to the skin and took awhile to get used to. I love them now for blues, rock or funk, any kind of playing where you want to dig in a bit for tone - although I will say that for slide (especially when recording at relatively low volume) they don't give quite the same glassy-sounding undertone to my ears as steel wounds, something I happen to prefer.I put the XLs on an Squire Strat, which I like to bend strings on and the 5-position switch gives me a nice range of color to compare. Like the regular XLs, I noticed very little \"new string zing\" after giving them a good stretch. When my skin is dry indoors during the winter the nickels can feel rough at first but in warmer humid temps I sweat more and they get as slick as any steel wounds.I think the balanced tension is more a factor when playing chords than single lines and, for me, it's more of feel thing rather than something I hear (That doesn't make it any less significant to me - I've tossed brand new sets of strings and sold perfectly good guitars on the vague basis they didn't quite feel right).To tell the truth, when playing out I prefer an even heavier set than regular lights for tone, but at home when recording or just playing for myself I like the amount of resistance I get from the nickel wound XLs versus the Slinky's I used since I began playing as a kid. You have to work a little harder with the nickels for bends and intonation but I like the tone and feel overall and I think it's made me a more precise player.", "id": 868}, {"review": "The DP-008EX Pocketstudio is the next generation design of the DP-03 Digital Portastudio. I have access to both units and hope to compare them as well as describe the DP-008EX on its own terms, pointing out features and issues important to me (mostly workflow-related) as someone who grew up home-recording with analog equipment.(If you want all the details of the full functionality I'd recommend downloading the manual from TASCAM or a dealer site that offers it.)Speaking of the manual I found it to be essential, at least at first. There are so many features that it will likely take some time to explore and incorporate them so having a copy handy (or better yet downloading a second copy) is a good idea.This is picky but I found the larger size of the DP-03 manual easier to read and handle than the smaller DP-008EX.I've used software-based DAWs for years and, while I enjoy MIDI recording, mixing, and editing with them, basic audio tracking never felt as comfortable or spontaneous as when I used analog equipment. I have a one-room home studio with minimal acoustic treatment and, aside from PC noise, I miss the simplicity and tactile response of my old MK-II cassette 4-track:  Instant power on, press record/pause, ready-set-go.  Granted, I don't miss the `wall of hiss' that plagued those recordings but I had fun capturing a lot of musical moments.Using a hardware control surface with my DAW didn't solve the problem - I just find the reality of booting Windows, dealing with the inevitable patching and other software distractions to be too toxic to the creative moment - especially when recording acoustic instruments.I hoped the DP-008EX would provide some of that older experience - with digital audio quality in a size that would integrate easily with my existing setup.The bottom line for me is: It does and it doesn't.First some comparison points that may not be obvious from the product images in the descriptions:Size-wise, the difference between Porta and Pocket studios is roughly 11 1/2 x 2 x 8 inches versus 8 3/4 x 1 3/4 x 5 inches. TASCAM doesn't provide a case or cover for the DP-008EX but a larger eReader or tablet case should do fine and I'd recommend one if you plan on portable use - the plastic appears fairly durable but it's still plastic.The knobs on the DP-008EX are smaller in diameter, lower, and have rounded tops compared to those on the DP-03. However, I find their slightly `rubbery' matte finish just as easy to grip. I also find the smaller, circular pushbuttons on the DP-008EX don't protrude above the surface as much as the larger bar-shaped buttons on the DP-003 and are less comfortable to use.The data wheel is identical in size and has a bit less resistance on the DP-008EX which I prefer - the wheel gets a workout and you want responsiveness when selecting from menus.You'll need the dedicated PS-P520 5v power supply for the DP-008EX; the 12v PS-1225L for the DP-03 can't be shared. (The plug won't fit so you can't fry it - and don't even think of using batteries when recording anything you take seriously).  On the other hand, the Teac RC-3F footswitch is sharable - you'll need a mini plug to phone adaptor - but I think it's indispensable if you're working alone.Speaking of power, a strong plus for both recorders (and for me a deal-breaker were it not present) is phantom mic power so you're not limited to the built-in stereo condensers. They're not bad for rough work but, unlike mic stand-mounted portables, it would be a challenge to position this unit close to some instruments and vocals. I can get a decent acoustic piano recording in a good-sounding room but for close mic recording of guitar (acoustic or electric amp), violin, or percussion I want the flexibility of a mic stand and better quality mics.I like the resistance of the faders on the DP-03, but I can understand how the lack of real estate kept them off the DP-008EX. There's no CD burner either on the smaller unit but with USB 2.0 transfer capability, that's not an issue for me.Having similar XLR, phono and RCA jacks along the back edge of both units is an acquired taste. I'm not  bothered by it because I have space to run the cables but it's worth considering your physical layout and whether that works for you.The LED screen appears to be identical in size on both units and that leads me to my main workflow issues:The flat positioning of the screen makes using the unit on a flat surface less comfortable than it should be - especially since the menu is used so much. A slanted or adjustable screen mount would probably be asking for design trouble:  I do woodworking and made myself a simple stand that slants at 25 degrees and doesn't interfere with jack access - it makes a tremendous difference on my neck and upper back while reading the screen and for general use. TASCAM should consider a similar accessory.The software is largely the same for both units, aside from additional mastering `tools' (essentially packaged presets), and here lies my major criticism: I feel a real conflict between directly accessing functionality (i.e. levels, EQ, arming tracks) with dedicated knobs and buttons, and being forced to indirectly access other functionality using what I see is an inflexible, constraining menu  system.If there were some way to customize the menu navigation (the equivalent of software hot-keys) it's possible the frequent repetition of non-functional steps such as pressing the home button and selecting with the wheel would not wear on me as much as they do.The best evidence of an unbalanced design I see is the dedicated Phantom power button on both units whose purpose is - to display the \"Phantom\" screen where you then make a selection to turn the power on and off! That crystallizes for me the hybrid character and compromises made here between software-based recording and using a dedicated hardware recorder.When space for knobs and buttons is severely limited I can understand the design thinking and trade-offs that drive having so much functionality accessible through the menu. But the DP-008EX is stuffed with knobs and buttons and even my first multi-tracker, a Fostex X-15, effectively doubled-up the functionality of two tracks to cover four.  So I have to question whether the trade-offs TASCAM made here in fact diminish the user experience.With connectivity and software-based recording using even smaller devices rapidly improving, I believe the market for dedicated hardware recorders such as the DP-008EX will be largely made up of people like me who grew up with older recorders and are looking to recapture some of that experience. I think TASCAM would be well-served taking that into account.I've always liked the design of TASCAM gear; it just looks and feels well-made, and that's still in large part true of the DP-008EX. But I can't help believing that a simple digital equivalent of my old MK-II cassette 4-track would satisfy a lot of people out there (and not to mention make a terrific hack for someone with the electronics chops to pull it off!).", "id": 873}, {"review": "To describe my impressions of the TH-2000-S versus my well-used Sennheiser HD-201s I chose a few favorite reference tracks that illustrate different instrumental timbres and production values:  I like to use recordings I know well so I can quickly detect varying emphasis in frequency response and clarity.Andres Segovia - `Variations on a Spanish Folk Tune - Narvaez' from `My Favorite Spanish Encores'.In my opinion one of the finest recordings of solo classical guitar I've ever heard, both for the performance and the sheer beauty of sound.  The distinguishing points of this opening piece are the bass notes that Segovia's arrangement of the original vihuela-texture really emphasize. For me there's a difference between bass presence and bass clarity: I'll gladly trade less `oomph' in the gut for the kind of definition the Tascam's bring out:  warm, well-defined, with a crisp and clear treble edge. The Sennheisers, while equally balanced, were far muddier and less defined at the low end with less presence and sparkle on top. They were also considerably quieter and this applies across the board - the TH-2000-S just puts out a lot more sound at similar volume settings.Jeff Beck `You Know What I Mean' from `Blow By Blow'.The George Martin production remains for me one of the most colorful instrumental electric guitar records ever made.  The clean separation and space in the mix between guitar, electric piano, clavinet, bass and drums is always a joy to hear on a good sound system. The TH-2000s again demonstrated more punch in the mids and bottom end than the Sennheisers and overall more presence. It's a 24-bit recording and this is the first time I can honestly say I hear the difference - like being there in the control room, seriously. There's a greyness to the Sennheisers that frankly never bothered me before, but after hearing the Tascam phones, I doubt I'll ever be satisfied with less again.Stravinsky Violin Concerto - Anne Sophie Mutter from `Mutter Modern'.The words I keep coming back to are `presence' and `clarity'. I can hear string attacks, counter voices in woodwinds and an increase in overall spaciousness with the TH-2000-S that I simply don't hear with the Sennheiser phones.As far as craftsmanship, the TH-2000-S weighs more than my other phones and much of that weight is in the band rather than the cups. The sliding cup adjustment is easy to move yet ratcheted to stay in place securely when removing the phones casually. The cup mounts are really well-designed and allow fine-grained 4-way rotation that guarantees a snug fit regardless of the size and shape of your head and ears. I like the balanced feel and snug fit on my admittedly large head. The 2-3\" cushion along the inside of the band and in particular the adds comfort.The cord is a hybrid - the 2-3' closest to the phones is flat 1/8\" diameter, well-insulated 'matte-finish' and flexible. Beyond that there's another foot of coiled wire that will comfortably expand another 3-4 feet.  I think it's a nice compromise that's probably biased towards most users sitting fairly close to an output jack - you can avoid having to deal with excess cord unless you need to.As we get older our hearing changes: for most people it's a decrease in high-frequency response but it also occur across the entire spectrum.  Simply listening louder isn't always the best solution and it can be a tremendous ear-opening experience to try a pair of better quality headphones. I'd encourage anyone excited by quality sound to experiment and these Tascam TH-2000-S are a good place to start.", "id": 888}, {"review": "The tension screw adjustment remains the best of any capo I've ever used - and I've tried many over the years. But what was Ned smoking when he decided to have the trigger handle and main support stem, including the pick clip and tuner holder, protude outward away from the fingerboard? It's awkward to apply and remove quickly. It's visually distracting for player and audience, and it doesn't add any mechanical benefit to the already excellent tension adjustment.The only possible justification I can come up with is having less to obstruct the fretting hand behind the neck -  but even that doesn't fly. Regardless of capo tension you should position it as close to the fret as practical and, unless you're avoiding playing that first fret (or use a low-thumb classical fret hand position) you're always going to feel some part of the capo against the leading edge of your hand. I own the older Planet Waves tri-action capo and never felt that to be a problem.Otherwise the construction of the NS Artist Capo is superb. The surface is arched, probably between a 10-12 radius that works fine on various Strat fingerboards as well as a flatter SG/LP style. It doesn't work as well on the very flat 16 radius of my Martin OM-1 which is virtually the same as a classical. If I cranked the tension it's possible the rubber would flatten out but I wouldn't risk marring the neck wood.I tried both the pick and tuner clips and they're functional, but to be honest I wouldn't use either - too distracting and I only use tuners to get an initial A, then tune each guitar to itself or to other instruments, depending on what they are.The only other capo I've ever used that protudes outward is the Kyser with its notorious 'wrought iron fence' design. I have one and, as good as the holding action is, I've never felt comfortable with the design. The older Planet Waves capo is still available so it comes down to preference.To top off the confusion, the picture on the front of the cardboard card the NS Artist comes mounted on shows a similar capo positioned in a way that's impossible with this capo!", "id": 894}, {"review": "I put the set on my Squire Jazz Bass with threaded bridge rollers. If you don't like loading up the tuners, trim a few inches off the leads; they're about 8-9 inches and have no cloth covering like Fenders. I usually play medium gauge flatwounds on this bass and the FlexSteels have overall less tension. I let out the truss rod a half turn to eliminate buzzing (yeah, ironic for a set designed for slapping).Gave them a good stretch and they're holding pitch well. I find the windings on the FlexSteels more comfortable than Rotosounds - at least comparing new-to-new. That helps when playing more horizontally with a lot of position shifting.Overall I'm more into jazz and classic prog than slapping and there's plenty of 'piano low-end sproing' (Squire, Lake and Ray Bennett fans will feel right at home, fingers or pick). The set is so bright-sounding in fact I had to roll a considerable amount off.The label says 'Light Top/Medium Bottom' (45-65-85-105): I found the gauge balance between the low E-A and the high D-G a little more pronounced than I'd like, but not outright uncomfortable.", "id": 896}, {"review": "I usually play an .11 on top and first grabbed my digital caliper to confirm the gauge of the high E in this set &#8211; it felt heavier than a .10, but the LED doesn&#8217;t lie and it confirmed .10.I put the NYXL set on my Ibanez Artist with DiMarzio  humbuckers. I stretch new strings out of habit; I don&#8217;t like the constant slipping as they settle.  I stretch all six strings in about 4-5 segments up the neck, retune, and hope for the best.There&#8217;s no whammy bar on the Artist and, for the first few days, I did a lot of blues bending to see how they&#8217;d hold up - the NYXLs stayed in tune very solidly with only minor tweaking as to be expected with any strings.I chose a darker-sounding guitar than a single-coil Fender, hoping the supposed brightness of the NYXLs would be more noticeable. On this guitar I usually play D&#8217;Addario XLs and an Ernie Ball &#8216;pink&#8217; set on my Strat so I&#8217;ve got two points of reference.In terms of tone, from the start the NYXLs sound much closer to &#8216;broken in&#8217; than the Ernie Balls. There&#8217;s far less &#8216;new jangle&#8217; to them and, while they&#8217;re bright, they&#8217;re manageable for the kind of tone I&#8217;m after. I play jazz in a more contemporary vein &#8211; in terms of tone more Scofield and Abercrombie than Wes Montgomery and Jim Hall.  I like a rich tone with some high end but without too much &#8216;klang&#8217;.In terms of feel and tension the NYXLs are stiffer and closer to the regular XLs than to Slinkys, which is probably to be expected. But oddly, the windings of the low E-A-D remind me a bit more of the Ernie Balls than XLs, whose windings feel a bit wider.Three weeks on, with the onset of warm humid weather around here the strings are showing no rust and still sound fresh.With so many players going through modeled amps and effects it&#8217;s a fair question just how much the tonal quality of electric strings still matters &#8211; or are we headed for &#8216;virtual strings&#8217; designed mostly for durability and intonation. Will we be dialing in &#8216;new and klangy&#8217;, &#8216;broken in with worn windings, or &#8216;sweated through and rusty&#8217;.I like to believe there are enough players out there young and old still fussy about tone and the role a good set of strings plays in delivering it.  To them I&#8217;d say these are worth checking out.", "id": 897}, {"review": "Wall hangers are good space-saving ideas, but I'm one of those who thinks they can stress necks, depending on the body/neck weight distribution and balance. I made my own hanging bases - just a carved slab of wood, really - to support the instrument from the bottom. The top hanger now just serves as a rest, but depending on the guitar's balance I'd recommend a heavy rubber band or something to stretch across the prongs if there's any tendency for the guitar to tilt forward.", "id": 166}, {"review": "I bought the stand to better organize my personal studio space and I'm satisfied enough to consider purchasing a second (too many instruments for my own good).Still, it could use some tweaks: I'd recommend putting lock washers under all the nuts - very inexpensive and keeps the bolts tight - especially on carpet where there's even more tendency for the pieces to shift about under stress. It also protects against over-tightening the bolts that can bend the relatively lightweight metal arms and support bars.I can imagine people feeling queasy about storing expensive instruments on a stand that feels like it wouldn't take much to tilt over forwards, but you should be able to convince yourself that the downward force of the instrument bodies (especially electrics) counteracts the weight of the necks leaning into the top support - making a forward fall unlikely.Still, for sanity's sake, I'd position the stand close to a wall. At first, this causes a dilemma because your headstocks will extend beyond the front plane of the stand. But it's easy to rig up one or two 6-8 inch support pieces from wood or pipe insulation-covered metal to brace the stand against the wall while providing comfortable clearance for the headstocks. Removing any worry of a fall is worth the effort.The design can hold a variety of instrument body shapes; the trick is to find the optimum balance point but it's not hard: I fit an acoustic bass guitar, a 335-shaped Ibanez Artist, Strat, SG-shaped bass, J-Bass, a Martin OM-1, a long neck bouzouki, six-string banjo and a Nick Lucas-shaped Recording King acoustic on it. That said, I don't max out the seven slots - I'll use at most 5, simply because different shapes make catching a strap and banging an instrument too easy when they're that close. If I were storing all electric guitars or basses with similar shapes, I might be comfortable with six or even seven.I wouldn't use this stand on stage - and by 'on stage' I mean any setting with people moving about who might come into contact with it, including a house party, basement jam session, etc. It's simply not sturdy enough, physics or no. But for my needs it works well and saves me a lot of floor space where it's tight to begin with.", "id": 769}, {"review": "The NS Mini chromatic headstock tuner quickly recognized twelve pitches across a multi-octave range of electric bass, guitar and mandolin. The accidentals appear as sharps or flats toggled using the alternate functions of the frequency button.The tuner's view window is slightly larger than a Chiclet but brightness and resolution are fine for dimly-lit spaces.  One thing that's less than ideal is the charcoal color of the tuner itself. If you've ever dropped stuff on dark stages you know what I mean. I'd wager the back of most headstocks skew to lighter tones than darker, so if discretion is what the manufacturer is emphasizing, a lighter color may work better.The notes appear red when out of tune; their color changes to green as a `rough marker'.  You then continue fine tuning using the vertical bars that appear on both sides of the note.  They've gone to lengths to make the tuner stage-friendly, but I'd much prefer the green color mean ` fine tuned and done'.  That way I can look from a distance. I should only have to bother with the bars if I'm struggling to home in (and in my experience that's the exception rather than the rule and usually caused by: new strings, slack under the bridge pins, a slipping tuner, etc.  Mid-life strings tend to stretch and loosen predictably, so long as you don't use a lot of altered tunings.The NS is designed to be clipped discretely to your instrument headstock and viewed from the back. I'm a lefty and, unlike some other tuners, I appreciate the swiveling base that allows me to view the screen right-side up.The viewer doesn't extend far above the headstock surface and felt a bit cramped on my L4 with large New Yorker-style tuners.  On headstocks with more bare wood like a Strat, or even my A-style mandolin, it was easier to find a comfortable spot for viewing that didn't obstruct my hand while turning keys.At first I didn't like the ratchet clamp that attaches to the headstock. I could attach the tuner with one hand by squeezing the clamp tight but it felt like I needed two to remove it: one to press the release and another to pull the clamp out. After a little practice, however, I found this wasn't the case and the touch required isn't difficult at all.The tuner's constructed in a high-impact composite, similar to those parachute-style clamps you see on backpacks. It feels durable and very unlikely to break, although I didn't try stomping on it.I was impressed the battery comes uninstalled in a separate small bag.  The battery door has a concave slot for easy opening with a pick or a coin. The tuner has an auto-shutoff function to preserve battery life.The power and frequency buttons are just nibs really; I'd prefer they be larger with more surface and a bit of click to them. The tuner can be calibrated in integer steps from 430 to 450 if 440 doesn't work for you.One advantage of a chromatic tuner is you can tune to a chord and aren't limited to (usually) diatonic open strings.  For myself, I only use tuners to set the pitch of one string, usually the low A for guitar or bass and low G for mandolin. In my opinion, tuning a fretted instrument completely by open strings is only slightly better than tuning it completely with harmonics - and neither does the job well. Intonation is subject to a bunch of variables: string action and thickness, neck relief, fret condition, nut and bridge condition.Once I have a single string to pitch I match fretted and open string unisons and octaves. After a while you learn which combination works best for each instrument.I used to love staring at those Pignose-sized 'strob-a-tuners' sitting on amps and never faulted a musician who took their time to tune accurately (I wish many more did). I'm not quite sure how we went from, 'We tune because we care' to 'I'm so embarrassed to be standing here tuning I hope no one notices', but the NS Mini Headstock tuner - questionable design choices and all - does what it says with a minimum of fuss.", "id": 785}, {"review": "To my mind there are three criteria for evaluating a capo:1) It's got to hold with enough even pressure to keep all the open stringsringing clearly, especially in the face of hard picking, strumming, and string pulling.2) The design shouldn't intrude on either my thumb when it's behind the neck or peeking over the fingerboard, or the side of my index finger when I'm at the first fret playing chords or single notes.3) The design shouldn't require excessive hand pressure or too much fussiness to apply, reposition, and remove the capo (especially two-handed fussiness).The Tri-Action capo scored big on all three criteria: It held tight on a variety of acoustic and electric neck widths and profiles, from a Martin OM-1 with a wide rounded shape to a Gibson L4 archtop with a baseball bat-thick and round neck, a skinny SG, a wide and soft C-profiled Ibanez Artist, and an imitation Strat with a hard-radiused fingerboard and classic C-shaped neck.Planet Waves came up with a design that works both \"over and under\": I can squeeze the capo with my fingers with its back snug in my palm or flip it over and use the base of my thumb, making it effortless to position, adjust and remove.The capo's profile is comparable in size to the Keyser, but without the Keyser's protruding high angle arm neccessary to generate adequate spring tension. I've used the Keyser for years and in my opinion the Tri-Action is far easier to apply.The Tri-Action is also much less conspicuous from the front, although it's not quite as compact as the Schubb or those fancy minimalist capos some flatpickers like (I like them too but they're a little more work than I sometimes want).What's remarkable about the Tri-Action is its spring tension that's truly comfortable to apply yet produces a more than adequate string grip. The spring wire is probably 1/16\" thick and I can't imagine it ever losing its tension. The adjusting screw wheel is about a quater-inch wide and textured for an easy touch.The purpose of the tension wheel is not to vary the distance between front and rear capo surfaces, as is the case with some other brands, but to vary the pressure exerted by the rear surface against the neck - and consequently the amount of pressure required to squeeze the capo. The bottom line is you can custom-fit the capo to your hand strength and avoid straining or worse - a painful palm cramp like the one I got on stage once while squeezing the Keyser.The pick holder is also nicely designed: a kind of serrated slit that lets you securely stash a pick at varying depths, equating to how easy it is to pull it out. I think my pockets serve the same purpose even more securely, but it's a nice touch.I didn't think there was a whole lot of room left for re-engineering the largely utilitarian guitar capo, but clearly a lot of thought went into Planet Waves' NS Tri-Action Capo - enough to easily knock my previous go-to capo right off its pedestal.Get one, and sit back and watch the banjo guys sweat when the fiddler calls for \"Done Gone\" in Bb at that next jam session.", "id": 843}]