[{"review": "I'm so glad I bought this instead of some of the cheaper, plastic pedalboards out there.  The board itself is made out of welded metal and it's very sturdy.  The velcro seems to be of decent quality, too.  Even the bag is nice.The single downside of this package is the shoulder strap on the bag.  As other reviewers have pointed out, the fact that it clips onto the bag in weird places basically makes it worthless.  My advice is to a) definitely buy the pedal train mini and b) toss the shoulder strap in a drawer somewhere and never look at it again.I'm using this unit for my bass gear: a SansAmp programmable bass driver DI, a compressor, a tuner..and possibly an envelope filter at some point.", "id": 588}, {"review": "Could be a fluke, but my unit was defective straight out of the box.  Plugged it into the Macbook Pro, fired up GarageBand and right away it's MIDI connectivity was intermittent. Then it had some stuck notes.  Then it stopped being recognized at all.  It still got power from the USB bus, but no MIDI, no sound.  The jack was visibly wiggly, too.So, you're mileage may vary, but mine obviously had a defective USB port on the back.  Rather than bust it open and get soldering iron, I returned it and bought an M-Audio Oxygen 25 for $20 more.", "id": 722}, {"review": "I bought this mixer in order to combine my bass guitar with an mp3 player for silent practice at home. Bass into one channel, iPod into another, headphones out.It works!  There are other solutions to this dilemma.  Pocket-sized headphone amps, and so on.  But they're a) more expensive and b) kind of junky and c) come equipped with built-in effects and amp models which I do not want.  YMMV.)So what's the Behringer XENYX 502 like in this use scenario?1. The blue power light is blinding.  First thing I did was put some masking tape on it so that it didn't prevent me from seeing the knobs on the board.2. Speaking of those knobs, they seem a little rickety.  Be careful jamming this into a gig bag repeatedly.  I worry that the knobs won't stand up to that kind of treatment for long.3.  There's no on/off switch, so you'll wind up pulling the power out of the back of the unit when it's not in use.  Strange for this particular usage scenario.Overall, I think this unit is a great value for the money.", "id": 367}, {"review": "I was new to pedal effects, new to pedal boards, and new to the challenge of how to power it all.  I did my research and settled on Pedal Train for the board (the Mini, with case) and the One Spot for power.  This bundle--including an 8-pedal chain, a few adapters and the power supply--does it all.  In fact, it may be overkill.  I only have 5 pedals, so I have to hide/secure the rest of the chain with twist ties.  And the adapters, never used 'em.  But it is a complete kit.  If you need more than this, I don't know what to tell ya.", "id": 428}, {"review": "I like the pedal.  It's totally silent, very bright display, sensitive meter.  In fact, the only complaint I have is that the strum-every-string-at-once thing isn't as useful as you might think.  Not that I ever use it.  I'd buy this product again if I had it to do over again.", "id": 650}]