[{"review": "It is always a delight nowadays when any electronic device is still functional after such a long time.  From 2006 when I bought it, till 2013 when I write this, still going strong, very happy with my purchase.  Alas, my experience says newer devices being sold are rarely as good as when they first come out, but you never know, it may still be as good as ever now.For what it's worth, I am a professional musician with perfect pitch.", "id": 330}, {"review": "I have used the Manhasset orchestra light, and this is definitely an improvement, it distributes a nice soft light evenly through the whole page, unlike the Manhasset light which tends to be rather uneven.  It illuminates my entire largeManhasset M54 Regal Conductor's Music Standquite well by itself.Having said that, for a 40 bucks light, it feels rather flimsy to me. In both construction and light brightness, it does not compare well with traditional clamp or desk lights, all of which are usually much cheaper (the issue being mainly the light switch, the jury is out about the clamp, though it seems strong). Of course, as an orchestra light, it couldn't be much brighter without defeating its intended purpose, I am just pointing out that I feel it isn't worth 40 dollars, when you consider the whole field of similar lights (those not intended for orchestra).I bought this because of reputation and reviews, but it should probably cost the same as its closest competitor, theRechargeable Music Stand LED Light Clip-on 9 LEDS with Adapter.  That one has the same negative issues as this light, but at a much more acceptable $18.99 plus free shipping.One more thing, you should ignore the \"Frequently Bought Together\" suggestion to get theMighty Bright 80910 Bright Light Cradlefor this light.  I bought it, and can confirm they are totally incompatible, and anyways, this light has a huge clamp which can be used to carefully balance the light on a desk without clamping, if desired.", "id": 681}, {"review": "I am mostly happy with this amp, it sounds great for my acoustic amplification needs.  With that said, when I was shopping around for an amp, both online and in person, ALL the amps I tried and read about (both very expensive and very cheap amps) had one characteristic in common, which is missing from this one, and which I thought was universal: it doesn't allow you to connect a headphone for private practicing, I had to purchase a headphone amp separately, wasn't expecting that.This may seem a nit pick, but considering the universality of this feature, you are best advised to know it is not present in this amp.  Other than that, this is a great amp.  I could see myself making a recording in a small to medium venue with it.", "id": 703}, {"review": "So far I am a very satisfied customer with this cable.  For what is worth, while I have used these cables before, this is the first one I have ever owned, so I am no expert.", "id": 32}, {"review": "This is my first guitar belt, it is not a good fit, the connection to the guitar is far too thick, I try to not remove it too often as it is highly inconvenient and hard to manage.  Other than that it is usable, sort of, but I am thinking of getting some kind of metal hook instead, the thick leather is so unpleasant to deal with.", "id": 285}]