[{"review": "This is purely an overdrive pedal, not a distortion pedal.  It increases the gain and dirties your tone, but it does not actually distort your sound.If you're a metal or hard rock player, don't buy this.  It's better suited for country, soul, R&B;, blues, or even jazz players who want to boost their volume and umph when they're doing a solo.  For that it's excellent, especially considering its very low price.And despite its very low price, it's very solidly built.  It's like a brick.This update is to point out that I've only used the Bad Monkey pedal with tube amps: A Fender Blues DeVille 4x10 and a Line 6 Spider Valve HD100 MK II running into an Ampeg 4x12.  I have no idea how it'll sound with a solid state amp.  But it sounds great with a tube amp.This update is to point out that I finally tried it with a solid state amp and it sounds pretty darn good.  I recently bought a 100 watt Fender Mustang III combo to use as a practice amp.  It perfectly compliments my Fender Blues DeVille 410/Fender Mustang floorboard combination.  As I've said, I use the Bad Monkey as a boost for soloing.  Whether I'm playing clean or dirty, the Bad Monkey gives my guitar a rich/deep/great sounding boost.This update is to reiterate how awesome this pedal is.  I rarely play directly through any of my amps, e.g., Fender Hot Rod Deluxe, Blues Deville, Super Champ x2 or Ampeg B25, I'll turn down the gain on the Bad Monkey and use it for a much fatter \"clean\" sound.  It's just so thick, like texas chili with lots of umph.  You've got to get this pedal.", "id": 145}, {"review": "These do a great job at passively eliminating noise while allowing you to hear your metronome (or a mix from a soundboard) perfectly.  They are certainly worth the price.", "id": 146}, {"review": "I've been using D'Addario XL strings since the 80s.  I love 'em.  The 10 pack price is amazing.", "id": 156}, {"review": "In my humble opinion, the pictures make the product look purple.  They're not purple.  At least the ones I was sent.  They were charcoal.I bought them specifically to use with my daughter's purple Washburn guitar, so it's kind of annoying.Other than the color, there's nothing wrong with them.", "id": 167}, {"review": "I installed this in a Super Champ x2.  As others have pointed out you'll have to turn the treble down after installing it.  That's because it's designed for making solos stand out. I.e., for adding punch.  If you're a lead guitarist, this speaker will make your guitar sing.However, if you mostly play rhythm, I'd stick with the stock speaker.I want to put two of these into my 4x10 Blues DeVille to increase its range and make solos sing, while letting the stock speakers give me some bottom.", "id": 287}, {"review": "I have a set of the original locking tuners on a '84ish Strat.  So I decided to try these on a Fender Telecoustic guitar I have that wouldn't stay in tune.  These fixed that problem.  It stays in perfect tune now.", "id": 387}, {"review": "Quite a few people are complaining about the buzz caused/induced by this.  I'm not getting any.  I use an old Arion Stage Tuner, a Digitech Bad Monkey and CM-2 Tube Overdrive, a Dunlap Wah from the 90s, and a Boss NS-2 Noise Suppressor.  I run it all into a Fender Deville 410, which additionally runs into an Acoustic B115 Neo bass cab for extra mmmph.At first I thought it was the noise suppressor.  But even when it's off, I'm getting absolutely no buzz from my effects.For the price this is AMAZING.  To be able to have all of my effects powered with one plug is a godsend.  The cables are VERY long, maybe too long, if that's possible.  If you're even thinking about buying this, JUST BUY IT ALREADY!!!!", "id": 428}, {"review": "I bought this to go with my Super Champ X2 combo.  It works.  It also came with a cord.I was not happy the Super Champ X2 didn't come with it.  Both my Hot Rod Deluxe and Blues DeVille came with foot switches.  And you really need the foot switch to use the X2's various voicings and effects. Now the X2 is my main amp.", "id": 535}, {"review": "This is intended to replace a MIM 6 screw Stratocaster bridge.  It only comes with the bridge, no body screws, no back springs, no arm... nothing.  That's why it's so inexpensive.  What you see in the picture is what you get.But that being said, it a great value if you want to spruce up your MIM Strat.  The block is HUGE compared to a standard MIM bridge.  It was incredibly easy to install.  And the sustain is improved.One tip which I forgot, do not tighten the 6 screws into the body all the way. The bridge has to be loose enough for the bridge to move like a hinge.  The springs in the back keep it back.  The string tension keeps it balanced in the front.  What I did was tighten the body screws all the way, and then loosened them one 1/4 turn back.", "id": 677}, {"review": "This is the greatest practice amp ever.  And by practice I mean practicing by yourself and with a band.First, it's all tube, so it sounds really good.  It's gets nice and dirty as you crank it and sounds warm at all volumes.  It also takes pedals well and can sound like a beast.Second, it's 15 watts and is pretty darn loud.  I've used it for band practice and it's definitely loud enough to keep up with a drummer.  At a bar you'll probably need to mic it or use the included line-out.Third, if the 10&#34; speaker isn't loud enough, you can plug it into a cabinet to push more air, it sounds great in the 4x12 and 2x12 cabs I have.  That'll make it loud enough for most bars.Fourth, it has great sounding built in effects, nearly everything you'll need.  Most small tube amps don't have built in effects.  So if you're trying to practice down in the living room, you're forced to drag your effects with you.  That's annoying.  With this amp everything is built in.Fifth, unlike a lot of tube amps, this one gets very quiet.  You can turn it way down, keep the warm tone, and practice without bothering anyone else.Sixth, the price is amazing.  All tube, build in effects, and line and speaker out... wow.  Fender is basically giving these things away.I love this amp so much I want to buy one for every guitarist I know.  The only downsides are that it does not come with a cover and a footswitch.  But considering the price, that's understandable. There's no reason to include those if most people are not going to use them.  You'll only want the cover and footswitch if you're playing in a band.", "id": 819}, {"review": "First, I don't like most distortion pedals because of instead of making my Fender Blues DeVille 410 sound distorted, they make it sound like it is amplifying a distorted pedal.  There's a difference. Think about it if you don't get it.Second, I don't like having a lot of pedals. I play in a rock/country band were we play music that sounds like Neil Young, Tom Petty, CCR, etc.  Just simple and clean rock and roll with a mix of 1,4,5 chords and an occasional minor 6th.  I just want an overdrive (my Digitech Bad Monkey) and my Arion tuner, but I need distortion when we do covers, AC/DC, Hendrix, etc.  (The DeVille can do Hendrix, if you turn it up to 7.  But of course then it's too loud.)Based on those criteria, the DigiTech CM-2 is PERFECT.  The Classic \"overdrive\" setting allows me to sound like Hendrix or rocking Neil Young (or any other rock band from the 60s and 70s).  The Modern setting allows me to sound more like 80s and 90s rock, e.g., Guns 'n Roses and Soundgarden.And this is important, both settings make my amp sound like IT is being overdriven.  It sounds like my tubes are being pushed to their breaking point.  It sounds fricken awesome.  It does not sound like an amplified pedal.So I can use the Bad Monkey (I've reviewed it on Amazon if you want to read it) for boosting my clean sound.  I use the CM-2 if I want to play dirtier and for covers.  Two pedals (plus the tuner) and I can play everything I want.  I'm happy.", "id": 529}]