[{"review": "I wanted something inexpensive and well made and decided to go with Planet Waves over the similarly priced Fender cable. I like it because the tip is one piece instead of screw on and the price was just right. When I have to replace this cable I will likely buy this same cable or something else by PW because of all the cables I have owned PW seems to withstand my abuse most effectively.", "id": 168}, {"review": "I figured I would splurge and buy these just to have some backup cables when I wear out the cheap guitar center ones (and have some that match). They are well built and feel like they can take some abuse. I will probably but 2 more packs shortly to switch out all my cables.", "id": 578}, {"review": "I think these jazz picks are awesome, nice and light with a gripped texture so you don't have worry about them flying when you solo! I only wish that more came in a single pack.", "id": 686}, {"review": "This looper is serious worth every cent I spent on it. Very simple, easy to use, and takes up less space on my pedal board than my Altoids tin. The sound quality is perfect, I can record a loop and play it back through this thing and it still sounds like I am playing instead of a recorded loop (assuming I end the loop correctly). I run this in my effects loop of my ac-30's after the preamp and all the distortion I run beforehand (big muff, od, boost) all get captured clearly coming out of this pedal. The range of the loop level is perfect, just over noon and you match the input signal and over that allows you to boost your loop for a little more dynamics.I chose those over the digitech jamman express xt and I have to say it was worth the extra money, even though the sales person was a little disappointed.If you want a simple loop this is the one, it takes a little learning but once you figure it out you will love it.", "id": 869}, {"review": "I bought this tuner over the TC Electronic poly tune and I am very happy with my purchase. Very simple to use, great visibility and it does not color the signal when not engaged. It also has the ability to daisy chain from it into other pedals but currently I have no such need. I highly recommend.", "id": 504}]