[{"review": "These are pricey but keep the fresh sparkly tone much longer.  When they start sounding a little dull it wipe them down with Fast Fret, loosen off the tension a bit and wipe 'em down firmly and they sound new again.", "id": 104}, {"review": "I ordered both this one and the Lee Oskar.  I couldn't find a usable position with either and was about ready to return them both then noticed that the shoulder piece on the Hohner had &#34;raised&#34; ends.  I reversed this piece where the ends angle down instead of up and it works ok.  The quality appears good.  The springs that hold the harp in are STRONG but by holding the harp in my mouth and using both hands I can change harps without removing the rack.This was my first shoulder rack and I didn't know what to expect.  I have to have it adjusted exactly right to be able to go from harp to singing and it's challenging but I can get it done.", "id": 354}, {"review": "First, I've noticed that many reviews here are for the \"original\" NS tuner, the one with only two buttons and \"coin slot\" battery cover. This one is a little smaller, has a metronome flasher, and the battery installs differently, but the name/model evidently didn't change.  I compared this new one, the \"original\", and the latest Snark on dreadnought guitar, mandolin, and 5-string banjo.Pros: Size, size, and SIZE!!Reasonably accurateMounting clip better than beforeGood priceMetronome flasher maybe for some?Cons:  Display not as bright as othersContrary to their description, this one seems less sensitive than original.Battery compartment difficult to openMay not fit well on some headstocks. On my wife's A style mandolin it fits but barely. On my slothead guitar it alsobarely fits.  That being said, I haven't found anything I can't use it on.My take.... The Snark was the better of the three in terms of accuracy, lock in speed, and visibility however I really dislike the \"eyeball on a stick\" form factor and refuse to use it on stage!  I like the fact that the NS is unobtrusive and can be left on the instrument, I even in leave 'em on in the case. The display and lock in speed of the original NS was better than the new one but the new one seems a bit more accurate for me. I'll keep the new NS tuners for now and hope that D'Adarrio (or someone) improves on it with a better processor and LED.", "id": 785}, {"review": "I've used this tuner for both my acoustic guitar and banjo for a year now and like them a lot.  We got this one for my wife's mandolin.  It's small, barely noticeable from the front and easily visible from the back.  I understand it can be a tight fit on some headstocks, it's snug on my 12 fret slot-head guitar due to the buttons pointing straight down but it works ok for me.  The accuracy is as good or better than any I've used.Pros:AccurateCheapEasy to see in daylight or darkGood battery lifeIt's always there, you don't have to hunt for a tuner.Cons:I wish it would turn the tuner buttons for me!", "id": 822}, {"review": "I bought this brand because I have one of their mic stand mounts (for iPhone) which I like a lot.Pros:The clips did a good job holding my iPad Mini without having to remove the folio type cover (Marware Axis).Quality seems acceptable for the price, the ball swivel works well.Cons:It's too heavy for my mic stands.  I tried it on the boom arm and it made it top-heavy and unstable.  If the boom is positioned in a very upright position it's ok, but a boom pointed up defeats the purpose!The clamp which holds the base to the stand is big and cumbersome.I had high hopes for this one but it's not going to work for me.  I have returned it and ordered a different ChargerCity model, the one with the lever-type mount.", "id": 831}]