[{"review": "Strings are half the battle with stringed instruments. A bad pair of strings on a nice instrument sound awful, and a good pair of strings can make a cheaper instrument sound tremendously better. Either way, stringes drastically effect the sound of an instrument at any price point. These strings make my cheap ukulele sound not-so-cheap, and I imagine they would do even more wonders on a uke of a higher price point. I also play guitar and Martin is one of my choice brands for strings so I figured they wouldn't let me down when I decided to play the ukulele - I was correct.", "id": 45}, {"review": "Summary for those who don't want to read the whole thing: This is more than worth the money. If you're a beginner looking for a first guitar or if you're experienced and are searching for a backup/travel option or anything like that, get this. Do not hesitate. A cheap guitar doesn't ALWAYS mean a POS!Alright, full story/review:So, when I was a kid up until my early teens my (insanely talented and self-taught) older brother helped me learn how to play guitar. I got pretty decent but somewhere along the way I stopped and I've regretted it basically every day ever since then. Recently, I decided to stop internally griping about it and realized I should actually DO something about it. So, here I am.Having previously lived in a house with multiple guitarists, I have heard the sounds of expensive guitars and I have heard the sounds of the cheapest guitars (like a typical beginner's First Act). I knew there was a middle ground and I was determined to find it. I got way more than I bargained for.I began my quest knowing that my funds were limited. There was no way I could afford to dive right in and buy a high end, top of the line Fender or Martin like I had had the benefit of learning on back in the day. I knew I had to go cheap, at least for now. I began scouring the internet in search of the best rated budget guitars. After an exhaustive amount of research, I chose this one due to the positive reviews and because all of the demos I'd pulled up on YouTube were excellent. Plus, Epiphone has a pretty good reputation in general.Despite the positive reviews, I was still a bit leery; buying instruments without actually handling them first is always a bit of a gamble. Even if it sounds nice and plays well, sometimes a perfectly solid, functional instrument just doesn't FEEL right. As I went through the checkout I silently reminded myself that I could send it back for any reason. I went into this fully knowing that there was a good possibility I'd just have to bite the bullet and buy something better, even if costlier.Well, it arrived earlier this week and I am not disappointed. I certainly didn't expect perfection and I was convinced that I would find some kind of error, if only cosmetic, with such a cheap guitar. I am here to tell you that I have not found anything wrong with it. Even if I had (unless it drastically affected the sound/playability of the instrument), it would still be worth the price.Along with the guitar I bought some new strings (Martins) because 9/10 times the stock strings that come on instruments are awful. I was pleasantly surprised to find that the stock strings are more than usable. I see that some of the other reviewers disagree. Maybe their strings were older or maybe it's just preference, I don't know. All I can say is that the stock strings on my guitar were not at all corroded/old. Shockingly enough, the guitar was pretty close to being in tune right out of the box! It doesn't seem to have any trouble staying in tune, either. All of that being said, it wouldn't hurt to pick up a pack of strings just to be safe. I mean, I'm sure that when I do finally put the Martins on I'll be even more mind-blown than I already am with the way it sounds.This guitar has a full, rich sound, plays comfortably (the low action helps!), and has zero issues with buzzing or dead frets. Oh, and contrary to what other reviews have said - YES, it DOES have a truss rod. While we're talking about its positives, let's not ignore the fact that it's also super attractive with its shiny black finish. There isn't much about it that would give away its price. No, it's not a $1000 guitar but it certainly doesn't play like a $100 guitar either! I don't regret this purchase at all. Even in the future when I progress and upgrade I will definitely be keeping this lovely gem!If you're still unsure, do what I did and listen to some demos on YouTube. I doubt you'll be disappointed. (Pay no mind to the reviews the guy on the GearWire YouTube channel did. He clearly doesn't know what he's talking about and I, as well as everyone else in the comments section, was sure to express my feelings about that, haha! One user even claimed Epiphone should sue him!) Check out the video reviews by the users/companies GoldHat3, SamAshMusic, GigGear, and ShadowFW.My only complaint about this guitar is that I didn't buy it sooner!Good luck on your search, I hope this review has helped!", "id": 53}, {"review": "This holder is spring loaded so it makes inserting and removing picks easy. It has a little sticky tab on the back so you can stick it to something (such at the side of back of your instrument) so you always know where your picks are and always have them on hand. I don't know exactly how many it holds, and the thickness of the picks makes a difference, but I've crammed quite a few of varying sizes in here without issues.", "id": 233}, {"review": "I don't know how much you can say about picks, but this is a versatile pack. You get a multitude of types and there are 2 of each thickness. If you use a variety of picks or are wanting to test out other types of picks, this is for you.", "id": 773}, {"review": "For the price, this is a steal. If you can, snag a pack of new strings and it will sound tremendously better. All in all with new strings I only spent about $30 on this uke and I think that is more than fair.If you can't get new strings, the ones that come on it will survive you a little while (but stock strings on any instrument are never great). Also, if you don't know how to to tune an instrument/don't have a tuner, you don't need to buy one; if you have a smartphone or iPod touch there are accurate tuning apps for nearly any instrument, ukulele included!A little back story: I used to play instruments when I was younger but stopped in my preteens/early teens. It's something I've recently been regretting more than ever. So, I'm fixing that! Not only am I relearning the instruments I played before, but I picked up a new one - the ukulele! Like many others, I was inspired by Amanda Palmer to do so ;)Back to the review!:The sound of the ukulele is great. It's not too tinny like a lot of cheap instruments are. After a week or so it has no trouble staying in tune and rarely needs adjustments. It's very lightweight (which is good) but I don't think it would survive a fall. It's a fingerprint magnet, but that's about the only gripe I have. I plan on sticker'ing and painting it anyway :) The gig bag, as other as said, is basically just a dust jacket. I'm cool with that because that says to me that the majority of the money I spent on this ukulele really was for the ukulele, not the extras!For the price, this ukulele more than serves its purpose. I was worried that I'd regret not shelling out another $20 or $30 for a more frequently recommended ukelele, but I don't regret it at all.It's pretty easy to learn, especially if you have the littlest bit of musical knowledge or experience. Even if you don't, it shouldn't take you too long to be playing some songs! You have the gift of internet where there is information everywhere!This ukelele is perfect for a beginner or for someone who wants a cheap backup or travel option. Plus, it's not costly so if it breaks/gets lost/stolen/you choose to upgrade, you haven't lost a whole lot of money.This would also be great for kids who want to learn an instrument. My little brother has been nagging me to get him a ukulele since I got one!That's about all! I will update if any problems arise in time.Don't hesitate. If you're new, don't worry about spending $50+ on something else (I mean, if you can and want to, go ahead!). This will be more than fine.Edit: Apparently, this thing fluctuates between $20-30. I was $24.95 when I got it. If it's $30, wait a few days and see if it goes down. I mean, it's worth the money but if you can save a little and spent that extra $5 on a new pack of strings, that would be even better.(I give it 4 stars and not 5 simply because while I have not played other ukuleles, I am certain that there ARE better. That's just how it is. The more $ you spend, the better. But this is definitely pretty solid over all for what it is and how much it costs!)", "id": 589}, {"review": "Cheap, quick and easy. It serves its purpose and it was so inexpensive it's almost painful. I haven't had it break and it doesn't cause any issues with the instrument, so I'm more than content with this handy, inexpensive capo.", "id": 808}]