[{"review": "I can now say I have used several others - coated Martins, flat wounds, smooth wounds, EXP, Elixir, etc. These are pretty cheap and sound like a million bucks. Their tone is slightly bright but not as &#34;harpsichord&#34; as the EXP. I am done experimenting. These are the strings for Takamine guitars.", "id": 198}, {"review": "These are very good quality in spite of their reasonable price. I love the flat, low profile, right angle plugs. My only complaint is I needed some in varying lengths (like 15&#34;) and so I had to order the Planet waves kit to make my own to finish the pedalboard.", "id": 207}, {"review": "I use this on my Takamine and my Tele. It is easy to use, applies the right amount of tension and looks very cool. You can leave it clipped on the headstock when not using it. Cheaper ones will work, but I wanted to try it out. I do like it", "id": 266}, {"review": "I bought a Pedaltrain pedal board and I have 6 individual stomp boxes that are crammed onto it. I originally bought Hosa connectors and they are high quality and have a low profile, but the selection of lengths is limited. I bought this kit with a little trepidation and proceeded to re-do the board. I swear I was done in 20 minutes!! The board looks awesome with all the cables cut to perfect length. These cables are dead silent and the connectors are high quality. The supplied cutting tool works as described and the only thing you need is a small-tip, flathead screwdriver with a medium size handle so you can firmly drive the locking screw into the cable for the final step. I could have saved some money if I had just bought these first instead of a bunch of random length patch cables.", "id": 312}, {"review": "Just a bag for my guitar stand. No big deal, but it sure makes it easier when I have all that stuff to lug around. I love my Hercules guitar stands, but they a don't like to stay put when folded up. This takes care of that problem for a couple of bags. Sturdy material, nice draw string to close it up. Shoulder strap works just fine. Glad I bought it.", "id": 403}, {"review": "This issue with this bad boy is not quality, features, or design. This is a Pedaltrain product, and just like my Pedaltrain 2, this is a well-made, perfectly designed board that does exactly what it claims it will do -it holds 50 freaking pounds of guitar effects stuff. And that, my friends is the problem.I am using a Voodoo Labs 4x4 power supply, but had to also get a Tripplite Isobar, 6 outlet power strip that I drilled into the upper left corner to handle a couple of the extra pedals. I plug that into the wall and then use a homemade 8&#34; iec power plug in the Voodoo. On the pedal I was able to fit 2 Jim Dunlop volume pedals (one is for the looper), a Crybaby Wah, TC Electronic Flashback X4, Sparkbooster, Mojo mojo overdrive, Corona chorus, Hall of Fame Reverb, Ditto looper, and the Shaker vibrato. I also have the MXR flanger, Helicon Harmony pedal for vocals, a Korg tuner and an Electro Harmonix Pulsar tremolo.(I know, I know.)Did I mention this sucker is big? I feel like they should name it the &#34;pedal porch&#34;. Maybe I can put a few potted plants on it.So getting back to the question of whether or not you should get this behemoth, I will ask you, to ask yourself, &#34;Do I really need all these pedals? If the answer is &#34;Hell yes, I deserve them all! I worked hard for them and can now make awesome sounds!!&#34;, then by all means knock yourself out. Just don't get a hernia lugging it around and make sure you book venues with appropriate stage space. No joke.", "id": 489}, {"review": "Bought several of these and they worked fine. I later moved on to Planet Waves for my custom pedal board because I could get the lengths perfect.", "id": 494}, {"review": "This tuner works great. I put in a 9 volt battery a couple of months ago and it still is going strong. It will take a 9 volt output from my power supply and I can then piggyback to another pedal, which is great. It is very, very accurate and does not get confused under normal conditions. You do need to hit only one string at a time, however. Size is perfect for a pedalboard small but still quite readable. Price is very good. I had a Boss in the past but took it back because it just seemed so overpriced and too complicated.", "id": 504}, {"review": "I bought this for my hercules fold up stand and it works great. There are 2 light sources and each has a choice between 1 or 2 lenses for brighter or softer light. The plug-in accessory is great, and my pedal board has an outlet. It runs fine on batteries also. Very pleased.", "id": 524}, {"review": "This is the Godzilla of volume pedals. It is a beautiful, massive, piece of metallic magic that appears to have no loss of tone as I run signal through it. It appears to be indestructible. I like that it has a &#34;tuner output&#34; and that the stiffness of the pedal action can be adjusted with a large slotted screwdriver. When a friend offered to sell his for $30 bucks I bought it without hesitation. I now have one in the front of my system and the second is placed farther down right after my Ditto looper so I can fade it out. Volume swells can be done from either pedal with slightly different results. If you need &#34;light&#34;, maybe keep looking. If you don't mind the heft, you will be pleased.", "id": 673}, {"review": "I am not a big user of flanger and my only comparison is with the flanger that is in the Boss ME 70 multi-effects pedal. This unit sounds good and is adjustable. It appears to give a few db boost whether or not you want it. There is no apparent degradation of signal when not in use. There is no &#34;subtle&#34; setting on the flanger, and so when it is on you know it. I think it is pretty cool and I mostly use it on my Fenders when I looking for heavy rock sound with overdrive..", "id": 675}, {"review": "This is one of the best pedals I have on my board. I originally thought the reverb on my amp was fine enough but was enticed to try this. I was very pleasantly surprised with the lovely quality of the reverb effect, which can be breathtaking. The settings are all quite useful (Church, plate, spring, hall, room, gate etc) and then you can adjust the amount of the effect and the delay. There is also a toneprint setting which is nice, but honestly, the pedal already has some many ways to adjust the sound, the toneprint seems redundant. I leave this pedal on most of the time - along with my Corona chorus and Flashback delay. It is part of &#34;my sound&#34;.", "id": 748}, {"review": "I started playing and writing a few songs that were specifically designed to get the sound that comes from a capo higher on the neck.I found that I needed to have a couple of exta capos hanging around and so bought this and the G7th. Both are very good. I did notice that if I had a wider neck (I think i am 42.5 mm at the nut on my two Takamines) the may be a bit short. They work and are cool looking. I have aa adjustable Planet Waves that also works great. Cheaper ones also work", "id": 761}, {"review": "A friend showed up at our monthly guitar club meeting with this and I loved having an on/off switch right at my fingertips. Genius!I bought 2 immediately. The shorter one goes from my guitar to the pedal board and the longer one from the pedal board to the amp. Works like a charm and no excuse now for damaging amps or ears.Two issues to consider. The right angle plug was a mm or 2 short of being able to stick into my Tele and my Takamine. It would not seat properly and would slide out. I had to turn the cord around and use the right angle on the pedal board side, where it worked, but now the switch is &#34;down there&#34;. I don't think Planet Waves is the first connector that I had a problem with that so I dont blame them, but maybe stick with the straight jack if you are not sure. Second issue is simply that these little button-switches are fussy. You have to make sure you have it in the right position by looking at them - feel wont do. (If you see the white edge they are &#34;quiet&#34;)", "id": 32}]