[{"review": "Barring any interference from any other devices or radio stations broadcasting on the same frequency and any manufacturer's defects ... the unit does what it was meant to do. I do however question whether the word \"Pro\" should apply to this system. Although the 1/4 inch mono plug that comes with the receiver offers the ability of plugging directly into most powered speaker systems or to a mixer, the overall quality of the audio brought back memories of mornings standing outside the classroom with my schoolmates and listening first to the national anthem being played and then announcements coming out of the pa system. The signal does experience some fading when the transmitter is moved about. To its defense, it is fighting against a radio music station broadcasting at near band frequency which can be received if the transmitter is off or further than 25 feet away.After playing with the device for a couple more minutes, I noticed that any movement whether I kept the receiver and transmitter stationary and I moved about my home or moved just the transmitter about severely affected the quality of the reception. Even the length of the mic cord, whether wound up or straight or even just gathered around the sending unit had an adverse effect on the sound output quality. YIKES!!! Perhaps its because of the competing signal its receiving from another source which I previously described above. I'm afraid this would not be a very usable and dependable device for my purposes. I'll probably be returning this unit asap.", "id": 267}, {"review": "Works well for my needs. It adjusts and holds whatever microphone I use in position very well. A good buy. I would recommend it for light to moderate use.", "id": 501}, {"review": "Bought two sets. Both arrived together and at the expected delivery date. I had bought two sets of the Pyle Pro PMDK102 months previously which also included a pair of 25ft 1/4\" cabling from an Amazon dealer which arrived without problems. Initially, I noticed only a slight difference in the two models which centered around the way the adjusting clamp allowed for the extension of the center speaker poles. Personally, I think its easier to setup the Pyle Pro PSTK103. Later comparison showed that the PSTK103 is also substantially taller in both the length of the tripod legs and the retracted center speaker pole.However, the way it was packaged severely diminished my opinion on how much the manufacturer really cared about its own products. The paint finish was chipped on several areas of the legs. There were dimples and nicks in several areas of the leg tubing. Why I blame the manufacturer's packaging more so than the way it was handled during shipping is simple ... the tripod legs have multiple connections which protrude from the joints and aside from the use of thin plastic bags to separate the two units laying upside down and side-by-side within the small confines of its included unpadded travel bag within its shipping carton, no other fore-thought of protection to prevent each tripod unit from physically rubbing or banging against one another during transport was afforded. Really, how hard would it have been to just separate the two units within the travel bag with some corrugated cardboard or a strip of expanded foam?!!!On the plus side ... after testing each of the tripod stands ... all seemed to function perfectly well. The units were light yet seemed solid and stable once set up. The price seemed right thought and if the manner of packaging were improved ... I would definitely say that thus far it seems like a great buy. Only time and after some use hereafter will I be able to determine if the unit holds up and is truly a bargain.", "id": 655}, {"review": "I use the gooseneck to position my pop filter over my microphone. It is also sturdy enough to use on my microphone holder to hold my microphone in place.", "id": 176}, {"review": "Arrived on time ... works as intended and maybe more.One day, I was pondering how best to de-clutter my wall receptacles from a glut of power adapters and also my table from a spaghetti of ensuing power cords used to feed various 9V-12V DC equipment on my table or rack. Fortunately, I chanced upon this little gem and in an instant ... my problem was solved. I chose the 12V adapter with the highest rated power output and used that as my primary 12V DC source and this little gem to power all the other equipment on the table or rack. I also bought another similar unit form another source here on Amazon and used that to supply the 9V DC source to power the rest of the units that needed a 9V source. Everything worked fine and I relegated the remaining adapters to storage. Been working without a problem to this day.", "id": 192}, {"review": "I've owned and used this product for some time now and am quite happy with it. I did notice that I had problems with an unpleasant humming introduced one time when using it with powered speakers, but I believe this was more so my fault than that of the unit. I learned that my active speakers did not care for input cables past a certain length. For greater distances, using a wireless transmitter to deliver the mixed sound and its matching wireless receiver connected to the speaker units solved this problem completely. The FX processor works flawlessly just as long as I remember to push down the selector to engage the desired function. Very easy to use. Compact in size. No ability to instantly mute an input device other than to turn down the gain. For the price ... what can you expect?!Soon I will be in the market for an upgrade ... one that has slider controls and the ability to connect to my laptop via usb. I need a few more xlr inputs and at least a 7 band equalizer and compressor/limiter for larger gigs and a fairly large choral group and its accompanying instruments. Just waiting for a good deal.", "id": 369}, {"review": "Great bargain price. 3 great vocal microphones, in its own protective case, with its own holders. Not top end ... but for general purpose use and abuse ... works just fine. Sensitivity and clarity is more than acceptable for my needs. Feels quite solid.", "id": 405}]