[{"review": "This is exactly what I was hoping for. The string cutter works better than expected. It's nice not having to go hunt down diagonal pliers when it's string changing time. The only little issue is that it's a little tougher to spin really fast than the little string winders because of the grip. No biggie though.", "id": 94}, {"review": "I can't write a great review for this. There's nothing to write about. This is a pick holder. It holds my picks. End of story. Price was right.", "id": 233}, {"review": "This is better than a gig bag, for sure, and looks like it could hold pretty much any standard sized solid body electric. Now, it's not padded really well and doesn't look like it'll hold up for more than a few years, but it was cheap. It seems to be slightly off kilter at the hinges and requires some fidgeting to get the lid closed properly, which is why I drop a star.", "id": 324}, {"review": "For $120 you get virtually every effect in the book.ProsTuner works wellAbility to adjust presets on the computerClean sounds are great - especially the reverb. When spring reverb is used with the '65 Fender Twin amp model you can get a really great sounding drip, much better than you'd expect. Delay and chorus are also pretty good.Downloadable presets on the internetConsDistortions and overdrives are pretty meh. Nothing as good as even a DS-1 pedal. Nothing in the same league as a good solid state amp overdrive. And nothing in the same universe as a good tube overdrive.No permanent preset. In other words, it'd be great to have a clean channel that you could double tap to from any other preset. No dice, so you have to program the same sound into multiple preset slots. That makes what seems like a lot (60 slots) get filled up pretty fast.In the end, it's definitely worth the $120 I spent on it. I recommend this if you're in the market for one.", "id": 590}, {"review": "This capo will not work on a guitar with a thicker neck, for example a les paul or most acoustics. For thinner necks, like a strat or tele, it works ok, but has to be positioned just right to prevent string buzz. It's not the ole clip it and go capo I'm used to. I bought this to have a capo I could just leave clipped on my acoustic's head for use when needed. No dice. Neck too thick. It's a Washburn dreadnaught. We're not talking some funky 7 string jazz guitar.Bottom line: It's cheap as dirt and you can make it work if you don't mind having to place it just right. My advice, spend a few bucks more and buy one that's easy.", "id": 603}, {"review": "This is my new favorite tuner. Not only can you just clip it to the head of your guitar and leave it there permanently, it works like a champ. I don't mean that it works, I mean that it works better than any of my other tuners. It is SUPER tight. It recognizes pitch differences that my ear can't, leaving a better tune than my RP255 or any of the old cheap korg tuners and the like I've got laying around.I plan on buying these for all my guitars.", "id": 818}, {"review": "I've been using primarily Alchemy strings for years but just got tired of spending so much for them. I figured I'd try some others at half the price and see if any stack up.These were the first to go on, and they were a HUGE step down from what I had on. The strings I took off were probably two months old an had spots of corrosion on the high E string. They were twice as loud as these. When you take these out of the pack, they sort of flop out like wet spaghetti. They don't do the fast unravel thing that strings typically do. The cons definitely outweigh the pros here.Pros:-Very flexible, string bends are easy-Easy on the fingersCons:-The most dull sound of any strings I've ever heard. Especially on the low end. They're dreadfully lacking in rich low end sound. The highs are very tinny. Almost sounds like a bad recording.-Your fingers stick when you try to slide down the strings. It's the weirdest thing. This is especially true for the G string. It's hard to explain, but it's kind of like rubbing against something really clean, where your hand does that skipping sort of rub and there's tons of squeak to boot. Anyways, it sucks. Grip is the last thing you want on your strings.Bottom line: Unless you have some wicked arthritis and just have to have super easy to bend strings, these should not be purchased. I'll never buy again. This is the first time in my life I wanted to change brand new strings.", "id": 613}]