[{"review": "This guitar is very attractive looking, and plays well right out of the box.  I am a beginner guitarist, so please take this review for what it's worth.  I am extremely pleased, and don't plan on ever upgrading.  This guitar is a darker cherry red wood color in the center than shown in the picture.  So expect it to be a different color than what you order.  See customer pics.It comes with strings installed and almost tuned.  The volume knob is well designed for smooth and convenient use.  The tremble and rhythm switch is far enough out of the way that you're not going to accidently hit it while strumming.  My only gripe is that the high E string gets caught on the top pickup when I'm playing hard, but maybe I'm just a novice.  I will say that it's very easy to play.Everything on it is very adjustable which I also like.  The only BUYER BEWARE statement I can think of is: you're going to be addicted to it!", "id": 31}, {"review": "This bag fits my Epiphone Les Paul II electric guitar very well...but no room to spare.  The outside pocket is too small for sheet music, but works for small things like a tuner and short cable.  I prefer a bigger pocket, but aside from that I can't complain.  This gig bag looks really sharp, and has two shoulder straps for convenient carrying.", "id": 51}, {"review": "I had been having lots of trouble with my guitars falling from the leather ended straps.  Not any more.  These locking ends are the ticket!  They are quick to release and adjust, and fit very well.  They are bulky when putting the guitar in a case, but I just leave them on.  The strap itself is plain, but it highlights the beauty of my guitar.  It's a must for any rambunctious guitar player.", "id": 208}, {"review": "This is a great little addition to my guitar because otherwise picks end up getting lost everywhere.  One note: this does NOT come with any picks.  One customer said it did, but mine did not.  It has a sticky pad on the back, and sticks well to a wood guitar.  I even moved it once, and it still sticks fine.  It is spring loaded so that the top pick easily slides out.", "id": 233}, {"review": "This cover does not fit a full size acoustic/electric Hohner guitar.  I measured the whole at 3 7/8&#34;, but this cover does not even come close to fitting!  It measures 4 1/6&#34; in diameter, so check your guitar closely!", "id": 497}]