[{"review": "There are other rack screws out there, but Raxxess makes the best quality screws and soft washers available.", "id": 22}, {"review": "On-Stage makes decent products, but this one would have been awesome if the actual table of the stand would fold one or more times. That would have been perfect! Otherwise, it works fine.", "id": 155}, {"review": "This clip does the same thing that the Hercules guitar stands do: Lock your guitar in place so you don't have to worry about it dropping or falling off the hanger. The auto-close function on the hanger is the best part of this hanger. Simply lift your guitar and it lets go everytime.", "id": 289}, {"review": "This is an awesome way to get into the in ear monitor game without dropping hundreds of dollars. Adjust your volume of the main mix, and adjust your instrument/mic level relative to the mix without affecting the main sound or your band mates feeds. Perfect for that singer or musician who is constantly asking for &#34;more me&#34; in their monitor. You can also use this to control a floor monitor if you want.", "id": 383}, {"review": "Do you have a Hercules guitar stand? Then this will make transporting it easy. It seems like a gimmick, but I have two stands and it's nice to be able to grab both of them by using the bag straps, and still be able to carry more gear with my other hand.", "id": 403}, {"review": "I use this to practice at my computer to keep from disturbing my wife when she is studying or my daughter when she is sleeping. Great little box!", "id": 418}, {"review": "What more can I say? GLS makes a great product for musicians on a budget! These cables are solidly made, affordable, and really easy to differentiate on a mixer. I have become a fan of GLS!", "id": 424}, {"review": "These are great xlr cables. We run them form our board to our mains and they are excellent! I have several gls cables and have zero complaints.", "id": 426}, {"review": "No cable noise, works well with pedals that don't play nice with other right-angle plugs (like the original line of Aguilar pedals). Great little product, and I would buy them again.", "id": 578}, {"review": "Let's' be very clear from the start: The pedal board and the carrying bag are excellent quality. The board is solid, and the bag is very well made and will last a life-time. As other people have pointed out though, Pedaltrain must have outsourced the decision to locate the strap D-rings to someone who has never carried anything over their shoulder. The only reason this is not a 5-star review is because of the D-rings. That being said, don't let that detract you from buying this. I just feed the shoulder strap through the carry-handle and it works well enough.", "id": 588}, {"review": "Both of the stands had parts that had fallen out, or were missing all together. When the pamphlet that comes with them states that they are fully assembled and guaranteed to be free of defects, this is a major concern. It may be that I got a bad box that got missed by quality control, but it does make me suspicious of Pyle products.", "id": 655}, {"review": "I bought this because I had a new baby at home and this allowed me to practice without rocking disturbing her. It's affordable, and does the same thing as more expensive adapters", "id": 710}, {"review": "This little guy worked just as advertised. It's a tremendous tuner for gigging or practice when you forget your tuner or dont' feel like bringing it. It won't work the best for getting intonation right, but it hits regular tuning perfectly. Super easy to use and a must-have for anybody who gigs out.", "id": 799}, {"review": "These guys are rock-solid and really easy to install. Any time I get a new instrument I change the stock buttons out for Dunlops!", "id": 44}, {"review": "This is hands down the best guitar stand on the market. It will last a lifetime and never drop your axe. I have two of these plus a wall mount hanger for my basses and I love them all!", "id": 337}, {"review": "I put this on my Fender Jazz Bass after I bought a new neck for it. This plate work the exact same as the stock plate, but it dresses the bass up a bit. This is not a mod that people will see (like pickup covers), but I like the way it looks when I pick it up to play.", "id": 475}, {"review": "I like this power supply, but I wish that the LED's only turned on for the channels that you have a cable plugged in to, so for that reason I'll give it 4 stars as opposed to 5. The quantity of power outlets and the amperage's that it provides are best in class.", "id": 852}]