[{"review": "This is my second SM48 in 25 years! What's the difference between the 58 and the 48? The 48 is made in Mexico. There is a noticeable difference in tone with the 48 with the on/off switch. (I did not buy that one) If feedback is an issue in your practice space, get the one with the switch, otherwise opt out for better clarity.I say go for it!! Save $50.", "id": 75}, {"review": "I use this One Spot Adapter with the 5 pedal attachment. Works perfectly! I've seen reviews about this brand being noisy. I suspect this to be happening with the 8 pedal version. Too many for one simple 9 volt source to handle.I've owned it for a couple of months, used it at home 5 days a week and rehearsed at high volumes about a dozen times. Zero hum or buzz from the unit. I should also mention that I do not have any drive/distortion pedals on my board.", "id": 191}, {"review": "What can I say? It does what it should.  5 pedals on a chain runs safely without crazy hiss and hum on my rig. Of course, if you're running a chain of drive/distortion pedals, you're asking for it.Works great for me. Zero complaints.", "id": 192}, {"review": "I bought this pedal to give my single coils some heat. It does that (my dial is set at 10 o'clock). However, I could see a tone purist really bothered by the the mid range coloration from this pedal. In live/practice situations, at high volumes, it doesn't bother me much. In the studio, I won't use this pedal for that reason. It was the right price for me, right now. If you want transparent boost, you gotta pay more.One more thing... a boost pedal really shines when it's running to a tube amp for that extra something. I don't think pushing the input of a digital amp is a good idea for sound's sake. Just a thought.", "id": 365}, {"review": "5 feet is a weird length for a cable. It really only has one use: When you're sitting right next to your practice amp. Just don't wander too far off! This cable is perfect for a kid who is going to his/her guitar lesson and has to plug in.I bought two of these for the home studio to jack in a guitar with a pedal or two in between. I feel chained to my workstation. Just my experience. Get a 10 foot and be free!Hope it helps.", "id": 419}, {"review": "I recently acquired a Vox Valvetronix AD100vt combo amp from my local Music shop. I use this amp mainly in the Modern UK preamp setting for most of the music I play. When I tried it at the shop it sounded great. Of course, I couldn't go stage level in the shop, so I couldn't really get a feel for the sound.I took it to practice the next day and was really put off by the floppy sound of the low end when \"chugging\" on the low E. So I went about experimenting. First, I converted the combo amp to a closed back speaker cabinet instead of the original Vox open-back design. Small improvement, but not close enough.After couple of weeks, I also noticed some volume variations as I played. With a little research, I found that it is one of the signs of a bad tube. I did a little more research on the 12AX7 tubes and found that they are not all created equal (of course) and was looking for one with tighter low end. This one came up in the specs of doing just that. (I believe it was x[...] where I got that info)I got the tube this morning put some gloves on an went about switching out the tube. (YES. TREAT THESE LIKE HALOGEN BULBS. THE OIL FROM YOUR SKIN WILL CREATE HOTSPOTS AND DAMAGE THE TUBE QUICKLY) I pulled out a GT Groove tube from the amp. I was totally surprised! Groove Tubes were THE tubes to have in the late '80s. Now a days, I read they are rebranded Chinese tubes. So sad.Anyway, total tone improvement. Got the bottom end I wanted and I had to make some significant eq adjustments from my original settings and easily nailed the tone I was so looking forward to.", "id": 514}, {"review": "I bought this pedal mainly for compressing the bass guitar in my home studio. It does what it is supposed to. I'm no master of compression, but I get a very usable, controlled signal from it. I noticed some hum when I turned the level up pretty high and that should be expected. I paid less than $30 for this pedal and that should be a factor when you're considering durability of this pedal.My bass player uses this pedal going into an SVT classic. No noticeable hum at &#34;concert&#34; level.Yes, this pedal is made of high strength plastic. If you are an angry stomper, go elsewhere. This pedal will not survive your overzealous foot.Battery changing... Yes, it's a pain in the butt. Two pens are required to push in the hinge pins to release the battery cover (the footswitch, itself). I bought a power supply, never looked back.So if you are on a budget, or NOT one of the lucky ones with an endorsement deal with a boutique pedal co., This should do well for you.", "id": 645}, {"review": "Got this to put into my Pseudo-caster project guitar. Love it! Be warned, it does NOT come with springs, claw or trem bar. If you order this, get the tremolo bar for the Mexican model. The threads are smaller on these.If you like to do &#34;dive bombs&#34;, you will need to grind a bevel on a small portion this massive sustain block. It will hit the back of the cavity before getting anywhere near absolute floppiness.Last important note... Make sure you measure your outer pivot screw distance. If it matches spec on this Trem, all the screw holes will match up.", "id": 677}, {"review": "I liked the string spacing on these nuts. You ~could~ just drop it in and play but you will soon realize it will need some refinement. My open B and E strings, with somewhat aggressive picking, would buzz like a sitar. This was corrected by filing the slots with a back angle towards the tuners. Some additional filing will be needed to remove the sharp edges. The base of this bone nut does NOT have a radius. So if your nut slot is radiused, you will need to have it done or you will have poor sustain and possibly crack the nut in half at string tension. This is more common in vintage guitars, though.My guitar's sustain was definitely improved with this nut. I highly recommend it!", "id": 857}]