[{"review": "I've been using Elixir strings since Gore first made prototypes over 10 years ago. I use both electric and acoustic. The product performs exactly as they guarantee it will.  Every once in a while I'll get a &#34;dead&#34; string. I'll just call the customer service number and they will replace it free of charge. Same thing with strings that break while tuning them up.", "id": 104}, {"review": "I'm using the guides to replace factory guides on my Strat and Tele. They will require that I drill a shallow hole to seat the guide properly. I hate drilling holes in guitars but it has to be done.  The quality of these guides is not what I expected. They are cast and plated and have some rough edges to them. If you want a very clean looking finish I would look for a higher quality guide. At this point I'm not even sure that I will use them.", "id": 115}, {"review": "Pickguard screws. The screws are not very tough and you have to be gentle with them so that the screwdriver doesn't bugger up the heads. They are not high enough quality that they can be put in and taken out more than a couple of times before they become worn.", "id": 215}, {"review": "This is a great low cost stand that accepts both acoustic and electric guitars. The cradle and neck height are both adjustable enabling a variety of guitar sizes to be used.  While it doesn't fold up small like a portable stand, it serves well as a semi-portable stand and is very good as a stationary stand.", "id": 258}, {"review": "These replace the OEM tuners exactly without requiring any modification of the headstock. They look fine. When I get the guitar back together I expect that they will work properly. Delivered on time as promised", "id": 387}, {"review": "It looks fine but as other reviewers have pointed out is thinner than the OEM plate that came on the guitar. Some people mentioned putting shims behind it but a better idea might be to cut the ends of the neck screws down by an 1/8th of an inch so that you don't screw the neck screws in too far.  The plate was delivered on time and as promised by Amazon.", "id": 475}, {"review": "What's to say?  It's not a high end capo and for the price I can lose it ( like most of the other capos I have owned).  It's not a high quality capo and it does take a few adjustments to get it seated properly.", "id": 25}, {"review": "This combo string winder, peg extractor and string clipper serves all three purposes adequately. It fits easily into a gig bag and is light and easy to handle. It is inexpensive enough that I have one in each of my gig bags and cases. In some ways it's like a bic pen, it's cheap enough that if you leave it someplace or lose it you can replace it.", "id": 94}]