[{"review": "...is a must if you have any of the Danelectro/FAB pedals.  As anyone who has one of these pedals knows they eat 9-volts like candy, this is the solution.  You get one of these and hook it up to a power splitter (Search for Visual Sound One Spot Multi-Plug 5 Cable) and you are good to go for up to 5 pedals!  No more battery swaps, no more searching for a 9-volt every 5 minutes...", "id": 40}, {"review": "Great strings at a great price.  These strings have a nice sound to them and they aren't the flimsy little strings you normally get for you guitar.  Nice sound for a nice price...", "id": 156}, {"review": "...thing is great for multi-pedal use!  This is a must if you have any of the Danelectro/FAB pedals.  As anyone who has one of these pedals knows they eat 9-volts like candy, you purchase the power supply (search for Danelectro DA-1 9.6V AC Adapter) and this cable and you're good to go for up to 5 pedals!  No more battery swaps.", "id": 192}, {"review": "...strings I use D'Addario strings on my acoustic and electric guitars as well they are great.  They have a really nice sound and don't cost an arm and a leg...", "id": 197}, {"review": "Great little pedal, economical and worked flawlessly.  It didn't have a power supply or battery included, for a low price what do you expect?  Besides batteries aren't that expensive.  Cranked out a nice distortion for my Fender guitar.  Great product.", "id": 280}, {"review": "I got two of these for my electric bass and rhythm guitars.  Great little stands at a great price.  They are sturdy, easy to assemble and adjustable.  I'd suggest this to anyone needing a guitar stand.", "id": 310}, {"review": "for connecting pedals in tandem, got two of these three packs been using them for quite some time and not one has failed yet.  Nice value as well.", "id": 578}, {"review": "I was expecting a so-so mike for the price, boy was I surprised!  This mike is great.  One thing I did notice was that if it wasn't fed into a mixer you need some low impedance filters to keep the thing from buzzing, other than that it works great.", "id": 213}, {"review": "Needed a mixer and figured it was worth the risk to try this inexpensive mixer.  It is limited in what it can do but it does the job.  I'm rapidly becoming a behringer fan.  The three points mentioned in another rating (Inputs should be out the back, needs rubber feet, and the led) are spot on.  I'd also like to see another set of outputs on it as well.  It could also use being a tad bigger, they jammed everything into such a small area the knobs are a little close together.  The LED for the power on this thing is so bright it's obnoxious, it almost blinds you.  Other than that its a great and affordable little mixer that does everything they advertise...", "id": 367}, {"review": "Like most of the other Danelectro pedals this one has a great sound and in this case a fairly inexpensive price though it is higher than most of their other pedals.  Once again though get the AC-DC adapter for it as it'll put you in the poor house supplying 9v's to it...it eats them like candy", "id": 716}]