[{"review": "How do you review an SM58?? I've used these most of my life, and will continue to. Very durable, I got this to replace the same, a 20 year old, rusted / dented grill 58 :) I also use a D5 (AKG - same price) and a line 6 wirelesss, but the 58 is always reliable first choice or backup.", "id": 20}, {"review": "Sometimes I have to run a longer cable to a snake if I'm doing the big band thing. Otherwise, I use this cable at every show. Love it.", "id": 47}, {"review": "This has the largest top of any of my stands, and it is the one I use when traveling / gigs. The top doesn't fold like some of the more expensive Stagg  Hercules stands, so if you're using it for gigging, that may be something to consider. I have to lug an 88key weighted piano around, so don't mind lugging this.", "id": 155}, {"review": "I have two of these now, and they may be my favorite. Had another brand that stopped working and replaced with this. The other one was not \"bad\", i lasted probably 10 years. What else to say? It's a sustain pedal and it's a good price and free shipping in most cases.", "id": 251}, {"review": "I actually like this bench a lot. It fits into my gear back (rolling duffle style) that contains my cables / power strips etc., with only the folded legs sticking out of the bag. I have the KT7800, which is much larger seat area, and easier to adjust. Depends on your preference I suppose, this one is smaller / lighter, the other is larger / easier to adjust.", "id": 306}, {"review": "This is my third bench and seems to be the best of them. Quick to set up / tear down / adjust. The bench is also larger than my others. Very happy for the price. 4 different height adjustments.", "id": 362}, {"review": "Second time buying the 6 pack - great deal for the price. I love having the colored cables makes set up so easy. I also like the XLR connectors on these, haven't had one go bad yet.", "id": 424}, {"review": "These are great,  have 3 of them now. I use them when I play with my duet and sometimes with the band. Used to plug in, but the batteries last a good while so I rarely use the cord anymore (there are enough cords in my life). I use a 3 ring binder with lyrics and fake chords, these light up everything pretty well. Only complaint - the clip isn't the best, but it's never fallen off or anything like that. Will but another one if any of them die, great product.", "id": 524}, {"review": "The stand seems sturdy, the base is like a tripod base of a mic stand, so it may hold up better in the long run than my other stands that have the \"clamping\" type of base. The top of the stand is shorter than my others, not really a problem but worth mentioning. The only gripe I could have with the stand is that the top takes two screws and two wingnuts, so it is not practical to use for gigging / setting up / tearing down. I will leave this one in my studio and use the others for shows. For the price, very sturdy and seems to be nice quality.", "id": 696}, {"review": "This is a pretty good stand for the price, I ended up leaving this one in the rehearsal room as I prefer the telescoping booms. I have the Dr. Pro telescoping and a samson telscoping, the samson is my favorite (think the model is BT4). For the price this is a good value.", "id": 279}]