[{"review": "Like most products on the market, depending on where and how the item is used, your experience may vary. For me, this cable is going to be used on a semi-stationary mic stand in my project studio, and thus far, it's done nothing but an exceptional job. I tested the cable with a few different mics and in each scenario, the signal was just as strong as the some of the other, more pricey cables out there. Would I purchase this again? Absolutely!", "id": 21}, {"review": "Some will argue that these are not necessary for your monitors, however as somebody who has worked in music for more than half their life, I can assure you that, whereas they're not life or death, they do make a significant improvement on the listening process, especially in your project studio. No, they're not going to make your music sound any better, but they will give you a more detailed and accurate bass response when your monitoring. Even cooler is the fact that the pads come with 2 extra pieces of padding that will essentially let you customize the position of the monitors in that you can angle them up or down ever-so-slightly. Lastly, although my monitors fit perfectly on the pads, I can't help but to think that if my monitors were any larger, I would need a second pair, especially if they were positioned horizontally. All and all, overpriced or not; they really make a world of difference.", "id": 57}, {"review": "Besides that fact that they are quality cables, the colors are pretty dope and really stand out nicely in the studio.", "id": 440}, {"review": "I'm not a ukulele player, nor do I pretend to be one, but I am guy that likes to make music and I can happily say that the Mahalo U-30GN is a perfect addition to my instrument collection. Worth noting is that you will need to tune the ukulele each time you play for the first few weeks until the strings are &#34;broken in&#34;, but from what I've read and gathered, this is par for the course. Lastly, if you're going to order one, I suggest pairing it with a pack of felt picks. Cheers!", "id": 589}, {"review": "These are your basic speaker stands for PA systems...they're functional, durable, and can be set-up within just a few seconds. I would have given this a higher rating, however upon receipt, one of the stands would not lock into place and kept sliding down regardless of how tight I had set the tension. While inspecting the bag, I found a hard plastic block which looked like it was part of the aluminum tubing of the speaker stand. Further inspection confirmed this as this 'block' was indeed part of the tube, and after several minutes of wrestling with it, I was able to get it lodged back inside. The block was part of the tension &#34;mechanism&#34; and once it was forced back into the tube, the stand(s) performed flawlessly.", "id": 655}, {"review": "Aloha friends! Simply put, if you have a ukulele, then these are the picks that you should be using. Cheers!", "id": 775}, {"review": "I was a bit skeptical on purchasing this pedal based on some of the reviews here, however most of the problems seemed related to using it as a volume pedal as opposed to an expression pedal. I only wanted this so that I could pair it with my RE-20 to control the intensity, and in that aspect, I can confirm that it works/pairs flawlessly. My only complaint is that the pedal seems to be extremely sensitive. For example; I tested using it as an expression pedal to control the filter of a VST synthesizer, and it was recognized and mapped without issue, but rocking the pedal ever-so-slightly would cause erratic movement on the filter. This is the same behavior that I have when connected to the RE-20, in that the slightest pedal movement will make the intensity or repeat rate to jump in a fashion that's anything but gradual. It's not the end of the world, but I was hoping that the movement would have been a bit more precise.", "id": 212}, {"review": "I picked this simple interface up back in 2007 and I can attest that it still works flawlessly after all these years! It's been gigged, dropped, and even rained on, however it still sounds great and functions perfectly. I was using this as my laptop interface and when combined with the free ASIO4All driver, I was able to get anywhere between 5ms and 10ms latency. Under Windows 7, it was plug and play with the default WDM driver, however to really take advantage of capabilities, you'll want to install ASIO4All, especially if you're using Ableton, FL Studio, energyXT, etc. All and all, the UCA202 is pretty limited, however it does allow you to easily get audio into and out of your PC. For the functionality alone, it's definitely worth asking price!", "id": 384}]