[{"review": "First of all, I use this as more of a 6 band EQ using the lower and highest more for LP and HP filters.  The middle four have the most dramatic effect on the tone.  You can also use this as boost box, using the gain and volume sliders.  The box is solid and fairly easy to manipulate on stage, but I tend to set and forget.In reviewing other posts maybe these bullets may be helpful.-If you turn your gain way up, you will have hiss.  Period, this holds true for any effect box or amp that has a gain on it that I have been exposed to.  Have a reason for upping your gain, if it is to add volume consider doing this on your guitar or amp.-EQ is to ENHANCE your tone, not create it!  A Strat cannot be made to sound like a Les Paul and vice versa.  Your tone is made up of many, many variables.  The resulting tone can be SHAPED or COLORED by adding or subtracting certain frequencies.  That is the function of an EQ, nothing more.  IT can range from dramatic to very subtle.  Very small changes can have large effects.  Small bumps in the higher range really enhance the harmonics I am able to produce.-I tend to put the EQ in much later in my effect chain, but feel free to experiment.", "id": 140}, {"review": "I had high hopes for this replacing my pedal board but there are a couple of things I don't like about it.  It has a button clip on the back which is non-removable so makes it all but useless if you don't put it on your belt.  I don't know about you but wearing something on my belt with two 1/4 inch cables is quite a feat.  Add to that possible lines for headphones and an a/c adapter and you look like OctoMan.And what possible function does the kidney bean shape make other than making it odd to put down anywhere with the belt clip sticking out.  The menu is accessed by using a 4 position finger pad.  The main rotaries on the front have two functions depending whether you are holding another key down to access the second set.  This is extremely difficult to do if you need to switch between settings in a live environment.  I have had multiple mistakes and frustrations.IMHO the POD really belongs on a desktop for DAW recording.  It doesn't have much value on your belt clip.  Still have my effects rack.", "id": 427}, {"review": "These are pretty good quality tweed cables.  I prefer the tweed, they seem not to tangle as easy and they are usually very easy to identify at gigs.  They also make one with the 90 degree 1/4 inch input as well.", "id": 586}, {"review": "I must say, in the beginning I was not thrilled with the product.  The coloring that it adds is relatively subtle unless cranked, however after using it for several weeks then not using it, I did notice a difference.  I found that using it as a gain input to the distortion pedal results in some very warm sweet sounding crunch :-)  very nice.  The type of coloring is available through a dip switch, which I guess is ok.  Not highly accessible though.  All in all this has stayed in my effects chain between the wah wah and the distortion box.  I normally leave it on and use the stomps available on my distortion pedal.  No plans to remove.", "id": 643}, {"review": "I love this stomp box although I never stomp on it :-)  Needless to say there are a wide variety of reverb available to you.  My amplifier doesn't have reverb so I route the effects send to it and leave it on.  It has just become part of my guitar tone now and wouldn't think about playing without it...", "id": 748}, {"review": "Being a musician I wanted something easy to bring with me to catch the jams.  With the support of this little recorder I have about 95% of what I have played over the last year available to me.Sound Quality - there are many options to select from, sample rate, type (mp3, wav) and a number of other options.  I have mainly recorded wav at 192, when I am done recording I normally will edit it in a DAW and then convert to mp3 for storage.  I would say the audio is good, not great, but certainly right on for what I am doing considering the price.  Power is about 4-6 hours of continuous recording.  I can fit about 3 hours on high quality on the Gb card.  This is usually a little more than I require when jamming.  I have used the USB power when available and that has performed well.I have been pleasantly surprised with the audio levels.  Many times at a jam  you don't necessarily get to pick an appropriate vantage point to record everyone equally.  Several times it had to sit next to the drummer, or on the stairs or on the window sill in one case, and I was worried about being able to pick up all the instruments, but on the default settings it seems to pick everyone up and not get saturated.  One instrument may be louder than another but then I tweak it adding compression and eq as necessary to further enhance.The only times it has failed has been I didn't have enough battery, I didn't format the card and it ran out of room or I forgot to press the record button TWICE before recording.  The first arms the track, the second begins the recording.  For the price I bought two and just keep one in my guitar case...  I have not had reason to use the line in for the recorder, just the external mics.", "id": 750}, {"review": "I was doubtful this would work but it will give you a fairly accurate reading of all six strings at once.  I do like that the volume is reduced when you switch it on.  The only issue I have noticed is that some strings it will read as slightly out of tune (1 red bar) but when you go to individually tune it you sometimes fine it is not flat.  So for me it is a quick check while I am in between songs, anything with 2 bars or more will get more attention.", "id": 889}, {"review": "Definitely provided extra gripping surface.  The pick extends out from the rubber 'shell'.  Obviously the thin pics were thin and the thick ones were a lot stiffer.  Since you have the shell they are a bit thicker than a normal pick which may have to be gotten used to.  I know for me I prefer to grip the pick really close to the tips for harmonics and on these your fingers definitely don't slip but it's a bit more pic than I want.  So I do carry and use these occasionally but they aren't my everyday pick.", "id": 503}, {"review": "This looper distinguishes itself by really only doing one thing but doing it really really well at a very affordable price.  To record you simply press the button and the led will turn red, continue playing.  When done simply tap again and the LED goes to green and plays back.  At any time in the looping process if you want to overdub simply tap the button and record and tap to finish.  No need to line it up with the loop, it places your overdub exactly where you played it in the loop.  If you don't like the take a simple press and hold will erase the overdub. Want to stop and clear (two presses and press and hold) and your back to a clean slate.  I don't know the limit of overdubs but I haven't reached it.  The amount of time for the looping I believe is 5 min so you can record an entire song and overdub to your hearts content.  The tone preservation is excellent and haven't noticed any issues there.  You can get a nice variety if you put this at the end of your effects change so that you can record a rhythm that is dirty and crunchy and overdub and record, then turn off your distortion and overdub a very nice clean lead over it.  If I have something I like, I then output it to Sonar to play with some more.Pros- Small, very easy to use (1 level knob and a stomp button), designed by guitarists and it shows, true bypass and plenty of room for recording.Cons- You may consider lack of battery a con, I don't, everything goes on the effects rack and is powered through AC.  No drum track or click track but then again, the aim for this device was to keep is simple, I believe.UPDATE: I was having an issue with the looper one night being able to record but not hear myself.  I contacted support and their response was quick but they basically said it sounds like it is broken, replace at the store which I did.  It worked great then one night again, I couldn't hear myself recording.  I played for about an hour with different configurations, it seems not all 9V AC adapters are equal.  Out of the 4 I have it only liked 2.  When I used that adapter it seemed to work just fine.  So beware if you are having an issue you might want to look at the 9V AC Adapter.", "id": 869}]