[{"review": "I bought this cord after returning a cheap one that I should've known better than to buy. My son, who has some experience as a musician recommended the Hosa brand when I was seeking a proper replacement.I bought it for a small home recording setup which includes a Behringer C-1 Condenser Microphone and a Behringer Xenyx 302 Mixer, and both ends make a reliable connection to both the board and the mic; the sound quality is excellent.An excellent value for the money.", "id": 5}, {"review": "Behringer makes quality products - I purchased the excellent C-1 Condenser Microphone, and replaced the 302usb with the Xenyx 802 mixer board.When I researched items for a simple home recording setup, I saw all of the positive reviews for this smaller mixer, and read the item description here on Amazon and the Behringer website for the C-1 mic included what turned out to be a misleading statement about how it would work with any of the Behringer phantom-powered mixer boards.That was incorrect information - this board receives power only via USB and doesn't provide adequate phantom power for condenser mics (48v).When I setup the return of this board to Amazon, I informed of the error, and the appear to have acted very promptly on it, as the item description for the C-1 on both websites now includes an explicit statement about the need for 48 volts.Although this correction is good, it would be more helpful to customers if Behringer would also correct the description about this board associated with its wording about its phantom power capabilities to state what kinds of mics it will adequately power.I've noticed in other venues (i.e. musician and sound forums) Behringer gets a bad rap. I don't think its due to poor quality equipment, I think its due to frustration about a lack of information provided to customers both before and after the sale. Neither the Behringer website nor the included documentation with the items I bought is adequate for customers like myself who are not sound experts.", "id": 368}, {"review": "Often, we get what we pay for. After researching various pieces of sound equipment for weeks and weeks, I chose solid items for reasonable prices.I should've known better to skimp on what is a critical piece of the puzzle - the quality of the cable. This item simply didn't ever work - it arrived with a bent pen on one end, and even when we attempted to straighten it, it didn't connect well onto the mixer board. The microphone end was a VERY shaky connection with the most intermittent power conveyed to the mic.Don't buy this item - spend the relatively small extra amount and get a more reliable brand.", "id": 556}, {"review": "I bought the smaller Behringer 302usb mixer for a small home recording setup with a budget target of &#60;$125, but had to move up to this model for and additional cost of about $12 due to the fact that the 302usb doesn't provide adequate phantom power for a Condenser Microphone (not properly disclosed by the company). The simple setup I have also includes the Behringer C-1 Condenser Microphone and a Hosa XLR cable.I was looking to improve the quality of voice recordings for podcasts, interviews, etc., over a simple USB headset, without &#34;breaking the bank&#34;. In addition to the positive reviews on Amazon about most of the Behringer equipment, my son, who has some experience with sound equipment said that Behringer makes solid items, but that I shouldn't expect much in the way of customer service. He's helped me work on tweaking my setup and he finds the items I bought to be quality as expected.I'm glad that I moved up to this board, even though it has a lot of features that I won't personally use. I'm glad that this has two microphone inputs, if I do decided to conduct in person interviews using the board. Besides the extra mic input, my son will likely put some of the additional features to use recording some music with his electric guitar and making some mixes using the features in GarageBand.I have found that my son's warning is somewhat correct, at least in regards to information provided for the customer by the company both in the paperwork included in the package and on the website. Since this is essentially entry level equipment, people like myself, who have little / no direct experience with sound equipment could use a little more guidance in using these projects, particularly in hooking things up to a computer, which is obviously an increasing application.I couldn't find any information on the Behringer website or in the paperwork which provided guidance for a Mac user, for instance. In addition, it would be nice if the manufacturer would give some basic information on such items as use of headphones for monitoring, etc. when using with a computer, but they don't. I've done a lot of experimentation in addition to Googling to figure out how to get things up and run.So far, I'm getting quality recording results from this board. I am currently using it with an RCA type cable with the input to my iMac's line-in. I might ultimately try another adapter for a USB connection or Firewire, but I haven't had the opportunity to research what is possible or which of the three options provide better sound. Whether I not I investigate will depend upon my needs in the future.I believe I got excellent value in the equipment quality. I would give 5 stars, but the manufacturer should provide more information.", "id": 782}, {"review": "This microphone deserves the positive reviews it has received. It is very well made equipment, which is readily apparent to a total sound equipment novice like myself. The item as pictured looks different from what I received; it is not the all lighter gray plastic looking body base, it's more of champagne color and is metal and the screw on adapter on the bottom is black (heavy duty plastic). Not sure why the picture is showing that is, because the actual microphone I received is much more impressive looking.I was initially looking to spend ~$125 on a simple home recording setup using my iMac. I ultimately spent about $135 because I moved to a Behringer mixer board that can convey the appropriate power to a condenser mic like this one.For those who are starting out with recording, I recommend this microphone and a quality XLR cord and you will not be disappointed with your results.", "id": 327}]