[{"review": "It works fine for the regular guitars but the bass guitar has these very wide tuning pegs.  This winder has a slot that will sorta fit across this tuning peg but it doesn't feel like it has enough of a grip to make turning it easier.I haven't had a chance to actually use it while changing strings yet, but so far it looks like it'll work as advertised in every other aspect.", "id": 94}, {"review": "I ordered the polyweb strings on the advice of some friends.  They didn't care at all for nanowebs which are widely available, but swore by the quality of the polywebs.  By some sort of mixup I got nanowebs by mistake.  I requested a return to get the proper item, and the seller offered to send me the polywebs and told me to keep the nanowebs for the trouble.  I haven't had a chance to test either set of strings out but I'm sure they'll be great.It's my understanding that the polywebs could practically be the last set of strings you ever buy (with some proper care).  I've been told that while nanowebs last longer than normal strings, they don't measure up to the polywebs.", "id": 102}, {"review": "It arrived in a small package with 3 main pieces in it (the base, the bottom fork and the top fork) and it didn't take much assembly to put it together.  It does a great job holding the guitar upright and makes it look a lot nicer as well.  I will probably buy a couple more of these.The only downside I can see so far is that the foam padding is rather thin.  I hope this doesn't eventually have a hole wear through it, but over time I could see it happening.  I suppose by that time I could find some replacement foam and fix it myself though.", "id": 519}, {"review": "I expected this to be a good mic but it's amazing how much different the quality is over your standard desk mic.", "id": 525}, {"review": "I wasn't sure about spending a lot of money on a guitar since I was just starting out.  I bought this to work with Rocksmith 2014 and it did the job just fine.  The guitar needed some work to get it properly set up since tuning it straight out of the box sounded horrible.  It turns out that the intonation needed to be set properly and also the strings that it came with are garbage.I put new strings on it and fixed the intonation, adjusted the truss rod a bit and adjusted the string height (all with just the tools that they provided with the guitar) and it sounded a lot better. Unfortunately there's no 22nd fret on this guitar.  That probably shouldn't come as a big surprise as a lot of stratocaster type guitars only have 21 frets, but there's this one song that requires me to bend the high e string on the 22nd fret...The single coil pickups have quite a bit of hum on them so for rocksmith you kinda have to calibrate it a few times to make sure that it doesn't pick up much of that hum, or else you resort to using the 2nd and 4th switch setting so that it uses two pickups at once which cancels out the hum.I think if you wanted to try modding your guitar this would probably be a decent choice too.  I haven't gotten that far yet.  I've had it since February, changed strings on it twice (in 4 months) and so far it's proven to be a fairly nice little guitar to learn on...except for that 22nd fret (oh well).", "id": 754}, {"review": "For some reason, when I saw &#34;48 picks&#34; I think of a sandwich baggie full of plastic picks... What I got was a slim resealable bag that's about 1/8th the size I was thinking of.  It comes with Light, Medium and Heavy picks.  Even the Light picks are thicker than the &#34;thin&#34; picks I had ordered before.  I like having the variety though.  This has a variety of colors as well as the thickness.The only thing that could have made this better is if it came with a drawstring on the bag so I could maybe hang it from my strap.", "id": 878}, {"review": "I bought a guitar and for a while used the strings that were provided with it.  After a month of using those strings I decided to replace them since I was having trouble keeping the low E string in tune.  I put these strings on and compared to the &#34;default&#34; strings, it was almost silky and softer by comparison.I'm guessing the guitar came with steel strings and these are nickel. The sound was much nicer to my ears as well.  They were relatively inexpensive and made a great choice for replacing the strings on a new guitar.", "id": 88}, {"review": "It's about the size of a credit card, and half as thick as a deck of cards.  It's fairly light and the plastic feels a bit cheap but it does the job it's supposed to do.  You can either play the notes to the built in mic or connect it directly via a guitar cable.  It has a switch to change between Bass and Guitar, and it accounts for the extra strings on 5 string basses or 7 string guitars.It also has a button to tune it down lower (5 half steps) so you can do some alternate tunings too.Lastly it has a button for &#34;Sound&#34; so that it produces a tone for you to tune something to manually.  The display is very fine and kinda hard to read, but it has lights above the LCD screen to show if it's flat, in tune or sharp, so you can focus on that if you have trouble.It comes with 2 AAA batteries.  I have no idea how long they'll last yet but I have some rechargeable batteries for use in it later.", "id": 624}]