[{"review": "I've got a MXR MC404 CAE for my concert line pedals... but this one is the one I use for local gigs and home use with Fender Telecaster and Hot Rod.", "id": 41}, {"review": "this little guy has help me record with my Apogee One voices and amps, to prevent air-flow shock on diaphragm... wanna have excellent recordings? get one!", "id": 46}, {"review": "After years of using a diagonal pliers, this small and secure to use around top line guitar/bases, this guys just made my #1 none StewMac tool in my tool set.", "id": 94}, {"review": "I always use the 1.00mm for guitar, had to test them with bass strings... they turn out to be great!", "id": 164}, {"review": "After years of playing, I rather choose this small and strong accessory to take care of my precious guitars and basses.", "id": 278}, {"review": "I use this guy with a Fender Twin, since Overdrive sound is not enough for now a days metal. Not much of noise and practical carry. If you really want to go for something a bit more &#34;Marshall JCM900 like&#34;... get a MXR Custom Badass '78 Distortion. For a extreme... get a Riot!", "id": 460}, {"review": "I use to tune with an antique Korg... I saw these baby on the road with Maroon5's James... just make sure your guitar intonation is perfect.", "id": 504}, {"review": "For many years I've been playing with Proel and &#34;Fender&#34; cables... until I start having problems with guitar jacks and connection efficiency. This guys put an end to the problem with high quality components. Best of all, Warranty For Life... or maybe longer.", "id": 587}, {"review": "Got a vintage instrument you don't ever want to see hitting the floor... well, here are is the long term 100% secure solution!", "id": 607}, {"review": "For years I have fell more and more in love with my Yamaha CGX-111SC. Stil, nylon acoustic guitars have this weird sound when played on open spaces without using the piezo (note: change to a better piezo system, LR Baggs are great!), high notes were lost in the thin air covered by the lower notes. I wanted to experiment with this item... result: GREAT!!! I finally got to listen to what I use to heard from the recordings at controlled environments. The sound is richer and clarity makes unique.", "id": 704}, {"review": "I usually stickup to the OverDrive pedals, asking tons of sound from tubes and extra overdrives. Still, I needed a Distortion that could cover of the Marshall sound-like roar JCM-800... and this guy did the job! It's not a Riot, but... pretty much defends its self from the old 70-80s songs. Love it!", "id": 757}, {"review": "I Normally use my KORG foot-switch tuner for my guitar and basses... this guy really had me believing in small-vibration-tuning.Three key words for this: Accurate + Small + InBeat!", "id": 785}, {"review": "I have a Fender Hod Rod Deluxe, and though it's got the Formel Electronics Mod... still needed a nice touch.This guy filled the need! Using the Effects Loop, no need of Volume or Gain, the sound is way much richer and definition for different types of guitars is beautiful.", "id": 140}, {"review": "Perfect for amp recordings and ambient mic. This helps my &#34;Apogee One&#34; to always be in perfect position and far from accidents and drops. Add &#34;Apogee One Mic Mount&#34;.", "id": 224}]