[{"review": "Nice cables.  So far I've not had any problems with them, but haven't put them through a lot of use just yet.  Also have the Planet Waves Custom Series cables that work just as well for less money!  I'll have to see over time which brand out lasts the other.", "id": 126}, {"review": "Nice cables.  So far I've not had any problems with them, but haven't put them through a lot of use just yet.  Also have the Monster audio cables that work just as well, but cost more!  I'll have to see over time which brand out lasts the other.", "id": 195}, {"review": "I have had this stand for over 2 years and still like it's compact transport capability.  Since I purchased mine, several other musicians have purchased the same stand.  It is well built, and can handle heavy music binders without tipping.  I've used it  at both inside and outside gigs without any problems.", "id": 357}, {"review": "Bought this rosin to see how I would like it.  I have a very light hand on the bow, so I like a rosin that is on the aggressive side.  This is not.  Since all fiddlers have their own styles you have to deal with trial & error.", "id": 636}, {"review": "I use this tuner to tune up my violin.  Other tuners I've tried using the vibration setting had difficulty feeling the &#34;E&#34; string vibrations thus making it hard to tune.  This tuner does an excellent job feeling and showing all 4 strings.", "id": 707}, {"review": "If you are looking for a compact size pickup this is it.  I've tried it on my fiddle and a mountain dulcimer.  It is great for a quick way to get electrified.  Lead wire is not very substantial, but if it breaks in the future hopefully I can just buy another one.  To get the best sound you should probably run this unit thru a preamp.", "id": 848}, {"review": "I have difficulty hearing the cheaper units on the market.  This metronome has 2 distinct audible sounds and a flashing light which makes it much easier for me to see and hear the beats.  Works very well.", "id": 390}]