[{"review": "This stuff works great and is well worth the price, I used it to clean the pots on several guitars and a bass amp along with various effect pedals, no more scratchiness, no more jarring volume spikes, all my knobs glide now better than the day they were new, I'll always keep a can of this around, nothing more to say, great stuff.", "id": 14}, {"review": "I have been using GHS Fast fret for over six years and it's amazing stuff, I apply just a tiny amount to the strings before I play and then wipe them down afterwards, I used to change strings every one to two months and now strings can last me a year. It's easy to control home much you put on and one can of this stuff lasts me a year or two, there isn't really any reason to just soak everything with it I don't think, I mainly use it to clean the strings. I'm really glad I found this stuff!", "id": 72}, {"review": "I've tried every gimmicky thing you can imagine and have always gone back to what simply works, these Dunlop Tortex .73mm picks, I've tried different brands, shapes and sizes and they all just get in the way, these aren't slick like some of the others, they stay in my hand and they wear ok (as long as I don't get too wild) and if I ever do drop one they show up super easy on the floor due to their bright yellow color, I would be lost if they quit making these or changed them any, hopefully they don't, these are great!", "id": 455}, {"review": "I own a lot of guitars and have to change strings often enough, I don't really enjoy changing strings but it needs done, this tool makes it such a breeze I don't know how I ever went without it. It takes me a fraction of the time it used to take changing strings, I can have them all loosened and cut in seconds where before I would stand there cranking one tuning peg for what seemed like forever. I am really happy with this purchase and will check out more stuff from Planet Waves.", "id": 94}, {"review": "This capo is lightweight and really tough, it is stiff and takes some strength to open but it stays in place and doesn't damage the necks of my guitars. I've used this on acoustic, electric, 7 string, 12 string, and a lot of 6 string guitars and it always works perfectly. I think it's a really nice tool and it does the job flawlessly.", "id": 116}, {"review": "I've been playing for nearly ten years and I've used all sorts of strings on many different guitars, I've had ball ends pop off for no reason, ball ends rolling around in the bottoms of containers when I've bought them new, and a lot of unnecessary string breakage and fast corrosion, (all top brands) I have also overpaid for fancy gimmicks on strings that are supposed give you magic tones ect. Then I tried D'addario, they just work and work well, I'm not asking for anything magical I just need what I need when I need it and these string have never failed to deliver, I've been using them for over three years now I don't know why I didn't give them a shot sooner, I could have saved a lot of money trying them first. Bottom line is these strings do the job without any drama, giving me more time to just play!", "id": 156}]