[{"review": "Light weight, compact, and all in one tool, what more could I ask for?This tool does three things very well, turns tuners on stringed instruments quickly, cuts musical instrument strings, and helps pull acoustic guitar string pins. What's not to like? Well the cutter part of the tool is a little hard to open - guess I'm used to side cutters or pliers - and it doesn't cut strings really close to the tuning pin - it leaves about a half inch of string hanging. Oh, if you actually follow the three loops of string theory for stringing your guitar (go to the Elixir Strings website and watch the excellent guitar stringing videos from the Taylor guitar factory) your wrist will get a little tired turning the crank for the tuners. The alternative is a battery operated turner that weighs a ton more.I find it very hard to believe that with normal use on stringed instrument strings, somebody could manage to break this plastic tool. The tool is made of sturdy plastic. If abused, trying to cut copper wire, it might break; but the tool was never designed for that use.I've used this tool now for several months and expect that it will last for a very long time. I use this on three different guitars, an acoustic and two electrics (Les Paul and PRS). The pin puller works just fine, I actually put a rag on the guitar body to prevent any dents in the wood. The tool fits inside my hard shell Gibson guitar case. This is a very nice tool.", "id": 94}, {"review": "These acoustic strings are used on a Laguna acoustic guitar. They are just the right weight, and just the right amount of flex. We've tried D'Addario, brighter sound (D'Addario Acoustic Guitar Strings Set, EXP 80/20 Lite), and Martin, a little stiff (Martin Strings SP Phosphor Bronze 12.5-55 MSP4150). In the end, these Elixirs sound and feel best on this guitar.As has been said, there is no perfect guitar string for everyone. The perfect guitar string is the one that feels and sounds right to you on your guitar. For the combination we have, these are outstanding strings.On the strings lasting longer, that's hard to say. Fresh strings do sound better. It's clear that the wound strings do not corrode like non-coated strings. But I'm not certain these last so much longer. We buy them because they sound good and have the right amount of flex to them - playability. Corrosion or crud on the string isn't the sole factor in changing strings.June 15, 2010 Update: Elixir is a wonderful company. On my third or fourth sets of Elixir strings, the G string snapped as my son was tuning the guitar for the first time. Elixir is outstanding, they will replace any string that doesn't perform up to your standard.The other amazing thing - I've watched tons of videos and watched a lot of guys change strings, and I'm still very confused. The Elixir website (it's pretty simple elixirstring dot com) is outstanding. Ther is a two part video from the Taylor factory on how to change strings. I swear that if you follow those instructions, you will change strings in minutes. It is so simple and so reproducible. I love this technique.I'm a huge fan of these strings now!", "id": 100}, {"review": "Simple, compact, well constructed, easy to use, and sounds good; all things you would look for in a capo.This is the original Shubb capo, designed for most acoustic guitars with metal strings. The Shubb website describes the huge range of specific capos they make, each with their own specialized use. The C1 is probably the most universal of all the models. This fits a Les Paul Traditional 08 (Gibson Les Paul Traditional Plus Electric Guitar, Heritage Cherry Sunburst), aPRS SE Custom 22 Guitar, Grey Black with Tremolo Bridge, andEpiphone LP Special II Les Paul Collection Electric Guitar, Vintage Sunburstelectrics. The primary use is for a Laguna acoustic.Follow the simple instruction card included with the capo to adjust the tension. It's key to not get too much tension.We've had trouble figuring out where to park this capo. Mostly it goes in a pocket. Once the capo is adjusted to fit the neck, it doesn't clamp tight on the headstock. Not a huge deal, but a consideration.", "id": 121}, {"review": "The biggest question I ask about these cables, are they worth the premium charged above more normal cables? The key to me is the lower end 100 series Monster cables,Monster S100-I-12 Standard 100 1/4-Inch Instrument Cable (12 Feet). The answer is mixed, and depends on what you are looking for.The cable ends are very heavy, they are metal and do unscrew. In some ways this is probably good, they feel good in your hand plugging and unplugging. The jacks are gold plated and look like they would last a lifetime. On the other hand, the series 100 plugs are a molded plastic end, with a good bit of flex to them, and they are lighter weight. So the choice is, heavy, shiny gold; or light weight, gray/black? For me, I like the heft of these cables.Construction-wise these are likely lifetime cables. Check out the pictures I've posted. The metal housing screws into the jack. There is an O-ring to seal the top portion of the threads. Inside the wires are soldered solidly to the jack, and then the whole thing is cast in solid acrylic or plastic. Unless you run over this end with a truck or pulled really really hard like tug of war, the wire is never separating from the jack. I don't think the actual 1/4 inch jack is any sturdier than other jacks.Sound is excellent. They are clear clean cables. Are they better than the 100's? Oh maybe a tiny bit. Maybe a little clearer, cleaner sound. But it isn't a huge difference.Bottom line, for gigging, probably go with the 100's. The jack ends will get stepped on at some point and they are cheap enough to replace. For practice or in your house, these are probably the way to go. They do look particularly good plugged into a Marshall half stack.These cables are not outrageously over priced like everything else Monster Cable. Study different one quarter inch jack cables and you'll see these are priced very close to everyone else. This is not the case of the HDMI cables at the big box store for fifty times what you should pay for them.", "id": 124}, {"review": "Elixir coated strings were by far my favorite strings for my acoustic guitar. D'Addario has finally made a string that is comparable to and maybe a little tiny bit better than the Elixir's.These are very nice bright strings. The coating is incredibly subtle, almost impossible to feel on the strings. I like that. Compared to Elixir's these are a bit brighter, with good feel.Call me old school, I hate the packaging. These strings are packaged in three two string loops inside a single plastic bag. Ah, you know I'm just so used to strings that are individually looped. Two strings looped together makes a mess while I'm restringing a guitar - when I unwrap that pair, I've got a string that has to sit out unwrapped on the bench. The neat freak in me hates that. I also dislike that the strings are in one plastic bag. Yeah I get it; they are trying to be more environmentally responsible. But darn it, 6 paper envelopes? It feels to me like they are just trying to cheapen up the packaging materials, not some environmental cause. 100% post-consumer recycled paper adds very little to the environmental load.I know D'Addario loves the color coded ends. On my acoustic guitar that's irrelevant, the ends are hidden inside the guitar behind the pegs. On my electric guitars, I don't like the look at all. I prefer gold or silver rings at the end. If the strings are in individual labeled packages, there's no need for the colors.D'Addario loves the color coded end rings so much, they do a horrible job color coding and simplifying their packaging. I have yet to decode their colors or naming system.I normally use 10 gauge strings in my acoustic guitar. I tested these at 12 gauge and am surprised how much I like them. The slightly thicker string is not bad.Oddly these strings are priced almost the same as Elixir's. My reason for using the original D'Addario strings is low price - if somebody is doing gigs nightly, those uncoated strings are the only way to go. Strings end up being changed long before corrosion becomes an issue for the gigging musician. For the home enthusiast, coated strings make a ton of sense, they do last longer. I think they are worth the premium price. Now there are two choices for excellent coated strings.In the end, the packaging, the color coded end rings, the crazy package coding, and the double looped strings all mean nothing once the strings are on the guitar. What they sound like and play like is the most important thing. And in that regard these are excellent strings.", "id": 130}, {"review": "These are excellent, inexpensive guitar strings. They are perfect for somebody that plays gigs and changes strings frequently. For the more casual player, these might not be the best choice.For the gigging musician, there is nothing better than these D'Addario strings. They are light weight, have great sound, and are inexpensive. These might take a very slight nod over Ernie Ball strings.For the more casual musician, somebody that isn't changing their strings once a week, these are probably not a great choice. Personally, I use Elixir strings on my electric guitars, a Les Paul 2008 Standard and a 1982 Gibson Lucille. I do not play gigs, so a set of strings doesn't see an hour or two of really hard playing per night. The coating on Elixir's helps keep corrosion down and is easier on my fingers; I like their feel a bit better than these strings. I get about a month of playing from those strings. Sadly, these D'Addario strings are really only good for about one or two weeks of playing.I've tried a variety of strings, Ernie Ball, Elixir, and D'Addario, on my guitars and the way I play, the Elixir's just sound and play the best to me. Of course, your mileage may vary. If I did start to play gigs, I would probably switch to a more affordable string like these.A silly cosmetic thing, I hate the packaging of these strings. D'Addario makes a huge deal out of reduced packaging and being environmentally responsible with their products. The strings come in a cardstock outer box, with a single plastic package inside. Each string size has a different colored ball on the end to help a person figure out the string gauge. I change strings myself, and I really prefer the individual paper envelopes for the strings, with the gauge clearly printed on the package. If you are new to changing strings, or only change them infrequently, this all in one package will confuse the heck out of you. Especially at first, I preferred to work with one string at a time.D'Addario also makes a major deal out of the serial number on their package to help fight fake strings. Their website has a place to enter the serial number to verify the package of stings is authentic. I kind of disliked the fact that you have to enter an email address to even get started. They could have very simply left a spot to enter the serial number with no other information necessary.In the end, the silly colored balls at the end of the strings, well they look goofy on my guitars. I wouldn't mind the colors on an acoustic (the ball gets hidden by the peg anyway), but those balls are visible on my electric guitar. I just prefer the simple gold balls on the ends of other strings.", "id": 156}, {"review": "This brush is used to remove static electricity and light dust from records before each playing. This is not a deep cleaning, dust or dirt removal brush; it is a compliment to record cleaning solutions like this excellent liquid cleaner by Last (LAST PC Power Cleaner 3/4 Oz.).The brush is super simple to use, with the album on your turntable, hold it at roughly a ninety degree angle for about two revolutions, and then sweep it off the LP. No fuss, no muss, no fooling around. Never touch the carbon fiber with your fingers. When there is visible dust on the fibers, give the brush a good flick by rotating the handle across the fibers. After each use, rotate the handle around to cover the fibers. If you press the brush too hard against the album, or do the deep dive sharp angle trick, fibers will be broken off the brush. Just press lightly against the rotating LP, sweep the brush off the LP, and all will be wonderful with this brush.This brush is sold under many different brand names, ClearAudio, AudioQuest, and Thorens.The brush comes with no instructions for use, an odd omission. Maybe there is an assumption that the brush is so easy to use, instructions would be redundant.Audiophile or not, this brush is a must have for anyone that still loves analog recordings.", "id": 260}, {"review": "Tried these on a Laguna acoustic guitar. They are basic standard traditional strings. They sound good, they are light weight. On this guitar they sound a bit too bright. My preference is to use Elixirs, prefer the feel and sound on this guitar (Elixir PolyWeb Acoustic Guitar Strings (Light)).These strings do not last less time than the Elixirs. Mostly fresh strings sound good on a guitar. Some people like a brand new set before every gig, others will go weeks or months before changing. If you are an every gig person, well the Martin set is probably perfect for you - they are much less expensive than others. Leaving strings in for an extended period - Elixirs or other coated strings are probably a better idea.There is no such thing as a perfect guitar string for every guitar. The choice is all about your personal preference and the guitar you play. I think the Martins are a very good value in a standard traditional style. So for the price, these are an excellent value.", "id": 294}, {"review": "These acoustic strings are used on a Laguna acoustic guitar. They are just the right weight, and just the right amount of flex. We've tried D'Addario, brighter sound (D'Addario Acoustic Guitar Strings Set, EXP 80/20 Lite), and Martin, a little stiff (Martin Strings SP Phosphor Bronze 12.5-55 MSP4150). In the end, these Elixirs sound and feel best on this guitar.The difference between these strings - nanoweb and polyweb - the nano's have a very light coating that you almost don't feel. So if you like standard not coated strings, the nano's are probably the way to go. If you want a bit of softness, the polys are a better bet.As has been said, there is no perfect guitar string for everyone. The perfect guitar string is the one that feels and sounds right to you on your guitar. For the combination we have, these are outstanding strings.On the strings lasting longer, that's hard to say. Fresh strings do sound better. It's clear that the wound strings do not corrode like non-coated strings. But I'm not certain these last so much longer. We buy them because they sound good and have the right amount of flex to them - playability. Corrosion or crud on the string isn't the sole factor in changing strings.Elixir is a wonderful company. On my third or fourth sets of Elixir strings, the G string snapped as my son was tuning the guitar for the first time. Elixir is outstanding, they will replace any string that doesn't perform up to your standard.The other amazing thing - I've watched tons of videos and watched a lot of guys change strings, and I'm still very confused. The Elixir website (it's pretty simple elixirstring dot com) is outstanding. Ther is a two part video from the Taylor factory on how to change strings. I swear that if you follow those instructions, you will change strings in minutes. It is so simple and so reproducible. I love this technique.", "id": 295}, {"review": "These Dava picks are very nice. They are about the equivalent of a medium weight pick.The rubber grip area is great. The feel is soft, just perfect for holding a long time. The Dunlop picks with the bumps are nice, but this just feels a lot better between my fingers.There are three little lines at the center of the pick, the bottom line is supposed to be less flex and the top line is supposed to have more flex. This is really hard to position my fingers on exactly the spots and there isn't much of an effect no matter where I place my fingers. The effect is subtle at best.The only criticism is the tip is a little bit too short; the rubber can end up striking the string.Overall, I like these picks a lot. The colors are cool and the rubber feels really good in my hand.", "id": 503}, {"review": "The Fender Vibro Champ is a great little amp. I'm amazed at how good this amp sounds. A small light weight package with a good set of voices that outputs a decent amount of sound.This is a 5 Watt Tube amp with enough power to fill a medium sized room or the perfect practice amp. This is a much better and louder amp than the small $100 solid state starter / practice amps by all the major manufacturers. Fender uses two very standard tubes for pre- and amplification: 12AX7 and 6V6 (both are Fender branded tubes). These are nice clean tubes that react consistently.The amp takes about 15 seconds to warm up and draws 45 Watts.The cool part of this amp is the 16 voice settings. In reality the amp packs effects for 7 different amps, Tweed, Blackface, British, Hot Rod, Metal, Jazz, and Acoustic. The first five have three different levels of style each. Our other two amps are Marshalls, an acoustic and a half stack. If I'm being really honest, I like the sound of this amp a lot more than the half stack. This is a clean simple amp to use. The Marshall has a ton of tweaks that are hard to get exactly right.The volume level on the different voices is nowhere near matched. Some voices are incredibly loud, others are really quiet. Switching voices means moving that volume knob a lot. Sadly, the volume only goes to 10.Once the voice is selected, there are 5 effects settings possible with two or three level for each (Vibratone, Delay, Reverb, Chorus, and Tremolo). The F/X level knob adjusts the amount of the effect applied (set to 1, the effect isn't used at all). This is probably the least useful part of the amp. There is no pedal selection, so once the effect is selected and volume dialed in, you're kind of stuck with that until you fiddle with the amp again. There's no easy way to change the effect in the middle of a song.There is a gain knob.I like the speaker on this amp. It is nicely detailed with a good warm sound. The internal speaker is connected with a 1/4 inch jack, so it is possible to connect the amp up to another cabinet with a simple 1/4 inch speaker cable. Very nicely done Fender, most cheaper amps are hard wired to the speaker. The back panel also has a 1/4 inch jack Line Out.This is a great small gig or practice amp. The sound is outstanding. The amp is used with a 1983 Gibson Lucille and a 2008 Les Paul Standard Plus.", "id": 553}, {"review": "It works! This guitar support couldn't be simpler. The neck rest is a molded plastic cup with that soft spongy material inside the neck support. The mat is a thick light weight foam mat (a bit like a yoga mat) with a hole cut in it. The neck support cup goes through that hole. That's it for set up. The mat protects the guitar body. The support cup holds the guitar at exactly the right angle to work on it, change strings, adjust the truss rod, work on the pickups, or clean the guitar. The guitar can be placed in strings up or down.This wouldn't be a difficult DIY project, but I'd be missing out on that cool Fender logo if I made this out of wood and a yoga mat. Honestly, this looks really sharp put together.The whole thing comes packaged in a clear plastic tube. That tube is an excellent storage tube.", "id": 571}, {"review": "The D'Addario Balanced Tension strings are a good value, and worth slightly higher price. These are excellent strings, the type that a gigging musician would likely use on their guitar. They are inexpensive and sound great. For somebody that is a casual home musician, coated strings might be a better choice. The difference, somebody that plays a two or three hours every day, will wear out a set of strings long before corrosion sets in. Somebody that plays an hour or two twice a week will likely never wear out their strings and corrosion becomes the bigger problem.The big question for me, is the Balanced Tension worth a little extra money? It seems like yes they are. The strings are slightly easier to bend and feel just a little bit better. There isn't a huge difference. The direct comparison string is D'Addario EXL110, (D'Addario EXL110 Nickel Wound Electric Guitar Strings, Regular Light, 10-46), at roughly $3.50 a set, these are good solid strings at a bargain price. The EXL110BT strings are about $5.00 a set. If I were going through a set of strings every few days, the EXL110's would probably be a better idea. But if a set is going to last a week or two, the savings overall is pretty small, I would use the EXL110BT's.My personal preference is coated strings, I like Elixir strings a lot. The new D'Addario coated strings are fine, but they end up being about the same price as Elixir. I'll stick with what I know well.My 1981 Lucille did love these strings. They worked out just fine.On the packaging, I don't like what D'Addario has done. All the strings are in a single plastic package, I prefer individual paper envelopes. They loop two strings together and I hate that. When I'm stringing my guitar I like to work with one string at a time, and this silly double loop makes me leave one string opened up on the bench. Sometimes the strings get crossed over when unlooping them and it makes me mess with the strings for a while. They are trying to save packaging, and that is a good thing. But seriously, that little paper wouldn't kill anybody. I also don't care for the color coded rings on the strings. Lucille has an open bridge where I can see those electric colors. It is a small thing, but I don't like it. I prefer that the rings all be brass, one color. Yeah, I'm the only one that sees that problem. If I work one string at a time from an individual envelope, the color coding is not necessary.These are fine strings. They are a great price and provide a little bit easier bend.", "id": 868}, {"review": "These Fender Medium picks are simple basic good picks that just work well. Color and appearance is a personal thing, I think these abalone picks just look cool. The color mix is random (no two picks are exactly the same); some have a bit more blue and reflective colors in them. Overall, the effect is not bad compared to real abalone.Fender makes a nice standard pick. The three weights are pretty easy to figure out (light, medium, and heavy). These mediums work well for playing electric guitar. I have some light red ones that have a lot of flex. Those work well for acoustic. I've used Dunlop with the little bumps for grip, and the Dava rubber coated picks. They are all nice, but sometimes you just want a regular old smooth pick. The gray Dunlop's don't look anywhere near as cool as these.At $3 for a dozen, they're worth a try. It they don't work out for playing, they sure look darn nice (the Fender logo is in gold).Dava 6024 Grip TipDunlop Nylon Standard Picks, Grey .73mm", "id": 120}, {"review": "For the price, this is an amazing pedal. The sound from a $40 pedal is outstanding, much better than I ever expected.The Voodoo is a fuzz pedal, meant to give a sort of Jimi Hendrix sound. This pedal creates fuzz and can raise a note an octave. Alone it does a decent job of transforming my guitar into something like Hendrix. I was able to hold a note for two minutes with this box, the sustain is big. All was not completely perfect, it might be me and the way I'm adjusting this, but I had a bit of trouble with feedback.From a sound standpoint, this is a great value and does a good job of fuzzing up my sound. Combined with Joyo's California, Hendrix is almost in the house. (Joyo JF-15 Guitar Effect Pedal California Sound True Bypass)I have a Boss ME-70 multi-effect pedal. This Joyo single effect pedal blows away my Boss pedal, I'm almost sad to say that. I don't have experience with other single effect pedals, so I can't make a comparison to those more costly pedals.I have a Marshall Amp and cabinet with 4 x 12 inch speakers. My guitar is a Gibson Les Paul 2008 Standard Plus.From a construction standpoint, these are remarkable for the price point. The whole thing has a good weight. The base has a dense skid resistant foam rubber on it. The box is a solid cast metal box, with a very heavy metal base. The bypass and octave up switches are solid and bolted tightly to the box. The 1/4 inch input and output jacks are really sweet - there is a metal insert that screws into the plastic internal jack. It looks to me like it would be very hard to break this jack - that outer ring is heavy duty. The pots look really good. For this pedal, they went with press on knobs. If the knob ever breaks, they are a very easy replacement at Radio Shack. The only weak point is the somewhat thin Mid Cut toggle switch. Given that it is between three knobs, I think it would be hard to break this switch - but it is a little lighter weight than I would like.The pedal comes with a 9 Volt battery. It also has a standard 9V power jack on the side, to use an AC adapter or large rechargeable battery pack.This is not a high end pedal, at this price point, nobody should ever expect that. But darn it, this is one amazingly nice pedal when I consider price. Well worth the investment.The GateShop provided me with a sample of this pedal for review.", "id": 836}]