[{"review": "I'm using this right now on my acoustic and it does its job in respect to holding your picks. It was smaller then I would have pictured, but it still is a good product. It can hold light to heavy picks and its super easy to put it and take it off. Only problem I had was that it moves a lot when putting my pick back in. Besides that, its highly recommendable to anyone. I will definitely pick up more for my other axes.", "id": 29}, {"review": "I'm in love with the dual design system! It works extremely well and allows me to switch between straps easily and quickly. There is one downside to this system, as the strap that is used will be fairly far away from the guitar itself. Which might not be a bad thing considering wear and tear on the guitar from the strap. There was one hiccup while putting this together for the first time. One component, which was this thin but big washer was pretty hard to install and the directions weren't much help either. The directions did have it on there where it is supposed to go, but I didn't know the name of the piece nor could I readily find it in there. After that, I installed this into my new guitar and strap and, I was ready to go. I HIGHLY recommend this! It is much easily to switch out straps w/o the possibility of striping the screws or boring into the screw hole and cracking some of the wood in the process.", "id": 44}, {"review": "Decent strings I used for a beat up strat that I had. Nothing to special but it was good enough for that. I'd recommend these.", "id": 89}, {"review": "I absolutely LOVE these picks. Grips really well in your hand, plays like a dream. I just wish more came in the pack. I would HIGHLY recommend these to anyone if they want some great picks.", "id": 170}, {"review": "I mostly play metal (7,6 string extended scale) and usually lean towards heavy duty picks such as Dava for riffs. But these picks are pretty amazing! The diamond-steel pattern creates a lot of grip and it is pretty hard to drop one of these, compared to a basic pick. This is a great product and would definitely recommend this to any level of player.", "id": 680}, {"review": "I LOVE snark tuners, this not being the first one I bought, nor the last. I loved the fact that I didn't have to press all the buttons like the other ones. Just get it relatively in tune by ear, then this thing will help you with the rest. My only problem is with the little rubber plastic on the grip. It has already pulled up and I only put it on and off my guitar maybe 3 times so far. I mean, I've had it for less then a month now and that is pretty bad. I'm just going to glue it back but it seems like it should have been better in that aspect. I would highly recommend this to anyone who wants a black snark tuner for their axe.", "id": 762}]