[{"review": "This is for theKyser Banjo/Mandolin CapoThis is one of three capos I use for a ukulele.  It works, and is my second favorite.  I can park it on the headstock of my ukulele, and it is easy to add, move, remove. With the trigger-type release, it makes it one of the easiest quick-change capos I've used. It feels sturdy enough (lightweight aluminum).  I like how the trigger portion sticks upwards, and does not get in the way like myDunlop Trigger Banjo Capo, Black.  My favorite is still the G7th capo.  This is a close second to the G7th.My only nitpicky complaint is how it is not eligible for Amazon Prime.  UPDATE:  I just saw that this capo is eligible for Amazon Prime.  Free shipping for Prime members!!!For the price and quality, this Kyser capo works on a uke. Highly recommended.", "id": 43}, {"review": "I use these strings on most of my acoustic guitars, except for the smaller Takamine New Yorker and A&L; Ami (I use the D'Addario custom lights).  I have grown a fondness for the Phosphor Bronze strings because of the perfect balance between the warm full sound with strumming and bright tones when picking.  ALso, the brightness is retained longer than other bronze and brass alloys I've tried, such as Martins and Elixirs.  These strings are quite durable and long-lasting.  In the 10 years I've been playing, I've never had these strings break on me (I've broken Martin and Elixir strings in the past).  The color-coded end balls help with the restringing.  I typically get the three-pack so I can restring a trio set of my herd at a time.  I really can't complain about anything.The individual gauges are: .012, .016, .024w, .032w, .042w, .053wHighly recommended.", "id": 198}, {"review": "I tune my guitars, ukuleles, cavaquinhos, and piano with various tuners, like the Korg GA-40 or Korg CA-40 or Korg TM-40, and I pair this Korg CM-100 Tuner Clip and the difference is huge.  You no longer have to worry about background noiseI clip it on the headstock of my guitar/uke/cava and it tunes them quite well.  On the piano, I can clip it on any part and it picks up on the tuner.  It works as well as most/all of the clip-on tuners you see on various guitars and ukuleles nowadays, but if you have one of the chromatic tuners that don't directly clip on (like the Intelli IMT series), then this will make it work 100x better (okay, slightly exaggerated) because the ambient noise is not picked up by the tuner's microphone.I give this accessory high marks, and I highly recommend it.", "id": 474}, {"review": "Pack of 10 guitar picks - check\"Meet the Beatles\" theme - checkRetail packaging - checkTwo-day delivery (got it the next day... thanks to Prime) - checkHappy guitarist - checkI can't really complain about anything, except maybe for the price.  But then again, I didn't HAVE TO buy these.  They are fun and kitschy.  5-stars.", "id": 614}, {"review": "It works, and it works well.  It easily cuts guitar strings, ukulele strings, etc.  No damage to blades when cutting  heavy to light gauge steel strings.  If you change your own strings, this cutter is a must have.  It is very durable, the material is made of high quality metal, and it makes clean cuts.  The rubber grips are comfortable to use, and have red accents (and therefore easy to find).My only minor gripe is that it is spring-loaded to open.  I've cut myself with the blades reaching into the pocket a few times when I first got it.  Thankfully I don't change strings too often.  I also made a little leather pouch for the clipper end, and I put a rubber band around the handles to keep it closed.A must-have for your guitar/bass/ukulele bag.  Highly recommended.", "id": 648}, {"review": "This works well.  Has nice ergonomics, fits all of my acoustic guitars, and is easy to use.  No adjustments are required for my guitars, but it is nice to know that the options is available for this capo.This capo comes with a pick holder.  And, it is expandable with aD'Addario NS Micro Clip-On Tunerthat attaches onto the lower arm.  I do not use a pick, and I use my own tuners, so neither of these two features is applicable for my needs.This capo has moved up as one of two highly used capos for my guitars, the other one being theG7th Performance Capo.  The G7 capo goes with my Takamine New Yorker, and this Planet Waves goes on everything else.  If anyone needs to use a capo, I loan out myKyser Capo.Recommended.", "id": 894}, {"review": "The title says it all.  I got it for $16 (free shipping with Amazon Prime), which is cheaper than my local music store.  I keep it on the head of the guitar, and it is easy to add, move, remove.  With the trigger-type release, it makes it one of the easiest quick-change capos I've used.  It feels sturdy enough (lightweight aluminum).  And best of all... it works!", "id": 25}, {"review": "This is a review for theMahalo U-30PK Painted Economy Soprano Ukulele (Pink).For the price ($30 shipped) it can't be beat.  Free shipping via Amazon Prime.  I got it for my 3yo daughter for christmas, and she loves it!  I taught her the C-chord, and I play the G-chord... so we play the Moldy Peaches \"Anyone else but you.\"  It's a great little starter musical instrument, and a great beater uke that I don't mind getting a bit banged up.I was surprised that the frets were level and the neck was straight (well, good enough for a cheap uke).  The strings are some kind of cheap nylon.  I changed the strings to nylguts, and they sound 1000x better... almost as good as my other laminate mahogany soprano (almost).  The fretboard is painted black, so I don't know what kind of wood was used (I didn't expect ebony for this price).  I also sanded down the nut and saddle because the action was a bit high, and now even I can play it without complaining too much.  It has geared tuners, not friction pegs.It even comes with a matching polyester \"gig-bag.\"  Now my mother wants one so she can play with her granddaughter.  Overall, a decent play/starter uke and worth the $30.", "id": 589}, {"review": "It works great on my acoustic guitars of various sizes.  It is easy to use, easy to put on, easy to adjust the tension, and lightweight.  When not in use, I keep it parked on the headstock.  The shape and ergonomics are a mix between a Kyser and a Schubb S1.  Five stars all the way.  Highly recommended.", "id": 843}]