[{"review": "If you plan to use this pedal as a traditional volume pedal in a Guitar > Volume Pedal > Amp configuration (inserting effects pedals anywhere you like), this is a POORLY engineered pedal.  It can't be \"true bypass\" as long as the signal travels through a potentiometer but they can use pots that are a virtual short when adjusted properly and with the pedal forward.Anyway, the difference between plugging my guitar directly into the amp and placing this pedal in the chain between the amp is immediately noticeable.  The tone becomes duller, the output drops.  I would expect that from an Asian knock-off, not from an A-list gear maker.  I might be over-stating Ernie Ball's reputation, though they make some fine guitars I gotta say, and I've used their strings for many years.If you plan to use this EB-6180 pedal with digital effects you should be fine.  This is because the digital device will take two measurements of pure resistance at either end of the rocker.  The signal processing takes place in the unit, not the pedal.  (Those units have their own tone problems but that's another review.)It does occur to me that any pedal with a buffer (NOT \"true bypass\" in other words) may fix this problem, which is more than likely related to impedance, like a tuner pedal, between the guitar and the volume pedal.  I will need to try that out, but it does not excuse Ernie Ball from their responsibility.  Major FAIL on their part.2 stars is generous because EB fails to honor the simple \"first do no harm\" principle. It harms your tone.  How dumb is that?  The pedal itself is very attractive, appears indestructible, though I have my doubts about their \"string\" mechanism over time.  The rocker feels smooth and the weight gives the pedal stability on the floor.I have no recommendations for a volume pedal.  Because of the feel, and esthetics, I do plan to keep this for the digital device use, but wish it was able to do what it promises, and fails so miserably, to deliver.", "id": 187}, {"review": "I agree with other reviews that Boss exploits its customers by insisting the $300 pedal have the PSA supply, but sells it separately.  It's a cheesy way to meet a price point without really doing it.  I used a OneSpot power supply I had already, and it works fine.  Just glad I didn't have to shell out $20 more to Boss for something they should have provided with the ME70.The first thing I noticed is that the tuner is not too good.  You get a letter, with an arrow on each side, and it's not very responsive.The Korg-style dial-in reverb controls are easy, but extremely limited.  Expected better.  You get either room or hall.  Neither are that realistic.Going from manual patch-level to bank-level is awkward.  It may just take practice.Next thing I noticed is the delay level does not respond as expected.  If I set the E. level (delayed signal level, or balance) at around thirty, it can be clearly heard.  When overdrive or boost is added the primary signal is boosted as expected, but the delayed signal remains at the original volume, effectively reducing the balance and making the delayed signal nearly inaudible.Did Boss just start making multi-effects pedals?  Have they learned nothing?Despite somewhat mediocre performance and design, the ME70 does have features that recommend it.  Some of the drives are usable.  The controls are accessible and easy to adjust.  The \"Solo\" setting on the Comp/FX module is a nice booster, although it can apparently be overdriven easily by the boost in the OD/DS module - maybe this is by design but it would be nice to have two levels of clean boost.The next annoyance is the very limited capabilities of the optional footswitches.  I was hoping to be able to flip between the preset and manual setting, but all it does is turn the preamp on and off, or step (one way) through the presents (FS-5U).It almost appears that Boss very cynically crippled the ME70 so it did not threaten GT10 sales.I'm looking forward to learning more about this pedal.  So far, it does some good things, but it could be much better.Has anyone else noticed the ME70 reviews out there aren't too useful?  I'm thinking of checking out the Vox Tonelab EX, which is being blown out now.  $225 at GC, for example.--3/16/12 update:  Despite the limitations above, I like the portability of this unit.  It runs on 6 AA's (I think) which is great when you just want to put it on the floor and play, for example at a jam where you don't have power nearby.New Fail update - the Tremolo in this unit just stinks.  I mean stinks.  Whatever the \"waveform\" is, it's not a sine wave, not smooth at all.  Very poor musical characterists.  Whatever engineer was in charge of this - you screwed up big time.  Your own Boss tremolo pedals are much better than what you've put in the ME70.  Why would you do that, Boss?  I like tremolo but it's virtually useless in this unit.  Some people won't notice, but if you like that swampy Fender style tremolo, you will be very disappointed.", "id": 582}, {"review": "I wasn't sure what to expect, and the foam rubber was a bit of a let down, especially when I took it from the plastic. Very strong fumes, not too pleasant, but they dissipated in the basement overnight.Because of the fumes I was a little concerned about what the material might do to a wood finish.  I was happy to see that there was no apparent smudging or marking after two hours.  I wouldn't leave it on anything \"finished\" for longer than that because this type of foam doesn't last forever and as it breaks down the residue can be hard to remove.  For now, it's great.It comes with a black nylon, sort of mesh tube shaped bag, good for putting it away or traveling.  For now I will just leave it as flat is possible so it doesn't curl so much.  For the size and utility, the price (which goes up and down) seems reasonable.", "id": 705}, {"review": "The very first thing I noticed about the design is how far from the guitar's surface the strap is actually connected.  What this tells me is there is considerable added stress to the screw and the wood surrounding it because of the added leverage to the guitar's weight.  The &#34;fulcrum&#34; is the surface of the wood, if this makes sense, and I can't help but wonder if it could eventually (eventually over much time and use) cause cracks or splits as a result.I found someone selling only the Dunlop strap buttons, which is a great idea for someone with 2 main straps and several guitars, and was about to order them when I found Planet Waves Elliptical End Pins.  I think this is the best idea yet for keeping a guitar on a strap, unless you're going to be spinning the guitar around your shoulders, and no additional stress on the guitar's body.  I've ordered a set.", "id": 44}, {"review": "This pedal board replaced a bcb6 boss case because I have a lot of non-Boss pedals and wanted to start using them for gigs.The PT2 footprint is large enough to accommodate a lot of pedals but not too big for a smaller gig, except some of the smallest \"stages\" (room corners) that do require a smaller rig.Without going into specifics there was a zipper issue on the soft case.  I wrote the company, described the problem.  Lizzie wrote back and said she'd take care of it. You just don't get better service than this company provides.  Combine that with the great product design and I'm a happy customer.The larger boards give you the option of installing a dedicated power supply underneath.  This is one of its best features.  Truly plug and play.  Yes, I spent more than I ever have on a pedal board before.  Portability.  Reliability.  Flexibility.  If I was ever going to use my best pedals for gigs, this was it.I have tried SKB and Furman and they have some nice features, if you like a lot of plastic.  I still like the PT2 much better.", "id": 544}, {"review": "I love this stand.  I am really disappointed in the cheap, designed-to-fail, bolt-in hardware used to adjust the telescoping rear leg.I think this stand can last a long time if you don't adjust it much, but how much better would it have been had they designed one of those pressure collars with a flip tab, so you are not limited to the holes drilled into the rear leg?  The other hardware isn't much better.For a $50 (list price) stand, On Stage took the cheap route rather than the quality route.  Well, it's only an On Stage product, not Hercules, K&M;, or Atlas, or Ultimate Support.  Cheap stuff, a budget brand, trying to pass as a name brand.Great idea though, and the price is right at $25 street.  Hopefully a better make will put out something more road-worthy.", "id": 653}]