[{"review": "They add depth to your bass drum by muffling the overtones a bit, and it is the pads that wear out rather than your bass drum head so these actually save you money and sound better. I've used a couple different brands, and they pretty much are similar.", "id": 73}, {"review": "Yes this ie every bit as good as the Shure SM 58 but you don't get the cool pouch. The 57 version is also like its Shure counterpart. Great sound and great deal. (yes I am a musician too)", "id": 425}, {"review": "I am a pro drummer and run pro sound support PA systems for outside venues as well from time to time. It is essential that I have cables that carry the great sound we make out to the speakers to reproduce it acurately to the crowds. These 50 ft xlr cables are made well, I hear virtually no sound loss or distortion over the long lengths. And as usual dealing with GLS and Orange County, they came fast packed well and safe. I am a continuing returning customer because of quality, price and service. And though on this particular order I had no need to contact them, they checked in with me to make sure everything went well. Great folks to deal with.", "id": 426}, {"review": "So I originally got the virtually identical Mackie version of this and it crapped out on me after  a couple of years of easy work. Behringer is typically good at making comparable gear at better prices than most. I use this for my vocal monitor attached to my drum rack. So much more efficient than a floor monitor. I have my own volume and tone settings at my fingertips, and because there is more than one channel, I can run a full main mix into it on one channel and mix in a separate feed from my own pa channel. Very cool to be able to mix down a too loud harmony, or turn myself up a little in my ear without affecting any of the other mix dynamics. Definitely recommend ... Hey you get volume and tone and control of your own space!", "id": 654}, {"review": "I'm a little surprised at this one. Just today I was emailed confirmation that the picks were shipped, and I found them in my mail box the same day. I like fender mediums because I use them on both bass and guitar. Good picks! Clean edges, good feel, good duribility, nice tone.", "id": 120}, {"review": "These really do work well, but it is a difficult struggle to get them separated at 1st. They stick together too well and it is hard to separate them at 1st without ripping the individual pads. I found it a little easier putting them in the fridge over night, then slowly pulling them apart. I also thought about heating them a little or perhaps adding a few drops of water. However chilling them did work well enough. That aside, these will greatly improve the way any set sounds. I've been a pro drummer for over 45 years, and have used masking tape, little cloth squares tapped down, lots of different things. There work best by far and are easily moved around depending on the room you are in and the sound you want. Great stuff. Oh and check out a drum dial to add to your tuning skills. That can help and a great drum doesn't sound so good if it isn't tuned right.", "id": 892}]