[{"review": "After receiving theDunlop Dual Design Straplok Systemalready installed on my Gibson Standard electric(7.36 lbs.), and liking them, I decided to try installing them on my Gibson Studio electric (7.23 lbs.). Noproblem. Just follow the instructions exactly and they will work perfectly.I had no problem either installing them nor using them since the installation. Money well spent makingsure my stringed instrument does not accidentally fall to the ground. Besides safety I also like being ableto swap out my straps on my guitars. It's a nice convenience. If you are so inclined you can use the samestrap for all your guitars.If you are not sure if they will work on your brand guitar seek out an online forum and either search thatforum for the answer or join and ask your questions. You've got a pricy piece of wood there and will wantto take care of it properly.What I don't care for, but feel okay with because they work so well, is how big they seem to be. Theydon't get in the way when being used but look almost out of place. That is why I chose Black for mysecond set. Helps keep the product's profile down a bit. Other than that, the product works asadvertised....NOTE: As of June 2014 I have installed two other sets and all are still working as expected. Do rememberto check and make sure your hardware is secure. After repeated use the screws can come loose and therewill be trouble if this happens. Do NOT use any glue in case you need to swap out the Straploks in thefuture.", "id": 44}, {"review": "This is my first attempt at buying a polishing cloth for my guitars. I tried this untreated 'MicrofiberPolish Cloth' on my Gibson ES-339 because I had heard good things about it.We'll begin with some stats: the cloth is 11-3/4\" by 11-3/4\" and has an 1/8\" border stitched aroundthe edge. It feels very soft to the touch and it is made in Korea. There is a small warning on theback of the package that states: \"Not designed for cleaning electrical devices.\" You can also washthis untreated polish cloth in mild soap and water, rinse it out and hang it up to dry. Now to thereview.My guitar has an Ebony hard lacquer finish, meaning very glossy and shiny. I have been playing thisguitar for about a year now and it had a lot finger smudges on the body's front and back and BACKof the neck. I was able to get most of the minor finger smudges off. When going after the moreresistant multiple smudges the polish cloth would spread it around and left most of the problem onthe finish.What I discovered about this cloth, even with increased elbow grease, is that it has it's limitations.So, if your guitar is reasonably clean and the smudges are fairly new this cloth is dynamite and takesthem right out. If the body oils have been there for awhile, probably collecting dust, then you willneed some type of cleaning liquid to help you break up the old fuzzy oils on your instrument. Pleaseuse any liquid sparingly when applying it to the surface of your instrument. Do not put a liquid directlyonto the surface of your instrument. You should put the cleaning liquid onto the cleaning cloth firstthen apply it.I decided to use Dunlop's 'Dunlop Formula 65 Guitar Polish & Cleaner' to cut and clean up the tougheroily smudges. I used another soft cotton cloth and it cleaned up very nicely. Since then I have beenable to keep the guitar polished and clean using only the 'Planet Waves Microfiber Polish Cloth'. It doesnot leave scratches or any marks when used without a liquid. I also did not have a problems with thecloth breaking down and leaving lint or pieces of cloth behind.You want to use a another cloth to clean your fretboard and not the same one you use for the finish.The fretboard gets a lot of oily dirt assigned to it through repeated play. I would be fearful that theadditional oils accumulated  on the fret board will get into the Microfiber cloth and transfer to the finishof the guitar.So like a lot of things in life there are limitations to everything. I gave this untreated microfiber cloth4 stars because it does a fine job keeping my guitar clean  and polished with minimal effort. My highexpectations, based upon the blurb, were that this cloth would clean up more ensconced oils and dirtbut it only smeared them around. It was more trouble than it was worth to use the microfiber cloth toclean up the smeared mess.Nonetheless, I like this cloth and recommend it for upkeep purposes and minor dirt or grime. I will bekeeping it in my guitar case just for this particular guitar finish and use each time I am done playing.", "id": 184}, {"review": "What can I say that has not been said about the other DRs that I have used. They rock, roll, andbend with the greatest of ease; once broken in, of course. If you want a mellower, bluesier stringwith decent sustain try DR Pure Blues.I decided to use 9's on my Fender Tele hollow-body because the company puts 9s on their guitars.I didn't want to worry about the nut being the wrong size and causing untold noises so I stuckwith the 9s. Hey, the Rev uses 7's; size does not matter when it comes to strings and tone.The other reason for the Pure Nickels was to tone down the ice pickiness one can get from P-90pick ups. Pure Nickels seem to mellow that out for me a bit. One more reason is that nickel iseasier on your frets; which is a good thing. Steel will wear down your frets a lot faster.I will say that my very first set of DR Pure Blues went bad after a few weeks. The windings brokeon the D-string at two places where the string fretted. The reason I kept going back to DR Bluesis that I have not had one problem on any of my electric guitars (4 solid bodies & another hollow-body) since then. Giving DR a second chance convinced me they will last and that my very firstuse in 2010 was a fluke.If you want strings that are an easier bend than steel or steel core nickels go with DR Pure Blues.Allegedly they are supposed to help give you vintage tone. This is because prior to the mid-40'smost strings were made of nickel. During WWII nickel was in short supply and so steel was used tomake the strings. Or so the historical theory goes.Gradually nickel wrapped steel strings and then pure nickel strings came back into vogue as playersbegan searching for the old vintage sound. To achieve the \"vintage\" tone I am sure you would alsoneed the right amp AND the right touch to get to that point. I am not necessarily looking for a\"vintage\" tone but love how easily these strings bend and how long they last. Your exact mileagemay differ.I have also never had anything rub off of the strings onto my fingers. The only time I get my fingersdirty is after oiling the fret board. There is usually is some residual oil left no matter how much I wipethe fret board. Definitely not the strings though. I have also never heard any string-squeak from thestrings that would give me pause either. Any string, even on acoustic, will squeak occasionally. Withan electric who knows if the pickups were set too high, or the nut is not cut right, or the wrong sizestring is used for the nut.Well there you go; what I have experienced with DR Pure Blues Nickel Wrap Round Core strings. I willalso say that on guitar forums that I frequent more people are giving DR kudos on their customerservice as well as their strings. So if you do get a bum string give them a holler. Now get out thereand play your heart out. Oh and how about working on that \"vintage\" tone while you are at it.Have fun.", "id": 205}, {"review": "If you want an inexpensive \"pure nickel\" string get theDR Strings Pure Blues Pure Nickel Wrap Round Core.They feel nice, are nicer to your frets, sound smooth and mellow for the blues or any genre. They bendnicely and sustain just as well.I know guitar strings can be a personal thing, and there are more expensive pure nickels out there, butat this price point try a set of these as well. You may be surprised.I have rated this set at '4' stars because only after about 16 hours of practice the 'D' string windingbroke at the second and third fret of my Gibson Standard. No damage to the frets and it was easilydiscovered because the string sounded dull, almost dead. Strange.I recently went 'electric' again after 20+ years. So electric guitar strings are basically a new experiencefor me again. That said, I never had an acoustic wound string have its winding come loose in over 30years  of playing.I put another set on my electric and have had no further problems. I have not heard of this happeningto anyone else. Maybe its no big deal, so no one remarks on it...UPDATE 07/14/2013: I am still using DR Blues on my guitars and have not had any further problems withthem..UPDATE 01/08/2014: I just had the D string windings break on a new set. Different guitar but broke onthe same frets as reported above.", "id": 284}, {"review": "I was looking for a cleaner and a polisher to get the grease and grime off my guitars. I decided to trythe Dunlop Formula 65 Polish & Cleaner. I thought, why not try a 2 in 1 formulation? After all, thereare shampoo and conditioners in one bottle, and that works well for me. So why not this? Possiblyfaulty logic but I went with it at the time.Well I have to say that it did well. I used a soft cotton cloth, placed some Formula 65 on the cloth(Not the guitar) and slowly worked on the more oily looking areas of my Gibson ES-339. This guitarmodel has a high gloss black lacquer finish. The Dunlop Polisher & Cleaner did a very good job on thefinish and did not leave any streaks behind.------------------------------------------------------------------------------------------------It was after using the substance all over the guitar that I realized that one must not get Formula 65in any cracks or chips. I am thankful that I did not have any of said cracks or chips. I am usually oneto read directions thoroughly; but not this time. No harm done but I will make it a point to inspect myguitars for cracking or chipping prior to using Formula 65 again.------------------------------------------------------------------------------------------------This stuff works well. It was able to lift off, with some effort, greasy build-up over the last year. I amnot a messy person but oily hands can and often leave smudges that mar the surface of the finish. Notonly does it clean up the oils from my hands and gosh knows what else, it also left a nice shine as well.The finish looks very good. This 4oz bottle will go a long way. It doesn't take much to work.I tried using an untreated micro-fiber polish cloth and that only pushed the oily mess around. That iswhen I decided to get the Dunlop Polisher & Cleaner. It definitely worked a lot easier than the un-treated micro-fiber cloth. I am now using the micro-fiber cloth to rub off any new smudges as theyoccur. I plan to re-apply the cleaner/polisher when I oil my fret board a couple times a year.I gave the Formula 65 Cleaner & Polisher 4-1/2 stars due to the fact you can potentially do damage toyour guitar. Chips and cracks do occur throughout the course of a guitar's life and can be expectedalbeit not wanted. So 4-1/2 stars because it does what it says it will do but you've got to be carefulusing it. So...be careful out there people....NOTE: There is a \"California Propositon 65 Warning\" on the web page under 'Product Details'. Amazonhas placed it there as a public service. It reads: \"WARNING: This product contains chemicals knownto the State of California to cause cancer and birth defects or other reproductive harm.\" Just thoughtyou ought to know.", "id": 351}, {"review": "This Fender Treated Polish Cloth; a soft ecru colored cloth with a cut scalloped edge all around is asimple product. The classic Fender logo is in the left upper quadrant of the cloth. The resealableplastic bag this cloth came in had a label that read, 'FENPC1' and states it's size as being, 12 inchesby 15 inches.Well, its size, as I measured it, is actually 12 inches by 14-5/8 inches. Just wanted to mention itbecause I have seen some people get mighty upset about things like this. Me, no problem. The missing3/8 of an inch is a minor detail. Go to a lumber yard some time and look for 2x4s. Now, you won'tactually find any actual '2x4's. They've been shrinking for over 50 years.I am not sure what this cloth is *treated* with but it does not feel any different than the UN-treatedGibson polishing cloths I have purchased. I also gave it the nose test. I thought there  might be a hintof, or a whiff of, some polish or something. Nope. No scent. No whiff.What I did find disconcerting is the warning in 'Product Details' section on the Amazon web page. It isthe fourth bullet down: \"California residents: Click here for Proposition 65 warning.\"  Below is thewarning verbatim from Amazon. Kudos to Amazon for posting this warning.* ------------------------------------------------------------------------------------------ ** \"California's Proposition 65 entitles California consumers to special warnings for products that* contain chemicals known to the state of California to cause cancer and birth defects or other* reproductive harm if those products expose consumers to such chemicals above certain* threshold levels. We care about our customers' safety and hope that the information below* helps with your buying decisions.* We are providing the following warning for products linked to this page:* WARNING: This product contains chemicals known to the State of California to cause cancer* and birth defects or other reproductive harm.\"* ------------------------------------------------------------------------------------------- *Just thought I let you know about that one. I guess the missing 3/8s of an inch  is really no big deal atthis point. You just need to worry that, in your concerns for keeping your beautiful guitar sparkling clean,you could get cancer. WoW.  Back to the review...The Fender cloth is just as soft and just a little bit bigger than the Gibson cloths but not much differencebetween the two. Well, the Gibson cloth does have a whip-stitch edging around it. Other than THAT, notmuch difference.When I use the Fender cloth on my Fender guitar there were no marks left and no smudges left. I  like tokeep the neck especially clean and polished on a regular basis and it seemed to do a good job at that. Idon't use it on the body that much because it is not as exposed to my dirty oily hands as much as theneck.So, based on the fact that Fender made a cloth that does not scratch or smudge my guitar I will give thisamazingly boring and uninteresting ecru colored cloth 4 stars. It appears to do  what it supposed to do,and that is polish your guitar without harming it.It gets one less star because of the California Prop 65 warning. I suppose I need to take this a somewhatseriously so I docked it one star. I will definitely be washing my hand right after using it.So far no harm has been done to any guitars in the writing of this review. For the future I am not so sureabout me. Thank you, and say, 'Goodnight', Gracie......Note About Vendor: GO-DPS responded admirably when my cloth did not show up on time. It was 4 dayspast the delivery date. I e-mailed them. They responded quickly and then put another cloth in the mail tome that came in an appropriate amount of time. For such an inexpensive item they went the distance incustomer service. I will use them again in the future.", "id": 572}, {"review": "This is one great looking cable. I purchased this cable December 2010 and it is still working well and stilllooks good. And as Fernando Lamas says, \"it is better to look good than to feel good\". Well, not when itcomes to cables.This cable is 20 AWG, with an \"Ultra-Pure Copper Center Conductor\" and 100% copper and conductivepolymer shield. You want a good shield if you are going to be playing loud. Helps keep those ugly micro-phonics away and you want that big time.The capacitance of this cable according to the manufacturer is 39 pF/ft. This is the one spec you wantto pay attention to when buying instrument cables. The lower the number, the least resistance whichresults in a higher performing cable.Out of this cable expect a more corpulent sound and beefy output. It seems the lows and mids are hugeand the highs are very nice indeed. This seems to be a very nicely balanced cable for the money.This cable comes in other colors in the braided cover style. They look terrific but I find this \"Fatso\" muchharder to coil than the thinner Spectraflex 'Vintage' this company makes. The bulkiness of this cabledoesn't seem to lend itself to easy coiling. It also seems to become twisted a lot easier and thus harderto straighten out and coil for storage. The easiest of my cables to coil, by the way, is the Lava Cable,\"Magma\", which only has a black rubber jacket and is a dream to coil. If I were to need more cable, quitehonestly I would buy the Lava. Pretty doesn't count for much with me.I gave this cable 4 stars because of its very good sound, is well constructed, has excellent shrunk rubbercovering the plugs, looks darn marvelous, and has about average specs for the money. Yet, difficulty incoiling for storage makes it a bit of a pain in the arse to deal with on a nightly basis.If you want a beautiful, well made cable that you don't have to put away every day buy this one.", "id": 587}, {"review": "I will start with saying this is NOT a Class 1 Tube amp; meaning ALL tube in the pre-ampAND the amplifier sections. I will also say that if you can find one used - buy it. It is awonderful practice amp and can also serve well as a studio amp or a small gig amp. Ipurchased this amp about 2 years ago and love it.The Super Champ XD is considered a 'hybrid' amp. It uses solid state circuits and tubesto bring you your hybrid 15 watts of sound.  The power amp is all tube and the preampis solid state and tube. I am not real technical when it come to amps but can tell youthis amp has had some detractors and a lot of fans mainly because it is a hybrid. Thereis definitely plenty of opinions out there on the web.This amp has two channels; one clean Classic 'Blackface' tone channel and one channelthat uses digital signal processing to dial in 16 effects and 16 different amplifier voices.You can purchase a foot switch for about $25 that enable you switch between channelone and channel two.The amp also has a 1/4\" Speaker Out so you can connect an external speaker box if youso choose to increase your decibels with a bigger speaker. There is also a 1/4\" Line Outto connect recording or sound reinforcement equipment. Unfortunately, there is not aHeadphone Output or Effects Loop.The amplifier use three tubes: 1x 12AX7 and 2x 6V6s. It's speaker is a 10 inch, 8ohm'Special Design' Fender. If you want to get louder, fuller and cleaner you could replacethe stock speaker with a Eminence 'Rajin Cajun'. You can also just break in the stockspeaker and see what you think. Some players are comfortable with the stock speaker.With regard to tubes and speakers there are plenty of forums out there that talk about themods they use and the subsequent results from those mods. This is an amp you can easilymod and after a few years there have been plenty of people doing just that.I will say that the clean channel is very nice whether I play through my Gibsons or myFender Tele. I very much enjoy the clean Blackface sound of the amp. It will breakupwhen you dial up to about 4 or 5 on the Master.The Digital Voicing Processor(DSP), from what I read from more experienced players, arepretty darn close to the original. Voices like, Tweed, British (Think Vox jangle), FenderHot Rod, Metal, an Acoustic 'super clean' tone optimized for finger picking. There is alsoa clean Jazz tone that has the 'character of the Fender Jazz King amplifier'. Again, I amnot that experienced with all of these tones but many players have positivecomments about the digital voices.With regard to the Effects (Vibratone, Delay, Reverb, Chorus, and Tremolo) the opinionsout there is that they are serviceable but not authentic. It is often recommended to buya pedal specific for the effect you are looking for if you want 'authentic'.If you want or need  a highly versatile voice channel with a wonderful clean channel thisis the amp. It  weighs only 25 pounds (10.9kg) so it's portability is very good. This ampwas a wonderful deal at $300 when I originally bought it in 2011. It is still a good dealtoday - if you can find one used.", "id": 561}]