[{"review": "Purchased it to use on a 00-28 slotted headstock Martin and it just didn't fit well for me. Also found it extremely difficult to attach and remove. A string style worked a lot better, was a lot easier to attach and remove, and provided a lot more options for where it good be placed.", "id": 568}, {"review": "They do the job and are made well. I guess the high dollar cables are better but it's hard to tell the difference.", "id": 578}, {"review": "Wanted a good compressor on the front of my signal chain for a pedalboard setup for electric guitar and this pedal is working great for my purposes at a good price. Have it set for a little compression to smooth out and add some sustain to the signal before going into anything else and never turn it off.", "id": 671}, {"review": "For performing I'd go with something a little higher quality replay and more features but for rehearsing lead lines and solos over your own rhythm playing this is a great little unit at a good price. Would definitely purchase it again.", "id": 869}, {"review": "There isn't much I can add to the good reviews already out there that I read before purchasing these for my 91 American Tele but I will say I really like these tuners and I'm very happy I switched to them. High quality and great design. The guitar just stays in tune now, period. Attractive too with the Fender F on the face of the locking knobs and NOT a big bulky look like I thought they may be before I tried them. Very easily installed without any modification to the headstock of the guitar. If your thinking you might like to upgrade to locking tuners but having doubts whether you'll like them or if you should go with a different brand? Go with it and get a set of these! If your experience is like mine you'll be very satisfied.", "id": 387}, {"review": "Love this pedal. The Mod button just makes it sound like tremolo to me and I have great classic Fender tremolo on the amp I use so I don't use that option much. I just use it for when I want a little slap-back and it works great for that and provides a real nice analog tone.", "id": 507}]