[{"review": "I was very disappointed in both the quality and engineering of this product. A work-around for the main issue follows the review. The flaws that bother me in order of significance are:1) Quality: Very weak soft-metal screws. Using minimal force and a well aligned driver there was some damage to the screw-heads on all 4 that I worked with. 2 of them rounded out so much that I was afraid they would be hard to remove later, causing me to run to the hardware store for higher quality replacement screws.2) Engineering : The instructions recommend, and the screws (the ones that come with the straplocks) are designed for a #2 Phillips screwdriver. However, a standard #2 driver is too big to fit into the strap-buttons. So you are likely to have to choose between grinding down a screwdriver to fit, or using a #1 which will increase the impact of the first problem above since it is the wrong tool for the job.3) Engineering : The point of connection for the strap is 5/8th of an inch out from the guitar. The strap button has a radius about 3/16ths of an inch. Therefore any lateral stress (i.e. weight of the guitar) is magnified by more than 3x due to leverage pulling outward on the screw. A 9 pound guitar would be applying a constant 27 to 30 pounds of force on the screw and the wood around it (half that when the weight is distributed evenly on two strap buttons of course). Get a little too active on stage and the level of force could go way higher.Realistically, if the screws weren't total crap, this might have been a 3 or 4 star review. Once you deal with the fact that a normal screwdriver won't fit and get the things properly installed, it would probably work out for most people. So if you are stuck with a set, here's what I recommend:Go to a hardware store and buy #6 x 1\" oval-head stainless steel replacement screws. Note that these won't fit properly, but they are the closest match and can be modified. (They are 21 cents each at my local stores, and would have cost Dunlop maybe 10 cents more in bulk than what they paid for the crap screws that come with this.)Put the screw into an electric drill (pointy end in) so the screw head is rotating smoothly when you operate the drill. Run the drill while using a file or a belt sander to take a fraction of the diameter off the screw head. It doesn't need much. I used a belt sander and it took about 20 seconds each. While you are at it, file down a cheap #2 screwdriver so it will fit into the strap button.Install with the new screws as normal, and recommend that your friends try a different brand!", "id": 44}, {"review": "If you don't know what type of pick you like, buy a sample pack. Picks make a big difference to sound and playability. These are thin and flexible. Easier to use for beginners and easier for strumming in general. However the tone is different. So you'll need to decide what songs they work for, etc.As far as quality, these are great. Easy to grip, and as durable as most.", "id": 61}, {"review": "I read the reviews of the few similar options. I went with this one because reviews of the competition talked about how far back the guitars lean. Not much of that complaint here. But this definitely has that problem.My guitar is quite stable leaning back less than a third of what this stand causes. So this can't go in several out-of-the-way places I had hoped would work. Also, I was hoping to use two of these close together for a compact 2-guitar rack. However, the angle makes that very awkward.I hope to modify it to work, but I'm not super hopeful at this point. Will probably have to manufacture something to replace it..", "id": 132}, {"review": "The one I got did not have very much of the neon yellow rubber thing on the tip of the screw. I feel like if I tighten it too much, I could dent my mic stand tube. But I haven't dented anything yet, so perhaps I'm just too skeptical. In any event, it seems like a better design might make it easier to get attachments tightened down and facing the right direction. But everything works. It's getting the job done and I haven't seen a better option. All in all, a pretty good device.", "id": 246}, {"review": "Tone is subjective. I have little experience with tube voodoo. So all I can say is that it is working well for me. I would buy again.", "id": 514}, {"review": "There is a lot to think about with a strap lock... Is it 100% sturdy? 100% reliable? Does the design put undue stress or wear on the guitar? Can it fit in a case, or does it make you take the strap off every time you put your guitar away?The Fender-Schaller design covers all of these bases well. I believe it is 100% sturdy and reliable. Unlike it's Dunlop competition, the stress on the guitar is roughly equivalent to plain strap buttons. It will not fit in all cases, but will fit in many.I've switched over to this design and couldn't be happier with it.NOTE: I advise using a crescent wrench and a socket to tighten the nut. One always wants to avoid over-tightening, but the risk of under-tightening is high without proper leverage. If you don't really tighten the nut down, you are likely to have things fall apart while playing some day.", "id": 607}, {"review": "Wow. Very cool gadget, and well executed. This review is based on using it with a number of acoustic and electric guitars with various headstocks. I have not tried it with other stringed or non-stringed instruments.The thing is quick and accurate. The display colors are bright and easy to read. It does not have to do much guessing at what note you are playing. (In fact, if you play a chord, it will usually guess the root note of the chord.) It clips on easily and firmly. It is very sensitive. I find that I have a habit of plucking the string frequently and not taking advantage of the sustain when tuning due to other tuners that needed stronger input to work. But I can pluck a string and slowly wind the string into tune, usually without having to pluck it again before I have it right.As an added bonus in my case, the color happens to be a great match for an Epiphone SG G-400 in Cherry Red.", "id": 707}, {"review": "I was hesitant to purchase this, as I really like the display of the previous models. At first it seems like it might be less accurate. It has less granularity in the display for example. However, it does seem to respond noticeably faster. It appears to be a bit more sensitive and better at tuning bass notes. And it may in fact be more precise, though it takes learning how to work with the display.On earlier Snarks, the display has individual tiny gradients for each cent of pitch above or below the note. And they seemed pretty dead on, especially if you tune from the harmonic at the middle of the string. But I also found that the note would occasionally stall briefly causing me to over-tune. (Though once you get used to it, it is easily avoided.)Anyway, on this unit, I am not sure what each bar represents, but it is very sensitive. If the string is not quite perfect, the \"On pitch\" bar will be lit up, but so will one next to it. Then a slight turn of the tuning peg will bring it right on. Then only the \"On pitch\" bar will be lit (unless you turn too far). And the result sounds really right. I think I'll be putting one of these on most instruments from now on.", "id": 811}, {"review": "I was hesitant to purchase this, as I really like the display of the previous models. At first it seems like it might be less accurate. It has less granularity in the display for example. However, it does seem to respond noticeably faster. It appears to be a bit more sensitive and better at tuning bass notes. And it may in fact be more precise, though it takes learning how to work with the display.On earlier Snarks, the display has individual tiny gradients for each cent of pitch above or below the note. And they seemed pretty dead on, especially if you tune from the harmonic at the middle of the string. But I also found that the note would occasionally stall briefly causing me to over-tune. (Though once you get used to it, it is easily avoided.)Anyway, on this unit, I am not sure what each bar represents, but it is very sensitive. If the string is not quite perfect, the \"On pitch\" bar will be lit up, but so will one next to it. Then a slight turn of the tuning peg will bring it right on. Then only the \"On pitch\" bar will be lit (unless you turn too far). And the result sounds really right.", "id": 820}, {"review": "This is what it is... A super cheap mono cable. It should be sufficient for many needs and is cheap enough that thin wire gauge and such can be forgiven. Just be aware that it is cheap and unshielded, etc.For the price and intent, I almost gave it 5 stars. But it's not a 5-star cable... It's a fair quality ultra cheap cable. 4 stars seems about right. (Yes, this is almost exactly what I wrote about the other Hosa cable I reviewed.)", "id": 10}, {"review": "This is a well made guitar strap, and is exactly as described. Suede is of course less slippery than smooth leather, and 2 inches is fairly narrow. If this is what you want, then this guitar strap is perfect. If you prefer the strap slip easily, or distribute the weight of a heavy guitar more, then it won't be.Definitely top notch if this is what you are after though. 5-stars.", "id": 483}]