[{"review": "I have been playing guitar for over 30 years. I've owned and played a variety of guitars in my lifetime. My wife bought this guitar for me as a gift. I cannot begin to tell you how much I love this guitar. It is a solid, well built guitar. The finish is beautiful. The pictures do it no justice. It sounds incredible. It has great tone and sustain, wonderful harmonics. The clean tones are nice and warm. The neck is fast. No fret noise or hums. The pickups are really nice. Its very versatile and you can play just about anything with it. From blues to hard rock & metal. I would perform live with this guitar in a heartbeat. You cannot find a better guitar for this price. I would have expected it to cost much more. I am extremely impressed with this great guitar. You can bet, when I add the next guitar to my collection, it will be another epiphone. Well done Epiphone!!", "id": 30}, {"review": "What a great multipurpose guitar tool. It works great. I really like the fact that it is cutter, a winder, and a pin remover, all in one. The quality is really nice. Next time I place an order, I'm going to get another one as a spare. I'd be lost without this tool.", "id": 94}, {"review": "I decided to try these mainly due to the fact that I live near the ocean, and thought thermocouple up better. I restrung an electric acoustic with these and it sounds great with or without the amp. I will definitely recommend these.", "id": 198}, {"review": "These strings sound great. I was really impressed by the sound. They stay in tune very nicely. Great for beginners and intermediate players. I would recommend them.", "id": 201}, {"review": "Bought this for my son. Its perfect for practice. Great portability. Has a nice clean sound, as well as a decent overdrive sound. Sounds great with an electric acoustic. Its surprisingly loud for a small amp. You can't beat the price. I highly recommend this!", "id": 303}, {"review": "I was a bit skeptical at first to purchase this. But its a nice cable! No noise or hum whatsoever!", "id": 735}, {"review": "These strap pins are fantastic. They securely hold the strap on your guitar very nicely. The oval shape is perfect. There is no need for proprietary or expensive \"strap locks\". They are easy to install. These elliptical pins are great. Terrific yet simple concept. They also look great! I highly recommend these to anyone who has a guitar. I will never use strap locks again after trying these. Great value.", "id": 786}, {"review": "Great gig bag for acoustic guitar. Very well made with good padding. It has six nice pockets, a rubber bumper, and two straps. It fits the guitar nicely. I would definately recommend this to anyone with an acoustic guitar that needs a gig bag. The strap and picks were an added bonus. A great value.", "id": 865}]