[{"review": "Better than Dunlop polish. It really holds up well and leaves a really nice shine. Mine didn't come with a polishing cloth like the picture shows though.", "id": 194}, {"review": "These really sound great on my acoustic flat top guitars. D'Addario's are the best and I love the ball end color coding. No guessing or searching for the vernier caliper to make sure the right string is on the right tuner.This coding system is consistent thru all their string sets. Can't beat this.", "id": 198}, {"review": "This is a very secure and almost comfortable. There should be a pick pocket on both ends but it is a nice feature.", "id": 285}, {"review": "it's hard to keep the loose end under the holes and since the holes are metal they can scratch the neck of the instrument. otherwise it's a good idea.", "id": 356}, {"review": "Good cutter for guitar strings and will take care of most electrical wire sizes too. Handel is very comfortable too.", "id": 648}, {"review": "I can use this strap with either smooth or suede side on my shoulder.Actually I like the smooth side on my shoulder so it is easy to adjust position without pulling on my shirt.", "id": 656}, {"review": "This is a great winder. Steel shaft will probably last.One of these should come standard issue with every guitar.", "id": 683}, {"review": "I ordered this from the Amazon warehouse as a refurbished item. It was properly packaged but the base was broken and poorly glued together. The glue didn't  hold so the clamping base separated from the stem that allows the meter to swivel. This was unfixable so I sent it back for a refund. Warehouse deals are not such good deals.", "id": 706}, {"review": "Cable would be O.K. If the end connections would stay screwed together. Maybe some lock tight would help. These connectors worry me.", "id": 735}, {"review": "Easy to use and the clip is sturdy. A bit slow compared to the Snarks I own but I like it.", "id": 799}, {"review": "Very good for a quick tune up. Might be a little to tight for checking intonation. Very fast readout and fast on off.", "id": 811}, {"review": "It is a nice smaller version of the 114SI Road Pro.It would be great if it had a steel shaft.The plastic shaft feels like it will break.But it is cheeep!", "id": 347}, {"review": "I like this tuner as much as my SN8. It's accurate, fast reading, and has the added feature of  acoustic mode if you need it,", "id": 707}]