[{"review": "Good quality guitar cord.Very low noise, repairable, effective strain releaf,thick rubber cover!! This is a great buy, under 10 bucks for a quality cord.Of course I just got it..it might not be durable but it looks durable.If I change my mind about anything I will update my review.For now, I would say, buy one!!Joe", "id": 6}, {"review": "I bought a new guitar & got it a day before my fingerease was delivered. My fingers were squeeking & sticking on the strings & back of neck, BAD!!After applying fingerease no more squeeks & much easier to move up & down the fretboard!!This stuff has been around for years.1st time I saw it was 40 years ago.Can't argue with that track record!!If you never used it get a can, you won't regret it!!Joe", "id": 173}, {"review": "My new guitar had only the back strap connector.You can put out over $20 for a button strap holder but for under 5 bucks I decided on this.Attach short end to strap feed long end under strings on guitar head.You now have a quick release strap holder.Very well made & strong!!Happy I found this before spending way more than I needed to!!Highly recommend this product!!Joe", "id": 174}, {"review": "I was a bit hesitant to buy a guitar stand for only 10 bucks but glad I did.This stand is VERY sturdy, well made & durable.Foam padded everywhere guitar touches!! Can be folded for easy transport!! Rubber strap on neck rest ensures guitar will stay put if bumped hard!!Pleasently surprised at the quality of this stand!!Highly recommended, very happy with purchase!!Joe", "id": 519}, {"review": "Good thing I didn't trust the plastic anchors. I put a bit of weight on it & the screws came out of the anchors. The anchors stayed in the wall. I found a stud & it works & looks fine. Good inexpensive guitar hangers. I'm getting a few more!!", "id": 779}, {"review": "I bought the Special 20 Pro Pack(Keys G,A & C)!!Love them. Was using cheep Pidmont Blues Harps(toys)!!I had to have more, like an addiction!!I bought a D then this Bb, then E.Won't be long & I'll get a F!!This harp,Bb, has a beautiful tone.Always loved the sound of the Bb!!Made in Germany,quality musical instrument,not a toy!!If you own Special 20's then you already know how good they are.If you don't try one.You might end up with 6 like me,or more,in no time!!Worth every cent!!If they are good enough for John Popper & Bob Dylan they're good enough for me.A PLEASURE to play!!!Joe", "id": 828}, {"review": "How in the World can they sell a very good microphone for $15??The cord that comes with it is worth more than that.Bought it to hear how my harmonicas would sound amped.Very good sound quality, plenty of gain.Would reccommend this for voice or instrument use. Has a 1/4in jack to easily plug into a guitar amp.If you need a good Mic or Mics & don't wan't to break the budget get one or a bunch of em'.You won't feel so bad when one falls off the stage & breaks. You'll still have a nice cord you can use on any Mic!!Very good purchase.Joe", "id": 690}, {"review": "Very inexpensive soundhole pickup with a impressive sound.Very high gain,fits in all size soundholes.Good heavy construction.Of course it's not great.I'm not on stage or anything so works fine for a novice like myself.If you have a Taylor, Martin or Gibson that's not already AE this is not for you & I probably didn't even need to say that!!I just have a cheep Rogue that sounds good with this pickup.It's just a matter of how much you want to (or can) spend.I'm happy with this pickup!!Joe", "id": 789}]