[{"review": "I've been playing the uke since before they became popular again and must confess I own a quiver full of the addictive things (ranging from plywood beaters to a solid wood art object with an electric in between). Over the years, I've tried several different brands of string. The truth is there was nothing wrong with any of them. It's just that the Martin M600 strings seem a little bit more compliant than the others and this allows me to tease out a bit more articulation and tone. Given that string changing is a frequent occurrence with multiple instruments to fuel, the Martin string set's relatively low cost is a nice bonus.", "id": 45}, {"review": "UPDATE 12/6/2013: The very latest Vic Firth phones have a MUCH-improved headband and less-bulky earcups. While I now prefer the latest Direct Sound EX-29s (a vast improvement over my original DS cans, mentioned below), the Firth's are still VERY good and, as a bonus, cost half as much. I still use both brands.Please remember to carefully monitor your SLP (volume) level with ANY isolation phones. Without background noise for reference, one can easily play them too loudly which, in turn, can lead to hearing loss over time.UPDATE 4/23/2010: I now own three pairs of Vic Firth isolation headphones and I'm happy to report the original pair is still going strong. Meanwhile, my office setup now consists of two ART Tube MP units...carefully adjusted to add little/no volume to the signal path (unity gain)...as a vacuum tube buffer stage between a Behringer U-Control UCA-202 DAC and a small Behringer Eurorack UB-502 mixer to provide silky-smooth state-of-the-art amplification for the Vic Firth isolation headphones. The resulting sound is absolutely top-drawer and completely belies the incredibly low price....about $150 total...I paid for the entire system. Affordable technology in the service of great art!UPDATE 2/3/2009: These bullet proof headphones have definitely stood the test of time. I now own two pairs of Vic Firth headphones. The newest pair live in my gym bag. Both pairs have survived abuse that would make lesser instruments crumble (e.g. getting tangled in the crank of a spin trainer or knocked onto a cement floor by my cat).BONUS TIP: Because these are full-sized headphones with large ear cups, I frequently use them in conjunction with the new Hearos High Fidelity \"full audio spectrum\" ear plugs (&lt;$15). The combo works in much the same the way Dolby noise reduction does. I play my MP3 player (or other signal source) 12 decibels louder and the ear plugs then attenuate 12 decibels...leaving me with the same music and way less background noise. This stuff may not fit your head/ears as well as it fits mine, but you might try it if you're so inclined.ORIGINAL REVIEW: How does an ADHD adult maintain focus in a busy, high-tech work environment? Soothing music is part of the fix. Active noise canceling headphones? I've tried and replaced several...but they either sound badly, are prone to electrical/mechanical problems, or both. What to do? Vic Firth and Direct Sound have effective and durable answers. Isolation headphones. I own and use them both. The Direct Sound phones block a bit more noise...the Vic Firth are more comfortable for extended wearing. Both have excellent sound quality. Enjoy!", "id": 146}, {"review": "ORIGINAL POSTING:My first Mini, purchased over a decade ago, was a bad investment. The four neck bolts continually came loose, no amount of tweaking could get the intonation right (Note: adults should probably play the Mini-Strat \"tuned- up\"...I play mine at F - Bb - Eb - G# - C - F...or, if they have large fingers, they should probably use a capo with standard tuning and heavier strings) so the string tension is similar to their full-sized guitars), the pick-up pole pieces didn't align with the strings, and the finish was uneven. It cost $99 and I figured I got less than what I paid for. It was clearly a toy and I sold it for $25 without regret.Three or four years ago I extensively played a \"Hello Kitty\" Mini owned by a friend. It cost her $149 and, after I tweaked the intonation and the string height a bit, it was a playable instrument. I figured she pretty much got what she paid for. A decent little 3/4-sized traveler.Recently, after reading that Fender had upped the build quality of their oriental Squier guitars, I again purchased a Mini. I couldn't be more pleased. Right out of the box, everything about the instrument was spot-on. The construction was rock solid, the neck was straight, the strings were correctly positioned, the intonation was exact, and the finish was flawless. It was, in two words, masterfully made. I figure I got at least $249 worth of guitar for $99. How cool is that?The sound of the current Mini is \"classic Fender single-coil\"...shimmering with bell-like overtones. The pickups are functional, if a bit thin sounding compared to the Seymour Duncans I have on my full-size Strat. The six-in-line enclosed tuners hold the light gauge strings without slipping. The neck is perfectly finished and fast. Because it's a 3/4-sized guitar, the first and second-fret string spacing might be too tight for adult players with large fingers. But for everyone else, including fortunate children, the current Mini is a sweet ride. And at its present \"give away\" street value, this has to be one of the most fantastic bargains in the musical kingdom! Bravo Fender!June, 2014 UPDATE:The mini has become my preferred, go-to electric. I now have one for jazz with a single Lace Hot Gold in the middle position with a custom pick guard from Chandler Music's Pickguard Heaven (see attached photo) and a very versatile one with a Lace Red, Silver, and Blue pickup set. Why? For the same reason John Lennon once owned a 3/4-sized guitar, I suppose. Obscure chords and finger patterns are easier on the hands because fingers have to span less distance. I believe the slight tonal inaccuracy of the 3/4 scale is offset by increased finger-placement accuracy. Try it and I think you'll like it!", "id": 152}, {"review": "Most 12AX7 tubes do what the electrical engineers say they should. Psychoacoustics being what it is, I can't honestly tell you, for sure, Electro-Harmonix tubes are measurably better than the no-name Chinese tubes I replace. But I THINK the Electro-Harmonix tubes sound better, therefore they do. At $12 per shot, who cares? I suppose I could contrive a double-blind experiment to settle the existential question empirically, but I'd rather spend my time playing. Rest assured Electro-Harmonix is GOOD stuff and the price is right. Just do it.  ;-)", "id": 229}, {"review": "Behringer is a problematic company for me. Some of their stuff has been useful far beyond its modest, entry-level pricing (e.g. A-500 Studio Amplifier, UCA-202 DAC, Eurorack UB-502 mini-mixer)...and some of their stuff hasn't served me well at all (e.g. GM-108 amplifier, BTR-2000 rack tuner).Across the Web, reviews for the TO-800 are uniformly favorable. Based on this, I purchased one instead of paying many times more for an Ibanez TS-808. This proved to be a good decision. The TO-800 produces exactly the sort of sound enhancement that made \"seasick green\" justly famous: creamy smooth to raunchy depending on my whim.The same sound for a lot less money? What's the catch? I'm a musical hobbyist. The TO-800 will sit safely on my office floor and, most likely, never be actuated by my foot. The Behringer's shoddy plastic case and flimsy little control knobs, for me, are not liabilities. If I was a gigging musician on the other hand, I'd want the tank-solid construction of \"the real thing\" and its additional cost would be well justified.", "id": 381}, {"review": "I'm an audiophile, but I've spent most of my adult life looking for outstanding devices that make exquisite sound available to &#34;the rest of us&#34; at realistic prices. The UCA202 is a must-have DAC for anyone streaming or playing digitized music - whether MP3 or 192KBPS FLAC - via a Mac, PC, or Linux computer (especially laptops with notoriously-noisy audio signal pathways).Run your digitized sound through the UCA202, then through a tube buffer stage (for under $100 if you use a pair of Behringer  MIC100s set at unity gain) and then through competent downstream electronics and speakers for &#34;state-of-the-art&#34; at you-and-me prices. Then tell me what YOU think (grin).Or run a pair of &#34;best buy&#34; Sony MDR-7506 headphones (or Direct Sound EX-29s in noisy environments) directly from the the UCA202. Same deal (Laughter of the Immortals).Rest assured I've voted with my feet. I own a total of five UCA202s that I use in different locations. Folks, this is a STELLAR device at a throw-away price. Bravo, Behringer!", "id": 384}, {"review": "With the exception of the MC-1 classical, Fender has upped the quality of every low-end guitar it's associated with. The latest &#34;bargain basement&#34; Squier Strat Bullet is no exception. As other reviewers have indicated, a Squier Bullet...straight from the box...is ready to give guitars several times its street value full-on competition. But why stop there? If you've read some of my other reviews, you know I'm a serial hot-rodder. And THIS is my favorite 'victim'. Why? Because it's such a sound platform to begin with (pun intended).The basic stuff on the Bullet is very good...and for many, it's all that's required. But let's quest after some serious, big-league sound. The first things to upgrade are the pickups. The standard ceramic-magnet Squier pickups do yeoman's work, but they're wonderfully eclipsed by top-drawer pickups from Lace and Seymour Duncan. My favorites? A Lace Red Dually bridge with a single Lace Hot Gold parked half-way between the middle and neck positions. The Lace Hot Gold value pack with a Hot Gold Hot bridge pickup. And the Lace 'patriot' Red, Silver, and Blue value pack. You simply have to hear the difference these pickups make to believe it...and all you need to find out is a Phillips screwdriver, a cheap soldering iron, some low-temperature solder, a pair of wire-cutters, option YouTube 'how-to' videos, and some patience.But wait a minute, hold the phone...what about the stock pick guard? Please memorize this: Chandler Guitar's Pickguard Heaven. Better yet, Google it. They're wonderful folks and they do excellently-affordable work. With a custom pick guard, virtually ANYTHING is possible (e.g. how about a Seymour Duncan Dimebucker bridge?)!The next thing to do is to block the tremolo (whammy) mechanism. Proper vibrato comes from the fingers. Period. A small piece of oak from Home Depot, carefully whittled (not for the guitar's sake, but for your finger's) can be easily wedged between the guitar body and the die-cast tremolo string-carrier by removing (and eventually replacing) six Phillips screws on the back of your Strat. Hey, now you're Eric Clapton.If you want bold-as-brass sound, the stock plastic nut can be replaced with a brass Strat nut, a bit of careful filing, and a tiny touch of epoxy or Gorilla glue. Why bother? A more forward lead guitar sound. If you play rhythm, don't bother.Finally, if you're a monster about precise tuning and have basic woodworking skills, the very good stock tuners can be replaced with state-of-the-art six-inline tuners from several manufacturers. Note well: most folks will be more than well served by the stock tuners.So what's then point of all this? For the price of one genuine American Strat (which is a VERY nice ride if you can afford it) you can have three or four, arguably-equally-excellent Squier Bullets with a diverse mix of pickups and resulting sounds.", "id": 555}, {"review": "Over the years, I've literally owned dozens of electronic tuners...generally five or six at a time in various locations...ranging from a $12 Musiciansfriend promotional item to a $200 rack mount. Most have been in the $30 range from Sabine, Yamaha, Korg, and Seiko. The Seiko SAT800E is my all time favorite because, like Mama Bear in the fairy tale, it affordably splits the difference between \"too small\" and \"too big\". It stays put on the floor when I run it inline between my guitar/bass/uke and my amp and its LCD display is large enough to be legible when I'm standing. At the same time, it neatly fits in my ukulele case. Beyond that, it simply does what good electronic tuners do, accurately and without fanfare. Bravo.", "id": 532}]