[{"review": "I've been using the Dunlop Delrin 500 2.0 picks.  Purple ones with the turtle/500 on them.  I thought I had found my pick.  Because they were so slippery, I had to rough up each side to have enough texture to improve the grip (I'd rub each flat side against the edge of a honing stone).  At the music store I stumbled on the Dunlop Gator Grip 2.0.  Yes they do offer a better grip (I think they're still a little slippery but much better than the Delrin 500).  But since I solved that problem with the honing stone, I was more curious.  So - again, they are better, grip wise, but I was very surprised at the difference in tone.  They give a much mellower tone than the 500s and since I'm using these with flat wound 12s on an archtop - the less bright sound often is a better tone overall.  500s seem to be a harder material and are brighter.  I don't know what the Gators are made of but I do like the difference in sound. I'm not sure how they'd work on round wound strings - but great for jazz tones.", "id": 65}, {"review": "I always find it interesting the different opinions about products.  Some don't like the sound, others say these wear out in a day (really -- do you play for 24 hours?).  Some say that the grip is good.  Here's my take -- for what it's worth.  I've listened to these with hollow and semi hollow body guitars.  Round and flat wound strings.  My general take is that these picks give a better, fuller, rounder bigger tone overall.  Compared to the tortex style pick material (1 mm for the tortex).  It's a bit hard to determine if the sound comes from the material, thickness or a combination of both.  Also note, I play with the rounded edge, not the tip.  So the grip in the center of these doesn't quite fit my grip style but it's still ok.  I do find that these get slippery faster than the tortex materials if my hands sweat at all.  I've been subjective in my comparisons -- but this is what I've found so far.  I find that they stand out, sound wise, for the guitars I'm currently playing.  The process of finding the \"right\" pick is never ending and changes over time.  Give these a try and let me know what you think.", "id": 66}, {"review": "Purchased these for a new Heritage H-575 arch top.  A few months later, the high E string unwound from the ball end.  Overall good strings, good sound -- this set simply didn't last very long.  I will replace with 12s however.  For me the 11s felt a little loose.  The 12s will likely improve the sound of the jazz box.  I have 12s on an Epiphone Joe Pass model.  I'll be curious to hear how the 12s sound incomparison to the 11s.", "id": 259}, {"review": "I'm happy with this.  Used it to replace the blown speaker from a 30 yr. old 60W Roland Cube Amp (a bass player used the amp and I think it was too much for the speaker -- next time I'll use the PA for the bass player).  Much better sound, perfect fit, etc. Keep in mind this is for a very clean sound and this speaker was recommended for its clean and somewhat smokey-type sound.  I believe it has those.  Using this for jazz applications and having the Roland around as a second amp.", "id": 276}, {"review": "I had some issues with my 18-watt all tube amp so I experimented and replaced all the tubes.  Issues not only continued but worsened.  Hum, noise, volume fade, unwanted distortion at low volumes.  I eventually put back the original El84s and that didn't help.  Once I removed the Tung-Sol 12AX7 preamp tubes and replaced, the hum stopped, sound quality of the amp was consistent, quiet and back to par.  My experience with the Tung-Sol tubes was very, very negative.  They caused me to go out and buy another amp.  I had no idea that brand new tubes could sound so badly that fast.  I'll never buy this brand again.", "id": 514}]