[{"review": "I hate spending 13 bucks on a couple little pieces of hardware that probably cost 13 cents to make, but its better than the 20 bucks local music shops want for this same set.  Overall they work really well and look sharp.  They fit perfectly on my Schecter Hellraiser.  Very happy with my purchase.", "id": 44}, {"review": "Fit my 07 MIM strat perfectly.  Looks like a whole new guitar now.  If you have a Fender guitar then suck it up and buy only fender parts for it.  The Cheap china copies on ebay dont fit.", "id": 217}, {"review": "I have been playing for 9 years.  Have owned many different guitars and amps, tube and solid state.  Currently own and use...Marshall JCM2000 DSL 100 w/1960b cabMarshall MG half-stackFender Super Champ X2 w/Carvin cabFender Frontman 212rLine 6 Spider III 120 Watt 2x10Kustom 35 Watt Combo 1x12Out of my solid state amps, this one sounds the best.  In fact, this amp sounds great, gets plenty loud, is affordable, and is not some junk brand you have never heard of.  Has a great clean tone with a lot of low end.  Reverb sounds great as well.  A little overdrive sounds good too unless you use too much, gets quite noisy and loses its clarity.  Remember, this amp is NOT for metal.  If high gain is what your after, then stay away.  If you are into ANY other kind of music, then this amp is fantastic and quite good for the price.  Also, unless your playing with a drumset, this amp is overkill as far as volume goes.  100 watts is not at all necessary for the bedroom guitarist. If you are into ANY other kind of music, then this amp is fantastic and quite good for the price.  All in all this amp was a good buy and I recommend it to anyone in the market for a solid state amp in this price range....But this wouldn't be a very good review without having some cons.  So here are mine.  These are by no means deal breakers but I find them quite annoying.POWER SWITCH IS ON THE BACK?-I find it annoying to have to reach around the back of the amp and feel for the power switch every time I turn it on.  It is especially annoying if you are like me and have limited space and stack your amps on top of each other.  With another amp sitting on top of my Frontman 212r, the power switch is even harder to get to.EFFECTS LOOP IS ON THE FRONT?-The last thing I want to see on or around my rig is messy wires everywhere.  When using the effects loop, one has to deal with looking at two more wires hanging down over the front of your amp when they could be hidden in the back.  Not the end of the world but I just don't understand why.  Why Fender why?FOOT-SWITCH JACK IS ON THE FRONT?-This one is not so bad, but just adds more messy wires to the picture.REVERB IS NOT FOOT-SWITCHABLE.-Foot-switch includes \"Channel\" and \"Boost\" buttons.  A third button for \"Reverb\" would have been AMAZING.CAB IS MADE OF SUPER CHEAP PARTICLE BOARD.-Not that I expected anything different in this price range, but the \"wood\" used is so soft, that you CANNOT pick it up by the back.  I could easily break a piece off with my bare hand if I wanted to, no exaggeration.  I know because when I first got this amp I went to pick it up and I immediately stopped myself because I could feel it about to break.---BOTTOM LINE---BUY if...-This is the best amp you can afford-This matches the sound your after-You need the 100 Watts to be loud enough for a drumset-You want the Fender name and sound without the huge price-tag.DONT BUY if...-You play metal/hard rock-This is your first amp-You only plan on playing at bedroom levels-You can afford a tube amp", "id": 559}, {"review": "Fit my MIM strat perfectly, not much else to say.  Always buy Fender parts for Fender guitars, dont be cheap and order china copies on ebay, they wont fit.", "id": 562}, {"review": "The strap looks great.  Very cool design and looks good on my tele.  And all for 7 bucks w/ prime shipping.  So why only 3-stars?  This is my fourth strap purchase from Planet Waves.  I have grown to love Planet Waves' straps for their comfort and durability, and obviously the designs.  I thought that this strap was the same as my others only with a different design.  Mainly because at my local music shops, I have never seen/felt a Planet Waves strap that was NOT made out of their usual thick, soft, and durable material(whatever that might be) that I have grown to love.  This strap is VERY thin and brittle feeling, which makes it very uncomfortable to use.  This strap DOES slide easily on your shirt (which is what I prefer) but once it makes contact with your neck it is SHARP and it makes your neck sore and itchy.  Needless to say this strap is definitely not suited for playing without a shirt on, Ouch!  I have tried running it through the washing machine a few times with fabric softener along with using it constantly to try to get it broken in.  But it is still as sharp as it was out of the package.  Maybe with years and years of use it will finally soften up.  That is if it lasts that long.Overall what you need to know is that this strap is NOT the same as the other Planet Waves straps.  The material is very thin and brittle feeling; unlike the many other straps from Planet Waves.  If comfort is not important to you then get this strap.  The price can't be beat and will give your guitar that 70's look.  If I would have paid $20+ on this strap I would be furious.  But at only $7 this strap is still a steal.", "id": 657}]