[{"review": "I got tired of flying with my guitar everytime I go visit my parents.  Besides the risk to my guitar, there is the cost.  For the price I paid for this guitar, I will be money ahead in two visits to my parents.  I had it shipped to my parents when I bought it, and they are keeping it there for me for my future visits.  It has much better tone than I expected, and very good action.  Stays in tune very well.  I am very happy with my purchase.  Recommending it to my friends who need a second guitar for the beach or the tailgate party.", "id": 183}, {"review": "Bright easy to read display, adjusts to face any direction, so I can even use it with my Telecaster which has very little room on the headstock.  Accurate and fast. Can't beat the price, and battery compartment is easy to open, unlike some other tuners I have.", "id": 706}, {"review": "Easy to use.  Wide enough to cover all six strings in one pass.  Little to no excess residue.  Handy to use package, pull the cover off, swipe the strings, put the cover back on.  I have not noticed any effect on the tone quality or sustain of my strings.", "id": 730}, {"review": "I have multiple guitars, for different styles.  I use these strings on my Ovation Legend, for acoustic leads.  Good tone, good sustain, and they stay in tune.  I play 2 gigs a week on average, and practice everyday.  These strings get a workout, and I change strings when I start to lose sustain.  That's why I buy the 10 packs, so I always have spare sets on hand.", "id": 198}, {"review": "I started using the confetti picks years ago, when I used to occasionally drop my pick.  No matter what color the floor/carpet/stage is, you can find your pick easily.  No lost picks.I like the extra heavy picks.  They suit my playing style well.  I don't have to wait for it to snap back, It doesn't bend. They don't break, either, although they do wear down over time.KMC Music Inc shipped fast and I got free shipping.  When I buy a gross, I only need to buy picks about once every 7 years.I would recommend these picks to anyone who likes a heavy pick!  Thank you KMC Music Inc for fast shipping!", "id": 332}]