[{"review": "I like this product so much I buy them two at a time but I wish I didn't have to. The problem is that everyone else likes it as much as me! So it's like that guy who asks for a lighter...uses it...and puts it in his pocket every single time, these also seem to grow feet and disappear just like the lighter.I understand people coveting tools that work this well and are so convenient but if it turns them into kletptos maybe it should contain a stain pack to catch them like bank robbers.It's a decent tool at a good price so buy one...Then see how long you can own it!", "id": 94}, {"review": "After 35 years of buying stands all I can say is that I should have invented it myself. I have many expensive guitars and I wouldn't use a inexpensive stand before I found this design. So if you're shopping and wonder if it's really good, you can trust me, because I'm way over qualified to pass judgement on this and I care about guitars and about Amazon shoppers.", "id": 133}, {"review": "These strings are okay, but nothing special except for the price, which is a factor when changing twice a week. I don't play enough to need changes that often anymore.So I've become more particular about trying to match the string to the guitar. This doesn't mean that these strings are bad, it just means I might prefer Brand X Pure Nickel on one guitar because they're darker and Brand Y Steels on another because they're brighter and Brand Z on yet another.So give these a try and if you prefer them it will be best to check on price by the case of this or any string that you prefer because they should be changed twice a month at least, if you want your instrument in top shape. A bad guitar can make a great artist sound only good.", "id": 156}, {"review": "A good quality cable to use while playing sitting, to go down to my processor on the floor in front of me. The angle goes up tight to the floor unit and out of the way and 5 feet is plenty. Great cable! I use Fender's 15 foot angle plug from the processor to my amp because stepping on the plugs can break the jacks.", "id": 419}, {"review": "Love this strap! It's a good quality strap and I have three of them. Being comfortable and basic you can let your imagine run wild! Just go browse a crafts store and see what you can find to make it YOURS. I can't let on what I've done to mine because...they are originals...but you can have a blast making a one of a kind of your own. Come on, we're artists so show off your creativity.", "id": 659}, {"review": "I use these and the next heavier and have since they came out and the standard model before that. Great grip, slow wearing and they don't break. I've been playing since 1973 and switched to Dunlops way, way back and have never found another I prefered. So give them a try.", "id": 680}, {"review": "I've been recording professionally for 27 years; Music, radio commercials and television mostly. So I'll try to give you the information you need to make your purchase.I've owned and used so many mics and brands through the years I can't remember them all but I can I say I've never had a bad A-T. 4033's, 4050's and 4080's I use every week and have for years, the 4033 going back to the mid 90's and the 2020 is just a lower priced electret condenser from the A-T family. You have no idea the % of recordings that you're hearing this brand on, it's used by almost every studio on every continent, I work in the US, Italy to Scotland and can attest to this. But first let me tell you, very simply, where the negative reviewers went wrong.This is a XLR connection phantom powered mic, which is pro and best. So it requires a phantom powered XLR input, which all pro equipment provides and is standard on most home recording audio interfaces. Which you should really purchase along with this, if you haven't already, because for around $100 you'll improve your recording and playback and have a preamp and monitoring, you'll find one by searching audio interfaces. I have a RolandRoland TRI CAPTURE Audio Interfaceand a Focusrite I use just for playback in my office and den but they work well and you don't need Avid HD's to get started. Audio interface is just another name for an external sound card but will provide the proper input and gain meter. Getting your interface away from the electronically noisy computer has been SOP since the dawn of digital. I see that small USB mixers are available which would be another option. Don't try an adapter on it, it won't work, as this needs power through the cord to charge the field effect transistor, but power supplies are available and after that adapt however you want. It doesn't come with the cord, what a surprise! Quality cords will cost about half the price of this, but a $15 version will probably do for most.It doesn't come with ashock mountbut you can purchase one if you like. Work with it, you may not need one and the recorded vibrations rumbling will tell you that you do. You'll need a windscreen and a popper stopper typeShure Popper Stopper Pop Filteris the usual, but I can also recommend using 2 large $1.49 foam screens with the top cut from one as this mic is side address and you will need to cover the entire screen. This isn't about being cheap, there are times that the goosenecks are very inconvenient and don't work at strange angles and you'll probably always need one or the other.This does not come with a stand, so pick up a boom stand if you don't have one and pay no attention that the negative reviewers will tell you they tip over, 18 wheelers also tip over.RecommendedUse a sandbag or whatever on the leg opposite the mic or remove the boom and top portion and slide on a barbell weight and put it back together or create a proper counterweight where they've put a faux plastic one. If it's possible, you could mount a boom from the ceiling and run the cable on hooks, eliminating vibration from the floor while keeping the cable out the wayMicrophone Flange Male. For desktop users, here's what I'd do. Using large Command strips and Velcro I'd fasten this to the deskAdjustable Desk Microphone Standand attach thisTelescoping Mini-BoomHere's another optionMXL Mics MXL-BCD-STANDUnderstand that recording has progressed by meeting needs and experimenting, if you need something figure it out, your clean, quiet recording is proof that it works.I can't justify comparing this to my $500 to $4000 mics like it but if there is a better value buy it. $82 wouldn't have bought a case for most of my condensers. It sure beats most non electret, electrostatic DC bias or dynamic style mics. The 2020 is certainly an entry level professional mic and in many situations could be substituted for a 4033 without issue. Also individual mics have a sound, of the eight 4033's I have, I prefer 3 of them and use them the most. So when reviewers say it's bright, I say compared to what? I can tell you what it sounds like.....KA-CHING! a great sound in audio recording. Uh huh, I know of one professional recording it's on and the client was clueless that I used an $82 mic. Think about it, would this be as good as what was used 40 years ago? Have you heard good 70's recordings? Anyone purchasing equipment because it \"sounds\" better ought to have earned enough to slap down cash to pay for it. Lot's of reviewers have opinions about this mic so don't ignore them but ask yourself this, do they have formal training and experience with 200 different mics in many studios and are they using expensive gear from their console to their monitors to reveal its true capabilities? Any noticeable increase in sound quality might cost $400 and won't be half of what you'll achieve by improving your recording technique.This type of mic is excellent for overhead, acoustics, amps or brass and of course vocals, really most recording needs, having a less uni and more omni, cardioid directional pattern than stage mics hyper pattern it's better suited to recording. Just understand you can't get too loud near it or you'll overdrive it since it's designed for up to screaming vocals, so back off with loud amps and brass, which also means you need a quiet place for recording because it'll pick up your AC ducts and your neighbor's TV. That, is a good thing, what's bad is you trying to do good recording in a noisy environment, so don't blame a mic for your extraneous room noise. You can't just use a different microphone or noise gates or processors of any kind, just quiet, anything else is a pail on a sinking ship because this is an acoustical, rather than electronic, signal to noise ratio. A 10db pad will reduce output but doesn't affect the diaphragm and its input and acoustical foam won't help, that's not even its purpose, I suggest reading this on acoustics and foam, music.tutsplus dot com/tutorials/beginners-guide-to-acoustic-treatment--audio-1274 (just replace the [dot]). Turn off your heat/air, be careful of headphone bleed and do your recording between 3 and 5 AM, when the world's a quieter place and that will really help, you'll likely hear how loud your computer fans are. You can get underground in your basement or build blanket walls, or buy used office partitions but you need quiet, I've known acoustic players who've worn gas masks to cut the sound of their breathing. If this is what your budget allows for it's an excellent first step into recording and this type of mic and likely this brand would be my first choice for a first recording mic no matter the cost. I keep saying \"this type of mic\" and the reason why is because A-T sells 14 models like this style up to $3000. This model is the lowest priced but you're buying a reputable brand. If your future plans include using only one mic, without the ability to use any traditional recording hardware, you can look here.Audio-Technica AT2020 USB Condenser USB MicrophoneOr hereAudio Technica AT2020USB+ Cardioid Condenser Microphone w/Pop FilterThis is not my advice, you will also lose the higher quality playback and the supplied recording software that comes with an interface. This model is not USB.Now pay no attention to the descriptions of how it sounds, I won't tell you because how it sounds to me on my system won't apply to you and your system and that goes for all audio, descriptions are worthless, only unplugging one piece of gear for another matters. This is important, all audio equipment either accurately reproduces or doesn't, the recording cannot sound better than the source, so a microphone can only reproduce sound more or less accurate than a different microphone. Accurate or inaccurate, not good or bad, there's a difference. It's during the mix that you make it better or different from the original sound. Apply these same thoughts to your home stereo, saying instead, playback cannot sound better than the recording and that's why accuracy is important in your monitors.So search out any info you don't understand and don't expect to be a competent engineer without years of schooling, training and having worked in a professional setting. If you're lucky like I was, after 1 year of tech school I worked on site repair (studios often need PT) and apprenticed while continuing my education for the next 3, then after 3 years of work (TV) with another year of school I became a studio owner. Real recording involves a facility, equipment and techniques as involved as a surgeon in a hospital. So study electronics, acoustics, the auditory cortex, everything audio, train yourself to hear the smallest sounds all day, it never stops. When making any purchases I recommend reading and research and realize this is a tool and because you can buy a tool doesn't mean you're educated in its use. So yes, I also don't recommend buying a scalpel and trying surgery on your little brother, unless.....But everyone of us started somewhere so get some equipment and start recording, quit all that sleeping, eating and other unnecessary activities and just read and record! Just short sessions at a real studio will also open your eyes and be educational and some will allow you to just stop in and talk, I have. So keep up the research because no man knows it all and I'm just here to help you out. If you need a good, small, inexpensive stereo amp check this one out. Topping TP22 Digital Mini Amplifier", "id": 254}, {"review": "I will let you know that I've been using boom stands for 35 years and that I write this so you can make an informed decision. I'm loyal to the audio community and the industry has already put one of my kids through college.I see half of this stand as being just fine but the boom is not very good. I particularly don't think the horizontal axis point is very good, I mean where you adjust the angle of the boom. It's a cheap version of a simple design and I suspect the day will come that you're trying to figure how to keep it from drooping, the problem being that the surface area is much smaller creating less friction and more tightening until something's got to give. The tightening screws to slide it also seem pretty poor and I'd predict someday you'll be going from duct tape to replacing it. I base this more on my experience in sound reinforcement, which is harder on equipment than recording and because I own both types of businesses. The boom in general isn't a nice one and will always be 32 inches because it isn't telescoping and uses a pretend plastic counterweight, so you're mainly purchasing the stand. On Stage has a better line they call the 9700 vs this 7700 series.9701B Pro Tripod Microphone Boom StandJust like you can't compare the price of a used compact car with a new full size pickup, this one is so inexpensive (too inexpensive?) that price comparisons aren't what's important, so looking at Amazon today I'd probably buy the 9700MS9701TB TeleBoom Microphone Standor this one,DR Pro Mic Stand Telescoping Boomor maybe try this oneHosa MSB-521BK Mic Stand with BoomI haven't tried that stand but since Hosa generally sells good inexpensive products I'd be inclined to give it a try. I think you'll end up spending more money on your next stand and you might as well do it once instead of twice. I'd pay attention to the 2 and 3 star reviews because you'll find more from experienced users and the most helpful 5 star do not say how long they've been using it but love how inexpensive it is. Ignore that it doesn't come with a mic clip because usually they don't, clips come with microphones or can be purchased separately. All but the best stands will fall over when unbalanced, so plan on putting weight on a leg if you're using a heavy mic like a condenser or spending a lot more money. $100+ will buy you a studio boom although a counterweight, like what's used on a cymbal boom will help any boom stand and could be created with a little imagination. As for the cheap cord clips, just forget them and buy these, they'll attach to a stand or cord and work excellent (no leftover duct tape glue).Velcro Reusable Self-Gripping TiesBut understand my position, I've got stands purchased 20 years ago that I can still use and don't feel the lowest price is always the best value, but you're intelligent so you know an $80 stand used for 20 years is $4/year, I use stands almost everyday and I don't think this would last me a year and maybe only months. But if1. You don't care about a telescoping boom and2. You don't plan to adjust it much and3. You use a average weight mic or4. You're alright with replacing the boom when neededThis stand could be fine for you now if you can't budget a higher quality stand and it will surely work for some. I did give it 3 stars but 2 are for the product and 1 is for the price. So I hope all of this helps you with your decision.*I've now purchased and reviewed theOn Stage 9701Band recommend checking it out*", "id": 279}, {"review": "Being a studio owner I didn't buy this for stage work. Being a player of multiple stringed instruments for decades I've had many different tuners including real strobes. So when I picked this up about 8 months ago it was because I needed one where I was at and right now.I don't know about the +/- .1% accuracy but the pegs and my ear tell me it's quite accurate, enough that I can find notes up and down the neck that are slightest bit out of tune when using it. By using a transformer adapter and a stage mic it also works very well for acoustic instruments.I'm still using the replacement battery I put in about 6 months ago but I just use it and unplug. It's travelled with me a few times and airport security finds it an interesting thing for me to have in a carry on but it almost seems durable enough to drop from 35,000 feet and continue working.I was shocked by how well it works. I was shocked by the fact that I could spend so little and get a real tuner and not a device that gets you close. Highly recommended.", "id": 651}]