[{"review": "I bought this product to use on my amp pots. It restored the sound,power and clearity of my amps.It doesn't evaporate right away, but after a couple of minutes your good to go!", "id": 14}, {"review": "I bought these because I wanted durable, flexible picks for easy strumming. I would recomend these to anyone that needs more stable strumming.", "id": 62}, {"review": "I bought these strings to try on my guitars. They sound good on a variety of models, like SG,Les Paul, Rickenbacker. They have a melodic tone and good intonation, and they seem to be lasting and staying in good shape.", "id": 156}, {"review": "First of all I liked the fact that it came coiled in a circular coil instead of the bow tie pattern that leaves bends through out the lenght of the cord.  The jacks are sealed in rubber and provide stress relief. It sounds ok for the price.", "id": 168}, {"review": "I bought these strings to replace the strings on my Hofner acoustic. The gauge is pretty good for a deeper tone. I might try a lighter set next time, but these have a good clear tone from low to high, and are fairly comfortable.", "id": 199}, {"review": "This is a good product. The construction is pretty good. It will give you a variety of bass tones. You have to buy a 1/8 trs to a 1/4 ts adaptor to line out to your amp or sound system.", "id": 547}, {"review": "This processor is okay for home practice if you need something other than just a dry signal. The sound is a little too electronic for me. I bought an RP-1 and it sounds much better.", "id": 600}, {"review": "These picks are ok if you need them to be on the stiff side. I was looking for a semi-soft felt picks.", "id": 695}, {"review": "This music package by Led Zepplin is historical and put together well. Great for any Zep fan. Great audio and video. I especially liked the unreleased version of For Your Life!", "id": 855}, {"review": "I've been using this product for many years. It has always worked well for me. I just spray a little on my hand and then rub the neck and strings, and I'm good to go!", "id": 173}, {"review": "This unit is well constructed.Switches and knobs feel sturdy.The user guide is informative.It has a wide tone range. I usually play a Hofner club bass and it sounds deep and clear.It is useful if you want to dial in a good sound and just leave it set. It doesn't have presets. You can loop an effects processor thru it.", "id": 236}]