[{"review": "Header says it all. Works well enough as a string winder, but I was really lookin for something to pull my bridge pins with and for me, this did not work well at all. Went back to my trusty rubber tipped pliers and just had to be gentle.", "id": 94}, {"review": "What can I say, I am a string snob! Ive tried MANY different kinds of strings for my acoustics and the Elixir Nanowebs are by far the best strings I have ever played.I had a set of another major brand on a cheap Washburn I bought, and I changed them out with these strings and WOW what a HUGE difference. The guitar has such a great ring to it.Also use these on my Taylors. These will give any quitar a beautiful voice!Pros:LifeSoundPlayabilityQuality and DurabilityCons:Price", "id": 109}, {"review": "Let me start off by saying I have had several types of humidifiers all of which have worked well. The major upside to this humidifier is you do not have to worry about over-humidifing your guitar! Packets maintain a constant relative humidity and they couldnt be easier to use.One star short of a 5 star review. Why? The price for the replacement packets.Other than that, a wonderful system!", "id": 406}, {"review": "These picks come in a large range of sizes, but most of them are way too thick to play any guitar with.There is a really funny smell to these when you first use them that gets on your fingers, but it goes away after a bit.They seem to be decent quality. The thin picks have not torn on me yet and the medium gauge picks dont wear down too quickly.These are ok to have around the house to play with but I would not recommend them for live performance.", "id": 567}, {"review": "Purchased this Snark tuner after reading a few positive reviews and decided to give it a try. For the money I figured why not.GREAT little tuner. Dead on accuracy and perfect for tuning in rooms where you may have noise interference using regular tuners. This clips to the headstock and  is very easy to use.The face pivots around and the display is nice and bright. I will pick up a few more and toss em in my guitar cases!", "id": 706}]