[{"review": "I bought this as i had already purchased tow other Joyo pedals just to see what the buzz was about.This phaser is perfect.  I do not use a dramatic effect, more or an EVH setting for leads.  This pedal is 99.8% sounding like the MXR.  I never give anything a 100%.  This is a a great phase pedal, great tone and a great price.  I am done thinking a good pedal must cost $200 and above.  This was like $35 and sounds awesome!", "id": 727}, {"review": "A bought this pedal to see how such a cheap stomp box could get such great reviews.  Plugging it in and playing it for 5 minutes one can see.  It has tons of gain on tap, it responds well to the guitars volume knob, it creates a wall of overdriven amp tonal love.The pedal cuts through and is articulate.  It's not for modern metal but it can do any kind of hard rock.  Think AC/DC and Van Halen to Metallica.  It's a classic rock pedal that screams!!!Buy it.", "id": 794}, {"review": "Thick, harmonically rich, articulate overdrive.  Amazing sustain, booming bass, even mids, chrystal highs.The pedal responds well to the guitar's volume and easily replaces my holy fire, custom badass od, and every other OD I have.How this pedal is so cheap is beyond me.  Just buy it.", "id": 795}, {"review": "I bought this pedal to use in a min rig as an experiment and I love it.  I use the pedal as a preamp going into a PA or poweramp.  The pedal is hyper versatile going from clean to heavy grind.  I use a classic box clean tone with a little bit of bite.  It is quite responsive to the volume knob on the guitar.  I have a VFE Alpha Dog and an MXR Custom Badass OD before the pedal. After the pedal I use an MXR phase and Flanger, VFE Blueprint Delay and then a Byang Triverb.  When all is said and done my tone is phenomenal and no one can tell when I am not going through a more traditional amp rig.  Buy the pedal, it's great!", "id": 798}, {"review": "First let's get the easy stuff done with.  This capo is beautiful,  It is clean with an even silver matte finish that looks good in the box (nice packaging) and equally good on the guitar.The capo is solid, the spring mechanism feels good in the hand and when it clamps down on the neck you can see (and hear) there was thought put into the capo to make sure the pressure on the string is even and the neck is well protected. No sharp points to damage the guitar.  And this thing is easy to use, squeeze, put on neck, done.  You could easily move this during a gig and then store it on the edge of your neck when not using it.  I tried this on my acoustics and electric and was happy with both.  When playing the strings behave as normal.  No odd muting or dropouts.  The capo is solid on the neck.I have to say I have not used a capo in a while because the one I have is pain.  With this new capo I am happy to use it.  This thing is great!  Easy to use, efficient, sturdy, looks nice and SOUNDS GREAT!", "id": 887}]