[{"review": "I bought this bench on an Amazon Warehouse Deal so that I could get it on Prime delivery and was not disappointed at all. The bench is very sturdy and comfortable - the cushioning is thick and soft. The item arrives flat packed and can be adjusted to the correct seating height in seconds. This bench is just what I was looking for and I'm sure it will serve its purpose for many years.", "id": 306}, {"review": "I once bought a guitar case that came with a variety pack (from light to heavy) of Planet Waves picks. Since then, I've used nothing else.I've found that the light picks, (.50mm) are perfect for me. These obviously don't last as long as thicker picks, (but still last a very long time), and they suit my playing style and the type of music I play better. The picks are comfortable to hold and are attractively designed in a faux mother-of-pearl style. I'll definitely continue to buy this brand in the future.", "id": 575}, {"review": "I have acoustic guitar experience to a novice level, but I have also wanted to learn the Ukulele for quite some time. As I had never so much as touched a ukulele before buying this one, I looked for a low-cost soprano to see whether I would enjoy playing such a similar looking but very different sounding and smaller instrument.Upon receiving this item, I tuned it up and had a little play using a few basic chords I learned. The Uke sounded acceptable, but I was (slightly) disappointed by the sound of the default supplied strings. Also at first (as I expected), the Ukelele went badly out of tune quickly when playing, but after a few hours the strings broke in and now keep their tuning with only occasional minor tweaks required.Of course, most cheap ukuleles come with fairly terrible (and cheap) strings so it would be wrong of me to be too critical when this instrument cost so little. I have now ordered some Aquila strings from Amazon to replace the default strings - i.e. I bought theAquila AQ-S Nylgut Soprano Ukulele Strings. I am still waiting for delivery on these, and will update this review when I eventually fit them as to the difference it makes, (which I expect will be a significant improvement in sound based upon my research.) To be honest though, the default strings on this ukulele aren't *too* bad so I may wait a while to install the Aquilla strings until I can play more competently and get the benefit of them!As far as the design and quality of this ukulele goes, I was pleasantly surprised and impressed. The paint-job was blemish free and well done, the unit appears to have been assembled well using adequate components, and the tuner backs on the reverse of the headstock are decorative little gold dolphins, which is a nice touch. The unit definitely belies its price and is a very nice looking instrument.For the money it costs, it is difficult to voice any serious gripes at all with this ukulele. I'm very much looking forward to getting more competent with the instrument over the coming months. I really couldn't imagine giving this ukulele anything less than a full five stars - it's great.", "id": 589}, {"review": "I only have a low-cost Mahala ukulele so I wasn't expecting much of an improvement when I replaced the stock Nylon strings, (after watching several Youtube videos showing me how to do it). I was wrong. These strings sound much better - the sound is much brighter and &#34;cleaner&#34; than the nylon strings my ukulele was supplied with when new. The Aquila strings took about 30 minutes of continuous playing and stretching until they settled and now they stay tuned for long periods. My ukulele now sounds wonderful for such a cheap instrument and is limited only by my clumsy fingers. I would definitely recommend these strings to any uke player looking to replace their stock nylon strings with something better.", "id": 698}, {"review": "I bought this to use primarily with my newly bought Ukulele, but it also works perfectly to tune my old acoustic guitar too. The display is large and clear and the reading is extremely accurate. I wish I'd bought one of these years ago instead of tuning my stringed instruments manually \"by ear\". Until now I'd assumed I tuned my instruments perfectly well, but this unit proved me wrong - both my Uke and guitar sound better after being fine tuned with this.This little gadget saves time, improves tuning accuracy and is absolutely perfect for the job it is designed for.It comes supplied with a CR2032 battery and a basic protective bag to keep it in when not in use.", "id": 763}, {"review": "I couldn't be happier with my choice to buy this product over the many others listed on Amazon. This was a newly listed item on Amazon when I bought it, (in fact this review will be the first), so I was a little apprehensive about choosing something that had no user feedback, but I'm glad I decided on this item.I wanted something with several storage compartments, so I could organize all my guitar accessories in the case properly. This bag has six separate compartments for storage - three main zipped compartments, each also with a zipped pocket for smaller items. Perfect! I also needed some new plectrums and this particular case came with a nice quantity bundled, as well as a guitar strap that I don't currently require as I already have one, but it's nice to have a spare now.The padding of the bag is quite thin, but firm, so is more than adequate enough to protect my guitar from bumps during transport and carrying. The two built in \"back-pack\" straps will certainly be useful when traveling with other luggage, and the case also comes with grip sized carry handles both on the front and the side ensuring the guitar can be carried however a user wishes to.If you are in the market for a guitar bag and don't want to spend a fortune, I would definitely recommend you consider this item. It is perfect for my requirements, and may well be for yours too.", "id": 865}]