[{"review": "It functions as designed.  It saves time when restringing a guitar.  It's made pretty well for a plastic tool.  Definitely takes less space than a wire cutter and a cordless drill to change strings.  Admittedly, the cordless drill would be used mostly by luthiers, but you get the point.", "id": 94}, {"review": "The mounting process was simple.Recommendation:  Buy a cheap magnetic stud finder if you don't already have one.  You don't want your instrument plummeting to the floor!I got a stud finder off Amazon and mounted two of these hangers.  They're holding up very well. The backs of the guitars are practically flush with the wall.  Whether that's a good thing...is up to you.  I guess I don't have to worry about it potentially swinging into the wall as much if it were bumped.  So maybe it is a good thing.Be careful when you hang it though.  It could definitely hit the wall if you don't place it on the hanger carefully.", "id": 154}, {"review": "This is a handy little contraption.  I'm using on one of my cheaper guitars. It wasn't compatible with the other strap I've been using and I had a difficult time getting it to secure to my strap, but it worked well with the strap on my other guitar.I think it's a good idea and practical for being on the stage and switching instruments quickly.", "id": 174}, {"review": "The price is fair and it serves its purpose.  I'm pretty happy with this cloth.  I just wish it was bigger so I could have a greater surface area of the cloth to use before washing it.  I haven't had to wash it yet, but it looks like it would hold up.", "id": 184}, {"review": "D'addario makes a pretty good string, but I'd have to say I prefer the Elixir. The sound is a little brighter, and the strings last longer with Elixir. Don't get me wrong though, I still like these.  If there's a sale, I'll buy some more.", "id": 198}, {"review": "It serves its purpose.  Doesn't hold as many pick as I expected.  Looking back, can't see why I really need it.  A plastic bag does fine.  In fact, I don't think I've ever used after the first time I put the picks in it.  I just use the excess picks I put in a ziplock bag.", "id": 233}, {"review": "It's a very fair price and is made well.  It seems as though it will hold up to some kicking around.  The only thing that worries me is that once the bottom piece swiveled and dropped my guitar...and this was when I just set it down not a few seconds before it fell.  I'd recommend easing your guitar into place and making sure it's secure.  I'm not sure how &#34;on stage&#34; ready this is.  It's a good, cheap stand though and for the price point, I understand the sacrifices they made in the design.", "id": 258}, {"review": "It works well.  This is a classic design that people have used for years and I can see why.  It it isn't broke, don't fix it.The only suggestion I would make is to have a different soundhole cover.  Maybe a sturdy plastic? The soundhole cover that is included is a very cheap, disposable plastic that looks like it was shipped with a cheap trinket.  I think the price is a little high for what it is. Rubber and foam tube?  Why do they charge so much?  I'd like to know the markup.", "id": 299}, {"review": "The price is a great selling point, just by itself.  I use it with my acoustic guitar and the On Stage FS7850B Guitar Foot Rest that I bought off Amazon as well.  It's a good combo.  It leads me to playing for longer periods.  It's solidly constructed.  It folds and is definitely portable.  Great buy.", "id": 306}, {"review": "This is quality construction.  It's definitely a must.  I'm a taller guy and it's important to have proper posture for longer playing periods.  I'm glad I bought this.", "id": 321}, {"review": "It's cleaned and polished pretty my Taylor guitar pretty well.  I would recommend this.  If not this one, at least buy some kind of cleaner/polish.  Protect your investment.", "id": 351}, {"review": "I love this little device:The colors of the display are a nice touch (red on the left hand side and green on the right).The color of the device.The interface is great and the clip works well.It's very accurate and I love how its chromatic function and the fact that it has a very large letter for the chord (versus being hard to read).A very attractive price.  I bought two.  It would be easy to have one for travelling purposes and to leave one at home just in case you lose it.  And it's so cheap, it wouldn't matter if you lost it.", "id": 707}, {"review": "I honestly don't see the purpose.  It doesn't seem to have improved my experience with my strings on my guitar.  I've used it a few times, but don't see the benefit.Edit 5/30/13:After coming back to read the other reviews, it's obvious what happened:  This was shipped to me completely dry.  There was no grease/lubricant qualities.  It was like a dry erase pad.  They need to improve their quality control.  I'm changing my rating from 3 star to 1 star.  They HAVE to find a way to fully secure this gap or maybe consider enhanced vacuum sealing packaging.I would suggest if you receive this product and it hasn't dried out yet, to place this product in a air-tight ziplock bag to reduce the likelihood of this drying out.", "id": 730}, {"review": "This capo works very well!It applies just enough pressure due to the adjustable design.  The rubber seems to hold well - it's a bit thin and seems like it could wear over an extended period of time, but I've had no issues as of yet.My guitar stays tuned for longer periods due to this capo's design.  I also have a quick-change Keyser and I can say I prefer this one for practice sessions, but the Keyser for performing.  This one is too slow for the stage.", "id": 541}, {"review": "I was disturbed with the price of banjos, until I did some research on the construction of them.  They're not something a regular craftsperson can put together without some serious experience.  At least, they wouldn't be able to put together a quality banjo.  But Jameson Guitars had put together a great banjo and an incredibly fair price.The tuning holds well and the instrument sounds great. I'm a guitar player and I'm excited to explore the different sounds I will be able to get out of this banjo.  It's also very good looking.  I love the neck and the back.  Even the drum.  Quality work was put into this thing.  I'm quite pleased.Now, I just need to get used to playing with 5 strings! :)", "id": 649}, {"review": "It's no frills.  It doesn't feel like quality leather to me.  The construction is pretty basic.  It is a very good value though.  It does seem like it can deal with some wear and tear.", "id": 656}]