[{"review": "I bought 6 of these XLR to 1/4&#34; adapters hoping to connect my microphones to an old funky mixer I owned with 1/4&#34; inputs.  It didn't end up working because I discovered I needed to convert the microphone level to line level (which these don't do), however they do convert XLR to 1/4&#34; balanced quite well.  Just not what I needed in my particular situation.", "id": 12}, {"review": "I bought this XLR splitter to split the lead vocal from FOH to my monitor rack.  Used this way it worked great and I never had any problems with signal loss or power issues.  I began using a transformer isolated XLR splitter after we started playing bigger venues and no longer use this splitter.  My only issue with the Hosa Y splitter is that the cable length from the female connector to the male connectors is very short, so short that it would cause the microphone cables to stick out from the mic stand when I plugged it into our lead singer's microphone.  It would be great on a guitar mic or something that's close to the ground, or horizontally placed, but it looks a little funny coming off of a vertical microphone stand.", "id": 13}, {"review": "I bought this cable for my band's live show setup.  I bought it almost a year ago and still currently use it for the same application.  While not the best quality cable, the length and price make it a good value for the money, especially if you're buying several at a time.  I don't use these cables in the studio but for live, they're fine.  I'd recommend this cable if you're on a budget and looking to buy several at a time.  If you're only going to buy one, I'd look into Canare or Mogami, they're a little bit more expensive but easy to get and worth the price.", "id": 16}, {"review": "I purchased this rack last year to hold my outboard recording gear.  I liked the fact that it was open in the back so I could patch things in and out easily before I bought a patch bay.  I find it very sturdy and well made, and I've loaded it almost completely full.  I do recommend placing the heavier units towards the bottom.", "id": 322}, {"review": "It's great to have a few extra mic clips on hand and for the price, these are great.  They hold SM58/57 perfectly.  Not cheap or poorly made at all, a great value.", "id": 179}]