[{"review": "Really great clamp, fastens to a vertical pipe very securely, great quality. A very nice addition to my collection. I highly recommend.", "id": 143}, {"review": "I use to mount a portable digital recorder onto the side of a mic stand. Very stable clamp mechanism, works very well. Price is good. Nice to have in your gadget bag.", "id": 246}, {"review": "I use this boom attached to a desk clamp to hold a talk back mic (a cheap SM58 wannabe from Radio Shack). I like how I can collapse and tilt back the boom so it is out of the way when not in use, but then I can  easily position for use with a generous 16 inch reach. Definitely cannot use this with a standard desk mic stand weighted base because of the tip risk, but a clamping mount works very well. The locking clutch is excellent, with a large nob and secure teeth. The smaller knob to control extending the boom is also more than sufficient. Just what I needed.", "id": 291}, {"review": "Needed a stand to lift my PA mixer off the floor for safety and ease of use. For $20, this is a sturdy little unit and collapses nicely for transportation. But it is a definite tipping risk if used at anything higher than the lowest height setting.I took the lead from reviewer W. Jones and \"removed the upper brackets and inserted them with the longest bars horizontal instead of vertical, and although my amp was more stable, I still didn't feel it was stable enough to set it on the highest setting.\" I am using at the lowest height and it is stable, but I highly recommend a heavy sandbag on the back if any other height setting is used.I give four stars for great value at $20, will suit my needs very well.", "id": 517}, {"review": "Bought two of these inexpensive adapters and am very satisfied. I am not having any problems fastening to a stand or cam corder, and I am able to clamp the swivel lock very securely. I am only using for light-weight applications. Certainly worth the $7.", "id": 548}, {"review": "Just needed a simple canvas bag to hold speaker stands on top of my pile of PA equipment on a cart. Aside from the two speaker stands, I can fit two mic stands and the bottom of a music stand. Very simple, sturdy canvas construction, thick zipper, two sturdy handles. I don't expect to carry equipment around in it much more than to get on and off my cart, so I'm assuming the stitching is more than sufficient. At $20, this bag looks like a great value.", "id": 552}, {"review": "Great mount for the price. Filter attached to mount is great idea, saves space and simplifies mic stand setup. Quality good, especially given fairly low price.", "id": 584}, {"review": "I use this small stand in my vocal isolation booth to hold the iPad that remotely controls my audio software via the Splashtop app. Very secure, effective clamp that connects to a vertical pipe. I covered with thin carpet to reduce reflection, and I find that it holds my iPad securely. I highly recommend.", "id": 592}, {"review": "By now, you have probably read about the problem with the USB connection generating a high pitch sound during recording making the USB functionality unusable (an Amazon reviewer referred to this as a \"fatal flaw,\" and I heartily agree). I experienced this firsthand, then read folks struggling with the issue on the Mackie support blogs. When I called Mackie support to seek a fix, I was told that the problem was well known and the newer lots had been corrected with new hardware. They sent me a new Mackie Board from the newer lots, and I returned my old one. I have not had any problems with the USB functionality since. I am thankful to Mackie for the great customer service, especially since I addressed the problem after the one year warranty had expired.I'm assuming that purchases made now will not have the problem, but if it does, contact Mackie to get a replacement.At this point, I am still running the board through its paces, but thus far so good.", "id": 652}]