[{"review": "This is a typical inexpensive hardshell guitar case made in China.  I bought it to replace the original (chipboard) case for a 1963 Gibson ES-135 archtop.  Lower bout is 16&#34; wide, upper bout is 12&#34; wide, body is 21 &#34; long, and it's about 5&#34; deep at the bridge.  Fits very snugly in this case which is what I was hoping for.  The case is about 4&#34; longer than the top of the headstock but I didn't expect an exact fit.  The wood shell is thin so don't drop anything on it but it is also lighter than a lot of other cases.  Normal plush fake fur inside with about 3/4 of soft foam all around.  Black tolex on the outside is thin but looks okay.  This is NOT a case to take on the road or if you travel by air but it is adequate for casual use.  Only annoying thing: the case arrived locked.  The keys were, of course, inside the case.  Dumb.  A friend at a music store used a key from another Guardian case to unlock it.  A good reminder that the case latch lock is to keep the latch from popping open and NOT to keep crooks out.", "id": 320}, {"review": "I have been using a ZT Lunchbox Amp for about a year.  Blindfolded you won't confuse it with a Marshall stack or a blackface Deluxe but for a small, portable, solid state amp it works as advertised.  People that say it is loud aren't kidding but there are limits.  The sound from the 6.5\" speaker requires some space to develop.  Up close it can be painfully loud but the sound is rather directional and it lacks bass.  I use mine for practice at home and for low-volume band rehearsals.  I played it once on stage, mic'd through a PA, but wasn't happy with the sound and switched to a tube amp with a 12\" speaker.To me it sounds best with humbuckers but I've played single coil guitars (Fender and Gibson) through it with usable results.  If you are after clean volume you might be disappointed.  It only gets so loud before distortion (and noise) becomes annoying.  Players that use a lot of distortion (e.g., Metal) will get a lot more out of this amp than players that need cleaner sounds at volume.  While the ZT Lunchbox isn't as versatile as some other small amps, it is great for a \"one trip\" load in at rehearsals.One thing to consider is adding the matching ZT extension cabinet.  It makes a big difference in two ways: two 6.5\" speakers move more air and the doubled speaker cone area helps thicken the sound.  Also, because the speakers can be angled and separated the area covered by the sound is increased.  This is a big help at rehearsals.  I point one cabinet towards myself and the other into the room.  I've tried using a guitar speaker cab, a PA speaker, and a PA floor monitor as an extension speaker but the ZT extension cabinet sounds best to me.  It's the same size as the ZT Lunchbox and they thoughtfully put the handle on the back so you can stack them.For an ultra-portable guitar (or harmonica) amplifier that can get decently loud the ZT Lunchbox is hard to beat.  But if you are particular about tone you might find that a lower wattage practice amp with a 12\" speaker works better.", "id": 685}, {"review": "I've been playing guitar more than 35 years and have used a lot of electronic tuners.  The first was slightly larger than a paperback book and cost what a cheap guitar sells for today.  But it was a godsend tuning up backstage while another band was playing.  Over the years tuners have gotten smaller, cheaper, and easier to use.  The Planet Waves PW-CT-12 is my new favorite.It is very small - a little bit larger than a grape.  Despite some of the other reviews I have used it with good results on a Strat, Tele, Les Paul, and ES-335 electrics and on acoustics from Martin, Gibson, National Resophonic, and Voyage Air.  I clamp it on the headstock between the nut and the low-E tuner.  I didn't expect it but it is out of the way enough to leave on while playing.  Previous to this my favorite tuner was a chromatic ukulele tuner built to clamp on the top of the headstock.  Small and accurate but to use it behind the headstock I have to read it upside down.  The PW-CT-12 is nicely out of the way even when I play an F chord with my thumb on the low E string.  It's so light I don't notice it's there.The display is bright and easy to see in most light.  A bit hard to read in direct sunlight but I do my best to avoid playing without shade anyway.  The display is small - a dime can cover most of it - but the characters are large enough to read in normal playing position.  The '#' sharp symbol is small but once you are familiar with the display you recognize it.  (No flat symbol.  Bb is displayed as A#.)  The tuner has auto shutoff to make the battery last longer.  The display uses bars to the side of the note letter and color to indicate tuning.  It's red until you get close then green with a bar on each side when you are in tune (for example, |E|).  I found it to be stable enough to be easy to use for quick tune ups between songs.These are inexpensive and intended to be discrete so the clamp is small and thin.  Rough handling will probably break it.  I notice that the clamp is easily removed so I'm guessing Planet Waves may sell replacements.  The clamp was not intuitive the first time but the instructions do cover it.  It is a ratchet rather than a clamp.  You press a small tab and gently pull the clamp out then push it down on the guitar neck.  For this reason this is not a tuner to pass around.  It's meant to be left on an instrument.  (It's small enough that you can leave it on in the case.)  If you need a tuner that is moved frequently there are better (and larger) choices.  It can be moved but it is a good tuner to set and forget.  I'm going to buy a couple more to leave on my most frequently used guitars.Other reviewers commented on accuracy.  If you want strobe accuracy there are better choices.  For that kind of accuracy you also need a larger display.  This tuner will get you close quickly and you can use your ears to fine tune if necessary.  I haven't had a problem except with guitars that have built-in intonation problems (like old Nationals) and they need tweaking even after a Peterson Strobe.Soapbox: especially if you are a new player, do yourself a favor and learn to tune your guitar by ear!  Try tuning the strings to a reference pitch or each other then use the tuner to check.  Learning to tune by ear will help you in more ways than I have time to list.  Being able to hear the intervals in a chord and know which string is off is an invaluable skill.  People that can only tune with a tuner will take much longer to develop that, if ever.", "id": 785}, {"review": "I've been playing long enough to remember when &#34;small&#34; electronic tuners were the size of a paperback book and had prices approaching $100.  New tuners like the Snark SN-8(B) are a joy in comparison.  The display is good sized and easy read (without my reading glasses) and the tuner responds quickly and accurately.  The only complaint I've heard about this tuner is that the clamp is tight.  Yeah?  So?  It won't fall off while you're using it (or playing) and you shouldn't leave anything clamped to your guitar when you aren't using it anyway.  You can't beat the price for a tuner this easy to use and it comes with a cleaning/carrying bag too.  I've used it with standard and altered tunings on guitar, bass, banjo, mandolin, ukulele, and tipple.  This one works.One suggestion for any younglings reading this: take it from an old f*** - electronic tuners are great, especially for tuning back stage or in other places where it isn't quiet but please, do yourself a favor, and learn to tune by ear.  I've met too many young players that cannot tune a guitar without an electronic tuner.  If the battery dies they are tone deaf.  Trust me, the ability to tune by ear is a skill you will always use.  If a string goes sharp or flat while I'm playing I can tune it back without stopping.  I would not be able to do that if I hadn't learned to tune by ear.", "id": 811}, {"review": "This is a simple humidifier for guitars with a round sound hole.  It would not work for an f-hole archtop or other types of instruments such as mandolin or ukulele.  Inside the sturdy plastic case is what appears to be an ordinary kitchen sponge.  If you use distilled water (as recommended) it should last quite a while.  The top comes off with a gentle press on the sides.  The dry sponge can be a little difficult to remove with fingers but tweezers or needle nose pliers work perfectly.  Don't push it all the way in after moistening and you won't have a problem.  I drip a little distilled water on the sponge, squeeze out any excess, and the assembled case pops in easily between the D and G strings, suspended in the middle of the sound hole.  They can't be seen in the photo but there are small ridges on each side that hold the top in place against the strings.  I've never had one of these move from where I left it.If the sponge isn't dripping wet you should never have a problem with drops of water in the guitar or case.  When the humidity is very low (30% or less) the sponge dries out in 2 to 3 days even if the case isn't opened.  As with most humidifiers of this type you will have to check every few days.If you have ever had a crack appear in the top of favorite guitar (or don't want to see one) use a guitar humidifier!  Especially during the winter - heating a house tends to drop the indoor humidity below safe levels (between 45% and 60% is ideal for most guitars).  Air conditioning can do the same.  For especially valuable guitars it would be worth buying a hygrometer to keep in the case but for most guitars having one in the room where you keep you guitar(s) is okay.  For many reasons it's always best to keep your guitar in a case or gig bag when not in use.  A humidifier is inexpensive extra precaution at those times of year when temperature or humidity changes quickly.", "id": 71}]