[{"review": "Normally I prefer a harder pick but I switch to these after 9pm when playing my acoustic guitar to keep the peace with the neighbors. These super light flexible nylon picks are great if you're trying to play quietly. If you prefer a flexible, softer pick as many people do these are also excellent for your regular go to pick.", "id": 63}, {"review": "I installed this in two minutes. I was planning on just using my twist-n-lock drywall anchors I bought at home depot to install some shelving recently but that's what it actually came with. These anchors are great. I used an 11/64 drill bit for the pilot holes. Don't use a bigger bit. It might be tempting to use a 1/4\" drill bit if you're thinking of the push in type drywall anchors. That would be a mistake. These are better and screw in. I used a manual ratchet screwdriver. The anchors go flush with the wall then you screw the wood screws into the center of the screw head and through. I recently installed several shelves in two apartments (a friend saw mine and wanted some too) and these are the anchors I used. Of course a stud is better and also if your drywall is already crumbling that's no good. For a typical well maintained house or apartment though this should be fine even without a stud. I have a Schecter five string bass hanging from it and I'm confident that's not going to pull out from gravity. A heavier screw would still work and add confidence than the one packaged. One such as the screws packaged in actual twist-n-lock anchors. Looks nice. Decent price.", "id": 166}, {"review": "I put these on my \"campfire acoustic\" Black Yamaha F335 and they look stunning. The tone seems slightly brighter, however, I go through strings pretty fast so a lot of the difference I am hearing is admittedly likely a result of going from dead strings to new strings. Since they are replacing plastic pins I am going to skip scientific analysis and give you a subjective \"sounds good\".These pins are a little thin (small) so they may slide out of the hole easier than the ones they are replacing. If you need to this should be remedied handily by applying a small amount of tape to the pins. This may not be necessary, however, even if they are slightly loose because the pins when used correctly are not a wedge to keep the string in the hole. The string should go all the way through the hole, into the body of the guitar. Insert the string so that you are sure the ball is inside the body at least a few inches, if possible it should be listing toward the neck. Then insert the pin with the slot facing the neck and push it in firmly. Unless you have really thick strings these slots should be ample for this. Then gently pull the string tight making sure that the ball does not grab the end of the pin. Instead it should be up against the body of the guitar and stopped from escaping back up the hole by the pin. The pin itself should not really be holding it in place all on its own. Usually the pins popping out are because the ball is actually hooked onto the end of the pin and is pulling it up out of the hole. If you avoid this you should also avoid the frustrating mishap of having the pin come flying out and poking you in the eye while you're trying to get your guitar in tune (typically ruining a brand new string in the process). If you can get your hand inside the guitar and feel the ball end of the string you should be able to feel how it it sitting against the body (correctly) or hanging on the pin (incorrectly). Also your tone and tuning stability will be improved by making sure you have a proper string installation.These fit my guitar snugly but not tightly, however I do not have problems with them popping out despite the fact that I do a lot of string bending a whole step or more (sometimes using two fingers' strength to bend that far). Overall I am quite pleased with these.", "id": 206}, {"review": "Firstly let me address the &#34;adjustable backrest&#34;. There's nothing adjustable about the backrest. The seat moves forward and backward about two inches which actually is a considerable difference in how it feels leaning back against the backrest but the backrest itself doesn't move, the seat does. It also does not adjust up and down as you would think an &#34;adjustable&#34; backrest should. The backrest cushion actually has a hard stop top that prevents this. But the seat does adjust slightly forward and back (presumably this is the purported backrest adjustment the description repeatedly asserts) and it does adjust up and down over quite a range so adjusting for height should not be a problem. The footrest, however, is welded in place so if you plan to use the footrest you're again limited to where you can put the seat in height range.All this aside I am still giving the stool high marks because it's a fair price, it does fold down with some extra dis-assembly for transport to venues and I find it works well for me. But for how it works for me you should know: I wanted this initially to play sitting down without a strap. I found that no matter how I adjusted the stool that I was just not comfortable with how the guitar rested and so I use it now exclusively with a strap. In this way however it's actually really nice because I can use the footrest or not at will and I can also stand up, walk around and then sit back down at will. Without the strap, though, my playing dexterity is compromised by slight balancing required to keep the guitar from smashing to the floor (at least in my mind's eye).If you want a stool that folds up and goes with you this is not that stool. You do need to loosen the screws and take the seat post out and remove the backrest. Then you're left with several pieces to schlep. Not difficult but it would be tedious to do this every day.Overall though I am very happy with the way this stool feels. No more couch and kitchen chairs for me.", "id": 518}, {"review": "I've been a musician for most of my life, playing primarily keyboards recently in the studio and with bands, saxophone and a little bass guitar. I've owned a six string guitar for 20+ years that has seen very little use. I had this misconception that my hands &#34;just weren't designed to play guitar&#34;. But recently my life changed a little bit. I have a young boy that's now master of my universe, a lot less room to leave musical gadgets lying about, and I now live in an apartment building where making a lot of noise tends to be frowned upon.I picked up this Micro Crush because I was originally looking for a micro Marshall and I saw this pop up. I knew I already liked the sound of Orange amps (better than Marshall given my druthers of musical taste) and for $69 it seemed like not much of a reach to try it out for myself.Shortly after a small package of value came to me with this charmingly tiny amp in it. My son's mom thought it was a toy &#34;it's so small!&#34; Yes you might think so until you plug it in. The idea here is to sound loud without being loud. This amp is perfect for that.Most of the time I have this thing turned up to about 1, 1 1/2, rarely up to 2 or beyond. I've got a simple effect chain going in: EH Soul Preacher (compressor/sustainer) -&#62; MX Analog delay -&#62; Cheap (but pleasant) Chinese Phaser -&#62; EH Holy Grail -&#62; Amp. I use this as my &#34;clean&#34; sound without the overdrive. It is beautiful. A little Dick Dale-ish. Then when I want a little edge I turn off the phaser and delay and turn on the overdrive. Maybe nudge down the volume a little more and I can rock AC/DC licks at midnight without raising complaints from the neighbors. And it sounds ... BIG!No this is not the same as actually BEING loud. For one thing your ears won't ring. The cops won't come knocking to serve a noise complaint. Knickknacks will remain on their knickknack shelves.  The dogs won't howl.But should you desire to rock out at midnight in your apartment building this amp fits the bill.So much so that I, the man with the hands &#34;just not made for guitar&#34; now have guitar callouses, a lust after a couple $1.5-$2k guitars one of which will soon come home with me and frankly a love for playing the guitar that I never had before in my life. This all because I can just set up my little rig next to the couch and it's always there. Always ready to go. So I play while I'm watching football or baseball. I play while I'm watching the news. I play while I'm playing Crazy 8's with my son. I play morning, noon and night. Not only that but I'm actually getting to be not-that-bad at playing either. Lots of playing/practice seems to inevitably make on better (hint: do those finger exercises too, they work).So I am not exaggerating when I reiterate my headline: this little amp changed my life (for the better).Best buy for under $100 I've made since I bought my son his Strider balance bike. Which is orange too!", "id": 528}]