[{"review": "i was pretty happy with them when i got them and finally used them and will likely pick up more once i need them.", "id": 90}, {"review": "Works as advertised.  I was a bit skeptical when the product arrived, but I just set up my acoustic guitar with this product and it does work.  Pretty simple, even if you're \"technically challenged.\"  Easy to use.  Haven't gigged with it yet, but I can imagine that this strap \"isn't going anywhere,\" regarding its functionality.  Not a \"pretty\" product, but good stuff.", "id": 174}, {"review": "Bought this on a whim.  It works well when utilized with the amp in direct fashion.  When used with a pedalboard rig, it doesn't add much except for hiss, unfortunately.  Sweet sound with an older Fender amp unit, though.  Does not sound good with updated equipment, Line 6 equipment, Roland units.  I'd say definitely do not get this if you're a tech or gear head.  Get it if you're a simple player with few FX in your arsenal.  It does sound good when just utilized with amp and guitar, amp, wah, and guitar, or amp, wah, guitar, and expression pedal.  Nothing else I've tied it to has seemed to work out, though.  Probably a wasted product with where I'm headed as a technical player, but good for beginners and intermediate levels.  Into King Crimson/Fripp styles?  Don't go for this for modeling.", "id": 182}, {"review": "These strings have a tonal quality that will change your life, if you'eve ever wondered how the greats such as Wes Montgomery, George Benson, and Larry Coryell have been able to get their awesome, mellow tones.  I'd recommend this even to metal players as a change of pace, as they may get something out of it that they've never considered before.  Obviously, this takes someone who is willing to give a change to their accustomed style of playing a try.  Trust me - I've been playing professionally for decades, and I can say that there's no way I'd turn my back on these as a jazz enthusiast.  Also, if you're interested in saving the skin on your fingers, this product will help, as I haven't even come close to the normal amount of skin shedding experienced previously on roundwounds.", "id": 259}, {"review": "Guardian?  Well, it is padded, but I've only gigged once since having the item (with 3 rehearsals held prior) and I can say that the case is nicked up \"pretty good,\" as they say in the South.  Yes, it will last, because it is a guitar case, but there's no way there's enough security to protect an instrument on a plane.  Now, that's for flight cases to handle, but don't even come near abusing your instrument while it is housed inside this case, because you may be disappointed to have to buy new parts once the \"guardian\" fails to guard against crushing your hardware.  This item is not one of the better cases out there, but it does suffice, and it does look good.  The first day I got it, someone said, \"nice case, it looks great!\"  Say that now, though, after using it outside the house 4 times, and you'd be a lying SOB.", "id": 320}, {"review": "This product did not fit my Takamine G, as the hole is 3/4 size.  I had to buy from Lute Hole, who then customized a part for me.  Beware, because you'd figure this item would fit inside any guitar out there, given the advertising.  Even the guy at Guitar Center, when I called to find out what was going on, told me to go with Lute Hole.  I never had a use for such an item before very recently, but, upon necessity, I found out that this item is bound to damage your guitar, even if it does fit.  Be very, very careful.  In fact, be very, very wary, as I briefly heard a light \"cracking\" noise when I tried to fit it in the guitar for the very first time.  I stopped, thereafter, after doing research online and finding out about the G's specs.  I've read, elsewhere, that it kills your tone, but I had been willing to try to utilize it in tandem with my actual coloring rig.  Ultimately, I spent nearly $100 more than I wanted to, just for this kind of item.  What is it they say in this era - caveat emptor?", "id": 497}, {"review": "I give them an excellent rating.  They do last a long time, and they do not seem to alter in tone and get that \"muddy\" sound when they're aging.  In fact, I'd say they actually do manage to approach David Gilmour's tone at times!  I could barely believe that, of course, but after playing hard for a few hours, I actually said to myself the phrase: \"Wow, that sounded like David Gilmour somewhat.\"  So, the fact that that occurred without me actually thinking about Pink Floyd or Gilmour and just being lost in the playing says a lot, because I then realized I had strung up the guitar with the strings that day.  Get them if you like Gilmour.  I'm hard on pricing, usually, but I say these are priced decently for their effectiveness.", "id": 499}, {"review": "The title says it all.  Great performance, sub par construction.  I bought this pedal for the compression and sustain, though, and am very pleased.  I use it for both bass and guitar, and it processes the signals well.  I am sure it would work well for other instruments or on recordings also.  Cheaply made, though.  I removed a spring that was seemingly attached to nothing inside the unit.  The removal stopped a terrible clicking noise that would have been audible from the stage floor.  Plastic encasement means the unit will likely suffer noticeable wear and tear throughout its lifetime.  Wish it was better made.  Audio reproduction is great!", "id": 645}, {"review": "Just got this, have used it for recording and rehearsal, it works well so far and I will revise the review if that somehow changes in the next few years.  Right now, though, I'd say great product.", "id": 18}, {"review": "Not as sturdy as some I've used and seen floating around, but it gets the job done as advertised.  Not a terrible buy.  Construction is a bit on the cheap side, though, as it is mostly plastic and seems a bit fragile around the edges.  The clipper and winder work well, though, even though they are both predominantly made of the same lower grade material.  However, all you really need are the two functions, and they work.", "id": 94}]