[{"review": "Grabbed these on impulse as I needed some new ones. Normally I used the old Fender Medium or Heavy picks, but I gotta say these are great. Stiff but flexible enough to maneuver plus they glide nicely. Not sure what could be said to prove it, but they just feel great.", "id": 54}, {"review": "Great solid switch. Works well for giving your Telecaster the option to run your pickups in both series and parallel.  As for those who have questioned if the travel is too much for some switch plates all I can say is that I have this in several of my Teles and I have never had a problem with the switch travel being too much for the plate.", "id": 113}, {"review": "Very nice cable. I used this with my Planet Waves 9v adapter. It works very well, all my pedals powered off one adapter is very useful. The Onespot adapter itself would probably be even better as it only takes one place on a power strip etc instead of a chunky old school adapter like the Planet Waves style. Really nice product for the price.", "id": 192}, {"review": "Super nice locking tuners. Used these as a direct drop in replacement for my Paul Reed Smith SE245 and really helped with tuning and stability. The smaller tuner buttons looked a little strange at first, but once installed looks great and works great.", "id": 275}, {"review": "I have these on several of my guitars and I love them.  Nice and stable, easy to change strings and lock tightly.  Always check the diameter of your peg holes prior to installing. To note these have the two peg placement anchors on them, so if your headstock only has the single hole for the tuning peg, you will have to do some drilling. Really nice upgrade for your standard tuners.", "id": 387}, {"review": "Great picks, not just for Jazz though. I play pretty much everything and these work really well for most styles. Takes a little getting used to the smaller size and feel, but once you do they are fantastic.", "id": 413}, {"review": "Awesome little untreated polishing cloth. I have purchased these for all of my guitars (more than I care to admit) and they are fantastic. They clean great, removing all oil and fingerprints and they are reasonably priced. Awesome product to keep your axe looking great.", "id": 437}, {"review": "Awesome tuner, really fast and responsive. Best of all it is accurate, enough so that using this for setups has resulted in a much quicker easier process than I had anticipated. Nice and bright so I can clearly see it on stage in the dark. Occasionally I get a small pop when I engage it but not that frequently. This pedal feels good and sturdy too, I really cannot see anyone breaking it unless you feel the need to leap from the monitors on to the switch. Price is easy enough that if anything should happen to it, I would not think twice about picking another one up.", "id": 504}, {"review": "Good little stand to hold your guitars.  They function well and are inexpensive.  The only downsides are that they are a bit light, best to place them near a wall, just in case you bump them. Also, it seems that every one that I have ordered (Here and MF) have had the foam a bit crushed up simply could be the packaging from the manufacturer though. Do not use these (or any other foam for that matter) on Nitro finishes.  Good product at a Great price.", "id": 519}, {"review": "Great polishing cloth. Not much to say here other than it works and works well. Removes all the fingerprints and polishes my baby up like new after each practice or gig. Can't go wrong.", "id": 572}, {"review": "Great product. D'Addario always makes great products at great prices. I use these on my pedal board and they are always reliable and cost effective.", "id": 578}, {"review": "Great product, with a little soldering knowledge (really basic in fact), you can fix that noisy jack in no time at all. Nice and snug with my American Stage Cables (D'Addario is great! Hey, R. Ford uses them).  Great price too, much less than what my local music shop asks for these.", "id": 674}, {"review": "I purchased these to replace the springs on my USA Standard Stratocaster.  These hold a lot more tension than the modern style black springs.  Holds your Trem solidly in place and reduces travel during bends.  Using 10's on my Strat, 3 springs was sufficient, if you want to hard tail it, just drop all 5 in. Great product.", "id": 676}, {"review": "Purchased these to replace some failing power tubes in my Vox NT15H, and all I can say is that they are great.  After a little break in these brought some new life back into my amp. Greatly improved the tone over the stock Sovteks that where in there originally. Great product for a great price.", "id": 687}, {"review": "This is an absolutely amazing Reverb pedal.  TC toneprint is very much a novelty, a very useful one at that if you want to dial in some really nice presets. Where this pedal really shines is in it's endless ability to tweak the parameters using the downloadable editor. You can spend hours finding &#34;Your Sound&#34; or just &#34;The Sound&#34; that you need. High quality chassis, excellent switch and input/output jacks that give a satisfying thunk, indicating your cable is secured.  Don't forget to lift the back panel to adjust the dipswitches to change the true bypass, tone dry through etc... All and all a great one stop reverb pedal with tons of tone and potential that should last a lifetime.", "id": 748}, {"review": "For the price I can hardly complain, but unfortunately the item was not the correct size for a Fender Strat replacement. Checked it Against my American Standard, MIM Strat and Squier and it would not fit any of them. Should have just used one of my dog's chew bones and cut it myself, would have been more accurate.", "id": 857}, {"review": "What really can you say about Switchcraft, they just make good solid parts.  Grab one, drop it in and replace that old broken import jack.", "id": 884}, {"review": "D'Addario always comes through for the musician who wants a great product on the cheap. I've used boutique strings for many years, but always come back to these. Great tone, great string life (with a little maintenance) and very reasonably priced. Loved these as a replacement for the Fender Super Bullets that came on my USA Fender Standard Stratocaster.", "id": 156}, {"review": "I typically play D'Addario .010's, but I wanted to see what all the fuss was about with these. Well I gotta say, I'm not stricken with disbelief at these, but they are very nice. Overall I would say that they feel about the same as my D'Addario strings, but if the price is right I wouldn't mind a substitution every now and again. They DO bend very nicely, obviously your guitar's scale length and your ability to bend strings may vary.", "id": 226}, {"review": "Love this stuff, I have been using it for years and it always does the job well. Cleans polishes and has a pleasant citrus scent. Cleans off grease, fingerprints, old beer and restores that sweet shine.", "id": 351}, {"review": "Purchased this tuner awhile back to be able to check my tuning periodically without having to access my in line tuner. This is a great tuner IF YOU KNOW WHAT YOU ARE USING IT FOR. With that being said, this little clip on is not intended for gig use per say. If that is what you are looking for, an inline tuner would be much more efficient and accurate. This little guy is best suited to practice (if you are like me and don't use your primary rig for at home practice and don't feel like breaking out the old pedal chain) it does the job and does it well. Now could you use it for a gig? Sure I suppose so, but bear in mind that it is not an \"in-line\" tuner therefore any excessive background noise will cause the accuracy to be a bit off. For the price it can't be beat. It swivels (although not much) but enough that you can clip it on, read the nicely lit LCD and tune up quickly. Great product that every player should keep in the case with their guitar.", "id": 799}]