[{"review": "Epiphone LP Special II Les Paul Electric Guitar, EbonyHello again. I have written a review on this guitar just after I purchased it and now it's been over a year and I still stand by my positive review. I own about 8 guitars now and this guitar is one of two of my favorites. My other favorite is a Dean electric 12 string.  When I hold and play this Epiphone Les Paul special 2 guitar it feels and sounds like something I could take on stage but it doesn't have the cost associated with a Gibson. What's also amazing is that it's still around a $150. It's well worth the noney. It stays in tune and it high quality. Well worth the money. I just purchased an electric/acoustic Epiphone ukelele today for my Chiropractor. I will review that later. If you are looking for a Les Paul guitar this is not one. Not his typical style although Amazon does sell one for about $250 so don't let the name fool you. It's still a very nice guitar though. Very solid construction and a beautiful polished ebony finish and tuners. I highly recommend this guitar. Buy it!  Thank you.", "id": 31}, {"review": "I bought this recently and I love it. Why?  It has no &#34;smell&#34;, it leaves no residue on your hands, it's very &#34;light&#34; but yet it cleans, shines, and polishes your guitar beautifully.  It leaves a protective coating on the guitar which not only protects the finish, it also makes it ultra-shiny glossy and brings out the rich deep colors. This is fantastic stuff. If you own a guitar this is the best product out there. But what else can you expect from a US company like Gibson. I was very suprised that it was this effective. This little bottle goes a long way. I have already polished all of my guitars and my friend's guitars and I still have more than 1/2 a bottle left. If you need to polish your guitar look no further. This is your best choice.", "id": 81}, {"review": "I just received this mic today and tried it out. I purchased it after rave reviews from other Amazon purchasers. This is a heavy solid high quality mic. Are you kidding me at this low price. They giving it away. Heck, the microphone cable it came with his heavy duty and long and it's worth $10 all by itself. I recorded a song today with it and I sounded very clear and clean with no hissing or popping.  You can't beat this deal. Awesome nice mic.", "id": 690}, {"review": "I LOVE THIS AMP. Here are the reasons: Solidly made, everything is high quality.  Best of all it comes with Fender Fuse software whereby you can hook it up to your PC using the USB cable (included) and &#34;control&#34; all of the amps features over and above the actual settings on the amp(without even touching the knobs) INCLUDING special effects like various stomp box add-ins, effects like reverb, distortion, phaser, factory presets on the dials etc and you can even select different amps on the PC screen visually. You can also go online through the app and download presets other people have created. If you want to play a Pink Floyd song you can download a David Gilmour preset and there you go. You got your Dark Side of the Moon and The Wall preset ready to go.  This is so cool and 20 watts beats 10 and works for me.  I can record directly from the amp into my PC Mixpad software program.", "id": 718}, {"review": "I really like Epiphone products. They are well-made, easy to play guitars. I also purchased an Ep Les Paul Special 2 Ebony from Amazon a while back. But, I received this Uke defective. I expected when I plugged it in it would play through an amplifier but I couldn't here anything at all. Totally dead. There are no volume controls but it was like the volume was turned all the way down. I'm disappointed because I expect Gibson to test each guitar before it leaves the factory. I actually bought this guitar for a friend and was very embarrassed when I got over to his house and it didn't work in front of him. I just requested a return/exchange from Amazon. If the next one works ok I may buy a second one for me. I seem to have bad luck with electric-acoustic guitars when purchased through Amazon. I had to send back my Dean 12 string elec-acoust to Amazon too because of an intermittent sound problem.  I do want to state that this is a beautiful Uke with nice feeling nylon strings, fine wood high polished surface, high quality tuners and plays loud acoustically.  The actual guitar looks even BETTER in person than in the picture. If this Uke was working 100% I would have given it a 4 or 5.", "id": 772}, {"review": "I had just bought an electric acoustic and while I was ordering that I just went ahead and picked one of these up as well because I figured what the heck it's under $20 and maybe my full size acoustic might work well with it. So I got it and th only thing I had an issue with is that it slide around a little too easily, but, it does work well. I recommend it for those who are looking for a simple solution to making their acoustic, electric so that they can play it through their amp.", "id": 789}, {"review": "I ordered the telecaster version and received this strat version by mistake BUT I liked this so much I decided to keep this one, reorder the telecaster version so I can have that too.  The body is very solid, beautiful finish (mine is a sunburst color).  For $79.95 this is a must buy. You will not be sorry. I have 3 fender type strats and this one is now my favorite. It's great for recording. I just bought a Zoom G5 and it works great with that.  The tones are rich and warm.  I agree with others that the quality is similar to strats costing $399 and more.  It fits so well in my hands and feels great. I love this guitar!!", "id": 754}, {"review": "This item did the job it's made for. Made well and you need to make sure you open it fully prior to inserting it onto your guitar neck to keep it from snapping back on you because it's strong but it won't damage your guitar and it's effective.", "id": 802}]