[{"review": "For the price I think it's hard to get any better than this.  I love this case.  It fits perfectly in the overhead bin on planes.  It's light and feels comfortable when you carry it.  Had mine for 2 years now and no complaints, still as good as new.  The look is not that inspiring, but it protects your guitar.  Some reviews are mentioning faulty hinges but I've had no problems with mine.", "id": 557}, {"review": "I've been using the snark for a year or so now, and I always have the suspicion that it's just telling me what I want to hear - that my guitar is in tune, when in fact, it's not.  The other day I had to go from standard tuning to DADGAD, and had about 1 minute to do so (plenty of time) but after the tuner said it was in tune, it was time to start playing and it was, well... noticeably out of tune.  After checking each string multiple times!  Very frustrating.  I guess you just have to go with a pedal if you want accuracy.  If you want something that usually puts you in the ballpark but may betray you when it really counts, then go with the Snark.  It's better than other clip-ons I've used, but still not cutting it in my opinion.  I play a Taylor 414ce.  A plus side is that you can buy a five-pack of batteries on amazon for 2 bucks - shipping and all.  You will need them sooner than you think :)", "id": 707}, {"review": "The one that shipped was the cheaper, shiny plastic one.  In my experience this model is inferior.  Also the rubber lining inside the clip was unattached - probably the glue didn't hold?  I like Snarks and think they are some of the best clip-on tuners.  Just not a fan of the cheap, shiny plastic versions.  I'll try returning it and getting the SN-8.", "id": 762}, {"review": "It's hard to find a good clip-on tuner that's accurate and visible in all situations. The Snark SN-8(B) is my favorite so far.  It's really bright, more accurate that other Snarks, and (despite other reviews saying it breaks easily) I've found it to be sturdy enough considering how flexible it is.  Again, it's a clip-on tuner so don't expect razor-sharp accuracy.  But it does a good enough job for what it is.  It's quick and convenient.  If you need something more accurate I recommend investing in a good pedal.  I've found the swivel to be a nice feature that makes it easy to see the display.  I don't typically use the metronome feature, but it's nice to have it.  Overall, my favorite Snark model and my favorite clip-on tuner.", "id": 811}, {"review": "I had just purchased a Polytune about 6 months to 1 year ago, and was a little annoyed when I saw ads for the Polytune 2.  Mine was still brand new to me and worked really well.  But after reading and watching about the improvements in this update I decided to take the hit, sell mine for a loss of $20 and get the new one.  A GREAT choice.  This Polytune 2 is amazing - bright, accurate (strobe option), well built...did I say bright?...improved foot switch... It's just another example of TC hitting it out of the park yet again.  Highly recommend getting one of these, you know, unless you want to grab a 1st gen for a deal... ;)", "id": 889}]