[{"review": "Basically, this case is very sharp looking - made with good quality materials. The inside of the one I received was grey fur. The case would probably take a beating over time, but its not a SKB case. Nice enough that I wouldn't check it at the airport. Survived a trip in a moving van from Philly to Boston.Would definitely recommended if you need a case that your Les Paul fits very snugly and safely into.", "id": 50}, {"review": "I have played through this for over 15 years and I will tell you right now, get a big amp. Get 2 amps and split the signal, even. You want to have the biggest amp you can when using this pedal. Otherwise it will come off sounding frail instead of \"Frail and Bedazzled\".Otherwise this pedal conjures up a beastly reference, and it should. I have been in a couple bands where I just plugged this into the amp and played my riffs. The free drinks and loose women followed shortly thereafter.If you're looking for stinging yet rumbly fuzz, this is the pedal you need. I only wish it went up to \"11\".", "id": 308}, {"review": "I bought these to replace a pair of ATH-M45s I had for 6 years. I used my old headphones for listening to music and for tracking in my recording studio. These have assumed the same role and perform wonderfully. I play a lot of electric drums and these cans do a great job of isolating the outside world from what I hear inside the headphones. Listening to music on them is a joy. Everyone has an opinion about a &#34;burn in&#34; period, mine seemed to open up at about 50-60 hours. I listen to music about 3 - 4 hours a day.", "id": 458}, {"review": "First off this is a overdrive pedal with a MOSFET circuit engineered to sound like overdriven tube distortion. The pedal is very good at this. There are a lot of tones available but fully cranked through a large amp, this is on par with the warm tone of another EHX pedal, the Big Muff Fuzz. The tone function is kindof useless to me I like to keep it on, With the switch turned on the effect is a little too harsh. Don't let that keep you from checking this hot rod out. I love mine. Its a keeper.", "id": 890}, {"review": "I have had this pedal for about 15 years, just replaced the old one a month ago. It distorts sound, not quite the way you would imagine though. This effect sounds really good through a fat cab or a larger amp that can let the cabinet give the tone a little color. I use it through a Epiphone Valve Jr and a Marshall 2x12 stack with JTM45 on top and its fine. This thing through a Champ or smaller amp will not give you the meat you are probably looking for without a EQ pedal.This does just what it says it does. One Volume knob, one tone, and one distortion knob. CRANK IT.", "id": 35}]