[{"review": "Got this little guy last night to use with my Squier Tele Custom II, hooked it up and played around with it for a while and it really impressed me for the quality of effect you get for nearly pocket change! I also have a Digitech RP-50 that has multiple effects including different types of chorus and this Fab Chorus sounds better than any of the RP-50's chorus settings.  I am so looking forward to laying down some cool tracks using this with the Tele, my Applause acoustic/electric, and my Squier Vintage Modified 70's bass guitar. And like other folks who've bought this product, I'll most likely be getting some of Danelectro's other Fab boxes and the Dan Electrode power supply.", "id": 319}, {"review": "I was looking for a low cost mixer to use with my Fostex MR-8 recorder and did a little research on the XENYX 802.  Just looking at it with it's inputs, number of controls, I would have guessed it cost close to a couple hundred bucks. Imagine my surprise when, after reading the positive reviews, that I discovered this thing was only [...]!  I bought it immediately and, right out of the box, it did exactly everything I was expecting it to - this is a awesome little piece of gear for getting the recording control and flexibility that is not inherent on the Fostex. I'm quite excited about my future recordings using the 802 - I'm like a kid with a new toy!  Highly recommended piece of gear that is an extremely great value for the cost.", "id": 368}, {"review": "I previously had the UCA-202 and it worked great for me for a couple of years but I noticed the audio went dead in one of the RCA phono input jacks (I had used those jacks previously with no issues). Regardless, I liked the UCA-202 so much that I got the UCA222 to replace it without hesitation, plus as a bonus, it's purdier! :)  Plugged it in just now, fired up the PC, the new UCA222 started working immediately...no muss, no fuss!  For the money, I don't think you can find a better deal for enhancing your PC's audio versatility.  I don't know if I'll even bother with the included software as I use a great program called Mixcraft (btw, check that out if you're looking for PC recording simplicity but sounds impressive as the other, costlier guys). Anyway, two thumbs way up for the UCA222!", "id": 597}, {"review": "I just got this thing and have only learned the basics of looping (I've done two jams so far) but I can already tell it's an amazing tool for any serious guitarist. The reviewer Shawn in PA hit the nail on the head with his comment that he's \"playing guitar twice as much and getting twice as good\" - that's a great compliment on this pedal and I agree 100%.  What I especially like about this pedal is that it feels like it was the \"missing link\" in my collection of gear and brings it all together. I'm using my guitar, my mixer, my bass, my drum machine, my monitors whereas before just doing recording seemed like a bit of a chore - this thing really puts the FUN back in playing.  I think this is the one piece of equipment that will really bring out my creativity and I can't wait to see what I come up with, with my new \"band\" :-)", "id": 668}, {"review": "My only reluctance about getting this was I thought the price was a little higher than it needed to be but I unboxed and connected this little dealie up and it does exactly what it says it does: it gets down my guitar tracks in iPad and sounds terrific so the $99.00 price tag isn't such a big deal.  NO learning curve, simply connect the included cable from the Jam to your 30-pin iPad dock, plug in your guitar, pull up GarageBand, select an amp, click on the icon in GarageBand that shows the guitar cable end, then select \"On\" for monitoring, hit record and start jamming, man - that is ALL there is to it.  I've not been one to record on computers for a long time, preferring instead to use such things as Fostex 8-track recorders, Behringer mixers, Digitech effect pedals, etc. but this is going to change all that.  Awesome product with excellent sound quality and could not be simpler to use.  UPDATE:  I mentioned a Behringer mixer above (Xenyx 802). I discovered that this Apogee Jam will take the signal routed (standard guitar type 1/4 in. cable) from the Behringer's control out (L- mono) thus allowing you to use the mixer for multiple inputs, both microphone & guitar. The sound quality doing this is excellent, I've recorded a guitar and vocal track and it worked beautifully.  You just have to be careful not to overdrive the Jam. Consequently, my opinion of the Apogee Jam is even higher than it was when I wrote my initial review in March.  I may not even need that Focusrite box now!", "id": 764}, {"review": "I'm reviewing this after spending a couple or so hours trying to get this to work with my Behringer 802 Xenyx mixer, and I finally did after nearly throwing in the towel.  Turns out I was using my mixer's CD/Tape switch incorrectly, thus getting very poor results or excruciating feedback.  I finally went on You Tube and found a Behringer guy that has a video that's less than 2 minutes in length and he had the unit hooked up to a mixer and computer.  Just taking a look at the that video made me realize it was something simple I was doing wrong - I was over-thinking it. Once I got it to working correctly, I could not believe the results once everything was dialed in correctly, including the control on my PC that controlled the recording volume for this unit.  So, now I'm looking forward to doing some real recording with it, using Audacity as my main recording software. (Edit: I did some recording with this dealie over the weekend and was really, really pleased with the results - I can hardly wait to do some more recording with this. So, to the arrogant salesman who bad-mouthed this at a local music chain store and tried to sale me a $150.00 Lexicon unit, I won't be needing that - I'm quite happy with this little interface, thank you very much. And to everyone else, don't forget that you can keep this thing hooked up to your PC and use it to simply listen to music on your hard drive and it will sound a lot better than your stock on-board sound card.  Thanks Behringer, this is a great value!!", "id": 384}, {"review": "I got one of these from another source but have returned it for exchange because of the following issue:  when I record a track either with the \"Audio Recorder\" or \"Guitar Amp\" screens in Garageband on my iPad 3, iOS7, the recording is great. But once I toggle over to the multitrack view and attempt to play the recording just made, there is godawful distortion and the audio is completely unlistenable.  Here's the other part of this: I can use Apogee Jam guitar interface, and iRig Pre microphone interface and Garageband behaves as it should and I can play the multitrack view with no problems whatsoever. The Focusrite support folks suggested I do a backup of my iPad contents and then do a software restore but I opted to return the unit instead, since the Apogee and iRig both work perfectly with Garageband. So, I don't know if the unit is having a problem with iOS7 or I just happened to get a lemon but I'll find out when the new one comes next week.  If it works correctly, I'll update this review after doing a few recordings. But, I would say if you've just updated to iOS7 or are thinking about it and you want to get this unit, you might want to hold off on that upgrade.  UPDATE: Got a replacement unit and even did a restore on my iPad, as suggested by a Focusrite support tech, and STILL have the problem I discussed above.  So, this product simply has turned out to be a dud for me. If anyone else has a similar issue with this and find a resolution,  please let me know.", "id": 854}]