[{"review": "Great as a booster, as others have said. For solos, it'll boost your mids and your signal. As an overdrive, it's great, kind of a midsy, Marshally sound. It does suck out some of the low end, but you can fix that on your amp or board or whatever. It's a Boss, it's solid - and a great price. Remember, this is overdrive - not distortion. For distortion, look at other Boss pedals.", "id": 38}, {"review": "I have a Boss OD which I realize now matches well with my little Vox tube amp, so I use this Bad Monkey pedal when I go direct for low level or headphone playing. Good price, good tone, pretty versatile, but I like the mid boost and harmonics I get from the Boss. The BM might work better with solid state.", "id": 145}, {"review": "Tried it, didn't like it, returned it. Just not my cup of tone, that's all. I have more use for an overdrive.", "id": 232}, {"review": "A breeze to install on my mac mini, simple to use with Garageband. The bad reviews here are bizarre, written by inept people who either can't handle the install or have a buggy PC or OS. I was up and running 5 minutes after I tore off the shrink wrap from the packaging.There's plenty of specs/details/videos on the interwebs about this software, go do some research, see if you like it. It's way better than the drum kits that come with Garageband and there's plenty of kits to expand with. I got the Vintage Rock kit and I love it - almost as much as I love pizza, which I will marry some day. I like a cheese pizza. Some call it \"plain\" but with the right blend of sauce, cheese and crust, there's nothing plain about it - it's somewhat complex, much like myself. We are a perfect match, pizza and me. We go together like shoo bop shoo wadda wadda yipitty boom de boom. I'm not exclusively a thin crust guy, sometimes I dig something a bit thick or an all out deep dish.The only weak point in this pizza I mean software is that you can't do a cymbal swell. Apparently, it's the same with all these virtual kits, regardless of brand, but it would be nice if someone (toontrack) would address it by including a \"side stick\" attack on the crashes. If you try to do a cymbal swell, you hear the initial stick-on-cymbal \"ting\" with each attack, so it's kind of a \"ting-ting-ting-ting\" sound instead of \"bwooooosssshhhhh.\" I'm sure I can find a bwoosh loop without a ting-ting. Bwoosh loop - no ting-ting. Do I get a fortune cookie with that?Pizza time!Ohhh, myyyy loooove... my darlin'... I hun-ger for.... your crust....", "id": 385}, {"review": "Had for over a year, hasn't failed. Bedroom Vox amp, never leaves the house, never turned up above conversational volume level, so I can't elaborate on sound, can only comment on reliability for my usage.", "id": 687}, {"review": "Just got it, so far so good. I use delay pretty light n tight - slapback vibe, not too wet. This does it well. I considered the MXR delay - no - I may have considered it but the only pedal failure I've ever experienced was my MXR/Dunlop Phase 90, first the DC input, then the stomp switch, after light/barely any bedroom use. This ModTone here, seems solidly constructed. I haven't played with it too much yet, but as of right now, I wouldn't recommend it for Edge wannabes, seems limited in that regard. I may be wrong, but either way, do we need more Edge wannabes?No, we do not.Good tone though, does the trick, trick.", "id": 791}]