[{"review": "I use these in my home studio as INSERTS and they work great. No complaints.On a side note, I always clean all my cables with CAIG DeoxIT Gold G5 Spray Contact Conditioner 5 oz.and hightly recommend it to all musicians, you will hear the differnce. I also spray a q-tip and and clean all the jacks on my guitars and instruments.", "id": 9}, {"review": "If you understand what this is for, I think it's a great idea. Maybe not a perfect tool but I believe it does what it is supposed to and does it well.Keeping in mind, I'm a guitar player who just bought a drum kit... My assumptions when using this are that drum tuning is &#34;relative&#34; meaning that 99% of drum pitch is established by ear, based on what you want each drum to sound like, unlike a stringed instrument which is tuned against an absolute reference frequency and each string has a distinct relation to the others.The concept with this torque key is that it assists you with applying equal tension on each of the tension rods therefore presumably having an equal tune all the way around the circumference of the head. It by no means will help you establish as specific pitch on any drum; it simply helps you achieve an even tension and &#8220;relative&#8221; pitch all around the head. The tension numbers on the torque key are for reference only, 2 is tighter than 1, 3 is tighter than 2... and so on. Yet these numbers are only relevant to each head; I find that you don't necessarily pick a number such as 2 and tune all the drums to that.The way I use this, right or wrong, is that I tune an approximate tune on any given head using the traditional method of tapping around the perimeter and tightening apposing rods as necessary until the pitch is the same all the way around and at an audible frequency that I like for the drum I&#8217;m tuning. Now theoretically you&#8217;re pretty well tuned anyway but this is when I grab my torque key and I set it to a number a bit lower than were I expect the torque is (this only comes from experience of using it a few times) then I check a tension rod and I increase the setting on the torque key until it no longer &#34;breaks over&#34;. Now, whatever number I'm on is the reference number for that drum. My process from here is to move around the head in the same crisscross pattern as you would tuning traditionally but I loosen each rod a bit first and then bring it back up to torque with the torque key. After this process, my drum head should both be at a pitch that I have chosen by ear and have equal pitch all around the drum head.I believe it is a common practice to use a slightly different tension on the bottom side head ether a little tighter or looser than the top side (typically a little lower pitch on the bottom?). Once you&#8217;ve tuned the top head, and you know what number you&#8217;ve used you can quickly tune the bottom by reducing or increasing a click or two on your torque key.Sure there are a few other variable that can come in to play like, did you seat the head adequately when installing it which in essence means did you apply some light pressure to the center of the head while drawing down the tension rods in small equal amounts in a crisscross pattern. Also, how are the rims of your shells, are they well machined and smooth? These may impact the ability for a torque based tune to work. How about your tension rods, are the threads clean, are they lubricated? Any variability in resistance of the threads on your torque rods will directly translate to pitch in that location. Again, I'm just a rookie and I may be off with some of these assumptions or they may have an essentially unmeasurable impact so take it for what it's worth.Once you find a tuning you like, you could write down what number it took to achieve the pitch you like on each head, that would make it easy to quickly get back to the same pitch if/when your drums need to be tuned again.", "id": 112}, {"review": "These cables work well in my jam space, they do seem a little thin if they were to be used heavily in gig'ing but at 1/3 the price, that's fair. Don't get me wrong, these are good cables and for the price I am very happy; I'd buy more for sure. I would probalby uses these for gigging as well if I didn't have heavier duty jumpers available.As the title says, these are a great value and work well.", "id": 181}, {"review": "My Big muff PI with Wicker had hellacious noise, I mean unusable. I noticed it would change with movement so I pulled the back off and immediately found paint overspray where the grounding spring from the circuit board meets the inside of the housing. After aggressively scraping the paint off, the pedal operates as I would expect it to.I really like the tone and aggressive drive of the big muff and the Tone and wicker switches are nice although I find that with the Wicker opened up/ON the noise level gets marginally too high; so long as you're playing hard and loud it's not really an issue. This pedal isn't designed to be quiet when you're not playing so don't be fooled there, it is normal for it to make some noise when there's not guitar input/strumming. The bypass on the other hand seems to be clean as advertised.I'll be keeping the pedal and like it but the lack of QA from my proudly made in America fuzz pedal was a bit of a let down; fortunately I found the problem and fixed it myself to avoid a return.", "id": 570}, {"review": "I bought 4 pcs of these at $8each shipped. These are very well constructed and function very well too. I am using these to tap the INSERTS from my mixer and send the signal to my M-audio Fast Track ultra for recording. By putting the 1/4\" TS partially in to the INSERT of my mixer (and most mixers) you can get a direct output without actually interupting the signal chain. The other end of the 1/4\" TS cable goes to the PDC21 and then I use the XLR output to connect to my Fast Track using either and XLR to XLR or and XLR to TRS cable. My Fast Track did not like something about the signal level when I fed it directly from the mixer but with the PDC21 between the mixer and FTU, it works fantastic. This is for refernce recording in our jam-space, not studio recording; it works great for this application.I have also used this as a DI box for guitar, all of my gear is middle of the line (not junk but not super high-end), I don't notice any tone-sucking in my \"jam-space\" application.I would definately buy more.", "id": 606}, {"review": "I was looking for a 25' TRS cable for my band room, I wanted a quality cable with reasonalbe durability although I was willing to compromise some durability for cost and I feel this was an excellent choice. Yes, there are better cables available at a much higher price but I feel this is a well built cable and great value.", "id": 745}, {"review": "I am a guitar player who bought a drum kit for people to jam on when they are at my place. I also bought a lesson book for drums, for myself. I point this out so you know &#34;who&#34; is writing the review; a rookie drummer...I did some research before buying and found most if any negative comments were along the lines of &#34;if you tune your drums properly...these aren't needed&#34;. Well, news flash, I'm not a freaking drummer or expert drum technician with years of experience. I can tune them half decent with the torque tuner I bought (Rhythm Tech RT 7350 ) but there are several drums that still had overtones or prolonged sustain that I did not like in my tiny jam room.This moongel was so simple to apply it is a crime and I just moved them around a little to get them in a position that was both out of the way and killed the resonation I wasnt liking. So what's not to like? I love it!Cost wise, Amazon was a few $$ more than the local GC but then again, it was quick and simple.I liked it so much I bought a second.", "id": 892}, {"review": "This doesn't look very robust, I expect it will work well in my home studio but if my kids get with in 6ft of it; consider it broken. The swivle hinge is secure and will hold it's position as well as the clamp but they could not have been made any more marginally weak.The backing board mine came with is about 2/3 the size of a full sheet of paper, make what you will of that... and mine is actually secured to the clamp with dual side adhesive so separating them would be a chore and a risk.Overall, a reasonable value and I'm glad I bought it.", "id": 520}, {"review": "I use this short stand for mic'ing my guitar amp cabinet. It is pretty small and on the edge of \"light duty\" but I wouldn't call it cheap or crappy. The adjustable features work well and feel like they will hold up reasonably. I don't use it for gig'ing so it isn't getting beat on but it seems to be a pretty good mic stand and the price was great. I also purchased a \"musician's gear\"  [ http://www.amazon.com/gp/product/B0018TC7BW/ref=cm_cr_rev_prod_title ]similar mic stand which was a few dollars more, I think I prefer the musician's gear unit becuase it's a bit beefier than this one but I still like this stand and it was a great value. This unit folds up particularly compact which migh be and advantage for some. Both are perfect for home recording and practice studios, likely even hold up to some gig'ing.", "id": 708}]