[{"review": "I like replacing pickguards, truss rod covers, knobs, etc. on my guitars. This is a nice part.  Looks awesome on my Les Paul Traditional Desert Burst.", "id": 80}, {"review": "It fit my American Vintage 70's Strat.  My guitar had an 11-hole pickguard.  I ordered an 11-hole pickguard and it fit like a glove.The guitar is 3-ply plastic, black/white/black.  This is what most black Fender genuine replacement pickguards will look like.I am happy with the purchase.", "id": 217}, {"review": "I like replacing the pickguard and other plastic parts to give my guitars a different look.  It takes under $40 (accessory kit + pickguard) to give your guitar a make over.Money well spent.", "id": 222}, {"review": "About ten years ago, I installed strap locks on my first guitar (Fender Stratocaster). They worked well and were easy to install. I subsequently installed Dunlop strap locks on many other guitars with mixed results: the screws are really small and they would some times get stuck in the middle of installation. I had to drill additional holes no two guitars (Gibson SGs).  Ouch.This made me take a second look at Schaller. The components, beginning with the screws, are of much higher quality than Dunlop. It took me ten years to realize that I made the wrong choice.  I should have gone with Schaller from the beginning. I have replaced all my strap locks with Schaller with excellent results.", "id": 278}, {"review": "About ten years ago, I installed strap locks on my first guitar (Fender Stratocaster). They worked well and were easy to install. I subsequently installed Dunlop strap locks on many other guitars with mixed results: the screws are really small and they would some times get stuck in the middle of installation. I had to drill additional holes no two guitars (Gibson SGs). Ouch.This made me take a second look at Schaller. The components, beginning with the screws, are of much higher quality than Dunlop. It took me ten years to realize that I made the wrong choice. I should have gone with Schaller from the beginning. I have replaced all my strap locks with Schaller with excellent results.", "id": 790}]