[{"review": "The case is hard on the outside and soft on the inside as it should be. The pocket inside is nice for holding accessories. It does include a lock on the middle latch, but somehow mine eventually stopped working, as the lock isn't very good quality. The lock cylinder itself fell inside the lock and can no longer be used. Otherwise great case, highly recommended.", "id": 50}, {"review": "I'm using them to angle my speakers up in addition to isolating them from the desk surface. Unfortunately, these angle the speakers down by default, so I had to do some cutting and rearranging, but it worked out. If you need to cut these to fit your speakers, try to find something better than scissors, because it's quite hard to cut the foam evenly with them.", "id": 57}, {"review": "Useful for connecting mics to a guitar amp or directly into a computer's mic jack. The 1/4\" side tends to become a bit loose after a while, not sure if it affects performance though.", "id": 249}, {"review": "I purchased this item and immediatly noticed upon arrival that the slits in which the strap go into are way too small for a typical strap. Way too small, maybe like a third of the width. I just have a normal planet waves strap, and it does not fit. However, it does hold the XDS transmitter nicely and securely. So looks like I will have to get creative with duct tape or something.UPDATE:When attached with rubber bands to my planet waves strap, it stays on pretty snugly. But you need to attach it with something.", "id": 264}, {"review": "I don't own the SRH840s, but rather the SRH440s. It was suggested on forums that these are a good upgrade for the 440s in terms of sound and comfort. I didn't believe the sound part, but I bought them because I at least wanted to replace the cracking old pads on my 440s. When I got them, they easily went on and looked just as good as the originals. They are definitely more comfortable. I don't know what it is, but something about the sound is different and I don't think it's placebo. There seems to be more presence in the bass and clarity in places I wouldn't expect. I highly recommend this upgrade.", "id": 646}]