[{"review": "The Epiphone Les Paul guitars don't particularly sound that great, but they stay in tune much better than the cheap squier strat you can get at the same or lower price. If your kid is serious about wanting to play guitar, but you're not completely sure if they will stick with it, if you can spend another $100 and get a used mexican made fender strat or tele. The reason for this is because for 1, if they decide it's not something they want to do anymore, you can resell it at the same price you bought it for (as long as it is still in decent condition) and little no money is lost. Second, if they do decide to stick with playing guitar and eventually own a &#34;better&#34; or more high end guitar, Mexican made teles or strats are great back up guitars for stage use. I have a couple different high end guitars and I will not get rid of my Mexy Strat because it sounds great still. I'll never pick up my first guitar which is essentially this.", "id": 31}, {"review": "Here's the deal with this pedal. It is inexpensive and you can get a better pedal with barely a bit more money and sometimes a little less money. In my opinion, for spending less than $100 for a distortion pedal, whether it is your first pedal or 700th pedal, a few more bucks will get you the MXR Badass distortion which has a much crisper tone to it.", "id": 35}, {"review": "This is a great pedal for price. No it's not the most amazing phase pedal, but it's still quality. I know many pedal geeks who still have it on their board. If you don't use a lot of phaser but need it for a song or 2. Buy it.", "id": 177}, {"review": "This power supply is great for me. I attached it underneath my Pedal train and it works great. The 2 knobs you see on it can &#34;Sag&#34; the power to be less voltage. You can get your pedal to sound as if it has a dying battery in it.", "id": 209}, {"review": "If you need a tube screamer. You can't go wrong with the TS9. The only reason why you shouldn't get it, is if it isn't the right tone for you. I say this because you can't say anything bad about this pedal. It sounds amazing. It just might not be your sound. I personally went with the TS808 because it compliments my amp better than the TS9. People who say this is better than the TS808 or vice versa are choosing the wrong wording. They prefer it. It's not better. Both are great.", "id": 446}, {"review": "I like how with this pedal, not only does it not have a heavy click when you press down, but if you are playing in a dark room the LED lights are nice and bright. True Bypass. I'm telling you, get it.", "id": 504}, {"review": "I don't have any problems with this pedal, but for the price I would just go with the Way Huge Aqua Puss for an analog delay.", "id": 507}, {"review": "These types of pedals are toys. They are a cheap way for a beginner to have effects to play with. By all means if you are buying it for your kid who just started playing. If not, i recommend slowly building your pedal collection and use the money to get 1 decent pedal whether it is a delay, or distortion.", "id": 600}, {"review": "If you are looking to spend not too much on a distortion pedal, in my opinion this is the one to get. There are a few more different models and brands that are good. But, i could use this pedal no matter what style of music i'm playing and not feel like i have to sell it if i start a new project.", "id": 757}, {"review": "I personally went with the pitch black pedal tuner. The reason why is the LED lights on these guys are small and harder to see onstage. The pitch black is nice and bold and bright. One reason why i almost got this thought is the ability to tune all strings at the same time. So its a give and take issue.", "id": 889}, {"review": "If you need a tube screamer. You can't go wrong with the TS808. The only reason why you shouldn't get it, is if it isn't the right tone for you. I say this because you can't say anything bad about this pedal. It sounds amazing. It just might not be your sound. I personally went with the TS808 because it compliments my amp better than the TS9. People who say this is better than the TS9 or vice versa are choosing the wrong wording. They prefer it. It's not better. Both are great.", "id": 447}]