[{"review": "I love this light. It runs on electric so no need for batteries. The goosenecks are metal and well made and the LED lights have switches that can turn on single or double LEDs on each side. It will clip on anything you want to hold it. It's simple, well made and works great.", "id": 524}, {"review": "This cup holder clamps on easily and really holds your drink so you dont have to worry about it. The insert part is made out of thick material so it will smash down when you pack it up. You dont really notice the name on both sides at gigs, just a cold beer in front of you thats always in the same place! I love it.", "id": 530}, {"review": "I buy many of these cable and they all test correctly with a meter and they all work great. So far I haven't had any issues at all. They feel well made and I will continue to use them for the bands PA.", "id": 554}, {"review": "I own the older Color Bank with the bulbs and it works better that this one. I love the size, weight and LED bulbs on this one though. It has a nice color throw too. It also has speed control and audio control just like the older model but........this new LED version is built with less quality. When you turn both speed controls all the way down to the lowest settings, the bulbs still keep flashing to the next one, about every second. They do not stop flashing when it's plugged in since it don't have an on/off switch. If you are using this on a switcher, then it wouldn't be a problem.I'd prefer the light to stop when the music stops, but it don't. When you try to adjust the audio flashing, it is so sensitive to sound that the lights just keep flashing very fast in rotation.Also the circuit board inside is held to the metal panel by 4 plastic pegs sticking through the back. They will stick your hand and eventually get pushed inside and the small circuit board will move around. Within 1 hour of getting it, I had to take it apart, push the plastic pegs back through the holes and melt them with a hot knife so they would stay in place.I love the light but it's not as useful to me since it's \"always\" flashing. It's possible I have a defective one, not sure.The cool bright LED bulbs are the best part of this light.***UPDATE,  I played with one of these in the store and it actually worked better. When you turn it all the down, the lights stopped flashing until the music started again. The one I have never stops flashing, even when the music stops. I guess I got a bad one.", "id": 534}, {"review": "This Fender amp is the perfect size to practice or take along. It sounds great and I like the headphone and MP3 player hookups. Good value.", "id": 564}, {"review": "This is what it shows, a simple small mic stand that dont fall over. Good for table top, cajon hole by floor or recording.Its well made and works well.", "id": 633}, {"review": "This is the American DJ Micro Galaxian red & green laser. It is the smaller version of the Galaxian laser with the same laser power output, but a smaller beam spread. It is a compact well built unit with a power switch on the back and a small fan to keep it cool. The small power cord plugs into the back of the unit and has a transformer block on the end of the cord. It comes with a remote that works great, but has an antenna to pull up if needed, which seems like old technology. The remote has 4 buttons which allows you to select auto/sound mode, blackout, color and direction of rotation. When going through the color modes you can select red, green, red/green together or red/green changing and flashing. You can select auto mode or sound mode so it will go with the music. There is also a speed control knob on the back of the laser to have the dots stop completely, move very fast or slow. The darker the room the better, but you can easily see it in any room with the lights on. I am very pleased with it. I havent tried it with fog but I know it would look great since it has 200 beams. It will work great for any DJ to use on the dancefloor, wall or ceiling. This is a great buy under $100.PROS: It is small, bright, well built and works great. It has a remote to control it.CONS: Transformer on cord and antenna on remote.", "id": 729}]