[{"review": "Sweet strap, nice colors, good quality.  Adjusts easily, nice quality leather hookups.  Don't forget your strap locks if you're planning to rock out :-)Looks great with my white Fender Jazz Bass Standard!", "id": 657}, {"review": "This is my first electric tuner.  As a percussionist-turned-bass-player, I goofed off, stick twirled and snored through countless hours of tuning in band class over the years. Not surprisingly, I kind of laughed at my own peril when it came time to tune my new instrument.  I grabbed this particular model because it was inexpensive and positively reviewed.  It does the trick.  It's small, accurate enough to get by with general practice (I can correct minor tuning issues by ear).  However, now that I have been using it for a few months, I have noticed that it does not give a very stable reading of pitch.  For example, if I go through and tune all the strings it will read a hair high/low on the next pass, and yet again on a third pass... If you need something &#34;no-fuss&#34; and accurate the first time around to the spot, you might want to invest in something a little more robust.  But, for standard/practice tuning, this is a fine accessory", "id": 799}, {"review": "Just barely gets the job done...I have a Fender Jazz Bass Standard.  The shape of the body of the guitar does not fit the arms of this stand and it forces you to position it very carefully to avoid the stand collapsing.  It is very low quality, not particularly sturdy and my cords get wrapped around it constantly.  Its JUST good enough, but if my room were larger and my guitar out in the open, I would be constantly worried about it falling over.  I will definitely be replacing this with a better quality stand in the near future.", "id": 883}, {"review": "A great set of bass strings with all the right features:- Perfect balance of bright/punch and warmth- Right, deep tones- Great feel and playability- Stable tuning- &#8220;Textured round&#8221; design with hexagonal core shape- Durable- Easy to stringMy father uses D&#8217;Addario on his telecaster and acoustic guitars, which originally prompted me to choose D&#8217;Addario for my Fender Jazz bass.  I can say that the brands&#8217; reputation carries over to bass&#8212;these are phenomenal strings.", "id": 896}, {"review": "My father is a full-time gigging musician primarily on Steel Guitar and Telecaster.  He has been playing over 50 years and it takes a lot to get him interested in new strings.  We both use D'Addario strings almost exclusively (myself on bass guitar, and him on the electric).  These are *outstanding* strings with great durability, playability and exceptional sound.  They remain in tune for long gigs or recording sessions, they generate less fret noise than comparable strings and have a bright/crisp sound that really stands out. Well worth the extra investment.  Highly recommended!", "id": 897}]