[{"review": "Perfect for my Epiphone Sheraton II.  Monster cables are well constructed.  I have several and never had any problems with any of them over the years.  Got this one because I wanted the 90 degree plug.", "id": 1}, {"review": "Plenty of cord to move around with.  Makes it less likely that I am going to clip the cord on a down stroke.  Just what the guitar doctor ordered.", "id": 123}, {"review": "I love these customs...inbetween the lights and mediums...you get the bright booming sound...nice bends and of course, the longer playing life...I've used these on my guitars that have alittle darker sound because of the wood used in them...to brigthen the sound a tad.  I would recommend these for cedar or mahagony body guitars in a blink of an eye.", "id": 130}, {"review": "Solid constructions with enough room for my sheet music.  Very portable, though the holder can be a challenge at times.  I have another stand that collapses into a very compact unit, but if you have heavy tomes that you wish to use or several sheets that you want to string ...  this unit is superior.", "id": 155}, {"review": "I have used d'addario for a number of years.  I'm not hot about their acoustic, but electric...they're a whole new world.  I like these nickel on my tele...they give them that extra twang.", "id": 156}, {"review": "Sound quality did improve over the plastic pegs.  Next in line is to tweak my bridge by replacing the plastic saddle with a Tusq.  This should improve my sustain and tone even more.  If you're looking for a budget increase of tone ... this is a way to go.", "id": 263}, {"review": "The stand is very well constructed and very stable.  The other stands that I have used were all bottom holders.  I was a little concern using a stand with a neck holder, but then again..all guitar stores display their guitars with them...so I thought ... lets have a go,  I'm glad I did.  My stand doesn't tip over like the others.  You just have to lift up before you take your instrument out.  The fingers in front hold the instrument in... lifting up slightly will disengage the fingers so you can remove your instrument.", "id": 337}, {"review": "Sweet \"twangy\" sound that is a flash from the past of steel lap guitars.  I have a ceramic and this steel slide.  Each has a unique sound.  The steel as expected has more of brighter twang.  When I change my strings, I know that I'll get some differences in tonal quality, but hey, experimenting for that sound that reaches us is what keeps all of us buying new toys.", "id": 340}, {"review": "I live in a dry climate, and I have to add distilled water to my humidifiers almost daily.  Since I can't afford to add a special room to humidify my instruments, the planet waves humidipak is the next best thing.  I get anywhere from 4 to 6 weeks out of a pack.  The time and effort this pack saves me to keep my humidifiers repleted with water is well worth the price. On the refillable humidifiers, you really can't forget more than a day or two to replenish the water.  With the humidpak, you have a lot more security.  Going on a trip?  You won't have to worry about your string instruments if you have these in your case.", "id": 406}, {"review": "Works like a champ.  I only have four pedals on it thus far, but I haven'te had any problems.  No noise issue, no \"brown outs\" because the power supply couldn't handle the load.  I still have open leads for those other pedals...(smile).  My power strip now has more space for other \"toys\" to make my weak playing sound better.", "id": 428}, {"review": "Not as bright as I would like them; however, very nice.  I can practice without lighting up the whole house.  I'm glad that I bought it.", "id": 524}, {"review": "Nice bright light.  I have the might bright twin lights, and have used them for about 4 years. As with many things, I'm a little older now and need a little more light to read the sheet music.  This light comes in a very nice soft case (though they call it a bag) that holds everything. The switch is conveniently located on top of the light. The clamp is very well constructed and is less likely to move...unlike my twin lights.", "id": 681}, {"review": "The use of the device was moderately difficult.  The primary difficulty was in the how the user's manual was written.  The information is not straight forth, and the \"how to\" especially on setting up the device was severely lacking.  This left me to the old plug and chug method.  Once I figured out how to set it up...I found the sound quality weak and tinny out of the onboard speaker.  The DR did sound better with ear buds, but still was short of what I expected based on the reviews on Amazon and other websites.  The good things though is that it is light, portable and the mics can be moved.  I wasn't expecting bose type of sound, but I wasn't expecting to hear the tin man either.", "id": 755}, {"review": "I have another headstock tuner that I've had for awhile.  This Planet Waves PW is about the half the size and works just as well.  The clamp that holds the tuner to the headstock is a little flaky, but the tuner works like a champ.  Nicely backlite for those low lighting conditions.  Compared to my other tuner, it's rigt on the money.  The other plus is that since it small and my guitar case has a little wiggle room, I don't have to take the tuner off.", "id": 785}, {"review": "For years I have used a kyser capo because I like the trigger action.  I have run into a few issues when switching between my 6 to 12 string guitar.  I haven't used it much on my electrics.  Though  I like the kyser, the planet waves tri-action is super slick.  It is extremely easy to adjust and is far easier to squeeze open.  The trigger action is like a hair trigger when compared to the kyser.  A few twist to adjust it and I can easily capo between my 6 or 12 string without any problem.  Light, easy and quick.  I am now a believer.  I'm switching to the planet tri-action.  It is definitely worth the few extra bucks.", "id": 843}, {"review": "I own several capos, but this is the first with an adjustable tension.  Several of my acoustic and electrics have different types of curvatures in the neck.  I picked out a couple and selected one of my other capos to match play against the NS Artist. There wasn't a whole log of tonal differences near the nut when I compared the capos, but when I compared them from the 5th fret on...there was some slight noticeable differences.  Granted, I had to readjust the tension on the NS Artist. Why readjust?  The neck's character changes slightly as you get nearer the body, and to ensure that I had just enough and not too much tension (after all that's why it's adjustable), I readjusted the tension.  The tonal differences were more noticeable when I played softly, and less when I cranked down.  All in all...not a bad capo.", "id": 894}, {"review": "I've been using Ernie Balls cobalt slinky light gauge because I like the feel.  I got these from the Vine, and wow, they are awesome.  They cost no more than the strings I normally get, but the tone and feel is totally different.  I can't comment on how long they'll last or keep in tune..but for now, I'm impressed.  I'll probably keep using these on my Santana PRS for awhile since I like the sound.  Every once in awhile, I'll step outside of my box...I mean.. I know the strings that I like and I tend to stick with them.  I use d'addario on my acoustic guitars, and ernie balls on my electrics..except for my strat..I like fender bullets on it.  So the sample from the Vine...sorta of nudged me..and I'm the better for it.", "id": 897}, {"review": "I can't speak on the claim for a longer string life.  The strings are true to Elixir's quality and tone.  These strings sound great plug and unplugged.  I also had the opportunity from Vine to try the phosphor bronze too.  There are tonal differences as expected.  The 80/20 are brighter, but the tones are clear and crisp.  When amplified, I did note less finger noise as I re-positioned or slid my fingers along the strings.  I didn't notice any difference to the feel of the string...as compared to other nanoweb Elixir strings that I have used over the years.  Time will tell if these strings last longer than their other versions.  For now, even if they only last as long as the other nanoweb ... you're still getting a good deal.", "id": 898}, {"review": "True to phosphor bronze these strings have a mellow and full sound.  You still get finger noise as you slide your fingers when setting up for the next chord, but the noise is somewhat less. I have used other Elixir nonweb coated strings and these strings are in par with them.  I can't speak to the string life.  The boast of these strings is that will last 3 to 5 times longer, and if that is the case, I will run out of time to submit my feedback.  So far now, they sound great, feel great...and if they don't last as long as the other Elixirs, you'll still come out ahead since they shouldn't cost any more.", "id": 899}, {"review": "Not much better than the dollar version of the peg winder.  Thought it would be more ergonomic and having the stringer cutter in one tool would be a plus.... but, not quiet up to par.  You'll be better off with the dollar string winder and a cheap pair of snips.", "id": 94}, {"review": "Works as described.  Solid little wires that allow you to be creative in how you hook up your guitar pedals...may work other applications that require the same type of plug.", "id": 181}, {"review": "Nice picks with very tasteful pics of hula girls.  Gave some to my guitar teacher, and thought they were the hoot.  A pick is pick, there's no doubt about that, but a little art work sort gives it a personality.", "id": 366}, {"review": "These patch cords work like a champ.  I use them with my pedal board, and haven't any issues with signal quality.  They give some versatility in their length.  I can move the cords around without having to move my pedals too much.  The colors....well...ok, they're a little odd, but for the price, I dealt with it.", "id": 805}, {"review": "I love these tuners.  I have tried the intel, krog, boss, etc... and out of all of them, I like the Snark the best.  Response and visual display are awesome.  Unlike a couple of the others I've used, the Snark works well on any place on the headstock.  A couple of the other brands I had to be careful where I positioned them because they didn't respond well.  You can't go wrong with any Snark.", "id": 811}]