[{"review": "I had purchased this cord and a 25' cord for an assignment I was going on. I had previously  bought a shorter cord that just didn't fit tight enough into the mic.  This one and the other one I bought were really a great, well made product and fit the mics tight and as they should.  I would recommend these cords and will look to purchase other lengths soon", "id": 439}, {"review": "I am president of the International Press Association a global organization of photographers, videographers and journalists.  We have been teaching our members to convert from shooting stills to videos on their DSLR cameras. I needed this cord and a shorter one for an important assignment on a cruise ship and these guys came through in time for me to use both cords.  You can see them in use at our online publication IMPress in this article and video.  Thanks guys will be shopping with you again.[...]", "id": 692}, {"review": "I know the old saying you get what you pay for and that is just the case here.  The unit is very light weight and the legs are too small to hold any decent mic like a RODE M1 mic or similar.I knew at this price it might not be great and took a shot, but I opened one, tried to use it and can't. It was a total waste of money, but doesn't pay to return it.  I suppose if you have a small mic that has basically no weight to it, it might serve your purpose.  Again, you get what you pay for and these are indeed budget light stands.", "id": 815}, {"review": "Just received this cord and it seems to work as expected. What can you say about an adapter cord?  It is well made, good construction and sound from my DSLR with my mic is superb.", "id": 7}, {"review": "This was one of two I purchased. Also bought the 25' Length and used them on an assignment recently.  They fit my RODE Mic nice and tight, other cords I have bought didn't and the sound quality is excellent. If Amazon allowed a link I would give you a link to a video I just finished on the Independence of the Seas.  Go to my website and look for it...IPA IMPRESS dot Com", "id": 21}, {"review": "What can you say about a Foam Ball type mic windscreen?  Well it fits the RODE M1 Mic I was using nice and tight. Quality is good, didn't tear apart when you put it on the mic and the recorded sound is just fine.", "id": 178}]