[{"review": "These are okay strings for the Folk Guitar.............nothing special but the price isn't out of the world either. Good buy for the money. Tried them on a Gibson J50 and they seem to do good.", "id": 28}, {"review": "Good picks, great feel and brings out sound loudly. Mostly for Electrics. I prefer the lighter sound of the Acoustic but these work very well with my friends Electric, Fender.", "id": 61}, {"review": "A very attractive and well constructed strap. I've been somewhat disappointed with some of the more expensive straps but this one is Excellent...................AND NOT SO EXPENSIVE. All the Buttons fit well (Snug) and it adjusts easily and quickly.", "id": 74}, {"review": "I kinda strayed away from the Elixir brand for a little while just \"To See\" if another brand would sound \"better\" and in doing so, I wasted time and money.(but I did get some EXPERIENCE) I'm back with the Elixirs now and have no intentions to \"Experiment\" any more.Simply put............Elixir makes the best Strings for an Acoustic Guitar that I've tried and I \"Will Stick with them\" because they have Great Sound, last a long time, easy to clean and prevent rust and/or corrosion.", "id": 103}, {"review": "This strap looks really great and fits just as advertised........it's just that it gets in the way (for Me and my chording skills) mounted as designed and shown. I altered the mounting manner to accomodate MY style and it functions fine.(Looks great, too) High quality and compliments the Martin Name and reputation really well. I feel that it's a good deal and  recommend it!", "id": 122}, {"review": "These strings fit the Bill perfectly for \"MY\" desired sound from a Yamaha LJ-16 Acoustic Guitar which has been \"Doctored\" with Bone Saddle, Pins and nut. When I decided to put the money into the guitar, it was my belief that the Elixir Strings would continue to provide the sound and feel that I like so much in the LJ-16 and after all the work was completed......that proved to be true to form. I did move to the Medium for a little improvement from the Bass side and it's a most outstanding sound from a medium price, hand crafted guitar. Elixir has the best (most comfortable) feel, to me, of all the strings that I've tested and these provide the best (for my liking) sound on this guitar. Try them if it's quality sound that you're looking for..............These are great!!!!", "id": 297}, {"review": "This is a very high quality Slide and really serves the purpose very well. Try one...............I think that you will love it, if that's what you're looking for.", "id": 334}, {"review": "Super, Excellent for dimly lighted rooms.............serves it's purpose really well and I plan to keep one of these handy from now on. Thanks for good quality products at a fair price.", "id": 524}, {"review": "The connection strap is a great enhancement for my D18 and fits wonderfully. Just one caution...I noticed a couple of scratches on the neck near the Headstock and finally determined that the \"Button\" was pressing on the neck when in the case.(I have occasion to pack and unpack several times per month)  It's easy to connect and disconnect so that's the \"Prevention Mode\" I now have in place. Wonderful set-up and I highly recommend it to to ALL Martin Owners!", "id": 568}, {"review": "Works well even with a room full of noise....................plus it's easy to see. These are the best buy for my money when it comes to tuning a Guitar or Uke.", "id": 762}]