[{"review": "I had changed my strings with some new Martins I got recently. They were bloody awful! Luckily, I'd also picked up a package of these Ernie Ball strings. First of all, they were packaged better than the Martins, they went on more easily and after I tuned up, they sound SO much better! Thank you Ernie Ball, for making far superior strings. My guitar thanks you as well (grin).", "id": 90}, {"review": "I hadn't played guitar in a number of years and decided to get back into it. Having had carpal tunnel surgery a few months ago, and having small hands to begin with, I started researching guitars with narrow necks. The Jasmine by Takamine kept coming up and had really good reviews, so I decided to give it a try, buying the S34C. Firstly, it was delivered promptly as requested, and arrived in pristine condition, with some really nice strings. It has a lovely honey gold finish on the front of the body, which had attracted me to the guitar in the first place. I really appreciate the cutaway. How many high notes will I be hitting on this baby? Who knows, but it looks WAY cool, LOL! The craftsmanship, at least to my unpracticed eyes, looks superb. I wasn't too crazy about the pickguard with all the lettering on it, but finally figured out the lettering was just a sticker that could be easily removed. And the sound...just lovely, with that ringing tonality one would expect from a steel string guitar, but with some lovely mellow tones where needed as well. I am so jazzed about how wonderful this guitar is, I'm taking online video lessons and learning a storm of chords and fingering techniques! Hey, I don't expect to be a Leo Kottke or Martin Simpson anytime soon, but I've got something to shoot for, and we all need a dream! If you're looking for a great guitar at a very reasonable price, look no further. Oh, the reason why I only gave it four stars is cuz the neck really doesn't seem to be all that narrow after all. But, maybe it's just my small kid-like hands. Thumb to little finger, I can barely reach an octave on piano. And there ya go!", "id": 183}, {"review": "Not crazy about having to pay shipping that amounted to half the purchase price for the stand, not to mention having to wait five days for it to arrive. No assembly instructions were included in the packaging. I've never owned something like this before, so that was annoying. Luckily, some nice pictures were posted on the web page and I was able to figure it out from there. Once I got it put together, and placed my beloved guitar in the thing, I got happier. It looks nice and holds the guitar safely (padding protects the guitar finish). I'd recommend this stand to others, but be aware of shipping, tax and consider the possibility it will arrive with no assembly instructions. Not that you have to be a rocket scientist to put it together, still...", "id": 258}, {"review": "Crikey, where to begin. Firstly, I hated the fact that they package two strings to a paper packet. Secondly, they mismarked one of the packets, so it appeared I had two &#34;D&#34; strings, instead of two &#34;E&#34; strings. Lastly, and certainly the least favorably, once tuned up, the strings sounded terrible! They were tinny and clangy sounding. I've never heard worse strings. Fortunately, I had bought a package of Ernie Ball Earthwood med. light, as well. I replaced the godawful Martins with the Ernie Ball's and they were far, far better! Shame on Martin for such a piss poor product. I'll never buy their strings again.", "id": 294}, {"review": "Really am impressed with this gig bag. My beloved Jasmine fits perfectly inside, has nice padding, tons of pockets to store stuff, backpack straps and handle for easy carrying, and it looks FAB! Love the price too. Can't go wrong with this one.", "id": 469}]