[{"review": "I've been using these for about 3 weeks now - they are strong but flexible and don't seem to develop kinks or bending \"habits\" if you roll them up the proper way.I've seen and used some better cables but not at this price point.  And I've certainly seen quite a few worse!  This is a pretty good sweet spot, in my opinion.", "id": 6}, {"review": "Not that it's a huge deal - but I quite prefer this capo over any other capo I've used.  It just has the most solid build quality and the simple pull style of loosening and tightening works better and more quickly than the type that \"snap\" into place.I own several of these now and whenever I mis-place one (which happens too often!) I come back to purchase another.If you're looking for a capo I highly recommend using this Dunlop model.", "id": 116}, {"review": "I have several of these straps in different colors and I've never been disappointed.  It holds my 11 pound Les Paul with no problems and the first one I bought has been through quite a few gigs and is still holding up strong.  If you like the design, go for it!", "id": 286}, {"review": "I'm sick of protools and I wanted to find something cheap and easy until I could afford to upgrade to some real equipment to use with cubase.  This unit fit the bill and has decent reviews so I went for it.I'm using it to record guitar and vocals and it does the trick.  The problem is that it records a lot of hum and white noise when using the xlr input.  I've tried every variation possible to make sure the problem isn't external to the unit.  I even tested the exact same mic + cable input into my MBox with protools and got a clean recording.  I actually like this unit's \"tone\" better than the mbox - it seems more transparent.  If not for the hum, it would get 5 stars.Unfortunately, hum is a pretty big problem.  The hum isn't loud enough to ruin your recording of only one or two tracks.  If you start layering, though, you can quickly be overtaken by white noise.  I even tried moving the unit onto a different electrical circuit and still had the same problem.So, it works for rough stuff for your own use but I wouldn't use it for anything you plan on passing around much.", "id": 639}, {"review": "I personally own two of these Snarks and I've seen several others among my friends.  They're great, easy-to-read and easy-to-use tuners that are surprisingly cheap.However, half of the Snarks I've come into contact with have broken within a few weeks.  One of mine broke after about 2 weeks of very light usage.  The screen is SUPER faint.  It's still tuning and displaying but without any back lighting.  This also happened to two of my friend's Snarks.My other Snark is still going strong.  I'd still recommend them for non-critical applications just for the price and ease of use.  However, these definitely aren't reliable gig-worthy tuners.  They're just so cheap it's easy to buy multiple Snarks and cover all of your guitars.", "id": 763}, {"review": "I've been playing for 8 years and I own 4 electric guitars.  All of my guitars are strung with D'Addario 10's.  They sound great when they're fresh and in my opinion they stay fresh the longest.  I play at least 15-20 hours per week so I put a decent amount of wear and tear on my strings.  It's really the durability that sets these apart.The Amazon price is terrific.  I like to restring my main guitar a little bit more than once a month and I can buy a year's worth of these for the same price as 1 set of bass strings.  I'd definitely recommend these strings and recommend purchasing through Amazon.", "id": 156}]