[{"review": "What can I say lower priced than most and very low distortion I could Not hear the hum but for multi pedals to save on cost I use a godlyke power supply but this Is a good power pack.", "id": 40}, {"review": "It has a 1950's slap back echo Its good for the price No putting It down for Sounding bad as with most Danelecto products and probably higher price and lower price products used the same circuits. If You want something that Is just reverb without all the slap back then Behringer DR600 which I use for Vocal for Guitar I use RV600 which has space verb and ducking also called shimmer.", "id": 315}, {"review": "It was Not what I wanted. When A Person has a low Income We can Not afford what We can Not use. I was looking for what Is called Shimmer most Reverbs do Not have Shimmer as the RV600 Because Digitech called Shimmer, String Swell and Volume Swell Is linked to the Violin Sound It cost Me 30.00 Its called Slow Motion for a reason because It has to be played slow to hear the effect the only way to hear It Is with Over Drive being played on the high Strings. It might be good for playing with a Bow, I have No Idea because I can Not afford a Bow.", "id": 449}, {"review": "Up date from February 08 2011 Wow look at all of Them that did Not find My review helpful I should have up dated much sooner,Not that I care because I tell the truth and do good to please Myself Not a bunch of fools. The first time I turned It on It was exactly the Sound I was looking for Shimmer and Space verb.Okay I Am apologizing for ordering the last one I guess I take the easiest way of ordering but If It makes You feel better It put Me farther In financial problems but If You look on some search there are some still left. Behringer needs to look at what The Customers Is buying and make more of them. If Your buying this Reverb Machine then You must be wanting It for Its Ducking also called Shimmer and Space verb If Not then there are cheaper Reverbs as Danelectro as FAB Echo which Is a nice Sounding older type slap reverbs Sound and there Is the more expensive Line 6 Verbzilla, and Someone wrote Me and said Boss has or did have this effect there are Internet videos showing this effect. My Digitech GSP 2101 quit working right It has Ducking Shimmer which Digitech calls String Swell which Is a Violin type Sound and They call Space verb Giga verb and I made the mistake of buying the Behringer Slow Motion 200 thinking String or Volume Swell was Shimmer then If found what I was looking for on Internet video I hope. I had already Wrote some Songs using My Digitech GSP 2101 and started having dreams about having this Sound effect again and just had to have It.How well this Behringer RV600 performs and Sounds I have Not received It yet to know but If possible I will do an up date but I have a Behringer EP2500 Power Amplifier that still works good which I even used as part of a Rife, Doug coil machine but the EP4000 would be better for that use Also the fan runs all the time.", "id": 508}, {"review": "Behringer usually makes good stuff and this Reverb Is No different but what It does best Is reverse reverb and moderate depth reverb Nothing else. I wanted this for Singing and I have the Danelectro FAB Echo which gives a short distance echo but I wanted something without the slap back and this does what I want It for but Not quite as much depth as I wanted but with The Music I do Not think Anyone can tell. If You want a good Reverb that Is above average with much depth then get the Behringer RV600 Not this. The power supply I use Is Danelectro which Is great, I also have a godlyke that I use.", "id": 545}]