[{"review": "I bought these hoping they would allow me to learn to bend guitar strings blues style.  They turned out to be just right.  I don't play that often but they have lasted for a lot longer than expected.  very pleased with the product and price.", "id": 227}, {"review": "this tuner is easy to use.  I like that it has the input jack for electric guitar as well as acoustic.  It makes it so much easier.  this is my first tuner in a long time and I'm please with it.", "id": 305}, {"review": "These strings are as advertised.  Nice tone and good quality.  Can't remember the last time I've found a bad string from a set of these.  Actually prefer the medium tension for a 650mm scale guitar.  Got the high tension ones for a shorter scale instrument so they wouldn't be too sloppy at concert pitch.", "id": 500}, {"review": "I like that this is fairly light.  It works as expected and has not given me any problems.  I recommend this item.", "id": 519}, {"review": "I am a beginner and wanted a set that I can learn on, but would also allow me to experiment with other percussion instruments besides a rock drum set and would take a small amount of room and allow low volume levels.  I've had this set for about a month and a half.  So far, it is working well for me.  The rubber drum and cymbal surfaces are great for keeping the volume low enough when playing late at night.  Each drum and cymbal seem to have sweet spots where I imaging the triggers are.  Depending on the devise, hitting further from this sweet spot might change the sound and/or volume produced.  The impression I get is that most electronic drum sets have some kind of problem or another, so it seems to be whether the problem(s) are something you can live with or not.  Also, you can't play with the same nuance and control as an acoustic set, but for the price it goes a long way to making it seem real enough that I can enjoy it and feel like I'm learning the drums.  It takes up very little space compared to an acoustic set which is great for me since I have little room for it.  There are a few problems that I'm not likely to encounter until I become really accomplished.  One is that when playing the snare rim shot and either the hi-hat or tom 1 simultaneously, one or the other will not trigger a sound to occur about half the time.  I found this out when playing these combinations rapidly, which I'm not likely to do maybe ever.  But it is still an error in functionality.  I called Alesis and they said this was a common characteristic of this model drum set.  There is a firmware update that has been mentioned in earlier reviews that I, but it didn't make any difference.  In summary, for the price and my needs, I am very pleased with this drum set.  More expensive sets with more sounds and better nuance control don't have the rubber surfaces that I want, plus, according to reviews they all seem to have problems of some type so spending more money doesn't necessarily eliminate problems.", "id": 609}]