[{"review": "I use this for my Epiphone Zakk Wylde Custom Les Paul. It fits perfectly in the case, one of the best cases I own and have seen, the carpet is awesome, also has a pocket in the middle, what holds the neck up, and can fit a strap and even a pedal. Very durable case and seems like the younger brother of the more expensive Gibson case.", "id": 50}, {"review": "I bought this because I had already bought a \"1 spot\" plug but as i gained pedals, I needed something to power them without buying more adapters and this is greatest way to solve that problem. Highly recommended.", "id": 192}, {"review": "I bought these when I had to re-tube my Marshall JCM800 2203KK head. This is the only tube head I have played or had so I really cant tell you how they compare to other brands but these things rock. They are very good for metal/hard rock and have lasted a year now, while gigging and practicing weekly. I was recommended to JJ by a friend who only uses them and I will likely be doing the same. I paired them with the JJ KT88s and these things just rock.", "id": 228}, {"review": "I bought this cause i needed something to easily change the strings on my guitars. This thing works great. For the price you can't beat it. Maybe one day I might get the powered one but until then this thing will do. Fits in your pocket, gig bag, etc. So you can have this thing on the go. Works great and you can't beat the price.", "id": 347}, {"review": "I love this thing and for the price you just can't beat it. It seems sturdy and I have gigged with it for a couple months now and it is holding up. I haven't tried it with acoustic guitars but it fits my 7 electric guitars very nicely. Set up only took about 10 min or so and it included all the tools necessary. I saw the same one in guitar center a week later for $60 more. Like I said, for the price you can't beat it.", "id": 769}, {"review": "I have 2 one spots which came with the 5 multi plug cable, after reading a little bit on the internet I read that the one spots can handle almost 10 pedals each (depends on the pedal, power handling etc.) So I saw they had an 8 plug cable and figured I would try it out. With adding many more pedals to my board, this is perfect. Def recommend if you have alot of pedals and only want to plug in once.", "id": 486}, {"review": "I own alot of MXR pedals and this one is one of my favorites. This is one of the top delay pedals the pro's use. It is super simple to use, Regen is how many repeats you want, Delay is how long you want the delay to be and the Mix is basically how loud you want delay to be in your mix. You can get all the great delays out of this one pedal. From Ain't Talkin' 'Bout Love, to the Randy Rhoads solos of the 80's. There is also a little MOD button which seems to add some depth to the pedal, really makes it seem a bit fuller. I like that feature alot.", "id": 507}]